[{"creator":"深潮","title":"速觀 Arbitrum 發展近況：全面找尋 Alpha 機會","link":"https://www.blocktempo.com/a-thread-on-the-360-view-of-arbitrum/","pubDate":"Mon, 12 Dec 2022 09:30:06 +0000","dc:creator":"深潮","content":"<p>這篇文章將分享一些對於 Arbitrum 的觀點、空投機會以及Alpha機會。本文源自 ViktorDefi  [&#8230;]</p>\n〈<a href=\"https://www.blocktempo.com/a-thread-on-the-360-view-of-arbitrum/\">速觀 Arbitrum 發展近況：全面找尋 Alpha 機會</a>〉這篇文章最早發佈於動區BlockTempo《<a href=\"https://www.blocktempo.com\">動區動趨-最具影響力的區塊鏈媒體 (比特幣, 加密貨幣)</a>》。","contentSnippet":"這篇文章將分享一些對於 Arbitrum 的觀點、空投機會以及Alpha機會。本文源自 ViktorDefi  […]\n速觀 Arbitrum 發展近況：全面找尋 Alpha 機會〉這篇文章最早發佈於動區BlockTempo《動區動趨-最具影響力的區塊鏈媒體 (比特幣, 加密貨幣)》。","guid":"https://www.blocktempo.com/?p=200911","categories":["其他幣別","分散式帳本技術","專欄作者","Arbitrum","Layer 2","以太坊","空投"],"isoDate":"2022-12-12T09:30:06.000Z","from":"https://www.blocktempo.com/feed/"},{"creator":"luc:","title":"Waves 算穩 USDN 脫鉤加劇至 0.78 鎂，遭韓五大交易所警告高風險","link":"https://www.blocktempo.com/algorithmic-stablecoin-usdn-unpegged-even-more/","pubDate":"Mon, 12 Dec 2022 09:30:49 +0000","dc:creator":"luc:","comments":"https://www.blocktempo.com/algorithmic-stablecoin-usdn-unpegged-even-more/#respond","content":"<p>公鏈項目 Waves 底下發行的算法穩定幣 USDN 今天脫鉤情況再度加劇，跌超 6% 下探 0.78 美元， [&#8230;]</p>\n〈<a href=\"https://www.blocktempo.com/algorithmic-stablecoin-usdn-unpegged-even-more/\">Waves 算穩 USDN 脫鉤加劇至 0.78 鎂，遭韓五大交易所警告高風險</a>〉這篇文章最早發佈於動區BlockTempo《<a href=\"https://www.blocktempo.com\">動區動趨-最具影響力的區塊鏈媒體 (比特幣, 加密貨幣)</a>》。","contentSnippet":"公鏈項目 Waves 底下發行的算法穩定幣 USDN 今天脫鉤情況再度加劇，跌超 6% 下探 0.78 美元， […]\nWaves 算穩 USDN 脫鉤加劇至 0.78 鎂，遭韓五大交易所警告高風險〉這篇文章最早發佈於動區BlockTempo《動區動趨-最具影響力的區塊鏈媒體 (比特幣, 加密貨幣)》。","guid":"https://www.blocktempo.com/?p=200790","categories":["交易所","加密貨幣市場","即時新聞","USDN","Waves","算法穩定幣","脫鉤"],"isoDate":"2022-12-12T09:30:49.000Z","from":"https://www.blocktempo.com/feed/"},{"creator":"Jaime Lee","title":"FIFA World Cup™ Final Prediction Competition - OFFICIAL GLOBAL RULES FOR GIVEAWAY","link":"https://blog.crypto.com/fifa-world-cup-final-prediction-competition/","pubDate":"Mon, 12 Dec 2022 09:33:37 GMT","content:encoded":"<p>To participate in the Giveaway, you must satisfy the eligibility criteria, meet the requirements set out in the Official Rules, and: <br></p><ol><li>Like the designated post on Twitter or Instagram;</li><li>Reply to the same post with your Final prediction;</li><li>Follow Crypto.com on the platform you entered, at the following accounts:<br>- Twitter: <a href=\"http://twitter.com/cryptocom\">@cryptocom</a><br>- Instagram: <a href=\"http://instagram.com/cryptocomofficial\">@cryptocomofficial </a>; and</li><li>Fill out the form at <a href=\"https://bit.ly/predictfifafinal\">https://bit.ly/predictfifafinal</a></li></ol><p>during the Entry Period (&#x201C;<strong>Entry</strong>&#x201D;). The Entry Period begins on December 12th, 2022 at 10:00am GMT and ends on December 13th, 2022 at 6:59pm GMT. *Entrant&#x2019;s Twitter and/or Instagram account must be a public account to be eligible for the Giveaway.<br></p><p><strong>Giveaway Items</strong></p><p>The Giveaway Items are as listed below with their estimated market value:</p><ul><li>US$200 in Cronos cryptocurrency token (CRO)</li></ul><p>Odds of winning depend on the number of Eligible Entries received during the Entry Period. Five (5) Giveaway Items will be distributed.<br></p><p><strong>OFFICIAL RULES FOR GIVEAWAY</strong></p><ul><li>Users residing in the United States shall consult the <a href=\"https://blog.crypto.com/fifa-world-cup-final-prediction-competition-us-specific-official-rules-for-sweepstakes\">US-Specific Official Rules for Sweepstakes.</a></li><li>Users residing in Australia shall consult the <a href=\"https://blog.crypto.com/fifa-world-cup-final-prediction-competition-au-rules\">Australian-Specific Official Rules for Giveaway.</a></li></ul><p>Crypto.com will conduct the Giveaway (the &#x201C;Giveaway&#x201D;) substantially as described in these rules. By entering or participating, each entrant or participant (&#x201C;Entrant&#x201D;) agrees unconditionally to be bound by these official rules (the &#x201C;Official Rules&#x201D;) and the decisions of Crypto.com, which are final and binding in all respects to the Giveaway. Eligibility to receive any items from the Giveaway is contingent upon fulfilling all requirements set forth herein.<br></p><p><strong>NO PURCHASE NECESSARY TO ENTER OR WIN A GIVEAWAY ITEM. A PURCHASE DOES NOT IMPROVE YOUR CHANCES OF WINNING. &#xA0;ODDS OF BEING SELECTED WILL DEPEND ON THE TOTAL NUMBER OF ELIGIBLE ENTRIES RECEIVED. VOID WHERE PROHIBITED BY LAW OR RESTRICTED BY LAW. </strong><br></p><p><strong>Sponsored and Administered by:</strong> The Giveaway subject to these Official Rules is sponsored and administered by the Crypto.com entity offering the Crypto.com App in your jurisdiction.<br></p><p><strong>1. &#xA0;Eligibility: </strong> <br></p><ol><li>General Eligibility: Unless otherwise specified, the Giveaway is open only to persons (i) who are eighteen (18) years of age or older at the time of entry; (ii) who are not residents of Argentina, Austria, Brazil, Canada, Colombia, Costa Rica, Chile, Dominican Republic, El Salvador, Finland, Germany, Guatemala, Honduras, Hong Kong, Israel, Japan, Mexico, the Netherlands, Norway, Paraguay, Peru, Singapore, Spain, Sweden, Switzerland or Uruguay; and (iii) who have an active e-mail account and Internet access prior to the beginning of the Entry Period (defined below). <strong>VOID WHERE PROHIBITED.</strong> &#xA0;<br></li><li>Individuals Excluded From Entry: Employees, officers and representatives, and the immediate family members of such employees, officers and representatives (i.e., parent, spouse, siblings, children, grandparents, step-parents, step children and step siblings, and their respective spouses, and those living in the same household, whether or not related) of Crypto.com or its affiliated companies, parent companies, subsidiaries, participating promotional partners, advertising and promotion agencies, webmasters and any company involved in the creation, design, execution, production, or fulfilment of the Giveaway (collectively, the &#x201C;<strong>Giveaway Entities</strong>&#x201D;) are not eligible to enter.<br></li><li>Additional Eligibility Requirements. Prior to being eligible to receive any Giveaway Item, a Selected Entrant (as defined below) must provide Crypto.com with any information or certifications needed by Crypto.com, in its judgment. Without limiting the foregoing, a Selected Entrant of the Giveaway may be required to sign a copy of these Official Rules, to complete and sign a Declaration of Compliance, Liability, and Publicity Release (except where prohibited by law), and provide any other document that Crypto.com determines is required, necessary or appropriate, in its judgment, to confirm the Selected Entrant&#x2019;s eligibility and for tax reporting or other purposes. If the Selected Entrant fails to satisfy these conditions within five (5) days of the notice that such person has been selected, that Entrant will not be eligible for the Giveaway Item, and an alternate Entrant will be selected, as described in &#x201C;Entrant Selection and Notification&#x201D; clause below. <strong>VOID WHERE PROHIBITED.</strong><br></li></ol><p><strong>2. &#xA0;No Purchase Necessary</strong>. No purchase or payment of any kind is necessary to enter or participate in this Giveaway.<br></p><p><strong>3. Acceptance of Rules.</strong> By entering the Giveaway, Entrant: (a) agrees to be bound by these Official Rules and by the interpretation of these Official Rules by Crypto.com and by the decisions of Crypto.com, which are final and binding in all respects; (b) acknowledges compliance with these Official Rules; and (c) agrees to comply with any and all applicable federal, state and local laws, rules and regulations. Winning the Giveaway Item (defined below) is contingent upon fulfilling all requirements set forth in these Official Rules. <strong>GIVEAWAY IS VOID WHERE PROHIBITED.</strong><br></p><p><strong>4. Entry Period:</strong> &#xA0; The Giveaway will begin and end at the times specified by Crypto.com (the &#x201C;Entry Period&#x201D;). The Entry Period will start on December 12th, 2022 at 10:00am GMT and end on December 13th, 2022 at 6:59pm GMT. Entry methods for the Giveaway will be specified by Crypto.com and all entries must be received during the Entry Period. Entries must be submitted during the Entry Period in order to be eligible for the Giveaway. Crypto.com shall have the sole and final decision regarding timekeeping for entry in the Giveaway. Normal time rates, if any, charged by the Entrants&#x2019; Internet service or mobile provider will apply.<br></p><ol><li>Complete and Truthful Entries. When submitting an entry, Entrant is required to provide complete and truthful information. &#xA0;Entries that are incomplete, illegible, corrupted, false, lost, late or misdirected, deceptive or otherwise not in compliance with the Official Rules may be disqualified from the Giveaway at Crypto.com&#x2019;s sole and absolute discretion. Entries submitted by persons who do not meet the eligibility requirements (including all requirements with respect to age and residence) are void. <br></li><li>Use of Automation for Repetitive Entries. The use of any scripts, computer programs, robotic repetitive, macro, automatic, programmed or similar automated entry methods or agents to submit entries will void all entries submitted by that person or that person&#x2019;s agents. &#xA0;Crypto.com will disqualify any entry from individuals who do not meet the eligibility requirements. &#xA0;<br></li><li>Eligible Entries. All entries submitted in compliance with these Official Rules and not disqualified or void are considered &#x201C;Eligible Entries.&#x201D; &#xA0;All entries are the property of Crypto.com. Image and photo entries shall not include images of any third parties or individuals outside of the Entrant and Crypto.com promotional materials. Entrant shall abide by all posting and image guidelines as set forth by any social media platform, if any, used to enter into this Giveaway. Crypto.com shall not be liable to any third parties for Entrant&#x2019;s violations of said social media guidelines. Photos displaying or containing profanity or that are obscene or otherwise inappropriate (as determined by Crypto.com) will be disqualified, as will entries that violate copyright laws or infringe on any third party rights. By entering, except where prohibited by law, Entrant is assigning all ownership rights and usage rights to Entrant&#x2019;s photo to the Giveaway Entities. <br></li><li>Number of Entries. Only one (1) Entry is permitted per person during the Entry Period. &#xA0;Multiple entrants are not permitted to share the same email address. Any attempt by any person to enter the Giveaway more than one (1) time by using multiple/different email addresses, identities, registrations and logins, or any other methods will void that entrant&apos;s entries and that entrant may be disqualified. Use of any automated system to participate is prohibited and will result in disqualification. Crypto.com and its affiliates, and their respective officers, directors, employees, contractors and agents are not responsible for lost, late, incomplete, invalid, unintelligible or misdirected registrations, which will be disqualified.<br></li></ol><p><strong>5. Method of Entry: </strong>Entry methods for the Giveaway will be specified by Crypto.com, and all entries must be received during the Entry Period. Entries must be submitted during the Entry Period in order to be eligible for the Giveaway.<br></p><p>To enter into the Giveaway, Entrants must, in addition to meeting the eligibility criteria, and:</p><ol><li>Like the designated post on Twitter or Instagram;</li><li>Reply to the same post with your Final prediction;</li><li>Follow Crypto.com on the platform you entered, at the following accounts:<br>- Twitter: <a href=\"http://twitter.com/cryptocom\">@cryptocom</a><br>- Instagram: <a href=\"http://instagram.com/cryptocomofficial\">@cryptocomofficial </a>; and</li><li>Fill out the form at <a href=\"https://bit.ly/predictfifafinal\">https://bit.ly/predictfifafinal</a><br></li></ol><p>during the Entry Period (each, an &#x201C;<strong>Entry</strong>&#x201D;). *Entrant&#x2019;s Twitter and/or Instagram account must be a public account to be eligible for the Giveaway.<br></p><p><strong>6. Giveaway Items: </strong> The item(s) for the giveaway will be specified by Crypto.com (the &#x201C;<strong>Giveaway Item</strong>&#x201D;). The total approximate total retail value of the Giveaway Item is as specified by Crypto.com. &#xA0;There is a limited number of items for the giveaway and hence the odds of receiving the item for the giveaway will depend on the number of Eligible Entries received during the Entry Period. &#xA0;In total, five (5) unique Entrants will be selected for Giveaway Items (&#x201C;<strong>Selected Entrants</strong>&#x201D;). &#xA0;Selected Entrants will include participants from the United States and Australia.<br></p><ol><li>CRO Giveaway Item: Five (5) Selected Entrants shall each receive US$200 worth of Cronos cryptocurrency tokens (CRO) to their Crypto.com App account, as provided in the Entry form, with the exchange rate determined by Crypto.com in its absolute discretion.<br></li><li>Unavailability of Giveaway Item. If for any reason the Giveaway Item, or any part of the Giveaway Item, is unavailable or there is a delay in receiving the Giveaway Item or a related event is delayed, cancelled or postponed, or for any other reason, Crypto.com reserves the right to modify the Giveaway Item in its sole discretion and award a substitute Giveaway Item, or portion of the Giveaway Item, of comparable or greater value as set forth in these Official Rules. No substitution, transfer, assignment or cash equivalent of the Giveaway Item, or any portion thereof, is permitted by the Selected Entrant. <br></li><li>Inability to Accept Giveaway Item. Crypto.com and the Giveaway Entities shall have no responsibility or obligation to a selected Entrant who is unable or unavailable to, or who does not for any reason, accept or utilize the Giveaway Item. In the event a selected Entrant cannot accept the Giveaway Item, an alternate Entrant will be selected from all remaining Eligible Entries. &#xA0;<br></li><li>Costs and Expenses Associated with the Giveaway Item. All costs and expenses not specifically listed above as part of the Giveaway Item are solely the Selected Entrant&#x2019;s responsibility. &#xA0;Selected Entrant agrees to comply with any additional terms and conditions applicable for attending the Event. <br></li><li>Giveaway Items Provided &#x201C;As Is&#x201D;. The Giveaway Items are provided &#x201C;as is&#x201D;. Entrants acknowledge that Crypto.com and the Giveaway Entities have neither made nor are in any manner responsible or liable for any warranty, representation or guarantee, express or implied, in fact or in law, relative to the Giveaway Items, including any implied warranty of merchantability of fitness for a particular purpose. &#xA0;Any Giveaway Items pictured in advertising and other Giveaway materials are for illustrative purposes only.<br></li><li>Selected Entrant Responsible for Any Applicable Tax Liability Associated with the Giveaway Item. The value of the Giveaway Item may be taxable to the Selected Entrant as income. All federal, state and local tax liability, and any other costs and expenses associated with acceptance or use of the Giveaway Item not specifically provided for in these Official Rules are solely the Selected Entrant&#x2019;s responsibility (regardless of whether the Giveaway Item, in whole or in part, is used). &#xA0;The recipient of a Giveaway Item is solely responsible for their entry into any Giveaway that involves a Giveaway Item of cryptocurrency or digital assets and should ensure that they understand the federal and state tax implications of receiving cryptocurrency or digital asset(s) as a Giveaway Item.<br></li></ol><p><strong>7. &#xA0;Entrant Selection and Notification:</strong> &#xA0;The potential &#x201C;Selected Entrant&#x201D; or &#x201C;Selected Entrants&#x201D; of the Giveaway Item in the Giveaway will be determined according to the method specified by Crypto.com in Crypto.com&#x2019;s sole and exclusive discretion.<br></p><ol><li>Number of Entrants to be Selected: A total of five (5) unique Selected Entrants will be determined according to the method specified by Crypto.com in Crypto.com&#x2019;s sole and exclusive discretion. &#xA0;<br></li><li>Notification of Selected Entrant. The Giveaway Item will be awarded to the authorized account holder of the public twitter account submitted with the entry regardless of the individual who submitted the winning entry. The authorized account holder is the person who is assigned to the account by Twitter. &#xA0;Each potential Selected Entrant will be notified, within thirty (30) days (or such other time specified by Crypto.com) of the end of the Entry Period, by email (at the email address provided with the entry), by phone (at the phone number provided with the entry), or such other method specified by Crypto.com, and will be required to confirm their email address and/or phone number.<br></li><li>Publicity of Selected Entrant. Additionally, Crypto.com and the Giveaway Entities reserve the right to make a public announcement, announcing the Selected Entrant on either the Crypto.com website, through the Crypto.com App, or in any manner (including, without limitation, social media (e.g., Facebook&#xAE;, Instagram&#xAE;, Twitter&#xAE;, Youtube&#xAE;)), which they deem appropriate. &#xA0;<br></li><li>Failure of Selected Entrant to Respond to Notification of Selection. If the Selected Entrant cannot be reached after a reasonable effort has been exerted and/or fails to respond to confirm their email address within one (1) day (or such other time specified by Crypto.com) from when the initial notification email is sent, the Selected Entrant forfeits the Giveaway Item, and an alternate Selected Entrant will be selected. &#xA0;<br></li><li>Alternative Selected Entrant. If the alternate Selected Entrant does not comply with these Official Rules or is otherwise unable to accept the Giveaway Item, the Giveaway Item is forfeited and another alternate Selected Entrant will be selected. &#xA0;This Selected Entrant selection and notification process shall be continued until a Selected Entrant is confirmed. &#xA0;If the Giveaway Item or a Selected Entrant notification is returned as undeliverable, the Giveaway Item will be forfeited and an alternate Selected Entrant will be selected.<br></li></ol><p><strong>8. &#xA0;Selected Entrant Verification:</strong> &#xA0;The Selected Entrant may be required to prove eligibility, including, without limitation, proof of age, residence, and identity, which may include submitting a copy of his/her passport or similar government issued identification within two (2) hours after being notified of being a potential Selected Entrant.<br></p><ol><li>Official Confirmation of Selected Entrant. The Selected Entrant (or any alternate Selected Entrant if one must be selected) is not official and shall not be confirmed as the Selected Entrant until he/she has provided information and completed, signed and returned all documentation required by Crypto.com, in its sole judgment. <br></li><li>Selected Entrant Obligations. Selected Entrants may be required to sign and return (1) a Declaration of Compliance, Liability, and Publicity Release (except where prohibited), (2) a Waiver and Release from Liability, and (3) any other document Crypto.com determines is required, necessary or appropriate, in its judgment, to confirm the Selected Entrant&#x2019;s eligibility and for tax reporting purposes. Each of these items must be received by Crypto.com within five (5) days of the date notice or attempted notice is sent, in order to claim the Giveaway Item. If, at any time, (i) Crypto.com determines that any Selected Entrant is not eligible to participate in the Giveaway, or (ii) a person whose name is drawn refuses to accept the selection as Selected Entrant, or (iii) a person whose name is drawn cannot or does not complete the eligibility requirements, including without limitation a failure to sign and return the required documents described above or provide any other requested information within the required time period, or (iv) the Selected Entrant (or any alternate Selected Entrant) &#xA0;cannot be contacted, then that person will be ineligible to receive the Giveaway Item(s In the event that a potential Selected Entrant is disqualified or ineligible for any reason, the potential Selected Entrant forfeits the Giveaway Item, and all privileges otherwise due as a Selected Entrant shall be terminated and an alternate Selected Entrant will be chosen by the same drawing method from among all of the remaining Eligible Entries. <br></li><li>Participation of Selected Entrant&#x2019;s Guests (Event or Amenity Access). All guests in attendance with a Selected Entrant, if applicable, must also execute all applicable documents prior to any participation or such guest(s) will not be permitted to participate.<br></li><li>Delay of Confirmation or Announcement of Selected Entrant. Provided that the Selected Entrant is in compliance with the Official Rules and after having successfully proven eligibility, the Selected Entrant will be officially confirmed as the Selected Entrant. &#xA0;Crypto.com expressly reserves the right to delay the announcement of the Selected Entrant for any reason it deems necessary. &#xA0;In addition, Crypto.com reserves the right to select an alternate Selected Entrant in the event that any Selected Entrant fails to comply with these Official Rules.<br></li></ol><p><strong>9. &#xA0;LIMITATION OF LIABILITY:</strong> &#xA0;THE GIVEAWAY ITEM IS OFFERED AND PROVIDED &#x201C;AS IS&#x201D; WITH NO WARRANTY OR GUARANTEE BY CRYPTO.COM OR ANY GIVEAWAY ENTITY, EITHER EXPRESS OR IMPLIED. &#xA0;IN NO EVENT WILL CRYPTO.COM OR ANY GIVEAWAY ENTITY BE LIABLE TO ENTRANT FOR ANY DIRECT, SPECIAL, INCIDENTAL, EXEMPLARY, PUNITIVE OR CONSEQUENTIAL DAMAGES (INCLUDING LOSS OF USE, DATA, BUSINESS OR PROFITS) ARISING OUT OF OR IN CONNECTION WITH ENTRANT&#x2019;S PARTICIPATION IN THE GIVEAWAY, WHETHER SUCH LIABILITY ARISES FROM ANY CLAIM BASED UPON CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE), STRICT LIABILITY OR OTHERWISE, AND WHETHER OR NOT CRYPTO.COM AND/OR OTHER GIVEAWAY ENTITIES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH LOSS OR DAMAGE.<br></p><p>SOME JURISDICTIONS DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATION OR EXCLUSION MAY NOT APPLY TO YOU.<br></p><p><strong>10. Indemnification. </strong>By entering the Giveaway, Entrant agrees to indemnify, defend, and hold harmless, Crypto.com and any other Giveaway Entities from any and all liability, for any claims, damages, injuries or losses of any kind, and to release all rights to bring any claim, action or proceeding arising out of, in connection with, or relating to, (i) participation in the Giveaway, (ii) without limitation, death, or property damage, arising directly or indirectly from the acceptance, possession, misuse or use of the Giveaway Item, (iii) defamation, violation of publicity rights, or invasion of privacy in connection with the Giveaway or acceptance and use or the Giveaway Item, and (iv) copyright infringement, trademark infringement, or any other intellectual property-related cause of action arising from or related to the Giveaway, the Giveaway Item, or Crypto.com&#x2019;s advertising and marketing related to the Giveaway, Entrants or the Selected Entrant, in all cases, including but not limited to: &#xA0;(a) unauthorized human intervention in the Giveaway; (b) technical errors related to computers, servers, providers, or telephone, or network lines; (c) printing errors; (d) lost, late, postage-due, misdirected or undeliverable mail; (e) errors in the administration of the Giveaway or the processing of entries; or (f) injury or damage to persons or property (including to any computer or mobile device systems resulting from participation in or accessing or downloading information in connection with the Giveaway), which may be caused, directly or indirectly, in whole or in part, from Entrant&#x2019;s participation in the Giveaway or receipt or use of any Giveaway Item. &#xA0;Entrant assumes all liability for any injury or damage caused, or claimed to be caused, by participation in the Giveaway, or the acceptance, receipt, or use of the Giveaway Item or any Giveaway Item component. &#xA0;Entrant further agrees that in any cause of action, Crypto.com and/or the Giveaway Entities&#x2019; liability will be limited to the value of the Giveaway Item, and in no event shall the Giveaway Entities be liable for attorney&#x2019;s fees.<br></p><p><strong>11. No Assumption of Responsibility. </strong>Crypto.com and the Giveaway Entities assume no responsibility for and will disqualify entries that are: stolen, late, lost, illegible, incomplete, invalid, unintelligible, altered, tampered with, unauthorized, fraudulent, damaged, destroyed, delayed, misdirected, not delivered, not received, or that have incorrect or inaccurate entry information, whether caused by any of the equipment or programming associated with or utilized in the Giveaway, or by any human, mechanical or electronic error that may occur in the processing of the entries in the Giveaway, or other errors appearing within the Official Rules or in the Giveaway related advertisements. Crypto.com and the Giveaway Entities assume no responsibility for any typographical or other error in the printing of the offer, administration of the Giveaway, errors in processing entries, identifying the Selected Entrant, in the announcement of the Giveaway Item and Selected Entrant, the delivery of the Giveaway Item, any problems or technical malfunction of any telephone network or lines, computer systems, online systems, servers or providers, computer equipment, software, failure of any e-mail or players on account of technical problems or traffic congestion on the Internet or on any web site including crypto.com, or any combination thereof, including, without limitation, any injury or damage to Entrant&#x2019;s or any other person&#x2019;s computer system/software related to or resulting from participation in, uploading any materials or downloading any materials in the Giveaway. &#xA0;Use of any device to automate or subvert entry is prohibited and any entries received by such means will be void. Crypto.com reserves the right in its sole discretion to disqualify any person it suspects or finds (i) to have tampered with the entry process or the operation of the Giveaway; (ii) to be acting in a disruptive manner, or with the intent to annoy, abuse, threaten or harass any other person; &#xA0;(iii) to display behavior that will bring such Selected Entrant, Crypto.com or the Giveaway Entities into disgrace; (iv) to have provided inaccurate information on any legal documents submitted in connection with the Giveaway; or (v) to be acting in violation of these Official Rules. ANY VIOLATION OF THESE OFFICIAL RULES BY A SELECTED ENTRANT WILL RESULT IN SUCH SELECTED ENTRANT&#x2019;S DISQUALIFICATION AS A SELECTED ENTRANT OF THE GIVEAWAY AND ALL PRIVILEGES AS A SELECTED ENTRANT WILL BE IMMEDIATELY TERMINATED.<br></p><p><strong>12. Grant of Rights.</strong> &#xA0;Except where prohibited by law, by entering the Giveaway and/or winning the Giveaway Item, Entrant irrevocably consents to the use of his or her name, image, photograph, likeness, biographical information, entry, statements attributed to Entrant (if true) and any video footage related to the Giveaway Item, for all Giveaway Entities&#x2019; advertising, promotional or other commercial purposes in all media now or hereafter known, worldwide and in perpetuity without additional compensation and additionally consents to the Giveaway Entities putting his or her name on a Selected Entrant&#x2019;s list. &#xA0;Please note that Crypto.com may not acknowledge or return any entries.<br></p><ol><li>Intellectual Property. By submitting an entry, Entrant agrees to Crypto.com&#x2019;s general terms regarding intellectual property available at <a href=\"https://crypto.com/document/mco_services\">https://crypto.com/document/mco_services.</a> &#xA0;Specifically, Entrant represents and warrants to Crypto.com that they have the rights, authorisations, and licences to all the content they share with Crypto.com via any platform. This includes, but is not limited to, getting the owner&#x2019;s consent before sharing third-party content and/or not infringing (or causing Crypto.com to infringe) any third-party rights, including third-party intellectual property rights. Entrant grants to Crypto.com a perpetual, non-exclusive, transferable, sublicensable, royalty-free, worldwide license to use, copy, modify, distribute, publish, and process the content they share with Crypto.com (including their intellectual property) without any further consent, notice, and/or compensation to them or to others for any purpose. Entrant can end this licence by deleting such content and notifying Crypto.com at contact@crypto.com. Entrant further agrees to hold Crypto.com harmless against any liability, claims, or demands arising from the content they share with Crypto.com.<br></li><li>Right of Publicity. By submitting an Entry, Entrant agrees to Crypto.com&#x2019;s use of your name, address, likeness, or Giveaway Item information for promotional purposes in any medium without additional compensation to the extent permitted by law. <br></li></ol><p><strong>13. &#xA0;General Terms; Force Majeure.</strong> &#xA0; &#xA0;The Giveaway Entities are not responsible if the Giveaway cannot take place, or if the Giveaway Item cannot be awarded due to delays, interruptions or failures due to acts of God, war, natural disasters, weather, acts or threats of terrorism, strikes, lockouts, labor disputes, work stoppages, fire, acts of government, or other events outside of the reasonable control of the Giveaway Entities. &#xA0;<br></p><ol><li>Right to Terminate. If, for any reason the Giveaway is not capable of running as planned, including, without limitation, due to infection by computer virus, bugs, tampering, unauthorized intervention, fraud, technical failures, or any other causes beyond the reasonable control of the Giveaway Entities, which, in Crypto.com&#x2019;s sole determination, corrupts or affects the administration, security, fairness, integrity or proper conduct of the Giveaway, Crypto.com reserves the right, in its sole discretion, to cancel, terminate, modify, or suspend the Giveaway or any part of the Giveaway. If the Giveaway or any part of the Giveaway is terminated or modified prior to the closing of the Entry Period, notice will be posted on crypto.com. Crypto.com reserves the right to modify and amend these Official Rules from time to time during the Entry Period for clarification purposes.<br></li><li>Reservation of Rights. ANY ATTEMPT BY ANY PERSON TO DELIBERATELY DAMAGE OR UNDERMINE THE LEGITIMATE OPERATION OF THE GIVEAWAY MAY BE IN VIOLATION OF CRIMINAL AND CIVIL LAW AND SHOULD SUCH AN ATTEMPT BE MADE, CRYPTO.COM RESERVES THE RIGHT TO SEEK REMEDIES AND DAMAGES (INCLUDING ATTORNEYS&#x2019; FEES) FROM ANY SUCH PERSON TO THE FULLEST EXTENT PERMITTED BY LAW.<br></li><li>Severability. The invalidity or unenforceability of any provision of these Official Rules will not affect the validity or enforceability of any other provision. In the event that any provision of the Official Rules is determined to be invalid or otherwise unenforceable or illegal, the other provisions will remain in effect and will be construed in accordance with their terms as if the invalid or illegal provision were not contained herein. Crypto.com&#x2019;s failure to enforce any term of these Official Rules will not constitute a waiver of that term or any other provision of these Official Rules. Entrant agrees to waive any rights to claim ambiguity of these Official Rules. Headings are solely for convenience of reference and will not be deemed to affect in any manner the meaning or intent of these Official Rules or any provision hereof. In the event there is a discrepancy or inconsistency between disclosures or other statements contained in the Giveaway&#x2013;related materials, privacy policy or terms of use on a website and/or the terms and conditions of these Official Rules, the Official Rules shall prevail, govern and control and the discrepancy will be resolved in Crypto.com&#x2019;s sole and absolute discretion.<br></li><li>Risk: Nothing contained herein shall be construed to be financial advice. Staking and purchasing cryptocurrencies involves a high degree of risk and there is always the possibility of loss, including the loss of all staked digital assets. Please seek professional advice before making any financial, investment, or trading decisions.<br></li></ol><p><strong>14. &#xA0;Privacy:</strong> All information submitted by Entrants and collected by Crypto.com in connection with Entrant&#x2019;s entry will be subject to and will be treated in a manner consistent with Crypto.com Global Marketing Privacy Notice available at: https://crypto.com/privacy/marketing. By participating in the Giveaway, Entrant hereby acknowledges that Entrant has read the Crypto.com Global Marketing Privacy Notice and that Crypto.com collects and uses Entrants&#x2019; personal information submitted in the entry for the purpose of carrying out the Giveaways. Among other things, the information Entrants provide may be used for sending Entrants company updates and announcements about Crypto.com and its products and/or services following the applicable requirements.<br></p><p><strong>15. &#xA0;Binding Arbitration:</strong> &#xA0;Except where prohibited by law, Entrant agrees that: (1) ANY DISPUTE, CONTROVERSY OR CLAIM ARISING OUT OF OR RELATING TO THE GIVEAWAY OR ANY GIVEAWAY ITEM AWARDED SHALL BE RESOLVED INDIVIDUALLY, WITHOUT RESORT TO ANY FORM OF CLASS ACTION; (2) Any dispute, controversy, difference or claim arising out of or relating to this contract, including the existence, validity, interpretation, performance, breach or termination thereof or any dispute regarding non- contractual obligations arising out of or relating to it shall be referred to and finally resolved by arbitration administered by the Hong Kong International Arbitration Centre (HKIAC) under the HKIAC Administered Arbitration Rules in force when the Notice of Arbitration is submitted. The law of this arbitration clause shall be Hong Kong law. The seat of arbitration shall be Hong Kong. The number of arbitrators shall be one. The arbitration proceedings shall be conducted in English; (3) unless both Entrant and Crypto.com agree in writing, the arbitrator may not consolidate more than one person&#x2019;s claims, and may not otherwise preside over any form of class or representative proceeding; (4) judgment upon any award rendered may be entered in any court having jurisdiction thereof; and (5) any award or judgment shall be subject to all limitations and releases set forth in these Official Rules and be limited to actual out of pocket damages, and shall not, in any event, include any punitive, exemplary, consequential or incidental damages, attorney&#x2019;s fees or costs of bringing a claim, or any injunctive or other equitable relief. &#xA0;SOME JURISDICTIONS DO NOT ALLOW THE LIMITATIONS OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE MAY NOT APPLY TO YOU.<br></p><p><strong>16. &#xA0;Governing Law:</strong> &#xA0;All federal, state and local laws and regulations apply. &#xA0;Void where prohibited by law. &#xA0;All issues and questions concerning the construction, validity, interpretation and enforceability of these Official Rules, or the rights and obligations of the Entrant and Crypto.com in connection with the Giveaway, shall be governed by, and construed in accordance with, the laws of Hong Kong without giving effect to any choice of law or conflict of laws rules.<br></p><p><strong>17. &#xA0;Accessibility of Official Rules and Selected Entrants List:</strong> &#xA0;The terms and conditions relating to validly submitting an entry to the Giveaway are available separately via the relevant campaign blog post. Where required by law, Crypto.com will provide the name of Selected Entrant(s) of a Giveaway to those who request it. Requests for the list of Selected Entrants shall be emailed to Crypto.com at contact@crypto.com within twenty-eight (28) days of the end of the Entry Period start date.<br></p><p><strong>18. Social Media:</strong> By submitting an Entry, Entrant agrees to a complete release of Facebook&#xAE;, Instagram&#xAE; Twitter&#xAE;, and/or You Tube&#xAE;, and/or any other social media platform used to promote or enter into this Giveaway and acknowledges that the Giveaway is in no way sponsored, endorsed, administered by, or associated with Facebook&#xAE;, Instagram&#xAE;, Twitter&#xAE;, YouTube&#xAE;, and/or any other social media platform. Further, Entrant agrees to abide by any and all, if any, requirements imposed by any social media platform used to promote or enter into the Giveaway.<br></p><p><strong>19. Entire Agreement.</strong> These Official Rules constitute the entire agreement between Crypto.com and Entrant. </p>","content:encodedSnippet":"To participate in the Giveaway, you must satisfy the eligibility criteria, meet the requirements set out in the Official Rules, and: \n\nLike the designated post on Twitter or Instagram;\nReply to the same post with your Final prediction;\nFollow Crypto.com on the platform you entered, at the following accounts:\n- Twitter: @cryptocom\n- Instagram: @cryptocomofficial ; and\nFill out the form at https://bit.ly/predictfifafinal\n\nduring the Entry Period (“Entry”). The Entry Period begins on December 12th, 2022 at 10:00am GMT and ends on December 13th, 2022 at 6:59pm GMT. *Entrant’s Twitter and/or Instagram account must be a public account to be eligible for the Giveaway.\n\nGiveaway Items\nThe Giveaway Items are as listed below with their estimated market value:\n\nUS$200 in Cronos cryptocurrency token (CRO)\n\nOdds of winning depend on the number of Eligible Entries received during the Entry Period. Five (5) Giveaway Items will be distributed.\n\nOFFICIAL RULES FOR GIVEAWAY\n\nUsers residing in the United States shall consult the US-Specific Official Rules for Sweepstakes.\nUsers residing in Australia shall consult the Australian-Specific Official Rules for Giveaway.\n\nCrypto.com will conduct the Giveaway (the “Giveaway”) substantially as described in these rules. By entering or participating, each entrant or participant (“Entrant”) agrees unconditionally to be bound by these official rules (the “Official Rules”) and the decisions of Crypto.com, which are final and binding in all respects to the Giveaway. Eligibility to receive any items from the Giveaway is contingent upon fulfilling all requirements set forth herein.\n\nNO PURCHASE NECESSARY TO ENTER OR WIN A GIVEAWAY ITEM. A PURCHASE DOES NOT IMPROVE YOUR CHANCES OF WINNING.  ODDS OF BEING SELECTED WILL DEPEND ON THE TOTAL NUMBER OF ELIGIBLE ENTRIES RECEIVED. VOID WHERE PROHIBITED BY LAW OR RESTRICTED BY LAW. \n\nSponsored and Administered by: The Giveaway subject to these Official Rules is sponsored and administered by the Crypto.com entity offering the Crypto.com App in your jurisdiction.\n\n1.  Eligibility:  \n\nGeneral Eligibility: Unless otherwise specified, the Giveaway is open only to persons (i) who are eighteen (18) years of age or older at the time of entry; (ii) who are not residents of Argentina, Austria, Brazil, Canada, Colombia, Costa Rica, Chile, Dominican Republic, El Salvador, Finland, Germany, Guatemala, Honduras, Hong Kong, Israel, Japan, Mexico, the Netherlands, Norway, Paraguay, Peru, Singapore, Spain, Sweden, Switzerland or Uruguay; and (iii) who have an active e-mail account and Internet access prior to the beginning of the Entry Period (defined below). VOID WHERE PROHIBITED.  \n\nIndividuals Excluded From Entry: Employees, officers and representatives, and the immediate family members of such employees, officers and representatives (i.e., parent, spouse, siblings, children, grandparents, step-parents, step children and step siblings, and their respective spouses, and those living in the same household, whether or not related) of Crypto.com or its affiliated companies, parent companies, subsidiaries, participating promotional partners, advertising and promotion agencies, webmasters and any company involved in the creation, design, execution, production, or fulfilment of the Giveaway (collectively, the “Giveaway Entities”) are not eligible to enter.\n\nAdditional Eligibility Requirements. Prior to being eligible to receive any Giveaway Item, a Selected Entrant (as defined below) must provide Crypto.com with any information or certifications needed by Crypto.com, in its judgment. Without limiting the foregoing, a Selected Entrant of the Giveaway may be required to sign a copy of these Official Rules, to complete and sign a Declaration of Compliance, Liability, and Publicity Release (except where prohibited by law), and provide any other document that Crypto.com determines is required, necessary or appropriate, in its judgment, to confirm the Selected Entrant’s eligibility and for tax reporting or other purposes. If the Selected Entrant fails to satisfy these conditions within five (5) days of the notice that such person has been selected, that Entrant will not be eligible for the Giveaway Item, and an alternate Entrant will be selected, as described in “Entrant Selection and Notification” clause below. VOID WHERE PROHIBITED.\n\n2.  No Purchase Necessary. No purchase or payment of any kind is necessary to enter or participate in this Giveaway.\n\n3. Acceptance of Rules. By entering the Giveaway, Entrant: (a) agrees to be bound by these Official Rules and by the interpretation of these Official Rules by Crypto.com and by the decisions of Crypto.com, which are final and binding in all respects; (b) acknowledges compliance with these Official Rules; and (c) agrees to comply with any and all applicable federal, state and local laws, rules and regulations. Winning the Giveaway Item (defined below) is contingent upon fulfilling all requirements set forth in these Official Rules. GIVEAWAY IS VOID WHERE PROHIBITED.\n\n4. Entry Period:   The Giveaway will begin and end at the times specified by Crypto.com (the “Entry Period”). The Entry Period will start on December 12th, 2022 at 10:00am GMT and end on December 13th, 2022 at 6:59pm GMT. Entry methods for the Giveaway will be specified by Crypto.com and all entries must be received during the Entry Period. Entries must be submitted during the Entry Period in order to be eligible for the Giveaway. Crypto.com shall have the sole and final decision regarding timekeeping for entry in the Giveaway. Normal time rates, if any, charged by the Entrants’ Internet service or mobile provider will apply.\n\nComplete and Truthful Entries. When submitting an entry, Entrant is required to provide complete and truthful information.  Entries that are incomplete, illegible, corrupted, false, lost, late or misdirected, deceptive or otherwise not in compliance with the Official Rules may be disqualified from the Giveaway at Crypto.com’s sole and absolute discretion. Entries submitted by persons who do not meet the eligibility requirements (including all requirements with respect to age and residence) are void. \n\nUse of Automation for Repetitive Entries. The use of any scripts, computer programs, robotic repetitive, macro, automatic, programmed or similar automated entry methods or agents to submit entries will void all entries submitted by that person or that person’s agents.  Crypto.com will disqualify any entry from individuals who do not meet the eligibility requirements.  \n\nEligible Entries. All entries submitted in compliance with these Official Rules and not disqualified or void are considered “Eligible Entries.”  All entries are the property of Crypto.com. Image and photo entries shall not include images of any third parties or individuals outside of the Entrant and Crypto.com promotional materials. Entrant shall abide by all posting and image guidelines as set forth by any social media platform, if any, used to enter into this Giveaway. Crypto.com shall not be liable to any third parties for Entrant’s violations of said social media guidelines. Photos displaying or containing profanity or that are obscene or otherwise inappropriate (as determined by Crypto.com) will be disqualified, as will entries that violate copyright laws or infringe on any third party rights. By entering, except where prohibited by law, Entrant is assigning all ownership rights and usage rights to Entrant’s photo to the Giveaway Entities. \n\nNumber of Entries. Only one (1) Entry is permitted per person during the Entry Period.  Multiple entrants are not permitted to share the same email address. Any attempt by any person to enter the Giveaway more than one (1) time by using multiple/different email addresses, identities, registrations and logins, or any other methods will void that entrant's entries and that entrant may be disqualified. Use of any automated system to participate is prohibited and will result in disqualification. Crypto.com and its affiliates, and their respective officers, directors, employees, contractors and agents are not responsible for lost, late, incomplete, invalid, unintelligible or misdirected registrations, which will be disqualified.\n\n5. Method of Entry: Entry methods for the Giveaway will be specified by Crypto.com, and all entries must be received during the Entry Period. Entries must be submitted during the Entry Period in order to be eligible for the Giveaway.\n\nTo enter into the Giveaway, Entrants must, in addition to meeting the eligibility criteria, and:\n\nLike the designated post on Twitter or Instagram;\nReply to the same post with your Final prediction;\nFollow Crypto.com on the platform you entered, at the following accounts:\n- Twitter: @cryptocom\n- Instagram: @cryptocomofficial ; and\nFill out the form at https://bit.ly/predictfifafinal\n\nduring the Entry Period (each, an “Entry”). *Entrant’s Twitter and/or Instagram account must be a public account to be eligible for the Giveaway.\n\n6. Giveaway Items:  The item(s) for the giveaway will be specified by Crypto.com (the “Giveaway Item”). The total approximate total retail value of the Giveaway Item is as specified by Crypto.com.  There is a limited number of items for the giveaway and hence the odds of receiving the item for the giveaway will depend on the number of Eligible Entries received during the Entry Period.  In total, five (5) unique Entrants will be selected for Giveaway Items (“Selected Entrants”).  Selected Entrants will include participants from the United States and Australia.\n\nCRO Giveaway Item: Five (5) Selected Entrants shall each receive US$200 worth of Cronos cryptocurrency tokens (CRO) to their Crypto.com App account, as provided in the Entry form, with the exchange rate determined by Crypto.com in its absolute discretion.\n\nUnavailability of Giveaway Item. If for any reason the Giveaway Item, or any part of the Giveaway Item, is unavailable or there is a delay in receiving the Giveaway Item or a related event is delayed, cancelled or postponed, or for any other reason, Crypto.com reserves the right to modify the Giveaway Item in its sole discretion and award a substitute Giveaway Item, or portion of the Giveaway Item, of comparable or greater value as set forth in these Official Rules. No substitution, transfer, assignment or cash equivalent of the Giveaway Item, or any portion thereof, is permitted by the Selected Entrant. \n\nInability to Accept Giveaway Item. Crypto.com and the Giveaway Entities shall have no responsibility or obligation to a selected Entrant who is unable or unavailable to, or who does not for any reason, accept or utilize the Giveaway Item. In the event a selected Entrant cannot accept the Giveaway Item, an alternate Entrant will be selected from all remaining Eligible Entries.  \n\nCosts and Expenses Associated with the Giveaway Item. All costs and expenses not specifically listed above as part of the Giveaway Item are solely the Selected Entrant’s responsibility.  Selected Entrant agrees to comply with any additional terms and conditions applicable for attending the Event. \n\nGiveaway Items Provided “As Is”. The Giveaway Items are provided “as is”. Entrants acknowledge that Crypto.com and the Giveaway Entities have neither made nor are in any manner responsible or liable for any warranty, representation or guarantee, express or implied, in fact or in law, relative to the Giveaway Items, including any implied warranty of merchantability of fitness for a particular purpose.  Any Giveaway Items pictured in advertising and other Giveaway materials are for illustrative purposes only.\n\nSelected Entrant Responsible for Any Applicable Tax Liability Associated with the Giveaway Item. The value of the Giveaway Item may be taxable to the Selected Entrant as income. All federal, state and local tax liability, and any other costs and expenses associated with acceptance or use of the Giveaway Item not specifically provided for in these Official Rules are solely the Selected Entrant’s responsibility (regardless of whether the Giveaway Item, in whole or in part, is used).  The recipient of a Giveaway Item is solely responsible for their entry into any Giveaway that involves a Giveaway Item of cryptocurrency or digital assets and should ensure that they understand the federal and state tax implications of receiving cryptocurrency or digital asset(s) as a Giveaway Item.\n\n7.  Entrant Selection and Notification:  The potential “Selected Entrant” or “Selected Entrants” of the Giveaway Item in the Giveaway will be determined according to the method specified by Crypto.com in Crypto.com’s sole and exclusive discretion.\n\nNumber of Entrants to be Selected: A total of five (5) unique Selected Entrants will be determined according to the method specified by Crypto.com in Crypto.com’s sole and exclusive discretion.  \n\nNotification of Selected Entrant. The Giveaway Item will be awarded to the authorized account holder of the public twitter account submitted with the entry regardless of the individual who submitted the winning entry. The authorized account holder is the person who is assigned to the account by Twitter.  Each potential Selected Entrant will be notified, within thirty (30) days (or such other time specified by Crypto.com) of the end of the Entry Period, by email (at the email address provided with the entry), by phone (at the phone number provided with the entry), or such other method specified by Crypto.com, and will be required to confirm their email address and/or phone number.\n\nPublicity of Selected Entrant. Additionally, Crypto.com and the Giveaway Entities reserve the right to make a public announcement, announcing the Selected Entrant on either the Crypto.com website, through the Crypto.com App, or in any manner (including, without limitation, social media (e.g., Facebook®, Instagram®, Twitter®, Youtube®)), which they deem appropriate.  \n\nFailure of Selected Entrant to Respond to Notification of Selection. If the Selected Entrant cannot be reached after a reasonable effort has been exerted and/or fails to respond to confirm their email address within one (1) day (or such other time specified by Crypto.com) from when the initial notification email is sent, the Selected Entrant forfeits the Giveaway Item, and an alternate Selected Entrant will be selected.  \n\nAlternative Selected Entrant. If the alternate Selected Entrant does not comply with these Official Rules or is otherwise unable to accept the Giveaway Item, the Giveaway Item is forfeited and another alternate Selected Entrant will be selected.  This Selected Entrant selection and notification process shall be continued until a Selected Entrant is confirmed.  If the Giveaway Item or a Selected Entrant notification is returned as undeliverable, the Giveaway Item will be forfeited and an alternate Selected Entrant will be selected.\n\n8.  Selected Entrant Verification:  The Selected Entrant may be required to prove eligibility, including, without limitation, proof of age, residence, and identity, which may include submitting a copy of his/her passport or similar government issued identification within two (2) hours after being notified of being a potential Selected Entrant.\n\nOfficial Confirmation of Selected Entrant. The Selected Entrant (or any alternate Selected Entrant if one must be selected) is not official and shall not be confirmed as the Selected Entrant until he/she has provided information and completed, signed and returned all documentation required by Crypto.com, in its sole judgment. \n\nSelected Entrant Obligations. Selected Entrants may be required to sign and return (1) a Declaration of Compliance, Liability, and Publicity Release (except where prohibited), (2) a Waiver and Release from Liability, and (3) any other document Crypto.com determines is required, necessary or appropriate, in its judgment, to confirm the Selected Entrant’s eligibility and for tax reporting purposes. Each of these items must be received by Crypto.com within five (5) days of the date notice or attempted notice is sent, in order to claim the Giveaway Item. If, at any time, (i) Crypto.com determines that any Selected Entrant is not eligible to participate in the Giveaway, or (ii) a person whose name is drawn refuses to accept the selection as Selected Entrant, or (iii) a person whose name is drawn cannot or does not complete the eligibility requirements, including without limitation a failure to sign and return the required documents described above or provide any other requested information within the required time period, or (iv) the Selected Entrant (or any alternate Selected Entrant)  cannot be contacted, then that person will be ineligible to receive the Giveaway Item(s In the event that a potential Selected Entrant is disqualified or ineligible for any reason, the potential Selected Entrant forfeits the Giveaway Item, and all privileges otherwise due as a Selected Entrant shall be terminated and an alternate Selected Entrant will be chosen by the same drawing method from among all of the remaining Eligible Entries. \n\nParticipation of Selected Entrant’s Guests (Event or Amenity Access). All guests in attendance with a Selected Entrant, if applicable, must also execute all applicable documents prior to any participation or such guest(s) will not be permitted to participate.\n\nDelay of Confirmation or Announcement of Selected Entrant. Provided that the Selected Entrant is in compliance with the Official Rules and after having successfully proven eligibility, the Selected Entrant will be officially confirmed as the Selected Entrant.  Crypto.com expressly reserves the right to delay the announcement of the Selected Entrant for any reason it deems necessary.  In addition, Crypto.com reserves the right to select an alternate Selected Entrant in the event that any Selected Entrant fails to comply with these Official Rules.\n\n9.  LIMITATION OF LIABILITY:  THE GIVEAWAY ITEM IS OFFERED AND PROVIDED “AS IS” WITH NO WARRANTY OR GUARANTEE BY CRYPTO.COM OR ANY GIVEAWAY ENTITY, EITHER EXPRESS OR IMPLIED.  IN NO EVENT WILL CRYPTO.COM OR ANY GIVEAWAY ENTITY BE LIABLE TO ENTRANT FOR ANY DIRECT, SPECIAL, INCIDENTAL, EXEMPLARY, PUNITIVE OR CONSEQUENTIAL DAMAGES (INCLUDING LOSS OF USE, DATA, BUSINESS OR PROFITS) ARISING OUT OF OR IN CONNECTION WITH ENTRANT’S PARTICIPATION IN THE GIVEAWAY, WHETHER SUCH LIABILITY ARISES FROM ANY CLAIM BASED UPON CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE), STRICT LIABILITY OR OTHERWISE, AND WHETHER OR NOT CRYPTO.COM AND/OR OTHER GIVEAWAY ENTITIES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH LOSS OR DAMAGE.\n\nSOME JURISDICTIONS DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATION OR EXCLUSION MAY NOT APPLY TO YOU.\n\n10. Indemnification. By entering the Giveaway, Entrant agrees to indemnify, defend, and hold harmless, Crypto.com and any other Giveaway Entities from any and all liability, for any claims, damages, injuries or losses of any kind, and to release all rights to bring any claim, action or proceeding arising out of, in connection with, or relating to, (i) participation in the Giveaway, (ii) without limitation, death, or property damage, arising directly or indirectly from the acceptance, possession, misuse or use of the Giveaway Item, (iii) defamation, violation of publicity rights, or invasion of privacy in connection with the Giveaway or acceptance and use or the Giveaway Item, and (iv) copyright infringement, trademark infringement, or any other intellectual property-related cause of action arising from or related to the Giveaway, the Giveaway Item, or Crypto.com’s advertising and marketing related to the Giveaway, Entrants or the Selected Entrant, in all cases, including but not limited to:  (a) unauthorized human intervention in the Giveaway; (b) technical errors related to computers, servers, providers, or telephone, or network lines; (c) printing errors; (d) lost, late, postage-due, misdirected or undeliverable mail; (e) errors in the administration of the Giveaway or the processing of entries; or (f) injury or damage to persons or property (including to any computer or mobile device systems resulting from participation in or accessing or downloading information in connection with the Giveaway), which may be caused, directly or indirectly, in whole or in part, from Entrant’s participation in the Giveaway or receipt or use of any Giveaway Item.  Entrant assumes all liability for any injury or damage caused, or claimed to be caused, by participation in the Giveaway, or the acceptance, receipt, or use of the Giveaway Item or any Giveaway Item component.  Entrant further agrees that in any cause of action, Crypto.com and/or the Giveaway Entities’ liability will be limited to the value of the Giveaway Item, and in no event shall the Giveaway Entities be liable for attorney’s fees.\n\n11. No Assumption of Responsibility. Crypto.com and the Giveaway Entities assume no responsibility for and will disqualify entries that are: stolen, late, lost, illegible, incomplete, invalid, unintelligible, altered, tampered with, unauthorized, fraudulent, damaged, destroyed, delayed, misdirected, not delivered, not received, or that have incorrect or inaccurate entry information, whether caused by any of the equipment or programming associated with or utilized in the Giveaway, or by any human, mechanical or electronic error that may occur in the processing of the entries in the Giveaway, or other errors appearing within the Official Rules or in the Giveaway related advertisements. Crypto.com and the Giveaway Entities assume no responsibility for any typographical or other error in the printing of the offer, administration of the Giveaway, errors in processing entries, identifying the Selected Entrant, in the announcement of the Giveaway Item and Selected Entrant, the delivery of the Giveaway Item, any problems or technical malfunction of any telephone network or lines, computer systems, online systems, servers or providers, computer equipment, software, failure of any e-mail or players on account of technical problems or traffic congestion on the Internet or on any web site including crypto.com, or any combination thereof, including, without limitation, any injury or damage to Entrant’s or any other person’s computer system/software related to or resulting from participation in, uploading any materials or downloading any materials in the Giveaway.  Use of any device to automate or subvert entry is prohibited and any entries received by such means will be void. Crypto.com reserves the right in its sole discretion to disqualify any person it suspects or finds (i) to have tampered with the entry process or the operation of the Giveaway; (ii) to be acting in a disruptive manner, or with the intent to annoy, abuse, threaten or harass any other person;  (iii) to display behavior that will bring such Selected Entrant, Crypto.com or the Giveaway Entities into disgrace; (iv) to have provided inaccurate information on any legal documents submitted in connection with the Giveaway; or (v) to be acting in violation of these Official Rules. ANY VIOLATION OF THESE OFFICIAL RULES BY A SELECTED ENTRANT WILL RESULT IN SUCH SELECTED ENTRANT’S DISQUALIFICATION AS A SELECTED ENTRANT OF THE GIVEAWAY AND ALL PRIVILEGES AS A SELECTED ENTRANT WILL BE IMMEDIATELY TERMINATED.\n\n12. Grant of Rights.  Except where prohibited by law, by entering the Giveaway and/or winning the Giveaway Item, Entrant irrevocably consents to the use of his or her name, image, photograph, likeness, biographical information, entry, statements attributed to Entrant (if true) and any video footage related to the Giveaway Item, for all Giveaway Entities’ advertising, promotional or other commercial purposes in all media now or hereafter known, worldwide and in perpetuity without additional compensation and additionally consents to the Giveaway Entities putting his or her name on a Selected Entrant’s list.  Please note that Crypto.com may not acknowledge or return any entries.\n\nIntellectual Property. By submitting an entry, Entrant agrees to Crypto.com’s general terms regarding intellectual property available at https://crypto.com/document/mco_services.  Specifically, Entrant represents and warrants to Crypto.com that they have the rights, authorisations, and licences to all the content they share with Crypto.com via any platform. This includes, but is not limited to, getting the owner’s consent before sharing third-party content and/or not infringing (or causing Crypto.com to infringe) any third-party rights, including third-party intellectual property rights. Entrant grants to Crypto.com a perpetual, non-exclusive, transferable, sublicensable, royalty-free, worldwide license to use, copy, modify, distribute, publish, and process the content they share with Crypto.com (including their intellectual property) without any further consent, notice, and/or compensation to them or to others for any purpose. Entrant can end this licence by deleting such content and notifying Crypto.com at contact@crypto.com. Entrant further agrees to hold Crypto.com harmless against any liability, claims, or demands arising from the content they share with Crypto.com.\n\nRight of Publicity. By submitting an Entry, Entrant agrees to Crypto.com’s use of your name, address, likeness, or Giveaway Item information for promotional purposes in any medium without additional compensation to the extent permitted by law. \n\n13.  General Terms; Force Majeure.    The Giveaway Entities are not responsible if the Giveaway cannot take place, or if the Giveaway Item cannot be awarded due to delays, interruptions or failures due to acts of God, war, natural disasters, weather, acts or threats of terrorism, strikes, lockouts, labor disputes, work stoppages, fire, acts of government, or other events outside of the reasonable control of the Giveaway Entities.  \n\nRight to Terminate. If, for any reason the Giveaway is not capable of running as planned, including, without limitation, due to infection by computer virus, bugs, tampering, unauthorized intervention, fraud, technical failures, or any other causes beyond the reasonable control of the Giveaway Entities, which, in Crypto.com’s sole determination, corrupts or affects the administration, security, fairness, integrity or proper conduct of the Giveaway, Crypto.com reserves the right, in its sole discretion, to cancel, terminate, modify, or suspend the Giveaway or any part of the Giveaway. If the Giveaway or any part of the Giveaway is terminated or modified prior to the closing of the Entry Period, notice will be posted on crypto.com. Crypto.com reserves the right to modify and amend these Official Rules from time to time during the Entry Period for clarification purposes.\n\nReservation of Rights. ANY ATTEMPT BY ANY PERSON TO DELIBERATELY DAMAGE OR UNDERMINE THE LEGITIMATE OPERATION OF THE GIVEAWAY MAY BE IN VIOLATION OF CRIMINAL AND CIVIL LAW AND SHOULD SUCH AN ATTEMPT BE MADE, CRYPTO.COM RESERVES THE RIGHT TO SEEK REMEDIES AND DAMAGES (INCLUDING ATTORNEYS’ FEES) FROM ANY SUCH PERSON TO THE FULLEST EXTENT PERMITTED BY LAW.\n\nSeverability. The invalidity or unenforceability of any provision of these Official Rules will not affect the validity or enforceability of any other provision. In the event that any provision of the Official Rules is determined to be invalid or otherwise unenforceable or illegal, the other provisions will remain in effect and will be construed in accordance with their terms as if the invalid or illegal provision were not contained herein. Crypto.com’s failure to enforce any term of these Official Rules will not constitute a waiver of that term or any other provision of these Official Rules. Entrant agrees to waive any rights to claim ambiguity of these Official Rules. Headings are solely for convenience of reference and will not be deemed to affect in any manner the meaning or intent of these Official Rules or any provision hereof. In the event there is a discrepancy or inconsistency between disclosures or other statements contained in the Giveaway–related materials, privacy policy or terms of use on a website and/or the terms and conditions of these Official Rules, the Official Rules shall prevail, govern and control and the discrepancy will be resolved in Crypto.com’s sole and absolute discretion.\n\nRisk: Nothing contained herein shall be construed to be financial advice. Staking and purchasing cryptocurrencies involves a high degree of risk and there is always the possibility of loss, including the loss of all staked digital assets. Please seek professional advice before making any financial, investment, or trading decisions.\n\n14.  Privacy: All information submitted by Entrants and collected by Crypto.com in connection with Entrant’s entry will be subject to and will be treated in a manner consistent with Crypto.com Global Marketing Privacy Notice available at: https://crypto.com/privacy/marketing. By participating in the Giveaway, Entrant hereby acknowledges that Entrant has read the Crypto.com Global Marketing Privacy Notice and that Crypto.com collects and uses Entrants’ personal information submitted in the entry for the purpose of carrying out the Giveaways. Among other things, the information Entrants provide may be used for sending Entrants company updates and announcements about Crypto.com and its products and/or services following the applicable requirements.\n\n15.  Binding Arbitration:  Except where prohibited by law, Entrant agrees that: (1) ANY DISPUTE, CONTROVERSY OR CLAIM ARISING OUT OF OR RELATING TO THE GIVEAWAY OR ANY GIVEAWAY ITEM AWARDED SHALL BE RESOLVED INDIVIDUALLY, WITHOUT RESORT TO ANY FORM OF CLASS ACTION; (2) Any dispute, controversy, difference or claim arising out of or relating to this contract, including the existence, validity, interpretation, performance, breach or termination thereof or any dispute regarding non- contractual obligations arising out of or relating to it shall be referred to and finally resolved by arbitration administered by the Hong Kong International Arbitration Centre (HKIAC) under the HKIAC Administered Arbitration Rules in force when the Notice of Arbitration is submitted. The law of this arbitration clause shall be Hong Kong law. The seat of arbitration shall be Hong Kong. The number of arbitrators shall be one. The arbitration proceedings shall be conducted in English; (3) unless both Entrant and Crypto.com agree in writing, the arbitrator may not consolidate more than one person’s claims, and may not otherwise preside over any form of class or representative proceeding; (4) judgment upon any award rendered may be entered in any court having jurisdiction thereof; and (5) any award or judgment shall be subject to all limitations and releases set forth in these Official Rules and be limited to actual out of pocket damages, and shall not, in any event, include any punitive, exemplary, consequential or incidental damages, attorney’s fees or costs of bringing a claim, or any injunctive or other equitable relief.  SOME JURISDICTIONS DO NOT ALLOW THE LIMITATIONS OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE MAY NOT APPLY TO YOU.\n\n16.  Governing Law:  All federal, state and local laws and regulations apply.  Void where prohibited by law.  All issues and questions concerning the construction, validity, interpretation and enforceability of these Official Rules, or the rights and obligations of the Entrant and Crypto.com in connection with the Giveaway, shall be governed by, and construed in accordance with, the laws of Hong Kong without giving effect to any choice of law or conflict of laws rules.\n\n17.  Accessibility of Official Rules and Selected Entrants List:  The terms and conditions relating to validly submitting an entry to the Giveaway are available separately via the relevant campaign blog post. Where required by law, Crypto.com will provide the name of Selected Entrant(s) of a Giveaway to those who request it. Requests for the list of Selected Entrants shall be emailed to Crypto.com at contact@crypto.com within twenty-eight (28) days of the end of the Entry Period start date.\n\n18. Social Media: By submitting an Entry, Entrant agrees to a complete release of Facebook®, Instagram® Twitter®, and/or You Tube®, and/or any other social media platform used to promote or enter into this Giveaway and acknowledges that the Giveaway is in no way sponsored, endorsed, administered by, or associated with Facebook®, Instagram®, Twitter®, YouTube®, and/or any other social media platform. Further, Entrant agrees to abide by any and all, if any, requirements imposed by any social media platform used to promote or enter into the Giveaway.\n\n19. Entire Agreement. These Official Rules constitute the entire agreement between Crypto.com and Entrant.","dc:creator":"Jaime Lee","content":"<p>To participate in the Giveaway, you must satisfy the eligibility criteria, meet the requirements set out in the Official Rules, and: <br></p><ol><li>Like the designated post on Twitter or Instagram;</li><li>Reply to the same post with your Final prediction;</li><li>Follow Crypto.com on the platform you entered, at the following accounts:</li></ol>","contentSnippet":"To participate in the Giveaway, you must satisfy the eligibility criteria, meet the requirements set out in the Official Rules, and: \n\nLike the designated post on Twitter or Instagram;\nReply to the same post with your Final prediction;\nFollow Crypto.com on the platform you entered, at the following accounts:","guid":"6396b3a8c8cb28003d580a14","isoDate":"2022-12-12T09:33:37.000Z","from":"https://blog.crypto.com/rss/"},{"creator":"Jaime Lee","title":"FIFA World Cup™ Final Prediction Competition - OFFICIAL RULES FOR AUSTRALIA GIVEAWAY","link":"https://blog.crypto.com/fifa-world-cup-final-prediction-competition-au-rules/","pubDate":"Mon, 12 Dec 2022 09:33:52 GMT","content:encoded":"<p>To participate in the Giveaway, you must satisfy the eligibility criteria and meet the requirements set out in the Official Rules, and: </p><ol><li>Like the designated post on Twitter or Instagram;</li><li>Reply to the same post with your Final prediction;</li><li>Follow Crypto.com on the platform you entered, at the following accounts:<br>- Twitter: <a href=\"http://twitter.com/cryptocom\">@cryptocom</a><br>- Instagram: <a href=\"http://instagram.com/cryptocomofficial\">@cryptocomofficial </a>; and</li><li>Fill out the form at <a href=\"https://bit.ly/predictfifafinal\">https://bit.ly/predictfifafinal</a></li></ol><p>during the Entry Period (&#x201C;<strong>Entry</strong>&#x201D;). The Entry Period begins on December 12th, 2022 at 10:00am GMT and ends on December 13th, 2022 at 6:59pm GMT. *Entrant&#x2019;s Twitter and/or Instagram account must be a public account to be eligible for the Giveaway.<br></p><p><strong>Giveaway Items</strong></p><p>The Giveaway Items are as listed below with their estimated market value:</p><ul><li>US$200 in Cronos cryptocurrency token (CRO) <br></li></ul><p>Odds of winning depend on the number of Eligible Entries received during the Entry Period. Five (5) Giveaway Items will be distributed.<br></p><h1 id=\"official-rules-for-australia-giveaway\"><strong>OFFICIAL RULES FOR AUSTRALIA GIVEAWAY </strong><br><br></h1><p><a href=\"https://crypto.com/\">Crypto.com </a>will conduct the Giveaway (the &#x201C;Giveaway&#x201D;) substantially as described in these rules. By entering or participating, each entrant or participant (&#x201C;Entrant&#x201D;) agrees unconditionally to be bound by these official rules (the &#x201C;Official Rules&#x201D;) and the decisions of <a href=\"https://crypto.com/\">Crypto.com</a>, which are final and binding in all respects to the Giveaway. Eligibility to receive any items from the Giveaway is contingent upon fulfilling all requirements set forth herein.<br></p><h1 id=\"no-purchase-necessary-to-enter-or-win-a-giveaway-item-a-purchase-does-not-improve-your-chances-of-being-selected-odds-of-being-selected-will-depend-on-the-total-number-of-eligible-entries-received-void-where-prohibited-by-law-or-restricted-by-law\"><strong>NO PURCHASE NECESSARY TO ENTER OR WIN A GIVEAWAY ITEM. A PURCHASE DOES NOT IMPROVE YOUR CHANCES OF BEING SELECTED. ODDS OF BEING SELECTED WILL DEPEND ON THE TOTAL NUMBER OF ELIGIBLE ENTRIES RECEIVED. VOID WHERE PROHIBITED BY LAW OR RESTRICTED BY LAW.</strong><br></h1><p>Giveaway subject to these Official Rules are sponsored and administered by the relevant <a href=\"https://crypto.com/\">Crypto.com </a>entity that provides you with relevant <a href=\"https://crypto.com/\">Crypto.com </a>services.<br></p><ol><li><strong><strong><strong>Eligibility: </strong></strong></strong><br></li><li>General Eligibility: Unless otherwise specified, the Giveaway is open only to Australian residents (i) who are eighteen (18) years of age or older at the time of entry; (ii) who have an active e-mail account and Internet access prior to the beginning of the Entry Period (defined below); and (iii) fulfil the Entry Requirements (defined below). <br></li><li>Individuals Excluded From Entry: Employees, officers and representatives, and the immediate family members of such employees, officers and representatives (i.e., parent, spouse, siblings, children, grandparents, step parents, step children and step siblings, and their respective spouses, and those living in the same household, whether or not related) of <a href=\"https://crypto.com/\">Crypto.com</a> or its affiliated companies, parent companies, subsidiaries, participating promotional partners, advertising and promotion agencies, webmasters and any company involved in the creation, design, execution, production, or fulfillment of the Giveaway (collectively, the &#x201C;Giveaway Entities&#x201D;) are not eligible to enter.<br></li><li>Additional Eligibility Requirements. Prior to being eligible to receive any Giveaway Item, a Selected Entrant (as defined below) must provide Crypto.com with any information or certifications needed by Crypto.com, in its judgment. Without limiting the foregoing, a Selected Entrant of the Giveaway may be required to sign a copy of these Official Rules, to complete and sign a Declaration of Compliance, Liability, and Publicity Release (except where prohibited by law), and provide any other document that Crypto.com determines is required, necessary or appropriate, in its judgment, to confirm the Selected Entrant&#x2019;s eligibility and for tax reporting or other purposes. If the Selected Entrant fails to satisfy these conditions within two (2) days of the notice that such person has been selected, that Entrant will not be eligible for the Giveaway Item, and an alternate Entrant will be selected, as described in &#x201C;Entrant Selection and Notification&#x201D; clause below. <strong>VOID WHERE PROHIBITED.</strong><br></li><li><strong><strong><strong>Acceptance of Rules</strong>. By entering the Giveaway, Entrant: (a) agrees to be bound by these Official Rules and by the interpretation of these Official Rules by <a href=\"https://crypto.com/\">Crypto.com </a>and by the decisions of <a href=\"https://crypto.com/\">Crypto.com</a>, which are final and binding in all respects; (b) acknowledges compliance with these Official Rules; and (c) agrees to comply with any and all applicable federal, state and local laws, rules and regulations. Winning the Giveaway Item (defined below) is contingent upon fulfilling all requirements set forth in these Official Rules. <strong>GIVEAWAY IS VOID WHERE PROHIBITED.</strong></strong></strong><br></li><li><strong><strong><strong>Entry Period: </strong> The Giveaway will begin and end at the times specified by Crypto.com (the &#x201C;Entry Period&#x201D;). The Entry Period will start on December 1</strong>2<strong>th, 2022 at 1</strong>0<strong>:00</strong>a<strong>m GMT and end on December 13th, 2022 at 6:59pm GMT. Entry methods for the Giveaway will be specified by Crypto.com and all entries must be received during the Entry Period. Entries must be submitted during the Entry Period in order to be eligible for the Giveaway. Crypto.com shall have the sole and final decision regarding timekeeping for entry in the Giveaway. Normal time rates, if any, charged by the Entrants&#x2019; Internet service or mobile provider will apply. &#xA0; &#xA0; </strong></strong><br></li><li>Registration of a Crypto.com Account. To enter the lucky draw, entrants must have a Crypto.com App account, and have completed the registration process (including but not limited to, providing their email, phone number and identification documents) prior to the Entry Period. Crypto.com shall have the sole and final decision regarding timekeeping for entry in the Giveaway. Normal time rates, if any, charged by the Entrants&apos; Internet service or mobile provider will apply.<br></li><li>Complete and Truthful Entries. When submitting an entry, Entrant is required to provide complete and truthful information. Entries that are incomplete, illegible, corrupted, false, lost, late or misdirected, deceptive or otherwise not in compliance with the Official Rules may be disqualified from the Giveaway at Crypto.com&#x2019;s sole and absolute discretion. Entries submitted by persons who do not meet the eligibility requirements (including all requirements with respect to age and residence) are void. <br></li><li>Use of Automation for Repetitive Entries. The use of any scripts, computer programs, robotic repetitive, macro, automatic, programmed or similar automated entry methods or agents to submit entries will void all entries submitted by that person or that person&#x2019;s agents. <a href=\"https://crypto.com/\">Crypto.com</a> will disqualify any entry from individuals who do not meet the eligibility requirements. <br></li><li>Eligible Entries. All entries submitted in compliance with these Official Rules and not disqualified or void are considered &#x201C;Eligible Entries.&#x201D; All entries are the property of <a href=\"https://crypto.com/\">Crypto.com</a>. Image and photo entries shall not include images of any third parties or individuals outside of the Entrant and Crypto.com promotional materials. Entrant shall abide by all posting and image guidelines as set forth by any social media platform, if any, used to enter into this Giveaway. Crypto.com shall not be liable to any third parties for Entrant&#x2019;s violations of said social media guidelines. Photos displaying or containing profanity or that are obscene or otherwise inappropriate (as determined by Crypto.com) will be disqualified, as will entries that violate copyright laws or infringe on any third party rights. By entering, except where prohibited by law, Entrant is assigning all ownership rights and usage rights to Entrant&#x2019;s photo to the Giveaway Entities.<br></li><li>Number of Entries. Only one (1) Entry is permitted per person during the Entry Period. Multiple entrants are not permitted to share the same email address. Any attempt by any person to enter the Giveaway more than one (1) time by using multiple/different email addresses, identities, registrations and logins, or any other methods will void that entrant&apos;s entries and that entrant may be disqualified. Use of any automated system to participate is prohibited and will result in disqualification. <a href=\"https://crypto.com/\">Crypto.com</a> and its affiliates, and their respective officers, directors, employees, contractors and agents are not responsible for lost, late, incomplete, invalid, unintelligible or misdirected registrations, which will be disqualified.</li><li><strong><strong><strong>Method of Entry</strong>: Entry methods for the Giveaway will be specified by Crypto.com, and all entries must be received during the Entry Period. Entries must be submitted during the Entry Period in order to be eligible for the Giveaway.</strong></strong><br></li><li>To enter into the Giveaway, Entrants must, in addition to meeting the eligibility criteria, have an existing registered and approved Crypto.com App account by the start of the Entry Period, and:</li><li>Like the designated post on Twitter or Instagram;</li><li>Reply to the same post with your finals prediction;</li><li>Follow Crypto.com on the platform you entered, at the following accounts:<br>- Twitter: <a href=\"http://twitter.com/cryptocom\">@cryptocom</a><br>- Instagram: <a href=\"http://instagram.com/cryptocomofficial\">@cryptocomofficial </a>; and</li><li>Fill out the form at <a href=\"https://bit.ly/predictfifafinal\">https://bit.ly/predictfifafinal</a><br></li></ol><p>during the Entry Period (each, an &#x201C;<strong>Entry</strong>&#x201D;). *Entrant&#x2019;s Twitter and/or Instagram account must be a public account to be eligible for the Giveaway.<br></p><ol><li><strong><strong><strong>Giveaway Items: </strong>The item(s) for the giveaway will be specified by <a href=\"https://crypto.com/\">Crypto.com </a>(the &#x201C;Giveaway Item&#x201D;). The approximate total retail value of the Giveaway Item is as specified by <a href=\"https://crypto.com/\">Crypto.com</a>. There is a limited number of items for the giveaway and hence the odds of receiving the item for the giveaway will depend on the number of Eligible Entries received during the Entry Period. Odds of winning depend on the total number of Eligible Entries received during the Entry Period.</strong></strong><br></li><li>CRO Giveaway Item: Five (5) Selected Entrants shall each receive US$200 worth of Cronos cryptocurrency tokens (CRO) to their Crypto.com App account, as provided in the Entry form, with the exchange rate determined by Crypto.com in its absolute discretion.<br></li><li>Unavailability of Giveaway Item. If for any reason the Giveaway Item, or any part of the Giveaway Item, is unavailable or there is a delay in receiving the Giveaway Item or a related event is delayed, cancelled or postponed, or for any other reason, Crypto.com reserves the right to modify the Giveaway Item in its sole discretion and award a substitute Giveaway Item, or portion of the Giveaway Item, of comparable or greater value as set forth in these Official Rules. No substitution, transfer, assignment or cash equivalent of the Giveaway Item, or any portion thereof, is permitted by the Selected Entrant. <br></li><li>Inability to Accept Giveaway Item. Crypto.com and the Giveaway Entities shall have no responsibility or obligation to a selected Entrant who is unable or unavailable to, or who does not for any reason, accept or utilize the Giveaway Item. In the event a selected Entrant cannot accept the Giveaway Item, an alternate Entrant will be randomly drawn from all remaining Eligible Entries. <br></li><li>Costs and Expenses Associated with the Giveaway Item. All costs and expenses not specifically listed above as part of the Giveaway Item are solely the Selected Entrant&#x2019;s responsibility. Selected Entrant agrees to comply with any additional terms and conditions applicable for attending the Event. <br></li><li>Giveaway Items Provided &#x201C;As Is&#x201D;. The Giveaway Items are provided &#x201C;as is&#x201D;. Entrants acknowledge that <a href=\"https://crypto.com/\">Crypto.com </a>and the Giveaway Entities have neither made nor are in any manner responsible or liable for any warranty, representation or guarantee, express or implied, in fact or in law, relative to the Giveaway Items, including any implied warranty of merchantability of fitness for a particular purpose. NOTHING IN THESE OFFICIAL RULES EXCLUDES OR PURPORTS TO EXCLUDE ANY STATUTORY CONSUMER GUARANTEES PROVIDED UNDER AUSTRALIAN LAW THAT CANNOT BE EXCLUDED BY LAW. Any Giveaway. Items pictured in advertising and other Giveaway materials are for illustrative purposes only.<br></li><li>Selected Entrant Responsible for Any Applicable Tax Liability Associated with the Giveaway Item. The value of the Giveaway Item may be taxable to the Selected Entrant as income. All federal, state and local tax liability, and any other costs and expenses associated with acceptance or use of the Giveaway Item not specifically provided for in these Official Rules are solely the Selected Entrant&#x2019;s responsibility (regardless of whether the Giveaway Item, in whole or in part, is used), &#xA0;including, but not limited to any customs duty or import taxes relating to the import, export or receipt of the items you purchase on the Crypto.com Merch Online Store at https://shop.crypto.com. The recipient of a Giveaway Item is solely responsible for their entry into any Giveaway that involves a Giveaway Item of digital assets or NFT(s) and should ensure that they understand the federal and state tax implications of receiving cryptocurrency or NFT(s) as a Giveaway Item.<br></li><li><strong><strong><strong>Entrant Selection and Notification: </strong>The potential &#x201C;Selected Entrant&#x201D; or &#x201C;Selected Entrants&#x201D; of the Giveaway Item in the Giveaway will be determined according to the method specified by <a href=\"https://crypto.com/\">Crypto.com</a> in Crypto.com&#x2019;s sole and exclusive discretion. </strong></strong><br></li><li>Number of Entrants to be Selected: A total of five (5) unique Selected Entrants will be determined according to the method specified by Crypto.com in Crypto.com&#x2019;s sole and exclusive discretion.</li><li>Notification of Selected Entrant. The Giveaway Item will be awarded to the authorized account holder of the Twitter account selected regardless of the individual who submitted the winning entry. The authorized account holder is the person who is assigned to the Twitter account by Twitter, the social media service provider. Each potential Selected Entrant will be notified within two (2) days of the random draw by direct message to the selected Twitter account, or such other method specified by <a href=\"https://crypto.com/\">Crypto.com</a>, and will be required to confirm his/her email address and/or phone number.<br></li><li>Publicity of Selected Entrant. Additionally, <a href=\"https://crypto.com/\">Crypto.com </a>and the Giveaway Entities reserve the right to make a public announcement, announcing the Selected Entrant on either the <a href=\"https://crypto.com/\">Crypto.com </a>website, through the <a href=\"https://crypto.com/\">Crypto.com </a>App, or in any manner (including, without limitation, social media (e.g., Facebook, Instagram, Twitter)), which they deem appropriate. <br></li><li>Failure of Selected Entrant to Respond to Notification of Selection. If the Selected Entrant cannot be reached after a reasonable effort has been exerted and/or fails to respond to confirm his/her email address within one (1) day (or such other time specified by <a href=\"https://crypto.com/\">Crypto.com</a>) from when the initial notification email is sent, the Selected Entrant forfeits the Giveaway Item, and an alternate Selected Entrant will be selected. <br></li><li>Alternative Selected Entrant. If the alternate Selected Entrant does not comply with these Official Rules or is otherwise unable to accept the Giveaway Item, the Giveaway Item is forfeited and another alternate Selected Entrant will be selected. This Selected Entrant selection and notification process shall be continued until a Selected Entrant is confirmed. If the Giveaway Item or a Selected Entrant notification is returned as undeliverable, the Giveaway Item will be forfeited and an alternate Selected Entrant will be selected.<br></li><li><strong><strong><strong>Selected Entrant Verification: </strong>The Selected Entrant may be required to prove eligibility, including, without limitation, proof of age, residence, and identity, which may include submitting a copy of his/her passport or similar government issued identification within two (2) hours after being notified of being a potential Selected Entrant.</strong></strong><br></li><li>Official Confirmation of Selected Entrant. The Selected Entrant (or any alternate Selected Entrant if one must be selected) is not official and shall not be confirmed as the Selected Entrant until he/she has provided information and completed, signed and returned all documentation required by <a href=\"https://crypto.com/\">Crypto.com</a>, in its sole judgment. <br></li><li>Selected Entrant Obligations. Selected Entrants may be required to sign and return (1) a Declaration of Compliance, Liability, and Publicity Release (except where prohibited), (2) a Waiver and Release from Liability, and (3) any other document Crypto.com determines is required, necessary or appropriate, in its judgment, to confirm the Selected Entrant&#x2019;s eligibility and for tax reporting purposes. Each of these items must be received by Crypto.com within five (5) days of the date notice or attempted notice is sent, in order to claim the Giveaway Item. If, at any time, (i) Crypto.com determines that any Selected Entrant is not eligible to participate in the Giveaway, or (ii) a person whose name is drawn refuses to accept the selection as Selected Entrant, or (iii) a person whose name is drawn cannot or does not complete the eligibility requirements, including without limitation a failure to sign and return the required documents described above or provide any other requested information within the required time period, or (iv) the Selected Entrant (or any alternate Selected Entrant) &#xA0;cannot be contacted, then that person will be ineligible to receive the Giveaway Item(s In the event that a potential Selected Entrant is disqualified or ineligible for any reason, the potential Selected Entrant forfeits the Giveaway Item, and all privileges otherwise due as a Selected Entrant shall be terminated and an alternate Selected Entrant will be chosen by the same drawing method from among all of the remaining Eligible Entries. <br></li><li>Participation of Selected Entrant&#x2019;s Guests (Event or Amenity Access). All guests in attendance with a Selected Entrant, if applicable, must also execute all applicable documents prior to any participation or such guest(s) will not be permitted to participate.<br></li><li>Delay of Confirmation or Announcement of Selected Entrant. Provided that the Selected Entrant is in compliance with the Official Rules and after having successfully proven eligibility, the Selected Entrant will be officially confirmed as the Selected Entrant. <a href=\"https://crypto.com/\">Crypto.com </a>expressly reserves the right to delay the announcement of the Selected Entrant for any reason it deems necessary. In addition, <a href=\"https://crypto.com/\">Crypto.com </a>reserves the right to select an alternate Selected Entrant in the event that any Selected Entrant fails to comply with these Official Rules.<br></li><li><strong><strong><strong>Liability Release and Indemnity: </strong>THE GIVEAWAY ITEM IS OFFERED AND PROVIDED &#x201C;AS IS&#x201D; WITH NO WARRANTY OR GUARANTEE BY <a href=\"https://crypto.com/\">CRYPTO.COM</a> OR ANY GIVEAWAY ENTITY, EITHER EXPRESS OR IMPLIED. IN NO EVENT WILL <a href=\"https://crypto.com/\">CRYPTO.COM </a>OR ANY GIVEAWAY ENTITY BE LIABLE TO ENTRANT FOR ANY DIRECT, SPECIAL, INCIDENTAL, EXEMPLARY, PUNITIVE OR CONSEQUENTIAL DAMAGES (INCLUDING LOSS OF USE, DATA, BUSINESS OR PROFITS) ARISING OUT OF OR IN CONNECTION WITH ENTRANT&#x2019;S PARTICIPATION IN THE GIVEAWAY, WHETHER SUCH LIABILITY ARISES FROM ANY CLAIM BASED UPON CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE), STRICT LIABILITY OR OTHERWISE, AND WHETHER OR NOT <a href=\"https://crypto.com/\">CRYPTO.COM</a> AND/OR OTHER GIVEAWAY ENTITIES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH LOSS OR DAMAGE.</strong></strong><br></li></ol><p>SOME JURISDICTIONS DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATION OR EXCLUSION MAY NOT APPLY TO YOU.<br></p><ol><li><strong><strong><strong>Indemnification</strong>. &#xA0;By entering the Giveaway, Entrant agrees to indemnify, defend, and hold harmless, <a href=\"https://crypto.com/\">Crypto.com </a>and any other Giveaway Entities from any and all liability, for any claims, damages, injuries or losses of any kind, and to release all rights to bring any claim, action or proceeding arising out of, in connection with, or relating to, (i) participation in the Giveaway, (ii) without limitation, death, or property damage, arising directly or indirectly from the acceptance, possession, misuse or use of the Giveaway Item, (iii) defamation, violation of publicity rights, or invasion of privacy in connection with the Giveaway or acceptance and use or the Giveaway Item, and (iv) copyright infringement, trademark infringement, or any other intellectual property-related cause of action arising from or related to the Giveaway, the Giveaway Item, or Crypto.com&#x2019;s advertising and marketing related to the Giveaway, Entrants or the Selected Entrant, in all cases, including but not limited to: (a) unauthorized human intervention in the Giveaway; (b) technical errors related to computers, servers, providers, or telephone, or network lines; (c) printing errors; (d) lost, late, postage-due, misdirected or undeliverable mail; (e) errors in the administration of the Giveaway or the processing of entries; or (f) injury or damage to persons or property (including to any computer or mobile device systems resulting from participation in or accessing or downloading information in connection with the Giveaway), which may be caused, directly or indirectly, in whole or in part, from Entrant&#x2019;s participation in the Giveaway or receipt or use of any Giveaway Item. Entrant assumes all liability for any injury or damage caused, or claimed to be caused, by participation in the Giveaway, or the acceptance, receipt, or use of the Giveaway Item or any Giveaway Item component. Entrant further agrees that in any cause of action, <a href=\"https://crypto.com/\">Crypto.com </a>and/or the Giveaway Entities&#x2019; liability will be limited to the value of the Giveaway Item, and in no event shall the Giveaway Entities be liable for attorney&#x2019;s fees.</strong></strong><br></li><li><strong><strong><strong>No Assumption of Responsibility</strong>. <a href=\"https://crypto.com/\">Crypto.com </a>and the Giveaway Entities assume no responsibility for and will disqualify entries that are: stolen, late, lost, illegible, incomplete, invalid, unintelligible, altered, tampered with, unauthorized, fraudulent, damaged, destroyed, delayed, misdirected, not delivered, not received, or that have incorrect or inaccurate entry information, whether caused by any of the equipment or programming associated with or utilized in the Giveaway, or by any human, mechanical or electronic error that may occur in the processing of the entries in the Giveaway, or other errors appearing within the Official Rules or in the Giveaway related advertisements. <a href=\"https://crypto.com/\">Crypto.com </a>and the Giveaway Entities assume no responsibility for any typographical or other error in the printing of the offer, administration of the Giveaway, errors in processing entries, identifying the Selected Entrant, in the announcement of the Giveaway Item and Selected Entrant, the delivery of the Giveaway Item, any problems or technical malfunction of any telephone network or lines, computer systems, online systems, servers or providers, computer equipment, software, failure of any e-mail or players on account of technical problems or traffic congestion on the Internet or on any web site including <a href=\"https://crypto.com/\">crypto.com</a>, or any combination thereof, including, without limitation, any injury or damage to Entrant&#x2019;s or any other person&#x2019;s computer system/software related to or resulting from participation in, uploading any materials or downloading any materials in the Giveaway. Use of any device to automate or subvert entry is prohibited and any entries received by such means will be void. <a href=\"https://crypto.com/\">Crypto.com </a>reserves the right in its sole discretion to disqualify any person it suspects or finds (i) to have tampered with the entry process or the operation of the Giveaway; (ii) to be acting in a disruptive manner, or with the intent to annoy, abuse, threaten or harass any other person; (iii) to display behavior that will bring such Selected Entrant, <a href=\"https://crypto.com/\">Crypto.com </a>or the Giveaway Entities into disgrace; (iv) to have provided inaccurate information on any legal documents submitted in connection with the Giveaway; or (v) to be acting in violation of these Official Rules. ANY VIOLATION OF THESE OFFICIAL RULES BY A SELECTED ENTRANT WILL RESULT IN SUCH SELECTED ENTRANT&#x2019;S DISQUALIFICATION AS A SELECTED ENTRANT OF THE GIVEAWAY AND ALL PRIVILEGES AS A SELECTED ENTRANT WILL BE IMMEDIATELY TERMINATED.</strong></strong><br></li><li><strong><strong><strong>Grant of Rights. </strong>Except where prohibited by law, by entering the Giveaway and/or winning the Giveaway Item, Entrant irrevocably consents to the use of his or her name, image, photograph, likeness, biographical information, entry, statements attributed to Entrant (if true) and any video footage related to the Giveaway Item, for all Giveaway Entities&#x2019; advertising, promotional or other commercial purposes in all media now or hereafter known, worldwide and in perpetuity without additional compensation and additionally consents to the Giveaway Entities putting his or her name on a Selected Entrant&#x2019;s list. Please note that <a href=\"https://crypto.com/\">Crypto.com </a>may not acknowledge or return any entries.</strong></strong><br></li><li>Intellectual Property. By submitting an entry, Entrant agrees to Crypto.com&#x2019;s general terms regarding intellectual property available at https://crypto.com/document/entity_australia.pdf<a href=\"https://crypto.com/document/mco_services\">.</a> &#xA0;Specifically, Entrant represents and warrants to Crypto.com that they have the rights, authorisations, and licences to all the content they share with Crypto.com via any platform. This includes, but is not limited to, getting the owner&#x2019;s consent before sharing third-party content and/or not infringing (or causing Crypto.com to infringe) any third-party rights, including third-party intellectual property rights. Entrant grants to Crypto.com a perpetual, non-exclusive, transferable, sublicensable, royalty-free, worldwide license to use, copy, modify, distribute, publish, and process the content they share with Crypto.com (including their intellectual property) without any further consent, notice, and/or compensation to them or to others for any purpose. Entrant can end this licence by deleting such content and notifying Crypto.com at contact@crypto.com. Entrant further agrees to hold Crypto.com harmless against any liability, claims, or demands arising from the content they share with Crypto.com.<br></li><li>Right of Publicity. By submitting an Entry, Entrant agrees to Crypto.com&#x2019;s use of your name, address, likeness, or Giveaway Item information for promotional purposes in any medium without additional compensation to the extent permitted by law.<br></li><li><strong><strong><strong>General Terms. &#xA0;</strong>The Giveaway Entities are not responsible if the Giveaway cannot take place, or if the Giveaway Item cannot be awarded due to delays, interruptions or failures due to acts of God, war, natural disasters, weather, acts or threats of terrorism, strikes, lockouts, labor disputes, work stoppages, fire, acts of government, or other events outside of the reasonable control of the Giveaway Entities. </strong></strong><br></li><li>Right to Terminate. If, for any reason the Giveaway is not capable of running as planned, including, without limitation, due to infection by computer virus, bugs, tampering, unauthorized intervention, fraud, technical failures, or any other causes beyond the reasonable control of the Giveaway Entities, which, in Crypto.com&#x2019;s sole determination, corrupts or affects the administration, security, fairness, integrity or proper conduct of the Giveaway, <a href=\"https://crypto.com/\">Crypto.com </a>reserves the right, in its sole discretion, to cancel, terminate, modify, or suspend the Giveaway or any part of the Giveaway. If the Giveaway or any part of the Giveaway is terminated or modified prior to the closing of the Entry Period, notice will be posted on <a href=\"https://crypto.com/\">crypto.com</a>. <a href=\"https://crypto.com/\">Crypto.com </a>reserves the right to modify and amend these Official Rules from time to time during the Entry Period for clarification purposes.<br></li><li>Reservation of Rights. ANY ATTEMPT BY ANY PERSON TO DELIBERATELY DAMAGE OR UNDERMINE THE LEGITIMATE OPERATION OF THE GIVEAWAY MAY BE IN VIOLATION OF CRIMINAL AND CIVIL LAW AND SHOULD SUCH AN ATTEMPT BE MADE, <a href=\"https://crypto.com/\">CRYPTO.COM </a>RESERVES THE RIGHT TO SEEK REMEDIES AND DAMAGES (INCLUDING ATTORNEYS&#x2019; FEES) FROM ANY SUCH PERSON TO THE FULLEST EXTENT PERMITTED BY LAW.<br></li><li>Severability. The invalidity or unenforceability of any provision of these Official Rules will not affect the validity or enforceability of any other provision. In the event that any provision of the Official Rules is determined to be invalid or otherwise unenforceable or illegal, the other provisions will remain in effect and will be construed in accordance with their terms as if the invalid or illegal provision were not contained herein. Crypto.com&#x2019;s failure to enforce any term of these Official Rules will not constitute a waiver of that term or any other provision of these Official Rules. Entrant agrees to waive any rights to claim ambiguity of these Official Rules. Headings are solely for convenience of reference and will not be deemed to affect in any manner the meaning or intent of these Official Rules or any provision hereof. In the event there is a discrepancy or inconsistency between disclosures or other statements contained in the Giveaway&#x2013; related materials, privacy policy or terms of use on a website and/or the terms and conditions of these Official Rules, the Official Rules shall prevail, govern and control and the discrepancy will be resolved in Crypto.com&#x2019;s sole and absolute discretion.<br></li><li><strong><strong><strong>Privacy: </strong>All information submitted by Entrants and collected by <a href=\"https://crypto.com/\">Crypto.com </a>in connection with Entrant&#x2019;s entry will be subject to and will be treated in a manner consistent with Crypto.com Global Marketing Privacy Notice available at: https://crypto.com/privacy/marketing. By participating in the Giveaway, Entrant hereby agrees that <a href=\"https://crypto.com/\">Crypto.com </a>may collect and use his or her personal information submitted with the entry, and acknowledges that he or she has read and accepted the <a href=\"https://crypto.com/\">Crypto.com Global Marketing </a>Privacy Notice. Among other things, the information Entrants provide may be used for sending Entrants company updates and announcements about <a href=\"https://crypto.com/\">Crypto.com </a>and its products and/or services.</strong></strong><br></li><li><strong><strong><strong>Binding Arbitration: </strong>Except where prohibited by law, Entrant agrees that: (1) ANY DISPUTE, CONTROVERSY OR CLAIM ARISING OUT OF OR RELATING TO THE GIVEAWAY OR ANY GIVEAWAY ITEM AWARDED SHALL BE RESOLVED INDIVIDUALLY, WITHOUT RESORT TO ANY FORM OF CLASS ACTION; (2) Any dispute, controversy or claim arising out of, relating to or in connection with this contract, including any questions regarding its existence, validity or termination, shall be resolved by arbitration in accordance with the ACICA Expedited Arbitration Rules. The seat of arbitration shall be Melbourne, Australia. The language of the arbitration shall be English; (3) unless both Entrant and <a href=\"https://crypto.com/\">Crypto.com </a>agree in writing, the arbitrator may not consolidate more than one person&#x2019;s claims, and may not otherwise preside over any form of class or representative proceeding; (4) judgment upon any award rendered may be entered in any court having jurisdiction thereof; and (5) any award or judgment shall be subject to all limitations and releases set forth in these Official Rules and be limited to actual out of pocket damages, and shall not, in any event, include any punitive, exemplary, consequential or incidental damages, attorney&#x2019;s fees or costs of bringing a claim, or any injunctive or other equitable relief. SOME JURISDICTIONS DO NOT ALLOW THE LIMITATIONS OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE MAY NOT APPLY TO YOU.</strong></strong><br></li><li><strong><strong><strong>Governing Law: </strong>All federal, state and local laws and regulations apply. Void where prohibited by law. All issues and questions concerning the construction, validity, interpretation and enforceability of these Official Rules, or the rights and obligations of the Entrant and <a href=\"https://crypto.com/\">Crypto.com </a>in connection with the Giveaway, shall be governed by, and construed in accordance with, the laws of Victoria, Australia without giving effect to any choice of law or conflict of laws rules. &#xA0;</strong></strong><br></li><li><strong><strong><strong>Accessibility of Official Rules and Selected Entrants List: </strong>The terms and conditions relating to validly submitting an entry to the Giveaway are available separately via the relevant campaign blog post. Where required by law, <a href=\"https://crypto.com/\">Crypto.com </a>will provide the name of Selected Entrant(s) of a Giveaway to those who request it. Requests for the list of Selected Entrants shall be emailed to Crypto.com at <a href=\"mailto:contact@crypto.com\">contact@crypto.com </a>within twenty-eight (28) days of the end of the Entry Period start date.</strong></strong><br></li><li><strong><strong><strong>Social Media:</strong> By submitting an Entry, Entrant agrees to a complete release of Facebook&#xAE;, Instagram&#xAE; Twitter&#xAE;, and/or You Tube&#xAE;, and/or any other social media platform used to promote or enter into this Giveaway and acknowledges that the Giveaway is in no way sponsored, endorsed, administered by, or associated with Facebook&#xAE;, Instagram&#xAE;, Twitter&#xAE;, YouTube&#xAE;, and/or any other social media platform. Further, Entrant agrees to abide by any and all, if any, requirements imposed by any social media platform used to promote or enter into the Giveaway. </strong></strong><br></li><li><strong><strong><strong>Entire Agreement.</strong> These Official Rules constitute the entire agreement between Crypto.com and Entrant.</strong></strong></li></ol>","content:encodedSnippet":"To participate in the Giveaway, you must satisfy the eligibility criteria and meet the requirements set out in the Official Rules, and: \n\nLike the designated post on Twitter or Instagram;\nReply to the same post with your Final prediction;\nFollow Crypto.com on the platform you entered, at the following accounts:\n- Twitter: @cryptocom\n- Instagram: @cryptocomofficial ; and\nFill out the form at https://bit.ly/predictfifafinal\n\nduring the Entry Period (“Entry”). The Entry Period begins on December 12th, 2022 at 10:00am GMT and ends on December 13th, 2022 at 6:59pm GMT. *Entrant’s Twitter and/or Instagram account must be a public account to be eligible for the Giveaway.\n\nGiveaway Items\nThe Giveaway Items are as listed below with their estimated market value:\n\nUS$200 in Cronos cryptocurrency token (CRO) \n\nOdds of winning depend on the number of Eligible Entries received during the Entry Period. Five (5) Giveaway Items will be distributed.\n\nOFFICIAL RULES FOR AUSTRALIA GIVEAWAY \n\nCrypto.com will conduct the Giveaway (the “Giveaway”) substantially as described in these rules. By entering or participating, each entrant or participant (“Entrant”) agrees unconditionally to be bound by these official rules (the “Official Rules”) and the decisions of Crypto.com, which are final and binding in all respects to the Giveaway. Eligibility to receive any items from the Giveaway is contingent upon fulfilling all requirements set forth herein.\n\nNO PURCHASE NECESSARY TO ENTER OR WIN A GIVEAWAY ITEM. A PURCHASE DOES NOT IMPROVE YOUR CHANCES OF BEING SELECTED. ODDS OF BEING SELECTED WILL DEPEND ON THE TOTAL NUMBER OF ELIGIBLE ENTRIES RECEIVED. VOID WHERE PROHIBITED BY LAW OR RESTRICTED BY LAW.\n\nGiveaway subject to these Official Rules are sponsored and administered by the relevant Crypto.com entity that provides you with relevant Crypto.com services.\n\nEligibility: \n\nGeneral Eligibility: Unless otherwise specified, the Giveaway is open only to Australian residents (i) who are eighteen (18) years of age or older at the time of entry; (ii) who have an active e-mail account and Internet access prior to the beginning of the Entry Period (defined below); and (iii) fulfil the Entry Requirements (defined below). \n\nIndividuals Excluded From Entry: Employees, officers and representatives, and the immediate family members of such employees, officers and representatives (i.e., parent, spouse, siblings, children, grandparents, step parents, step children and step siblings, and their respective spouses, and those living in the same household, whether or not related) of Crypto.com or its affiliated companies, parent companies, subsidiaries, participating promotional partners, advertising and promotion agencies, webmasters and any company involved in the creation, design, execution, production, or fulfillment of the Giveaway (collectively, the “Giveaway Entities”) are not eligible to enter.\n\nAdditional Eligibility Requirements. Prior to being eligible to receive any Giveaway Item, a Selected Entrant (as defined below) must provide Crypto.com with any information or certifications needed by Crypto.com, in its judgment. Without limiting the foregoing, a Selected Entrant of the Giveaway may be required to sign a copy of these Official Rules, to complete and sign a Declaration of Compliance, Liability, and Publicity Release (except where prohibited by law), and provide any other document that Crypto.com determines is required, necessary or appropriate, in its judgment, to confirm the Selected Entrant’s eligibility and for tax reporting or other purposes. If the Selected Entrant fails to satisfy these conditions within two (2) days of the notice that such person has been selected, that Entrant will not be eligible for the Giveaway Item, and an alternate Entrant will be selected, as described in “Entrant Selection and Notification” clause below. VOID WHERE PROHIBITED.\n\nAcceptance of Rules. By entering the Giveaway, Entrant: (a) agrees to be bound by these Official Rules and by the interpretation of these Official Rules by Crypto.com and by the decisions of Crypto.com, which are final and binding in all respects; (b) acknowledges compliance with these Official Rules; and (c) agrees to comply with any and all applicable federal, state and local laws, rules and regulations. Winning the Giveaway Item (defined below) is contingent upon fulfilling all requirements set forth in these Official Rules. GIVEAWAY IS VOID WHERE PROHIBITED.\n\nEntry Period:  The Giveaway will begin and end at the times specified by Crypto.com (the “Entry Period”). The Entry Period will start on December 12th, 2022 at 10:00am GMT and end on December 13th, 2022 at 6:59pm GMT. Entry methods for the Giveaway will be specified by Crypto.com and all entries must be received during the Entry Period. Entries must be submitted during the Entry Period in order to be eligible for the Giveaway. Crypto.com shall have the sole and final decision regarding timekeeping for entry in the Giveaway. Normal time rates, if any, charged by the Entrants’ Internet service or mobile provider will apply.     \n\nRegistration of a Crypto.com Account. To enter the lucky draw, entrants must have a Crypto.com App account, and have completed the registration process (including but not limited to, providing their email, phone number and identification documents) prior to the Entry Period. Crypto.com shall have the sole and final decision regarding timekeeping for entry in the Giveaway. Normal time rates, if any, charged by the Entrants' Internet service or mobile provider will apply.\n\nComplete and Truthful Entries. When submitting an entry, Entrant is required to provide complete and truthful information. Entries that are incomplete, illegible, corrupted, false, lost, late or misdirected, deceptive or otherwise not in compliance with the Official Rules may be disqualified from the Giveaway at Crypto.com’s sole and absolute discretion. Entries submitted by persons who do not meet the eligibility requirements (including all requirements with respect to age and residence) are void. \n\nUse of Automation for Repetitive Entries. The use of any scripts, computer programs, robotic repetitive, macro, automatic, programmed or similar automated entry methods or agents to submit entries will void all entries submitted by that person or that person’s agents. Crypto.com will disqualify any entry from individuals who do not meet the eligibility requirements. \n\nEligible Entries. All entries submitted in compliance with these Official Rules and not disqualified or void are considered “Eligible Entries.” All entries are the property of Crypto.com. Image and photo entries shall not include images of any third parties or individuals outside of the Entrant and Crypto.com promotional materials. Entrant shall abide by all posting and image guidelines as set forth by any social media platform, if any, used to enter into this Giveaway. Crypto.com shall not be liable to any third parties for Entrant’s violations of said social media guidelines. Photos displaying or containing profanity or that are obscene or otherwise inappropriate (as determined by Crypto.com) will be disqualified, as will entries that violate copyright laws or infringe on any third party rights. By entering, except where prohibited by law, Entrant is assigning all ownership rights and usage rights to Entrant’s photo to the Giveaway Entities.\n\nNumber of Entries. Only one (1) Entry is permitted per person during the Entry Period. Multiple entrants are not permitted to share the same email address. Any attempt by any person to enter the Giveaway more than one (1) time by using multiple/different email addresses, identities, registrations and logins, or any other methods will void that entrant's entries and that entrant may be disqualified. Use of any automated system to participate is prohibited and will result in disqualification. Crypto.com and its affiliates, and their respective officers, directors, employees, contractors and agents are not responsible for lost, late, incomplete, invalid, unintelligible or misdirected registrations, which will be disqualified.\nMethod of Entry: Entry methods for the Giveaway will be specified by Crypto.com, and all entries must be received during the Entry Period. Entries must be submitted during the Entry Period in order to be eligible for the Giveaway.\n\nTo enter into the Giveaway, Entrants must, in addition to meeting the eligibility criteria, have an existing registered and approved Crypto.com App account by the start of the Entry Period, and:\nLike the designated post on Twitter or Instagram;\nReply to the same post with your finals prediction;\nFollow Crypto.com on the platform you entered, at the following accounts:\n- Twitter: @cryptocom\n- Instagram: @cryptocomofficial ; and\nFill out the form at https://bit.ly/predictfifafinal\n\nduring the Entry Period (each, an “Entry”). *Entrant’s Twitter and/or Instagram account must be a public account to be eligible for the Giveaway.\n\nGiveaway Items: The item(s) for the giveaway will be specified by Crypto.com (the “Giveaway Item”). The approximate total retail value of the Giveaway Item is as specified by Crypto.com. There is a limited number of items for the giveaway and hence the odds of receiving the item for the giveaway will depend on the number of Eligible Entries received during the Entry Period. Odds of winning depend on the total number of Eligible Entries received during the Entry Period.\n\nCRO Giveaway Item: Five (5) Selected Entrants shall each receive US$200 worth of Cronos cryptocurrency tokens (CRO) to their Crypto.com App account, as provided in the Entry form, with the exchange rate determined by Crypto.com in its absolute discretion.\n\nUnavailability of Giveaway Item. If for any reason the Giveaway Item, or any part of the Giveaway Item, is unavailable or there is a delay in receiving the Giveaway Item or a related event is delayed, cancelled or postponed, or for any other reason, Crypto.com reserves the right to modify the Giveaway Item in its sole discretion and award a substitute Giveaway Item, or portion of the Giveaway Item, of comparable or greater value as set forth in these Official Rules. No substitution, transfer, assignment or cash equivalent of the Giveaway Item, or any portion thereof, is permitted by the Selected Entrant. \n\nInability to Accept Giveaway Item. Crypto.com and the Giveaway Entities shall have no responsibility or obligation to a selected Entrant who is unable or unavailable to, or who does not for any reason, accept or utilize the Giveaway Item. In the event a selected Entrant cannot accept the Giveaway Item, an alternate Entrant will be randomly drawn from all remaining Eligible Entries. \n\nCosts and Expenses Associated with the Giveaway Item. All costs and expenses not specifically listed above as part of the Giveaway Item are solely the Selected Entrant’s responsibility. Selected Entrant agrees to comply with any additional terms and conditions applicable for attending the Event. \n\nGiveaway Items Provided “As Is”. The Giveaway Items are provided “as is”. Entrants acknowledge that Crypto.com and the Giveaway Entities have neither made nor are in any manner responsible or liable for any warranty, representation or guarantee, express or implied, in fact or in law, relative to the Giveaway Items, including any implied warranty of merchantability of fitness for a particular purpose. NOTHING IN THESE OFFICIAL RULES EXCLUDES OR PURPORTS TO EXCLUDE ANY STATUTORY CONSUMER GUARANTEES PROVIDED UNDER AUSTRALIAN LAW THAT CANNOT BE EXCLUDED BY LAW. Any Giveaway. Items pictured in advertising and other Giveaway materials are for illustrative purposes only.\n\nSelected Entrant Responsible for Any Applicable Tax Liability Associated with the Giveaway Item. The value of the Giveaway Item may be taxable to the Selected Entrant as income. All federal, state and local tax liability, and any other costs and expenses associated with acceptance or use of the Giveaway Item not specifically provided for in these Official Rules are solely the Selected Entrant’s responsibility (regardless of whether the Giveaway Item, in whole or in part, is used),  including, but not limited to any customs duty or import taxes relating to the import, export or receipt of the items you purchase on the Crypto.com Merch Online Store at https://shop.crypto.com. The recipient of a Giveaway Item is solely responsible for their entry into any Giveaway that involves a Giveaway Item of digital assets or NFT(s) and should ensure that they understand the federal and state tax implications of receiving cryptocurrency or NFT(s) as a Giveaway Item.\n\nEntrant Selection and Notification: The potential “Selected Entrant” or “Selected Entrants” of the Giveaway Item in the Giveaway will be determined according to the method specified by Crypto.com in Crypto.com’s sole and exclusive discretion. \n\nNumber of Entrants to be Selected: A total of five (5) unique Selected Entrants will be determined according to the method specified by Crypto.com in Crypto.com’s sole and exclusive discretion.\nNotification of Selected Entrant. The Giveaway Item will be awarded to the authorized account holder of the Twitter account selected regardless of the individual who submitted the winning entry. The authorized account holder is the person who is assigned to the Twitter account by Twitter, the social media service provider. Each potential Selected Entrant will be notified within two (2) days of the random draw by direct message to the selected Twitter account, or such other method specified by Crypto.com, and will be required to confirm his/her email address and/or phone number.\n\nPublicity of Selected Entrant. Additionally, Crypto.com and the Giveaway Entities reserve the right to make a public announcement, announcing the Selected Entrant on either the Crypto.com website, through the Crypto.com App, or in any manner (including, without limitation, social media (e.g., Facebook, Instagram, Twitter)), which they deem appropriate. \n\nFailure of Selected Entrant to Respond to Notification of Selection. If the Selected Entrant cannot be reached after a reasonable effort has been exerted and/or fails to respond to confirm his/her email address within one (1) day (or such other time specified by Crypto.com) from when the initial notification email is sent, the Selected Entrant forfeits the Giveaway Item, and an alternate Selected Entrant will be selected. \n\nAlternative Selected Entrant. If the alternate Selected Entrant does not comply with these Official Rules or is otherwise unable to accept the Giveaway Item, the Giveaway Item is forfeited and another alternate Selected Entrant will be selected. This Selected Entrant selection and notification process shall be continued until a Selected Entrant is confirmed. If the Giveaway Item or a Selected Entrant notification is returned as undeliverable, the Giveaway Item will be forfeited and an alternate Selected Entrant will be selected.\n\nSelected Entrant Verification: The Selected Entrant may be required to prove eligibility, including, without limitation, proof of age, residence, and identity, which may include submitting a copy of his/her passport or similar government issued identification within two (2) hours after being notified of being a potential Selected Entrant.\n\nOfficial Confirmation of Selected Entrant. The Selected Entrant (or any alternate Selected Entrant if one must be selected) is not official and shall not be confirmed as the Selected Entrant until he/she has provided information and completed, signed and returned all documentation required by Crypto.com, in its sole judgment. \n\nSelected Entrant Obligations. Selected Entrants may be required to sign and return (1) a Declaration of Compliance, Liability, and Publicity Release (except where prohibited), (2) a Waiver and Release from Liability, and (3) any other document Crypto.com determines is required, necessary or appropriate, in its judgment, to confirm the Selected Entrant’s eligibility and for tax reporting purposes. Each of these items must be received by Crypto.com within five (5) days of the date notice or attempted notice is sent, in order to claim the Giveaway Item. If, at any time, (i) Crypto.com determines that any Selected Entrant is not eligible to participate in the Giveaway, or (ii) a person whose name is drawn refuses to accept the selection as Selected Entrant, or (iii) a person whose name is drawn cannot or does not complete the eligibility requirements, including without limitation a failure to sign and return the required documents described above or provide any other requested information within the required time period, or (iv) the Selected Entrant (or any alternate Selected Entrant)  cannot be contacted, then that person will be ineligible to receive the Giveaway Item(s In the event that a potential Selected Entrant is disqualified or ineligible for any reason, the potential Selected Entrant forfeits the Giveaway Item, and all privileges otherwise due as a Selected Entrant shall be terminated and an alternate Selected Entrant will be chosen by the same drawing method from among all of the remaining Eligible Entries. \n\nParticipation of Selected Entrant’s Guests (Event or Amenity Access). All guests in attendance with a Selected Entrant, if applicable, must also execute all applicable documents prior to any participation or such guest(s) will not be permitted to participate.\n\nDelay of Confirmation or Announcement of Selected Entrant. Provided that the Selected Entrant is in compliance with the Official Rules and after having successfully proven eligibility, the Selected Entrant will be officially confirmed as the Selected Entrant. Crypto.com expressly reserves the right to delay the announcement of the Selected Entrant for any reason it deems necessary. In addition, Crypto.com reserves the right to select an alternate Selected Entrant in the event that any Selected Entrant fails to comply with these Official Rules.\n\nLiability Release and Indemnity: THE GIVEAWAY ITEM IS OFFERED AND PROVIDED “AS IS” WITH NO WARRANTY OR GUARANTEE BY CRYPTO.COM OR ANY GIVEAWAY ENTITY, EITHER EXPRESS OR IMPLIED. IN NO EVENT WILL CRYPTO.COM OR ANY GIVEAWAY ENTITY BE LIABLE TO ENTRANT FOR ANY DIRECT, SPECIAL, INCIDENTAL, EXEMPLARY, PUNITIVE OR CONSEQUENTIAL DAMAGES (INCLUDING LOSS OF USE, DATA, BUSINESS OR PROFITS) ARISING OUT OF OR IN CONNECTION WITH ENTRANT’S PARTICIPATION IN THE GIVEAWAY, WHETHER SUCH LIABILITY ARISES FROM ANY CLAIM BASED UPON CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE), STRICT LIABILITY OR OTHERWISE, AND WHETHER OR NOT CRYPTO.COM AND/OR OTHER GIVEAWAY ENTITIES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH LOSS OR DAMAGE.\n\nSOME JURISDICTIONS DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATION OR EXCLUSION MAY NOT APPLY TO YOU.\n\nIndemnification.  By entering the Giveaway, Entrant agrees to indemnify, defend, and hold harmless, Crypto.com and any other Giveaway Entities from any and all liability, for any claims, damages, injuries or losses of any kind, and to release all rights to bring any claim, action or proceeding arising out of, in connection with, or relating to, (i) participation in the Giveaway, (ii) without limitation, death, or property damage, arising directly or indirectly from the acceptance, possession, misuse or use of the Giveaway Item, (iii) defamation, violation of publicity rights, or invasion of privacy in connection with the Giveaway or acceptance and use or the Giveaway Item, and (iv) copyright infringement, trademark infringement, or any other intellectual property-related cause of action arising from or related to the Giveaway, the Giveaway Item, or Crypto.com’s advertising and marketing related to the Giveaway, Entrants or the Selected Entrant, in all cases, including but not limited to: (a) unauthorized human intervention in the Giveaway; (b) technical errors related to computers, servers, providers, or telephone, or network lines; (c) printing errors; (d) lost, late, postage-due, misdirected or undeliverable mail; (e) errors in the administration of the Giveaway or the processing of entries; or (f) injury or damage to persons or property (including to any computer or mobile device systems resulting from participation in or accessing or downloading information in connection with the Giveaway), which may be caused, directly or indirectly, in whole or in part, from Entrant’s participation in the Giveaway or receipt or use of any Giveaway Item. Entrant assumes all liability for any injury or damage caused, or claimed to be caused, by participation in the Giveaway, or the acceptance, receipt, or use of the Giveaway Item or any Giveaway Item component. Entrant further agrees that in any cause of action, Crypto.com and/or the Giveaway Entities’ liability will be limited to the value of the Giveaway Item, and in no event shall the Giveaway Entities be liable for attorney’s fees.\n\nNo Assumption of Responsibility. Crypto.com and the Giveaway Entities assume no responsibility for and will disqualify entries that are: stolen, late, lost, illegible, incomplete, invalid, unintelligible, altered, tampered with, unauthorized, fraudulent, damaged, destroyed, delayed, misdirected, not delivered, not received, or that have incorrect or inaccurate entry information, whether caused by any of the equipment or programming associated with or utilized in the Giveaway, or by any human, mechanical or electronic error that may occur in the processing of the entries in the Giveaway, or other errors appearing within the Official Rules or in the Giveaway related advertisements. Crypto.com and the Giveaway Entities assume no responsibility for any typographical or other error in the printing of the offer, administration of the Giveaway, errors in processing entries, identifying the Selected Entrant, in the announcement of the Giveaway Item and Selected Entrant, the delivery of the Giveaway Item, any problems or technical malfunction of any telephone network or lines, computer systems, online systems, servers or providers, computer equipment, software, failure of any e-mail or players on account of technical problems or traffic congestion on the Internet or on any web site including crypto.com, or any combination thereof, including, without limitation, any injury or damage to Entrant’s or any other person’s computer system/software related to or resulting from participation in, uploading any materials or downloading any materials in the Giveaway. Use of any device to automate or subvert entry is prohibited and any entries received by such means will be void. Crypto.com reserves the right in its sole discretion to disqualify any person it suspects or finds (i) to have tampered with the entry process or the operation of the Giveaway; (ii) to be acting in a disruptive manner, or with the intent to annoy, abuse, threaten or harass any other person; (iii) to display behavior that will bring such Selected Entrant, Crypto.com or the Giveaway Entities into disgrace; (iv) to have provided inaccurate information on any legal documents submitted in connection with the Giveaway; or (v) to be acting in violation of these Official Rules. ANY VIOLATION OF THESE OFFICIAL RULES BY A SELECTED ENTRANT WILL RESULT IN SUCH SELECTED ENTRANT’S DISQUALIFICATION AS A SELECTED ENTRANT OF THE GIVEAWAY AND ALL PRIVILEGES AS A SELECTED ENTRANT WILL BE IMMEDIATELY TERMINATED.\n\nGrant of Rights. Except where prohibited by law, by entering the Giveaway and/or winning the Giveaway Item, Entrant irrevocably consents to the use of his or her name, image, photograph, likeness, biographical information, entry, statements attributed to Entrant (if true) and any video footage related to the Giveaway Item, for all Giveaway Entities’ advertising, promotional or other commercial purposes in all media now or hereafter known, worldwide and in perpetuity without additional compensation and additionally consents to the Giveaway Entities putting his or her name on a Selected Entrant’s list. Please note that Crypto.com may not acknowledge or return any entries.\n\nIntellectual Property. By submitting an entry, Entrant agrees to Crypto.com’s general terms regarding intellectual property available at https://crypto.com/document/entity_australia.pdf.  Specifically, Entrant represents and warrants to Crypto.com that they have the rights, authorisations, and licences to all the content they share with Crypto.com via any platform. This includes, but is not limited to, getting the owner’s consent before sharing third-party content and/or not infringing (or causing Crypto.com to infringe) any third-party rights, including third-party intellectual property rights. Entrant grants to Crypto.com a perpetual, non-exclusive, transferable, sublicensable, royalty-free, worldwide license to use, copy, modify, distribute, publish, and process the content they share with Crypto.com (including their intellectual property) without any further consent, notice, and/or compensation to them or to others for any purpose. Entrant can end this licence by deleting such content and notifying Crypto.com at contact@crypto.com. Entrant further agrees to hold Crypto.com harmless against any liability, claims, or demands arising from the content they share with Crypto.com.\n\nRight of Publicity. By submitting an Entry, Entrant agrees to Crypto.com’s use of your name, address, likeness, or Giveaway Item information for promotional purposes in any medium without additional compensation to the extent permitted by law.\n\nGeneral Terms.  The Giveaway Entities are not responsible if the Giveaway cannot take place, or if the Giveaway Item cannot be awarded due to delays, interruptions or failures due to acts of God, war, natural disasters, weather, acts or threats of terrorism, strikes, lockouts, labor disputes, work stoppages, fire, acts of government, or other events outside of the reasonable control of the Giveaway Entities. \n\nRight to Terminate. If, for any reason the Giveaway is not capable of running as planned, including, without limitation, due to infection by computer virus, bugs, tampering, unauthorized intervention, fraud, technical failures, or any other causes beyond the reasonable control of the Giveaway Entities, which, in Crypto.com’s sole determination, corrupts or affects the administration, security, fairness, integrity or proper conduct of the Giveaway, Crypto.com reserves the right, in its sole discretion, to cancel, terminate, modify, or suspend the Giveaway or any part of the Giveaway. If the Giveaway or any part of the Giveaway is terminated or modified prior to the closing of the Entry Period, notice will be posted on crypto.com. Crypto.com reserves the right to modify and amend these Official Rules from time to time during the Entry Period for clarification purposes.\n\nReservation of Rights. ANY ATTEMPT BY ANY PERSON TO DELIBERATELY DAMAGE OR UNDERMINE THE LEGITIMATE OPERATION OF THE GIVEAWAY MAY BE IN VIOLATION OF CRIMINAL AND CIVIL LAW AND SHOULD SUCH AN ATTEMPT BE MADE, CRYPTO.COM RESERVES THE RIGHT TO SEEK REMEDIES AND DAMAGES (INCLUDING ATTORNEYS’ FEES) FROM ANY SUCH PERSON TO THE FULLEST EXTENT PERMITTED BY LAW.\n\nSeverability. The invalidity or unenforceability of any provision of these Official Rules will not affect the validity or enforceability of any other provision. In the event that any provision of the Official Rules is determined to be invalid or otherwise unenforceable or illegal, the other provisions will remain in effect and will be construed in accordance with their terms as if the invalid or illegal provision were not contained herein. Crypto.com’s failure to enforce any term of these Official Rules will not constitute a waiver of that term or any other provision of these Official Rules. Entrant agrees to waive any rights to claim ambiguity of these Official Rules. Headings are solely for convenience of reference and will not be deemed to affect in any manner the meaning or intent of these Official Rules or any provision hereof. In the event there is a discrepancy or inconsistency between disclosures or other statements contained in the Giveaway– related materials, privacy policy or terms of use on a website and/or the terms and conditions of these Official Rules, the Official Rules shall prevail, govern and control and the discrepancy will be resolved in Crypto.com’s sole and absolute discretion.\n\nPrivacy: All information submitted by Entrants and collected by Crypto.com in connection with Entrant’s entry will be subject to and will be treated in a manner consistent with Crypto.com Global Marketing Privacy Notice available at: https://crypto.com/privacy/marketing. By participating in the Giveaway, Entrant hereby agrees that Crypto.com may collect and use his or her personal information submitted with the entry, and acknowledges that he or she has read and accepted the Crypto.com Global Marketing Privacy Notice. Among other things, the information Entrants provide may be used for sending Entrants company updates and announcements about Crypto.com and its products and/or services.\n\nBinding Arbitration: Except where prohibited by law, Entrant agrees that: (1) ANY DISPUTE, CONTROVERSY OR CLAIM ARISING OUT OF OR RELATING TO THE GIVEAWAY OR ANY GIVEAWAY ITEM AWARDED SHALL BE RESOLVED INDIVIDUALLY, WITHOUT RESORT TO ANY FORM OF CLASS ACTION; (2) Any dispute, controversy or claim arising out of, relating to or in connection with this contract, including any questions regarding its existence, validity or termination, shall be resolved by arbitration in accordance with the ACICA Expedited Arbitration Rules. The seat of arbitration shall be Melbourne, Australia. The language of the arbitration shall be English; (3) unless both Entrant and Crypto.com agree in writing, the arbitrator may not consolidate more than one person’s claims, and may not otherwise preside over any form of class or representative proceeding; (4) judgment upon any award rendered may be entered in any court having jurisdiction thereof; and (5) any award or judgment shall be subject to all limitations and releases set forth in these Official Rules and be limited to actual out of pocket damages, and shall not, in any event, include any punitive, exemplary, consequential or incidental damages, attorney’s fees or costs of bringing a claim, or any injunctive or other equitable relief. SOME JURISDICTIONS DO NOT ALLOW THE LIMITATIONS OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE MAY NOT APPLY TO YOU.\n\nGoverning Law: All federal, state and local laws and regulations apply. Void where prohibited by law. All issues and questions concerning the construction, validity, interpretation and enforceability of these Official Rules, or the rights and obligations of the Entrant and Crypto.com in connection with the Giveaway, shall be governed by, and construed in accordance with, the laws of Victoria, Australia without giving effect to any choice of law or conflict of laws rules.  \n\nAccessibility of Official Rules and Selected Entrants List: The terms and conditions relating to validly submitting an entry to the Giveaway are available separately via the relevant campaign blog post. Where required by law, Crypto.com will provide the name of Selected Entrant(s) of a Giveaway to those who request it. Requests for the list of Selected Entrants shall be emailed to Crypto.com at contact@crypto.com within twenty-eight (28) days of the end of the Entry Period start date.\n\nSocial Media: By submitting an Entry, Entrant agrees to a complete release of Facebook®, Instagram® Twitter®, and/or You Tube®, and/or any other social media platform used to promote or enter into this Giveaway and acknowledges that the Giveaway is in no way sponsored, endorsed, administered by, or associated with Facebook®, Instagram®, Twitter®, YouTube®, and/or any other social media platform. Further, Entrant agrees to abide by any and all, if any, requirements imposed by any social media platform used to promote or enter into the Giveaway. \n\nEntire Agreement. These Official Rules constitute the entire agreement between Crypto.com and Entrant.","dc:creator":"Jaime Lee","content":"<p>To participate in the Giveaway, you must satisfy the eligibility criteria and meet the requirements set out in the Official Rules, and: </p><ol><li>Like the designated post on Twitter or Instagram;</li><li>Reply to the same post with your Final prediction;</li><li>Follow Crypto.com on the platform you entered, at the following</li></ol>","contentSnippet":"To participate in the Giveaway, you must satisfy the eligibility criteria and meet the requirements set out in the Official Rules, and: \n\nLike the designated post on Twitter or Instagram;\nReply to the same post with your Final prediction;\nFollow Crypto.com on the platform you entered, at the following","guid":"6396baaac8cb28003d580a3f","isoDate":"2022-12-12T09:33:52.000Z","from":"https://blog.crypto.com/rss/"},{"creator":"Jaime Lee","title":"FIFA World Cup™ Final Prediction Competition - US-SPECIFIC OFFICIAL RULES FOR SWEEPSTAKES","link":"https://blog.crypto.com/fifa-world-cup-final-prediction-competition-us-specific-official-rules-for-sweepstakes/","pubDate":"Mon, 12 Dec 2022 09:34:13 GMT","content:encoded":"<p>To participate in the Sweepstakes, you must satisfy the eligibility criteria and meet the requirements set out in these Official Rules,and:</p><ol><li>Like the designated post on Twitter or Instagram;</li><li>Reply to the same post with your Final prediction;</li><li>Follow Crypto.com on the platform you entered, at the following accounts:<br>- Twitter: <a href=\"http://twitter.com/cryptocom\">@cryptocom</a><br>- Instagram: <a href=\"http://instagram.com/cryptocomofficial\">@cryptocomofficial </a>; and</li><li>Fill out the form at <a href=\"https://bit.ly/predictfifafinal\">https://bit.ly/predictfifafinal</a><br></li></ol><p>during the Entry Period (&#x201C;<strong>Entry</strong>&#x201D;). The Entry Period begins on December 12th, 2022 at 10:00am GMT and ends on December 13th, 2022 at 6:59pm GMT. *Entrant&#x2019;s Twitter and/or Instagram account must be a public account to be eligible for the Sweepstakes.<br></p><p>The Prizes are as listed below with their estimated market value:</p><ul><li>US$200 in Cronos cryptocurrency token (CRO) </li></ul><p>Odds of winning depend on the number of Eligible Entries received during the Entry Period. Five (5) Prizes will be distributed.<br></p><p><strong>US-SPECIFIC OFFICIAL RULES FOR SWEEPSTAKES </strong><br></p><p>The relevant Crypto.com App entity that provides you the Crypto.com App services (&#x201C;Crypto.com&#x201D;) will conduct the sweepstakes (the &#x201C;Sweepstakes&#x201D;) substantially as described in these rules. By entering or participating, each entrant or participant (&#x201C;Entrant&#x201D;) agrees unconditionally to be bound by these official rules (the &#x201C;Official Rules&#x201D;) and the decisions of Crypto.com, which are final and binding in all respects to the Sweepstakes. Winning any prize is contingent upon fulfilling all requirements set forth herein.</p><p><strong>NO PURCHASE NECESSARY TO ENTER OR WIN; PURCHASE WILL NOT INCREASE YOUR CHANCES OF WINNING. &#xA0;YOU HAVE NOT WON YET. ODDS OF WINNING WILL DEPEND ON THE TOTAL NUMBER OF ELIGIBLE ENTRIES RECEIVED. SWEEPSTAKES VOID WHERE PROHIBITED BY LAW OR RESTRICTED BY LAW.</strong></p><p><strong>PLEASE READ THESE RULES FULLY AND CAREFULLY. THESE RULES CONTAIN A BINDING ARBITRATION PROVISION AND A WAIVER OF YOUR RIGHTS TO CLASS OR REPRESENTATIVE ACTIONS. &#xA0;</strong><br></p><p>By entering the Sweepstakes, Entrant:<br></p><ol><li>Agrees to be bound by these Official Rules and by the interpretation of these Official Rules by Crypto.com and by the decisions of Crypto.com, which are final and binding in all respects;<br></li><li>Acknowledges compliance with these Official Rules; and<br></li><li>Agrees to comply with any and all applicable federal, state, and local laws, rules and regulation. &#xA0;Winning the Prize (defined below) is contingent upon fulfilling all requirements set forth in these Official Rules.</li></ol><p><strong>Sponsored and Administered by: </strong>The &#x201C;Sponsor&#x201D; of this Sweepstakes is Foris, Inc. dba. Crypto.com, Suite 2725, Sabadell Financial Center Building, 1111 Brickell Avenue, Miami, FL 33131, which administers all aspects of this Sweepstakes.</p><ol><li><strong><strong><strong>Eligibility:</strong></strong></strong></li><li>General Eligibility. &#xA0;This Sweepstakes is open only to (i) legal residents of the United States (excluding residents of New York, Rhode Island, or any United States Territory (except Puerto Rico)) (ii) those who are twenty-one (21) years of age or older at the time of entry; and (iii) those who have an active email account and internet access prior to the beginning of the Entry Period (defined below). &#xA0;<strong>All Entrants must have an approved Crypto.com App account or apply for and be approved prior to the Campaign Period end date. VOID WHERE PROHIBITED.</strong></li><li>Individuals Excluded From Entry: Employees, officers, and directors of Crypto.com or its affiliated companies, parent companies, subsidiaries, participating promotional partners, advertising and promotion agencies, webmasters, and any company involved in the creation, design, execution, production, or fulfillment of the Sweepstakes (collectively, the &#x201C;Sweepstakes Entities&#x201D;), and the immediate family members or individuals living in the same household of such employees, officers, and directors, are not eligible to enter the Sweepstakes or win any Prize. For purposes of these eligibility rules, &#x201C;immediate family members&#x201D; means spouse, children, parents, parents of spouse, siblings, and spouse&#x2019;s siblings.</li><li>Additional Eligibility Requirements. Prior to being eligible to receive any Prize, an Entrant who has been selected as the potential winner of the Sweepstakes must provide Crypto.com with any information or certifications needed by Crypto.com, in its judgment. Without limiting the foregoing, a person who was selected as a potential Winner of the Sweepstakes may be required to sign a copy of these Official Rules, to complete and sign a Declaration of Compliance, Liability, and Publicity Release (except where prohibited by law), and provide any other document that Crypto.com determines is required, necessary or appropriate, in its judgment, to confirm the Winner&#x2019;s eligibility and for tax reporting or other purposes. If the potential Winner fails to satisfy these conditions within five (5) days of the notice that such person has been selected to be a Winner, that person will not be eligible for the Prize, and an alternate Winner will be selected, as described in &#x201C;Winner Selection and Notification&#x201D; below. <strong>VOID WHERE PROHIBITED.</strong></li><li><strong><strong><strong>No Purchase Necessary.</strong> No purchase or payment of any kind is necessary to enter or win this Sweepstakes.</strong></strong></li><li><strong><strong><strong>Acceptance of Rules: </strong>By entering the Sweepstakes, Entrant: (a) agrees to be bound by these Official Rules and by the interpretation of these Official Rules by Crypto.com and by the decisions of Crypto.com, which are final and binding in all respects; (b) acknowledges compliance with these Official Rules; and (c) agrees to comply with any and all applicable federal, state and local laws, rules and regulations. Winning the Prize (defined below) is contingent upon fulfilling all requirements set forth in these Official Rules. <strong>VOID WHERE PROHIBITED.</strong></strong></strong></li><li><strong><strong><strong>Entry Period</strong>: &#xA0;The Sweepstakes will begin and end at the times specified by Crypto.com (the &#x201C;Entry Period&#x201D;).<strong> </strong>The Entry Period will start on December 1</strong>2<strong>th, 2022 at 1</strong>0<strong>:00</strong>a<strong>m GMT and ends on December 13th, 2022 at 6:59pm GMT. Entries must be submitted during the Entry Period in order to be eligible for the Sweepstakes. Crypto.com shall have the sole and final decision regarding timekeeping for entry in the Sweepstakes. Normal time rates, if any, charged by the Entrants&#x2019; Internet service or mobile provider will apply.</strong></strong></li><li>Complete and Truthful Entries. When submitting an entry, Entrant is required to provide complete and truthful information. &#xA0;Entries that are incomplete, illegible, corrupted, false, lost, late or misdirected, deceptive or otherwise not in compliance with the Official Rules may be disqualified from the Sweepstakes at Crypto.com&#x2019;s sole and absolute discretion. Entries submitted by persons who do not meet the eligibility requirements (including all requirements with respect to age and residence) are void.</li><li>Use of Automation for Repetitive Entries. The use of any scripts, computer programs, robotic repetitive, macro, automatic, programmed or similar automated entry methods or agents to submit entries will void all entries submitted by that person or that person&#x2019;s agents. &#xA0;Crypto.com will disqualify any entry from individuals who do not meet the eligibility requirements.</li><li>Eligible Entries. All entries submitted in compliance with these Official Rules and not disqualified or void are considered &#x201C;Eligible Entries.&#x201D; &#xA0;All entries are the property of Crypto.com. Image and photo entries shall not include images of any third parties or individuals outside of the Entrant and Crypto.com promotional materials. Entrant shall abide by all posting and image guidelines as set forth by any social media platform, if any, used to enter into this</li></ol><p>Sweepstakes. Crypto.com shall not be liable to any third parties for Entrant&#x2019;s violations of said</p><p>social media guidelines. Photos displaying or containing profanity or that are obscene or otherwise inappropriate (as determined by Crypto.com) will be disqualified, as will entries that violate copyright laws or infringe on any third party rights. By entering, except where prohibited by law, Entrant is assigning all ownership rights and usage rights to Entrant&#x2019;s photo to the Sweepstakes Entities.</p><ol><li>Number of Entries. Only five (5) Entries are permitted per person during the Entry Period. Multiple Entrants are not permitted to share the same email address. Any attempt by any person to enter the Sweepstakes more than one (1) time by using multiple/different email addresses, identities, registrations and logins, or any other methods will void that Entrant&apos;s entries and that Entrant may be disqualified. Crypto.com and its affiliates, and their respective officers, directors, employees, contractors and agents are not responsible for lost, late, incomplete, invalid, unintelligible, or misdirected registrations, which will be disqualified.</li><li><strong><strong><strong>Method of Entry: &#xA0;</strong>Entry methods for the Sweepstakes will be specified by Crypto.com, and all entries must be received during the Entry Period. Entries must be submitted during the Entry Period in order to be eligible for the Sweepstakes.</strong></strong></li></ol><p>To enter into the Sweepstakes, Entrants must, in addition to meeting the eligibility criteria, have an existing registered and:</p><ol><li>Like the designated post on Twitter or Instagram;</li><li>Reply to the same post with your Final prediction;</li><li>Follow Crypto.com on the platform you entered, at the following accounts:<br>- Twitter: <a href=\"http://twitter.com/cryptocom\">@cryptocom</a><br>- Instagram: <a href=\"http://instagram.com/cryptocomofficial\">@cryptocomofficial </a>; and</li><li>Fill out the form at <a href=\"https://forms.gle/hBUqbjw22NQN31Ps5\">https://bit.ly/predictfifafinal</a><br></li></ol><p>during the Entry Period (each, an &#x201C;<strong>Entry</strong>&#x201D;). *Entrant&#x2019;s Twitter and/or Instagram account must be a public account to be eligible for the Sweepstakes.<br></p><p>b. In addition to any other method specified by Crypto.com to submit an Eligible Entry, Entrants may submit an entry by mail (&#x201C;Mail-in Entry&#x201D;). On a plain 3&#x201D; x 5&#x201D; card, Entrants must legibly handprint or type their name, complete address, city, state, zip code, business or home phone numbers (including area code), and email address. Then, Entrants must mail the 3&#x201D; x 5&#x201D; card in a postage-affixed sealed envelope stating &#x201C;FIFA World Cup&#x2122; Final Prediction Competition&#x201D; to: Foris Inc, Suite 2725, Sabadell Financial Center Building, 1111 Brickell Avenue, Miami, FL 33131. Mail entries must be postmarked and received by the specified campaign end date and time. No mechanically or programmatically reproduced entries are permitted. Each envelope is considered one entry. All entries submitted become the sole property of Sponsor and will not be returned. Sponsor is not responsible for lost, late, misdirected, illegible, or damaged mailed entries.<br></p><ol><li><strong><strong><strong>Prize and Odds of Winning:</strong> &#xA0;The Prize(s) of the Sweepstakes will be specified by Crypto.com (the &#x201C;Prize&#x201D;). The total approximate total retail value of the Prize(s) is as specified by Crypto.com. Odds of winning depend on the number of Eligible Entries received during the Entry Period.</strong></strong></li><li>CRO Prize: Five (5) Winners shall each receive US$200 worth of Cronos cryptocurrency tokens (CRO) to their Crypto.com App account, as provided in the Entry form, with the exchange rate determined by Crypto.com in its absolute discretion.</li><li>Unavailability of Prize. If for any reason the Prize(s), or any part of a Prize, is unavailable or a Prize or related event is delayed, canceled, or postponed, or for any other reason, Crypto.com reserves the right to modify the Sweepstakes in its sole discretion and award a substitute Prize, or portion of Prize, of comparable or greater value as set forth in these Official Rules. No substitution, transfer, assignment or cash equivalent of the Prize, or any portion thereof, is permitted by the Winner, except that, a valid and successful Mail-in Entry may receive a cash equivalent for the Prize, which in any case shall not exceed US$200.</li><li>Inability to Accept Prize. Crypto.com and the Sweepstakes Entities shall have no responsibility or obligation to a Winner who is unable or unavailable to, or who does not for any reason, accept or utilize a Prize. In the event a potential Winner cannot accept the Prize, an alternate Winner will be randomly drawn from all remaining Eligible Entries.</li><li>Costs and Expenses Associated with Prize. All costs and expenses not specifically listed above as part of the Prize are solely the Winner&apos;s responsibility. &#xA0;Winner agrees to comply with any additional terms and conditions applicable for attending the Event.</li><li>Prize(s) Provided &#x201C;As Is&#x201D;. The Prize(s) are provided &#x201C;as is&#x201D;. Entrants acknowledge that Crypto.com and the Sweepstakes Entities have neither made nor are in any manner responsible or liable for any warranty, representation, or guarantee, express or implied, in fact or in law, relative to the Prize(s), including any implied warranty of merchantability of fitness for a particular purpose. &#xA0;Any Prize(s) pictured in advertising and other Sweepstakes materials are for illustrative purposes only.</li><li>Winner Responsible for Any Applicable Tax Liability Associated with Prize(s). The value of the Prize(s) may be taxable to the Winner as income. All federal, state, and local tax liability, and any other costs and expenses associated with acceptance or use of the Prize(s) not specifically provided for in these Official Rules are solely the Winner&#x2019;s responsibility (regardless of whether the Prize(s), in whole or in part, is used), including, but not limited to any customs duty or import taxes relating to the import, export or receipt of the items you purchase on the Crypto.com Merch Online Store at https://shop.crypto.com. Winner is solely responsible for its entry into any Sweepstakes that involves a Prize of digital assets or non-fungible tokens (NFTs) and should ensure that they understand the federal and state tax implications of receiving cryptocurrency or NFT(s) as a Prize.</li><li><strong><strong><strong>Winner Selection and Notification</strong>: The potential &#x201C;Winner&#x201D; or &#x201C;Winners&#x201D; of the Prize will be determined according to the method specified by Crypto.com in Crypto.com&#x2019;s sole and exclusive discretion. These methods may include, but are not limited to, online random drawing, if applicable.</strong></strong></li><li>Number of Winners to be Selected: A total of five (5) unique winners will be determined according to the method specified by Crypto.com in Crypto.com&#x2019;s sole and exclusive discretion.</li><li>Notification of Prize Winner. The Prize(s) will be awarded to the authorized account holder of the email address, social media handle and/or other identifier submitted with the entry regardless of the individual who submitted the winning entry. The authorized account holder is the person who is assigned to the email address, or social media handle, by an internet service provider or other organization that is responsible for assigning email addresses or the domain names associated with email addresses. &#xA0;Each potential Winner will be notified within seven (7) days from the end of the Entry Period by email (at the email address provided with the entry), by phone (at the phone number provided with the entry), or such other method specified by Crypto.com, and will be required to confirm his/her email address and/or phone number.</li><li>Publicity of Prize Winner. Crypto.com and the Sweepstakes Entities reserve the right to make a public announcement, announcing the Winner on the Crypto.com website, through the Crypto.com App, and/or in any manner (including, without limitation, social media (e.g., Facebook&#xAE;, Instagram&#xAE;, Twitter&#xAE;, YouTube&#xAE;)), which they deem appropriate.</li><li>Failure of Winner to Respond to Notification of Prize. If the Winner cannot be reached after a reasonable effort has been exerted and/or fails to respond to confirm their email address within one (1) day (or such other time specified by Crypto.com) from when the initial notification email is sent, the Winner forfeits the Prize, and an alternate Winner will be selected.</li><li>Selection of Alternate Winner(s). If the alternate Winner does not comply with these Official Rules or is otherwise unable to accept the Prize(s), the Prize(s) shall be forfeited and another alternate Winner will be selected. This Winner selection and notification process shall be continued until a Winner is confirmed. &#xA0;If the Prize(s) or a Winner notification is returned as undeliverable, the Prize(s) will be forfeited and an alternate Winner will be selected.</li><li><strong><strong><strong>Winner Verification.</strong> The Winner may be required to prove eligibility, including, without limitation, proof of age, residence, and identity, which may include submitting a copy of their passport or similar government issued identification within two (2) hours after being notified of being a potential Winner.</strong></strong></li><li>Official Confirmation of Winner. The Winner(s) (or any alternate Winner if one must be selected) is not official and shall not be confirmed as the Winner until they have completed, signed and returned documentation required by Crypto.com. If the Winner (or any alternate Winner) does not complete all forms necessary within the time given and/or in the event of non-compliance by the Winner (or alternate Winner), such Winner (or alternate Winner) shall be disqualified and shall forfeit the Prize(s), and all privileges otherwise due as a Winner shall be terminated and an alternate Winner will be chosen from among all of the remaining Eligible Entries.</li><li>Winner Obligations. Winner(s) may be required to sign and return (1) a Declaration of Compliance, Liability, and Publicity Release (except where prohibited), (2) a Waiver and Release from Liability, and (3) any other document Crypto.com determines is required, necessary or appropriate, in its judgment, to confirm the Winner&#x2019;s eligibility and for tax reporting purposes. Each of these items must be received by Crypto.com within five (5) days of the date notice or attempted notice is sent, in order to claim the Prize. &#xA0;If, at any time, (i) Crypto.com determines that any person selected as a potential Winner is not eligible to participate in the Sweepstakes, or (ii) a person whose name is drawn refuses to accept the selection as a Winner, or (iii) a person whose name is drawn cannot or does not complete the eligibility requirements, including without limitation a failure to sign and return the required documents described above or provide any other requested information within the required time period, or (iv) a person cannot be contacted, then that person will be ineligible to win a Prize(s). In the event that a potential Winner is disqualified or ineligible for any reason, the potential Winner(s) forfeits the Prize and all privileges otherwise due as a Winner shall be terminated, and an alternate Winner will be chosen by the same drawing method from among all of the remaining Eligible Entries.</li><li>Participation of Winner&#x2019;s Guests in a Prize (Event or Amenity Access). If applicable, all guests in attendance with a Winner, if applicable, must also execute all required documents prior to any participation or such guest(s) will not be permitted to participate.</li><li>Delay of Confirmation or Announcement of Winner. Provided that the Winner is in compliance with the Official Rules and after having successfully proven eligibility, the Winner will be officially confirmed as the Winner. &#xA0;Crypto.com expressly reserves the right to delay the announcement of the Winner for any reason it deems necessary. &#xA0;In addition, Crypto.com reserves the right to select an alternate Winner in the event that any Winner fails to comply with these Official Rules.</li><li><strong><strong><strong>LIMITATION OF LIABILITY</strong>: &#xA0;By entering this Sweepstakes, Entrant waives all rights to, and holds Crypto.com or the Sweepstakes Entity harmless from, any claim, liability, loss, damage (including punitive, incidental, and consequential damages), or expense (including attorneys&apos; fees) arising out of or in connection with participation in this Sweepstakes or the acceptance, use, or misuse of any Prize. SOME JURISDICTIONS DO NOT ALLOW THE LIMITATIONS OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE MAY NOT APPLY TO YOU. Crypto.com or Sweepstakes Entity will not be responsible for: late, incomplete, or incorrect entries; an Entrant&apos;s failure to receive prize notices due to Entrant&apos;s spam, junk email, or other security settings or for Entrants&apos; provision of incorrect or otherwise non-functioning contact information; technical, hardware, or software malfunctions, lost or unavailable network connections, or failed, incorrect, inaccurate, incomplete, garbled, or delayed electronic communications whether caused by the sender or by any of the equipment or programming associated with or used in this Sweepstakes; by any human error which may occur in the processing of the entries in this sweepstakes; or any typographical, technological, or other error in the publishing of the offer, administration of the Sweepstakes, or announcement of the Prize(s). THE PRIZE IS OFFERED AND PROVIDED &#x201C;AS IS&#x201D; WITH NO WARRANTY OR GUARANTEE BY CRYPTO.COM OR ANY SWEEPSTAKES ENTITY, EITHER EXPRESS OR IMPLIED. &#xA0;IN NO EVENT WILL CRYPTO.COM OR ANY SWEEPSTAKES ENTITY BE LIABLE TO ENTRANT FOR ANY DIRECT, SPECIAL, INCIDENTAL, EXEMPLARY, PUNITIVE, OR CONSEQUENTIAL DAMAGES (INCLUDING LOSS OF USE, DATA, BUSINESS, OR PROFITS) ARISING OUT OF OR IN CONNECTION WITH ENTRANT&#x2019;S PARTICIPATION IN THE SWEEPSTAKES, WHETHER SUCH LIABILITY ARISES FROM ANY CLAIM BASED UPON CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE), STRICT LIABILITY OR OTHERWISE, AND WHETHER OR NOT CRYPTO.COM AND/OR OTHER SWEEPSTAKES ENTITIES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH LOSS OR DAMAGE. </strong></strong><br></li><li><strong><strong><strong>Indemnification.</strong> By entering the Sweepstakes, Entrant agrees to indemnify, defend, and hold harmless, Crypto.com and any other Sweepstakes Entities from any and all liability, for any claims, damages, injuries or losses of any kind, and to release all rights to bring any claim, action or proceeding arising out of, in connection with, or relating to, (i) participation in the Sweepstakes, (ii) without limitation, death, or property damage, arising directly or indirectly from the acceptance, possession, misuse or use of the Prize(s), (iii) defamation, violation of publicity rights, or invasion of privacy in connection with the Sweepstakes or acceptance and use or the Prize(s), and (iv) copyright infringement, trademark infringement, or any other intellectual property-related cause of action arising from or related to the Sweepstakes, the Prize(s), or Crypto.com&#x2019;s advertising and marketing related to the Sweepstakes, Entrants or the Winner, in all cases, including but not limited to: &#xA0;(a) unauthorized human intervention in the Sweepstakes; (b) technical errors related to computers, servers, providers, or telephone, or network lines; (c) printing errors; (d) lost, late, postage-due, misdirected or undeliverable mail; (e) errors in the administration of the Sweepstakes or the processing of entries; or (f) injury or damage to persons or property (including to any computer or mobile device systems resulting from participation in or accessing or downloading information in connection with the Sweepstakes), which may be caused, directly or indirectly, in whole or in part, from Entrant&#x2019;s participation in the Sweepstakes or receipt or use of any Prize(s). &#xA0;Entrant assumes all liability for any injury or damage caused, or claimed to be caused, by participation in the Sweepstakes, or the acceptance, receipt, or use of the Prize(s) or any Prize component. &#xA0;Entrant further agrees that in any cause of action, Crypto.com and/or the Sweepstakes Entities&#x2019; liability will be limited to the value of the Prize(s), and in no event shall the Sweepstakes Entities be liable for attorney&#x2019;s fees.</strong></strong></li><li><strong><strong><strong>No Assumption of Responsibility. </strong>Crypto.com and the Sweepstakes Entities assume no responsibility for and will disqualify entries that are: stolen, late, lost, illegible, incomplete, invalid, unintelligible, altered, tampered with, unauthorized, fraudulent, damaged, destroyed, delayed, misdirected, not delivered, not received, or that have incorrect or inaccurate entry information, whether caused by any of the equipment or programming associated with or utilized in the Sweepstakes, or by any human, mechanical or electronic error that may occur in the processing of the entries in the Sweepstakes, or other errors appearing within the Official Rules or in the Sweepstakes related advertisements. Crypto.com and the Sweepstakes Entities assume no responsibility for any typographical or other error in the printing of the offer, administration of the Sweepstakes, errors in processing entries, identifying the Winner, in the announcement of the Prize(s) and Winner, the delivery of the Prize(s), any problems or technical malfunction of any telephone network or lines, computer systems, online systems, servers or providers, computer equipment, software, failure of any e-mail or players on account of technical problems or traffic congestion on the Internet or on any web site including crypto.com, or any combination thereof, including, without limitation, any injury or damage to Entrant&#x2019;s or any other person&#x2019;s computer system/software related to or resulting from participation in, uploading any materials or downloading any materials in the Sweepstakes. &#xA0;Use of any device to automate or subvert entry is prohibited and any entries received by such means will be void. Crypto.com reserves the right in its sole discretion to disqualify any person it suspects or finds (i) to have tampered with the entry process or the operation of the Sweepstakes; (ii) to be acting in a disruptive manner, or with the intent to annoy, abuse, threaten or harass any other person; &#xA0;(iii) to display behavior that will bring such Winner, Crypto.com or the Sweepstakes Entities into disgrace; (iv) to have provided inaccurate information on any legal documents submitted in connection with the Sweepstakes; or (v) to be acting in violation of these Official Rules. ANY VIOLATION OF THESE OFFICIAL RULES BY A WINNER WILL RESULT IN SUCH WINNER&#x2019;S DISQUALIFICATION AS A WINNER OF THE SWEEPSTAKES AND ALL PRIVILEGES AS A WINNER WILL BE IMMEDIATELY TERMINATED.</strong></strong></li><li><strong><strong><strong>Grant of Rights. &#xA0;</strong>Except where prohibited by law, by entering the Sweepstakes and/or winning the Prize, Entrant irrevocably consents to the use of his or her name, image, photograph, likeness, biographical information, entry, statements attributed to Entrant (if true) and any video footage related to the Prize, for all Sweepstakes Entities&#x2019; advertising, promotional or other commercial purposes in all media now or hereafter known, worldwide and in perpetuity without additional compensation and additionally consents to the Sweepstakes Entities putting their name on a Winner&#x2019;s list. &#xA0;Please note that Crypto.com may not acknowledge or return any entries.</strong></strong></li><li>Intellectual Property. By submitting an entry, Entrant agrees to Crypto.com&#x2019;s general terms regarding intellectual property available at <a href=\"https://crypto.com/document/mco_services\">https://crypto.com/document/mco_services.</a> &#xA0;Specifically, Entrant represents and warrants to Crypto.com that they have the rights, authorizations, and licenses to all the content they share with Crypto.com via any platform. This includes, but is not limited to, getting the owner&#x2019;s consent before sharing third-party content and/or not infringing (or causing Crypto.com to infringe) any third-party rights, including third-party intellectual property rights. Entrant grants to Crypto.com a perpetual, non-exclusive, transferable, sublicensable, royalty-free, worldwide license to use, copy, modify, distribute, publish, and process the content they share with Crypto.com (including their intellectual property) without any further consent, notice, and/or compensation to them or to others for any purpose. Entrant can end this license by deleting such content and notifying Crypto.com at contact@crypto.com. Entrant further agrees to hold Crypto.com harmless against any liability, claims, or demands arising from the content they share with Crypto.com.</li><li>Right of Publicity. By submitting an entry, Entrant agrees to Crypto.com&#x2019;s use of your name, address, likeness, or Prize information for promotional purposes in any medium without additional compensation to the extent permitted by law.</li><li><strong><strong><strong>General Terms; Force Majeure</strong>. &#xA0;The Sweepstakes Entities are not responsible if the Sweepstakes cannot take place, or if the Prize(s) cannot be awarded due to delays, interruptions or failures due to acts of God, war, natural disasters, weather, acts or threats of terrorism, global pandemic, local epidemics, strikes, lockouts, labor disputes, work stoppages, fire, acts of government, or other events outside of the reasonable control of the Sweepstakes Entities.</strong></strong></li><li>Right to Terminate. If, for any reason the Sweepstakes is not capable of running as planned, including, without limitation, due to infection by computer virus, bugs, tampering, unauthorized intervention, fraud, technical failures, or any other causes beyond the reasonable control of the Sweepstakes Entities, which, in Crypto.com&#x2019;s sole determination, corrupts or affects the administration, security, fairness, integrity or proper conduct of the Sweepstakes, Crypto.com reserves the right, in its sole discretion, to cancel, terminate, modify, or suspend the Sweepstakes or any part of the Sweepstakes. If the Sweepstakes or any part of the Sweepstakes is terminated or modified prior to the closing of the Sweepstakes Period, notice will be posted on Crypto.com. Crypto.com reserves the right to modify and amend these Official Rules from time to time during the Sweepstakes Period for clarification purposes.</li><li>Reservation of Rights. ANY ATTEMPT BY ANY PERSON TO DELIBERATELY DAMAGE OR UNDERMINE THE LEGITIMATE OPERATION OF THE SWEEPSTAKES MAY BE IN VIOLATION OF</li></ol><p>CRIMINAL AND CIVIL LAW AND SHOULD SUCH AN ATTEMPT BE MADE, CRYPTO.COM RESERVES THE RIGHT TO SEEK REMEDIES AND DAMAGES (INCLUDING ATTORNEYS&#x2019; FEES) FROM ANY SUCH PERSON TO THE FULLEST EXTENT PERMITTED BY LAW.</p><ol><li>Severability. The invalidity or unenforceability of any provision of these Official Rules will not affect the validity or enforceability of any other provision. In the event that any provision of the Official Rules is determined to be invalid or otherwise unenforceable or illegal, the other provisions will remain in effect and will be construed in accordance with their terms as if the invalid or illegal provision were not contained herein. Crypto.com&#x2019;s failure to enforce any term of these Official Rules will not constitute a waiver of that term or any other provision of these Official Rules. Entrant agrees to waive any rights to claim ambiguity of these Official Rules. Headings are solely for convenience of reference and will not be deemed to affect in any manner the meaning or intent of these Official Rules or any provision hereof. In the event there is a discrepancy or inconsistency between disclosures or other statements contained in the Sweepstakes&#x2013;related materials, privacy policy or terms of use on a website and/or the terms and conditions of these Official Rules, the Official Rules shall prevail, govern and control and the discrepancy will be resolved in Crypto.com&#x2019;s sole and absolute discretion.</li><li><strong><strong><strong>Privacy</strong>. &#xA0;All Personal Information submitted by Entrants and collected by Crypto.com in connection with Entrant&#x2019;s entry will be subject to and will be treated in a manner consistent with Crypto.com Global Marketing Privacy Notice available at: https://crypto.com/privacy/marketing <a href=\"https://crypto.com/privacy/unitedstates\">.</a> By participating in the Sweepstakes, Entrant hereby agrees that Crypto.com may collect and use their personal information submitted with the entry, and acknowledges that they have read and accepted the Crypto.com Global Marketing Privacy Notice. &#xA0;Among other things, the information Entrants provide may be used for sending Entrants company updates and announcements about Crypto.com and its products and/or services.</strong></strong></li><li>Children&#x2019;s Online Privacy Protection Act. Crypto.com&#x2019;s Sweepstakes are not intended for general audiences and are not directed to children under the age of 18. We do not knowingly collect Personal Information from children under the age of 18 through our Sweepstakes. If you become aware that a child has provided us with Personal Information without parental consent, please contact us at contact@crypto.com. If we become aware that a child under the age of 18 has provided us with Personal Information without parental consent, Crypto.com takes steps to remove such information.</li><li>California Consumer Privacy Act. Crypto.com complies with the California Consumer Privacy Act (CCPA) and is required to provide certain information to individuals about how Crypto.com collects, uses, and shares your Personal Information, and about the rights and choices that Entrant may have concerning Entrant&#x2019;s Personal Information. For further information regarding Entrant&#x2019;s rights, please review Crypto.com &#xA0; &#xA0; &#xA0;Global Marketing Privacy Notice, available at https://crypto.com/privacy/marketing &#xA0; &#xA0; &#xA0;<a href=\"https://crypto.com/en/privacy/global.html\">.</a></li><li><strong><strong><strong>Class Waiver.</strong> Except where prohibited by law, Entrant agrees that: &#xA0;ANY DISPUTE, CONTROVERSY OR CLAIM ARISING OUT OF OR RELATING TO THE SWEEPSTAKES OR ANY PRIZE AWARDED IS UNIQUE TO THE ENTRANT AND SHALL BE RESOLVED INDIVIDUALLY AND WITHOUT RESORT TO ANY FORM OF CLASS OR REPRESENTATIVE ACTION INCLUDING MASS ARBITRATION.</strong></strong></li><li><strong><strong><strong>Dispute Resolution; Binding Arbitration</strong>. Except where prohibited by law, Entrant agrees that: (1) <strong>ANY DISPUTE, CONTROVERSY OR CLAIM ARISING OUT OF OR RELATING TO THE SWEEPSTAKES OR ANY PRIZE AWARDED SHALL BE RESOLVED BY BINDING ARBITRATION ADMINISTERED BY TH</strong><a href=\"https://www.lawinsider.com/clause/american-arbitration-association\"><strong>E AMERICAN ARBITRATION ASSOCIATION</strong>,</a> and <a href=\"https://www.lawinsider.com/clause/the-arbitrator\">the arbitrator </a>shall be <a href=\"https://www.lawinsider.com/clause/selected\">selected </a>from a <a href=\"https://www.lawinsider.com/clause/list-of-arbitrators\">list of arbitrators</a><a href=\"https://www.lawinsider.com/clause/provided\"> provided </a>by the American Arbitration Association <a href=\"https://www.lawinsider.com/dictionary/following-a\">following a</a><a href=\"https://www.lawinsider.com/clause/request\"> request </a>by <a href=\"https://www.lawinsider.com/clause/the-party\">the party</a><a href=\"https://www.lawinsider.com/dictionary/seeking\"> seeking </a>arbitration for a list of five <a href=\"https://www.lawinsider.com/clause/retired\">retired </a>or former jurists with <a href=\"https://www.lawinsider.com/clause/substantial\">substantial</a><a href=\"https://www.lawinsider.com/clause/professional-experience\"> professional experience </a>in <a href=\"https://www.lawinsider.com/clause/employment-matters\">employment matters.</a> The arbitration shall be <a href=\"https://www.lawinsider.com/dictionary/conducted\">conducted </a>in the State of Florida under <a href=\"https://www.lawinsider.com/dictionary/the-procedures\">the procedures</a><a href=\"https://www.lawinsider.com/clause/applicable-to\"> applicable to</a><a href=\"https://www.lawinsider.com/clause/arbitrations\"> arbitrations </a>in the <a href=\"https://www.lawinsider.com/clause/state-of-california\">State of Fl</a>orida. &#xA0;The arbitrator&apos;s <a href=\"https://www.lawinsider.com/clause/authority-and-jurisdiction\">authority and jurisdiction </a>shall be <a href=\"https://www.lawinsider.com/clause/limited\">limited </a>to <a href=\"https://www.lawinsider.com/dictionary/determining\">determining</a><a href=\"https://www.lawinsider.com/clause/the-dispute\"> the dispute </a>in arbitration in <a href=\"https://www.lawinsider.com/clause/conformity-with-law\">conformity with law,</a> to the same <a href=\"https://www.lawinsider.com/clause/extent\">extent </a>as if such dispute were <a href=\"https://www.lawinsider.com/clause/determined\">determined </a>as to <a href=\"https://www.lawinsider.com/clause/liability\">liability </a>and any <a href=\"https://www.lawinsider.com/clause/remedy\">remedy </a>by a <a href=\"https://www.lawinsider.com/clause/court\">court </a>without a <a href=\"https://www.lawinsider.com/clause/jury\">jury.</a> The arbitrator shall <a href=\"https://www.lawinsider.com/dictionary/render\">render</a><a href=\"https://www.lawinsider.com/dictionary/an-award\"> an award </a>which shall <a href=\"https://www.lawinsider.com/clause/include\">include </a>a written <a href=\"https://www.lawinsider.com/clause/statement-of\">statement of </a><a href=\"https://www.lawinsider.com/clause/opinion\">opinion </a><a href=\"https://www.lawinsider.com/clause/setting\">setting </a>forth the arbitrator&apos;s <a href=\"https://www.lawinsider.com/clause/findings-of-fact-and-conclusions-of-law\">findings of fact and conclusions of law, a</a>nd the arbitration proceedings shall be conducted in English; unless both Entrant and Crypto.com agree in writing, the arbitrator may not consolidate more than one person&#x2019;s claims, and may not otherwise preside over any form of class or representative proceeding; judgment upon any award rendered may be entered in any court having jurisdiction thereof; and any award or judgment shall be subject to all limitations and releases set forth in these Official Rules and be limited to actual out of pocket damages, and shall not, in any event, include any punitive, exemplary, consequential or incidental damages, attorney&#x2019;s fees or costs of bringing a claim, or any injunctive or other equitable relief. &#xA0;SOME JURISDICTIONS DO NOT ALLOW THE LIMITATIONS OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE MAY NOT APPLY TO YOU.<strong> </strong> </strong></strong><br></li><li><strong><strong><strong>Governing Law</strong>: &#xA0;All federal, state and local laws and regulations apply. &#xA0;Void where prohibited by law. &#xA0;All issues and questions concerning the construction, validity, interpretation and enforceability of these Official Rules, or the rights and obligations of the Entrant and Crypto.com in connection with the Sweepstakes, shall be governed by, and construed in accordance with, the laws of the State of Florida without giving effect to any choice of law or conflict of laws rules.</strong></strong></li><li><strong><strong><strong>Accessibility of Official Rules and Winners List: &#xA0;</strong>A copy of these Official Rules is available via the relevant campaign blog post. Where required by law, Crypto.com will provide the name of Winner(s) of a Sweepstakes to those who request it.</strong></strong></li><li>Requests for Official Rules. For a copy of the Official Rules you can:</li></ol><p>Send a self-addressed, stamped envelope, postmarked to Foris, Inc., Suite 2725, Sabadell Financial Center Building, 1111 Brickell Avenue, Miami, FL 33131, Attn: Crypto.com Legal; and write the name of the Sweepstakes on the lower left hand corner of the envelope.</p><ol><li>Requests for Winner(s). For the name of the Winner(s) you can:</li></ol><p>Send a self-addressed, stamped envelope, postmarked to Foris, Inc., Suite 2725, Sabadell Financial Center Building, 1111 Brickell Avenue, Miami, FL 33131, Attn: Crypto.com Legal; and write the name of the Sweepstakes on the lower left hand corner of the envelope. All requests for the name of the Winner(s) must be received within two (2) weeks of the end of the Sweepstakes Period.</p><ol><li><strong><strong><strong>Social Media:</strong> By submitting an Entry, Entrant agrees to a complete release of Facebook&#xAE;, Instagram&#xAE; Twitter&#xAE;, and/or You Tube&#xAE;, and/or any other social media platform used to promote or enter into this Sweepstakes and acknowledges that the Sweepstakes is in no way sponsored, endorsed, administered by, or associated with Facebook&#xAE;, Instagram&#xAE;, Twitter&#xAE;, YouTube&#xAE;, and/or &#xA0;any other social media platform. Further, Entrant agrees to abide by any and all, if any, requirements imposed by any social media platform used to promote or enter into the Sweepstakes.</strong></strong></li><li><strong><strong><strong>Entire Agreement.</strong> These Official Rules constitute the entire agreement between the Sponsor and Entrant.</strong></strong></li></ol>","content:encodedSnippet":"To participate in the Sweepstakes, you must satisfy the eligibility criteria and meet the requirements set out in these Official Rules,and:\n\nLike the designated post on Twitter or Instagram;\nReply to the same post with your Final prediction;\nFollow Crypto.com on the platform you entered, at the following accounts:\n- Twitter: @cryptocom\n- Instagram: @cryptocomofficial ; and\nFill out the form at https://bit.ly/predictfifafinal\n\nduring the Entry Period (“Entry”). The Entry Period begins on December 12th, 2022 at 10:00am GMT and ends on December 13th, 2022 at 6:59pm GMT. *Entrant’s Twitter and/or Instagram account must be a public account to be eligible for the Sweepstakes.\n\nThe Prizes are as listed below with their estimated market value:\n\nUS$200 in Cronos cryptocurrency token (CRO) \n\nOdds of winning depend on the number of Eligible Entries received during the Entry Period. Five (5) Prizes will be distributed.\n\nUS-SPECIFIC OFFICIAL RULES FOR SWEEPSTAKES \n\nThe relevant Crypto.com App entity that provides you the Crypto.com App services (“Crypto.com”) will conduct the sweepstakes (the “Sweepstakes”) substantially as described in these rules. By entering or participating, each entrant or participant (“Entrant”) agrees unconditionally to be bound by these official rules (the “Official Rules”) and the decisions of Crypto.com, which are final and binding in all respects to the Sweepstakes. Winning any prize is contingent upon fulfilling all requirements set forth herein.\nNO PURCHASE NECESSARY TO ENTER OR WIN; PURCHASE WILL NOT INCREASE YOUR CHANCES OF WINNING.  YOU HAVE NOT WON YET. ODDS OF WINNING WILL DEPEND ON THE TOTAL NUMBER OF ELIGIBLE ENTRIES RECEIVED. SWEEPSTAKES VOID WHERE PROHIBITED BY LAW OR RESTRICTED BY LAW.\nPLEASE READ THESE RULES FULLY AND CAREFULLY. THESE RULES CONTAIN A BINDING ARBITRATION PROVISION AND A WAIVER OF YOUR RIGHTS TO CLASS OR REPRESENTATIVE ACTIONS.  \n\nBy entering the Sweepstakes, Entrant:\n\nAgrees to be bound by these Official Rules and by the interpretation of these Official Rules by Crypto.com and by the decisions of Crypto.com, which are final and binding in all respects;\n\nAcknowledges compliance with these Official Rules; and\n\nAgrees to comply with any and all applicable federal, state, and local laws, rules and regulation.  Winning the Prize (defined below) is contingent upon fulfilling all requirements set forth in these Official Rules.\n\nSponsored and Administered by: The “Sponsor” of this Sweepstakes is Foris, Inc. dba. Crypto.com, Suite 2725, Sabadell Financial Center Building, 1111 Brickell Avenue, Miami, FL 33131, which administers all aspects of this Sweepstakes.\n\nEligibility:\nGeneral Eligibility.  This Sweepstakes is open only to (i) legal residents of the United States (excluding residents of New York, Rhode Island, or any United States Territory (except Puerto Rico)) (ii) those who are twenty-one (21) years of age or older at the time of entry; and (iii) those who have an active email account and internet access prior to the beginning of the Entry Period (defined below).  All Entrants must have an approved Crypto.com App account or apply for and be approved prior to the Campaign Period end date. VOID WHERE PROHIBITED.\nIndividuals Excluded From Entry: Employees, officers, and directors of Crypto.com or its affiliated companies, parent companies, subsidiaries, participating promotional partners, advertising and promotion agencies, webmasters, and any company involved in the creation, design, execution, production, or fulfillment of the Sweepstakes (collectively, the “Sweepstakes Entities”), and the immediate family members or individuals living in the same household of such employees, officers, and directors, are not eligible to enter the Sweepstakes or win any Prize. For purposes of these eligibility rules, “immediate family members” means spouse, children, parents, parents of spouse, siblings, and spouse’s siblings.\nAdditional Eligibility Requirements. Prior to being eligible to receive any Prize, an Entrant who has been selected as the potential winner of the Sweepstakes must provide Crypto.com with any information or certifications needed by Crypto.com, in its judgment. Without limiting the foregoing, a person who was selected as a potential Winner of the Sweepstakes may be required to sign a copy of these Official Rules, to complete and sign a Declaration of Compliance, Liability, and Publicity Release (except where prohibited by law), and provide any other document that Crypto.com determines is required, necessary or appropriate, in its judgment, to confirm the Winner’s eligibility and for tax reporting or other purposes. If the potential Winner fails to satisfy these conditions within five (5) days of the notice that such person has been selected to be a Winner, that person will not be eligible for the Prize, and an alternate Winner will be selected, as described in “Winner Selection and Notification” below. VOID WHERE PROHIBITED.\nNo Purchase Necessary. No purchase or payment of any kind is necessary to enter or win this Sweepstakes.\nAcceptance of Rules: By entering the Sweepstakes, Entrant: (a) agrees to be bound by these Official Rules and by the interpretation of these Official Rules by Crypto.com and by the decisions of Crypto.com, which are final and binding in all respects; (b) acknowledges compliance with these Official Rules; and (c) agrees to comply with any and all applicable federal, state and local laws, rules and regulations. Winning the Prize (defined below) is contingent upon fulfilling all requirements set forth in these Official Rules. VOID WHERE PROHIBITED.\nEntry Period:  The Sweepstakes will begin and end at the times specified by Crypto.com (the “Entry Period”). The Entry Period will start on December 12th, 2022 at 10:00am GMT and ends on December 13th, 2022 at 6:59pm GMT. Entries must be submitted during the Entry Period in order to be eligible for the Sweepstakes. Crypto.com shall have the sole and final decision regarding timekeeping for entry in the Sweepstakes. Normal time rates, if any, charged by the Entrants’ Internet service or mobile provider will apply.\nComplete and Truthful Entries. When submitting an entry, Entrant is required to provide complete and truthful information.  Entries that are incomplete, illegible, corrupted, false, lost, late or misdirected, deceptive or otherwise not in compliance with the Official Rules may be disqualified from the Sweepstakes at Crypto.com’s sole and absolute discretion. Entries submitted by persons who do not meet the eligibility requirements (including all requirements with respect to age and residence) are void.\nUse of Automation for Repetitive Entries. The use of any scripts, computer programs, robotic repetitive, macro, automatic, programmed or similar automated entry methods or agents to submit entries will void all entries submitted by that person or that person’s agents.  Crypto.com will disqualify any entry from individuals who do not meet the eligibility requirements.\nEligible Entries. All entries submitted in compliance with these Official Rules and not disqualified or void are considered “Eligible Entries.”  All entries are the property of Crypto.com. Image and photo entries shall not include images of any third parties or individuals outside of the Entrant and Crypto.com promotional materials. Entrant shall abide by all posting and image guidelines as set forth by any social media platform, if any, used to enter into this\n\nSweepstakes. Crypto.com shall not be liable to any third parties for Entrant’s violations of said\nsocial media guidelines. Photos displaying or containing profanity or that are obscene or otherwise inappropriate (as determined by Crypto.com) will be disqualified, as will entries that violate copyright laws or infringe on any third party rights. By entering, except where prohibited by law, Entrant is assigning all ownership rights and usage rights to Entrant’s photo to the Sweepstakes Entities.\n\nNumber of Entries. Only five (5) Entries are permitted per person during the Entry Period. Multiple Entrants are not permitted to share the same email address. Any attempt by any person to enter the Sweepstakes more than one (1) time by using multiple/different email addresses, identities, registrations and logins, or any other methods will void that Entrant's entries and that Entrant may be disqualified. Crypto.com and its affiliates, and their respective officers, directors, employees, contractors and agents are not responsible for lost, late, incomplete, invalid, unintelligible, or misdirected registrations, which will be disqualified.\nMethod of Entry:  Entry methods for the Sweepstakes will be specified by Crypto.com, and all entries must be received during the Entry Period. Entries must be submitted during the Entry Period in order to be eligible for the Sweepstakes.\n\nTo enter into the Sweepstakes, Entrants must, in addition to meeting the eligibility criteria, have an existing registered and:\n\nLike the designated post on Twitter or Instagram;\nReply to the same post with your Final prediction;\nFollow Crypto.com on the platform you entered, at the following accounts:\n- Twitter: @cryptocom\n- Instagram: @cryptocomofficial ; and\nFill out the form at https://bit.ly/predictfifafinal\n\nduring the Entry Period (each, an “Entry”). *Entrant’s Twitter and/or Instagram account must be a public account to be eligible for the Sweepstakes.\n\nb. In addition to any other method specified by Crypto.com to submit an Eligible Entry, Entrants may submit an entry by mail (“Mail-in Entry”). On a plain 3” x 5” card, Entrants must legibly handprint or type their name, complete address, city, state, zip code, business or home phone numbers (including area code), and email address. Then, Entrants must mail the 3” x 5” card in a postage-affixed sealed envelope stating “FIFA World Cup™ Final Prediction Competition” to: Foris Inc, Suite 2725, Sabadell Financial Center Building, 1111 Brickell Avenue, Miami, FL 33131. Mail entries must be postmarked and received by the specified campaign end date and time. No mechanically or programmatically reproduced entries are permitted. Each envelope is considered one entry. All entries submitted become the sole property of Sponsor and will not be returned. Sponsor is not responsible for lost, late, misdirected, illegible, or damaged mailed entries.\n\nPrize and Odds of Winning:  The Prize(s) of the Sweepstakes will be specified by Crypto.com (the “Prize”). The total approximate total retail value of the Prize(s) is as specified by Crypto.com. Odds of winning depend on the number of Eligible Entries received during the Entry Period.\nCRO Prize: Five (5) Winners shall each receive US$200 worth of Cronos cryptocurrency tokens (CRO) to their Crypto.com App account, as provided in the Entry form, with the exchange rate determined by Crypto.com in its absolute discretion.\nUnavailability of Prize. If for any reason the Prize(s), or any part of a Prize, is unavailable or a Prize or related event is delayed, canceled, or postponed, or for any other reason, Crypto.com reserves the right to modify the Sweepstakes in its sole discretion and award a substitute Prize, or portion of Prize, of comparable or greater value as set forth in these Official Rules. No substitution, transfer, assignment or cash equivalent of the Prize, or any portion thereof, is permitted by the Winner, except that, a valid and successful Mail-in Entry may receive a cash equivalent for the Prize, which in any case shall not exceed US$200.\nInability to Accept Prize. Crypto.com and the Sweepstakes Entities shall have no responsibility or obligation to a Winner who is unable or unavailable to, or who does not for any reason, accept or utilize a Prize. In the event a potential Winner cannot accept the Prize, an alternate Winner will be randomly drawn from all remaining Eligible Entries.\nCosts and Expenses Associated with Prize. All costs and expenses not specifically listed above as part of the Prize are solely the Winner's responsibility.  Winner agrees to comply with any additional terms and conditions applicable for attending the Event.\nPrize(s) Provided “As Is”. The Prize(s) are provided “as is”. Entrants acknowledge that Crypto.com and the Sweepstakes Entities have neither made nor are in any manner responsible or liable for any warranty, representation, or guarantee, express or implied, in fact or in law, relative to the Prize(s), including any implied warranty of merchantability of fitness for a particular purpose.  Any Prize(s) pictured in advertising and other Sweepstakes materials are for illustrative purposes only.\nWinner Responsible for Any Applicable Tax Liability Associated with Prize(s). The value of the Prize(s) may be taxable to the Winner as income. All federal, state, and local tax liability, and any other costs and expenses associated with acceptance or use of the Prize(s) not specifically provided for in these Official Rules are solely the Winner’s responsibility (regardless of whether the Prize(s), in whole or in part, is used), including, but not limited to any customs duty or import taxes relating to the import, export or receipt of the items you purchase on the Crypto.com Merch Online Store at https://shop.crypto.com. Winner is solely responsible for its entry into any Sweepstakes that involves a Prize of digital assets or non-fungible tokens (NFTs) and should ensure that they understand the federal and state tax implications of receiving cryptocurrency or NFT(s) as a Prize.\nWinner Selection and Notification: The potential “Winner” or “Winners” of the Prize will be determined according to the method specified by Crypto.com in Crypto.com’s sole and exclusive discretion. These methods may include, but are not limited to, online random drawing, if applicable.\nNumber of Winners to be Selected: A total of five (5) unique winners will be determined according to the method specified by Crypto.com in Crypto.com’s sole and exclusive discretion.\nNotification of Prize Winner. The Prize(s) will be awarded to the authorized account holder of the email address, social media handle and/or other identifier submitted with the entry regardless of the individual who submitted the winning entry. The authorized account holder is the person who is assigned to the email address, or social media handle, by an internet service provider or other organization that is responsible for assigning email addresses or the domain names associated with email addresses.  Each potential Winner will be notified within seven (7) days from the end of the Entry Period by email (at the email address provided with the entry), by phone (at the phone number provided with the entry), or such other method specified by Crypto.com, and will be required to confirm his/her email address and/or phone number.\nPublicity of Prize Winner. Crypto.com and the Sweepstakes Entities reserve the right to make a public announcement, announcing the Winner on the Crypto.com website, through the Crypto.com App, and/or in any manner (including, without limitation, social media (e.g., Facebook®, Instagram®, Twitter®, YouTube®)), which they deem appropriate.\nFailure of Winner to Respond to Notification of Prize. If the Winner cannot be reached after a reasonable effort has been exerted and/or fails to respond to confirm their email address within one (1) day (or such other time specified by Crypto.com) from when the initial notification email is sent, the Winner forfeits the Prize, and an alternate Winner will be selected.\nSelection of Alternate Winner(s). If the alternate Winner does not comply with these Official Rules or is otherwise unable to accept the Prize(s), the Prize(s) shall be forfeited and another alternate Winner will be selected. This Winner selection and notification process shall be continued until a Winner is confirmed.  If the Prize(s) or a Winner notification is returned as undeliverable, the Prize(s) will be forfeited and an alternate Winner will be selected.\nWinner Verification. The Winner may be required to prove eligibility, including, without limitation, proof of age, residence, and identity, which may include submitting a copy of their passport or similar government issued identification within two (2) hours after being notified of being a potential Winner.\nOfficial Confirmation of Winner. The Winner(s) (or any alternate Winner if one must be selected) is not official and shall not be confirmed as the Winner until they have completed, signed and returned documentation required by Crypto.com. If the Winner (or any alternate Winner) does not complete all forms necessary within the time given and/or in the event of non-compliance by the Winner (or alternate Winner), such Winner (or alternate Winner) shall be disqualified and shall forfeit the Prize(s), and all privileges otherwise due as a Winner shall be terminated and an alternate Winner will be chosen from among all of the remaining Eligible Entries.\nWinner Obligations. Winner(s) may be required to sign and return (1) a Declaration of Compliance, Liability, and Publicity Release (except where prohibited), (2) a Waiver and Release from Liability, and (3) any other document Crypto.com determines is required, necessary or appropriate, in its judgment, to confirm the Winner’s eligibility and for tax reporting purposes. Each of these items must be received by Crypto.com within five (5) days of the date notice or attempted notice is sent, in order to claim the Prize.  If, at any time, (i) Crypto.com determines that any person selected as a potential Winner is not eligible to participate in the Sweepstakes, or (ii) a person whose name is drawn refuses to accept the selection as a Winner, or (iii) a person whose name is drawn cannot or does not complete the eligibility requirements, including without limitation a failure to sign and return the required documents described above or provide any other requested information within the required time period, or (iv) a person cannot be contacted, then that person will be ineligible to win a Prize(s). In the event that a potential Winner is disqualified or ineligible for any reason, the potential Winner(s) forfeits the Prize and all privileges otherwise due as a Winner shall be terminated, and an alternate Winner will be chosen by the same drawing method from among all of the remaining Eligible Entries.\nParticipation of Winner’s Guests in a Prize (Event or Amenity Access). If applicable, all guests in attendance with a Winner, if applicable, must also execute all required documents prior to any participation or such guest(s) will not be permitted to participate.\nDelay of Confirmation or Announcement of Winner. Provided that the Winner is in compliance with the Official Rules and after having successfully proven eligibility, the Winner will be officially confirmed as the Winner.  Crypto.com expressly reserves the right to delay the announcement of the Winner for any reason it deems necessary.  In addition, Crypto.com reserves the right to select an alternate Winner in the event that any Winner fails to comply with these Official Rules.\nLIMITATION OF LIABILITY:  By entering this Sweepstakes, Entrant waives all rights to, and holds Crypto.com or the Sweepstakes Entity harmless from, any claim, liability, loss, damage (including punitive, incidental, and consequential damages), or expense (including attorneys' fees) arising out of or in connection with participation in this Sweepstakes or the acceptance, use, or misuse of any Prize. SOME JURISDICTIONS DO NOT ALLOW THE LIMITATIONS OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE MAY NOT APPLY TO YOU. Crypto.com or Sweepstakes Entity will not be responsible for: late, incomplete, or incorrect entries; an Entrant's failure to receive prize notices due to Entrant's spam, junk email, or other security settings or for Entrants' provision of incorrect or otherwise non-functioning contact information; technical, hardware, or software malfunctions, lost or unavailable network connections, or failed, incorrect, inaccurate, incomplete, garbled, or delayed electronic communications whether caused by the sender or by any of the equipment or programming associated with or used in this Sweepstakes; by any human error which may occur in the processing of the entries in this sweepstakes; or any typographical, technological, or other error in the publishing of the offer, administration of the Sweepstakes, or announcement of the Prize(s). THE PRIZE IS OFFERED AND PROVIDED “AS IS” WITH NO WARRANTY OR GUARANTEE BY CRYPTO.COM OR ANY SWEEPSTAKES ENTITY, EITHER EXPRESS OR IMPLIED.  IN NO EVENT WILL CRYPTO.COM OR ANY SWEEPSTAKES ENTITY BE LIABLE TO ENTRANT FOR ANY DIRECT, SPECIAL, INCIDENTAL, EXEMPLARY, PUNITIVE, OR CONSEQUENTIAL DAMAGES (INCLUDING LOSS OF USE, DATA, BUSINESS, OR PROFITS) ARISING OUT OF OR IN CONNECTION WITH ENTRANT’S PARTICIPATION IN THE SWEEPSTAKES, WHETHER SUCH LIABILITY ARISES FROM ANY CLAIM BASED UPON CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE), STRICT LIABILITY OR OTHERWISE, AND WHETHER OR NOT CRYPTO.COM AND/OR OTHER SWEEPSTAKES ENTITIES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH LOSS OR DAMAGE. \n\nIndemnification. By entering the Sweepstakes, Entrant agrees to indemnify, defend, and hold harmless, Crypto.com and any other Sweepstakes Entities from any and all liability, for any claims, damages, injuries or losses of any kind, and to release all rights to bring any claim, action or proceeding arising out of, in connection with, or relating to, (i) participation in the Sweepstakes, (ii) without limitation, death, or property damage, arising directly or indirectly from the acceptance, possession, misuse or use of the Prize(s), (iii) defamation, violation of publicity rights, or invasion of privacy in connection with the Sweepstakes or acceptance and use or the Prize(s), and (iv) copyright infringement, trademark infringement, or any other intellectual property-related cause of action arising from or related to the Sweepstakes, the Prize(s), or Crypto.com’s advertising and marketing related to the Sweepstakes, Entrants or the Winner, in all cases, including but not limited to:  (a) unauthorized human intervention in the Sweepstakes; (b) technical errors related to computers, servers, providers, or telephone, or network lines; (c) printing errors; (d) lost, late, postage-due, misdirected or undeliverable mail; (e) errors in the administration of the Sweepstakes or the processing of entries; or (f) injury or damage to persons or property (including to any computer or mobile device systems resulting from participation in or accessing or downloading information in connection with the Sweepstakes), which may be caused, directly or indirectly, in whole or in part, from Entrant’s participation in the Sweepstakes or receipt or use of any Prize(s).  Entrant assumes all liability for any injury or damage caused, or claimed to be caused, by participation in the Sweepstakes, or the acceptance, receipt, or use of the Prize(s) or any Prize component.  Entrant further agrees that in any cause of action, Crypto.com and/or the Sweepstakes Entities’ liability will be limited to the value of the Prize(s), and in no event shall the Sweepstakes Entities be liable for attorney’s fees.\nNo Assumption of Responsibility. Crypto.com and the Sweepstakes Entities assume no responsibility for and will disqualify entries that are: stolen, late, lost, illegible, incomplete, invalid, unintelligible, altered, tampered with, unauthorized, fraudulent, damaged, destroyed, delayed, misdirected, not delivered, not received, or that have incorrect or inaccurate entry information, whether caused by any of the equipment or programming associated with or utilized in the Sweepstakes, or by any human, mechanical or electronic error that may occur in the processing of the entries in the Sweepstakes, or other errors appearing within the Official Rules or in the Sweepstakes related advertisements. Crypto.com and the Sweepstakes Entities assume no responsibility for any typographical or other error in the printing of the offer, administration of the Sweepstakes, errors in processing entries, identifying the Winner, in the announcement of the Prize(s) and Winner, the delivery of the Prize(s), any problems or technical malfunction of any telephone network or lines, computer systems, online systems, servers or providers, computer equipment, software, failure of any e-mail or players on account of technical problems or traffic congestion on the Internet or on any web site including crypto.com, or any combination thereof, including, without limitation, any injury or damage to Entrant’s or any other person’s computer system/software related to or resulting from participation in, uploading any materials or downloading any materials in the Sweepstakes.  Use of any device to automate or subvert entry is prohibited and any entries received by such means will be void. Crypto.com reserves the right in its sole discretion to disqualify any person it suspects or finds (i) to have tampered with the entry process or the operation of the Sweepstakes; (ii) to be acting in a disruptive manner, or with the intent to annoy, abuse, threaten or harass any other person;  (iii) to display behavior that will bring such Winner, Crypto.com or the Sweepstakes Entities into disgrace; (iv) to have provided inaccurate information on any legal documents submitted in connection with the Sweepstakes; or (v) to be acting in violation of these Official Rules. ANY VIOLATION OF THESE OFFICIAL RULES BY A WINNER WILL RESULT IN SUCH WINNER’S DISQUALIFICATION AS A WINNER OF THE SWEEPSTAKES AND ALL PRIVILEGES AS A WINNER WILL BE IMMEDIATELY TERMINATED.\nGrant of Rights.  Except where prohibited by law, by entering the Sweepstakes and/or winning the Prize, Entrant irrevocably consents to the use of his or her name, image, photograph, likeness, biographical information, entry, statements attributed to Entrant (if true) and any video footage related to the Prize, for all Sweepstakes Entities’ advertising, promotional or other commercial purposes in all media now or hereafter known, worldwide and in perpetuity without additional compensation and additionally consents to the Sweepstakes Entities putting their name on a Winner’s list.  Please note that Crypto.com may not acknowledge or return any entries.\nIntellectual Property. By submitting an entry, Entrant agrees to Crypto.com’s general terms regarding intellectual property available at https://crypto.com/document/mco_services.  Specifically, Entrant represents and warrants to Crypto.com that they have the rights, authorizations, and licenses to all the content they share with Crypto.com via any platform. This includes, but is not limited to, getting the owner’s consent before sharing third-party content and/or not infringing (or causing Crypto.com to infringe) any third-party rights, including third-party intellectual property rights. Entrant grants to Crypto.com a perpetual, non-exclusive, transferable, sublicensable, royalty-free, worldwide license to use, copy, modify, distribute, publish, and process the content they share with Crypto.com (including their intellectual property) without any further consent, notice, and/or compensation to them or to others for any purpose. Entrant can end this license by deleting such content and notifying Crypto.com at contact@crypto.com. Entrant further agrees to hold Crypto.com harmless against any liability, claims, or demands arising from the content they share with Crypto.com.\nRight of Publicity. By submitting an entry, Entrant agrees to Crypto.com’s use of your name, address, likeness, or Prize information for promotional purposes in any medium without additional compensation to the extent permitted by law.\nGeneral Terms; Force Majeure.  The Sweepstakes Entities are not responsible if the Sweepstakes cannot take place, or if the Prize(s) cannot be awarded due to delays, interruptions or failures due to acts of God, war, natural disasters, weather, acts or threats of terrorism, global pandemic, local epidemics, strikes, lockouts, labor disputes, work stoppages, fire, acts of government, or other events outside of the reasonable control of the Sweepstakes Entities.\nRight to Terminate. If, for any reason the Sweepstakes is not capable of running as planned, including, without limitation, due to infection by computer virus, bugs, tampering, unauthorized intervention, fraud, technical failures, or any other causes beyond the reasonable control of the Sweepstakes Entities, which, in Crypto.com’s sole determination, corrupts or affects the administration, security, fairness, integrity or proper conduct of the Sweepstakes, Crypto.com reserves the right, in its sole discretion, to cancel, terminate, modify, or suspend the Sweepstakes or any part of the Sweepstakes. If the Sweepstakes or any part of the Sweepstakes is terminated or modified prior to the closing of the Sweepstakes Period, notice will be posted on Crypto.com. Crypto.com reserves the right to modify and amend these Official Rules from time to time during the Sweepstakes Period for clarification purposes.\nReservation of Rights. ANY ATTEMPT BY ANY PERSON TO DELIBERATELY DAMAGE OR UNDERMINE THE LEGITIMATE OPERATION OF THE SWEEPSTAKES MAY BE IN VIOLATION OF\n\nCRIMINAL AND CIVIL LAW AND SHOULD SUCH AN ATTEMPT BE MADE, CRYPTO.COM RESERVES THE RIGHT TO SEEK REMEDIES AND DAMAGES (INCLUDING ATTORNEYS’ FEES) FROM ANY SUCH PERSON TO THE FULLEST EXTENT PERMITTED BY LAW.\n\nSeverability. The invalidity or unenforceability of any provision of these Official Rules will not affect the validity or enforceability of any other provision. In the event that any provision of the Official Rules is determined to be invalid or otherwise unenforceable or illegal, the other provisions will remain in effect and will be construed in accordance with their terms as if the invalid or illegal provision were not contained herein. Crypto.com’s failure to enforce any term of these Official Rules will not constitute a waiver of that term or any other provision of these Official Rules. Entrant agrees to waive any rights to claim ambiguity of these Official Rules. Headings are solely for convenience of reference and will not be deemed to affect in any manner the meaning or intent of these Official Rules or any provision hereof. In the event there is a discrepancy or inconsistency between disclosures or other statements contained in the Sweepstakes–related materials, privacy policy or terms of use on a website and/or the terms and conditions of these Official Rules, the Official Rules shall prevail, govern and control and the discrepancy will be resolved in Crypto.com’s sole and absolute discretion.\nPrivacy.  All Personal Information submitted by Entrants and collected by Crypto.com in connection with Entrant’s entry will be subject to and will be treated in a manner consistent with Crypto.com Global Marketing Privacy Notice available at: https://crypto.com/privacy/marketing . By participating in the Sweepstakes, Entrant hereby agrees that Crypto.com may collect and use their personal information submitted with the entry, and acknowledges that they have read and accepted the Crypto.com Global Marketing Privacy Notice.  Among other things, the information Entrants provide may be used for sending Entrants company updates and announcements about Crypto.com and its products and/or services.\nChildren’s Online Privacy Protection Act. Crypto.com’s Sweepstakes are not intended for general audiences and are not directed to children under the age of 18. We do not knowingly collect Personal Information from children under the age of 18 through our Sweepstakes. If you become aware that a child has provided us with Personal Information without parental consent, please contact us at contact@crypto.com. If we become aware that a child under the age of 18 has provided us with Personal Information without parental consent, Crypto.com takes steps to remove such information.\nCalifornia Consumer Privacy Act. Crypto.com complies with the California Consumer Privacy Act (CCPA) and is required to provide certain information to individuals about how Crypto.com collects, uses, and shares your Personal Information, and about the rights and choices that Entrant may have concerning Entrant’s Personal Information. For further information regarding Entrant’s rights, please review Crypto.com      Global Marketing Privacy Notice, available at https://crypto.com/privacy/marketing      .\nClass Waiver. Except where prohibited by law, Entrant agrees that:  ANY DISPUTE, CONTROVERSY OR CLAIM ARISING OUT OF OR RELATING TO THE SWEEPSTAKES OR ANY PRIZE AWARDED IS UNIQUE TO THE ENTRANT AND SHALL BE RESOLVED INDIVIDUALLY AND WITHOUT RESORT TO ANY FORM OF CLASS OR REPRESENTATIVE ACTION INCLUDING MASS ARBITRATION.\nDispute Resolution; Binding Arbitration. Except where prohibited by law, Entrant agrees that: (1) ANY DISPUTE, CONTROVERSY OR CLAIM ARISING OUT OF OR RELATING TO THE SWEEPSTAKES OR ANY PRIZE AWARDED SHALL BE RESOLVED BY BINDING ARBITRATION ADMINISTERED BY THE AMERICAN ARBITRATION ASSOCIATION, and the arbitrator shall be selected from a list of arbitrators provided by the American Arbitration Association following a request by the party seeking arbitration for a list of five retired or former jurists with substantial professional experience in employment matters. The arbitration shall be conducted in the State of Florida under the procedures applicable to arbitrations in the State of Florida.  The arbitrator's authority and jurisdiction shall be limited to determining the dispute in arbitration in conformity with law, to the same extent as if such dispute were determined as to liability and any remedy by a court without a jury. The arbitrator shall render an award which shall include a written statement of opinion setting forth the arbitrator's findings of fact and conclusions of law, and the arbitration proceedings shall be conducted in English; unless both Entrant and Crypto.com agree in writing, the arbitrator may not consolidate more than one person’s claims, and may not otherwise preside over any form of class or representative proceeding; judgment upon any award rendered may be entered in any court having jurisdiction thereof; and any award or judgment shall be subject to all limitations and releases set forth in these Official Rules and be limited to actual out of pocket damages, and shall not, in any event, include any punitive, exemplary, consequential or incidental damages, attorney’s fees or costs of bringing a claim, or any injunctive or other equitable relief.  SOME JURISDICTIONS DO NOT ALLOW THE LIMITATIONS OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE MAY NOT APPLY TO YOU.  \n\nGoverning Law:  All federal, state and local laws and regulations apply.  Void where prohibited by law.  All issues and questions concerning the construction, validity, interpretation and enforceability of these Official Rules, or the rights and obligations of the Entrant and Crypto.com in connection with the Sweepstakes, shall be governed by, and construed in accordance with, the laws of the State of Florida without giving effect to any choice of law or conflict of laws rules.\nAccessibility of Official Rules and Winners List:  A copy of these Official Rules is available via the relevant campaign blog post. Where required by law, Crypto.com will provide the name of Winner(s) of a Sweepstakes to those who request it.\nRequests for Official Rules. For a copy of the Official Rules you can:\n\nSend a self-addressed, stamped envelope, postmarked to Foris, Inc., Suite 2725, Sabadell Financial Center Building, 1111 Brickell Avenue, Miami, FL 33131, Attn: Crypto.com Legal; and write the name of the Sweepstakes on the lower left hand corner of the envelope.\n\nRequests for Winner(s). For the name of the Winner(s) you can:\n\nSend a self-addressed, stamped envelope, postmarked to Foris, Inc., Suite 2725, Sabadell Financial Center Building, 1111 Brickell Avenue, Miami, FL 33131, Attn: Crypto.com Legal; and write the name of the Sweepstakes on the lower left hand corner of the envelope. All requests for the name of the Winner(s) must be received within two (2) weeks of the end of the Sweepstakes Period.\n\nSocial Media: By submitting an Entry, Entrant agrees to a complete release of Facebook®, Instagram® Twitter®, and/or You Tube®, and/or any other social media platform used to promote or enter into this Sweepstakes and acknowledges that the Sweepstakes is in no way sponsored, endorsed, administered by, or associated with Facebook®, Instagram®, Twitter®, YouTube®, and/or  any other social media platform. Further, Entrant agrees to abide by any and all, if any, requirements imposed by any social media platform used to promote or enter into the Sweepstakes.\nEntire Agreement. These Official Rules constitute the entire agreement between the Sponsor and Entrant.","dc:creator":"Jaime Lee","content":"<p>To participate in the Sweepstakes, you must satisfy the eligibility criteria and meet the requirements set out in these Official Rules,and:</p><ol><li>Like the designated post on Twitter or Instagram;</li><li>Reply to the same post with your Final prediction;</li><li>Follow Crypto.com on the platform you entered, at the following</li></ol>","contentSnippet":"To participate in the Sweepstakes, you must satisfy the eligibility criteria and meet the requirements set out in these Official Rules,and:\n\nLike the designated post on Twitter or Instagram;\nReply to the same post with your Final prediction;\nFollow Crypto.com on the platform you entered, at the following","guid":"6396b9eac8cb28003d580a2b","isoDate":"2022-12-12T09:34:13.000Z","from":"https://blog.crypto.com/rss/"},{"title":"v1.6.0","link":"https://github.com/scrtlabs/SecretNetwork/releases/tag/v1.6.0","pubDate":"2022-12-12T09:42:20.000Z","author":"github-actions[bot]","content":"<p>Merge pull request <a class=\"issue-link js-issue-link\" href=\"https://github.com/scrtlabs/SecretNetwork/pull/1284\">#1284</a> from scrtlabs/fix-oom-cache</p>\n\n<p>Fix writable gas tracking</p>","contentSnippet":"Merge pull request #1284 from scrtlabs/fix-oom-cache\nFix writable gas tracking","id":"tag:github.com,2008:Repository/236962590/v1.6.0","isoDate":"2022-12-12T09:42:20.000Z","from":"https://github.com/scrtlabs/SecretNetwork/releases.atom"}]