[{"title":"Why Paradigm Was Wrong: How rETH Will Flip stETH","link":"https://mirror.xyz/0x04BEE613690e98A1959F236c38AbAa5f2439B14a/pnaLyH6W4j58vfypsOKHciF_BM5HFvTkouTd9uThesM","pubDate":"Sun, 25 Dec 2022 16:50:00 GMT","content:encoded":"<p><em><strong>analysis of the social and economic headwinds facing stETH, how these headwinds are reflected by market conditions creating tailwinds for rETH, breakdown of the broader LSD market, and the general Rocket Pool bull case</strong></em></p>\n<p><em>Disclosure: I am paid a small weekly stipend as Rocket Pool Community Advocate by the Rocket Pool core team and hold a considerable sum of RPL tokens that have been gifted to me over the past few years in support of my contributions. I have a small allocation of both LDO and SWISE tokens.</em></p>\n<p><em>I would like to give a special thanks to silvv.eth and Nick Ashley for reviewing and editing this paper with me. A further thanks to all those in the Rocket Pool community who have contributed to this document, whether by providing writing input or by contributing towards something mentioned.</em></p>\n<h2 id=\"table-of-contents\">Table of Contents</h2>\n<ul>\n<li><p><strong>1 - Power is not Law</strong></p>\n<ul>\n<li>The Monopolist Playbook</li>\n</ul>\n</li>\n<li><p><strong>2 - Social Headwinds to stETH Growth</strong></p>\n<ul>\n<li><p>Governance Attackable</p>\n</li>\n<li><p>Rapidly Changing Fee/Incentive Structures</p>\n</li>\n<li><p>The Multichain Dilemma</p>\n</li>\n<li><p>Validator Registry</p>\n</li>\n</ul>\n</li>\n<li><p><strong>3 - Economic Headwinds to stETH Growth</strong></p>\n<ul>\n<li><p>Staking––Risk Free or Risk Fee?</p>\n</li>\n<li><p>Execution Risk</p>\n</li>\n<li><p>Tail Risk</p>\n</li>\n<li><p>Centralization Risk</p>\n</li>\n</ul>\n</li>\n<li><p><strong>4 - The Orange Cascade</strong></p>\n<ul>\n<li><p>The Orange Creep - Pre-Withdrawals</p>\n</li>\n<li><p>The Orange Migration - Withdrawals</p>\n</li>\n<li><p>The Orange Future - Post-Withdrawals</p>\n</li>\n</ul>\n</li>\n<li><p><strong>5 - A New Challenger Arrives</strong></p>\n<ul>\n<li><p>The Drain of cbETH</p>\n</li>\n<li><p>frxETH - Liquidity vs Design</p>\n</li>\n<li><p>Shadowy Super Stakewisers</p>\n</li>\n<li><p>Reflections of a Rocketeer</p>\n</li>\n</ul>\n</li>\n<li><p><strong>6 - The Underappreciated Art of Counterparty Tokenomics</strong></p>\n</li>\n<li><p><strong>7 - Conclusion</strong></p>\n</li>\n<li><p><strong>8 - Postscript</strong></p>\n</li>\n</ul>\n<h2 id=\"1---power-is-not-law\">1 - Power is not Law</h2>\n<p>The Pareto principle, also known as the power law, is a phenomenon that occurs when a small number of individuals or groups control a disproportionate amount of a resource or outcome. This can be seen in many different fields, including economics, sociology, and ecology. For example, the global distribution of wealth is often described using the Pareto principle.</p>\n<p>The Pareto principle was the foundation of a now-famous research paper from Hasu and Georgios of Paradigm, a Web3 investment firm. Writing about the nature of liquid staking, they argued that Ethereum’s proof-of-stake (PoS) system would be dominated by pools that were socially scalable and delivered the highest possible returns by accepting MEV (Maximal Extractable Value). They argued that a Pareto distribution would result whereby most staked ETH would be controlled either by a centralized exchange, or a less-centralized alternative that could launch first. As the first mover, this entity would have the most time in the market and therefore seem most trustworthy, prima facie. This is popularly referred to as the Lindy effect, with its growing time in the market translating to increased investor trust. Another advantage of being early is that liquidity tends to beget liquidity - liquidity is a lifeblood for protocols, being all the more critical for any liquid staking endeavor as the name suggests. The authors would go on to help found Lido, a protocol that now holds an oppressive ~90% of the Ethereum Liquid Staking Derivative (LSD) token market cap used in DeFi, much higher than the power law might suggest is natural.</p>\n<p><a href=\"https://www.paradigm.xyz/2021/04/on-staking-pools-and-staking-derivatives\">https://www.paradigm.xyz/2021/04/on-staking-pools-and-staking-derivatives</a></p>\n<p>The Pareto principle only holds true in the presence of some environmental limiting pressure that prevents total ecosystem domination. For example, in a biological ecosystem, the balance between predator and prey populations can keep both populations in check. However, if there is an artificial disruption, such as hunting or the introduction of a non-native species, the ecosystem can collapse.</p>\n<p>The claim that PoS ETH is already in a power law distribution often skips an important component--the limiting pressure. One can see this limiting pressure exemplified through the growth phases of a wild animal population as modeled by the logistic curve. In the first phase, exponential growth quickly brings the population to an extreme from essentially zero. In the middle of the curve, growth reaches an inflection point and slows as some pressure begins to mount. For predatory species, this may be decreasing food rations from over-predation. The final part of the curve is the approach towards carrying capacity – an asymptotic relationship for the population’s ceiling wherein risk or lack of food inhibits any further growth. Here the species holds a dominant, yet fluctuating, grasp on the ecosystem. Further growth is repudiated as it would diminish resources causing population collapse, which in turn would boost reproduction as resources become plentiful again -- a constant cycle around the steady state. Now, imagine if the counter force could be suppressed or hidden. What would happen to the bacteria population? It would consume with no end.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/Sxj9dEJlSYS1LD3zft2Vd.png?height=356&width=532\" alt=\"Sample bacteria colony growth over time demonstrates the exponential phase, growth slow down, and population steady-state phases of colony dynamics\"></p>\n<h3 id=\"the-monopolist-playbook\">The Monopolist Playbook</h3>\n<p>I posit that <em><strong>Lido has been artificially suppressing power law dynamics to maintain an unsustainably high proportion of the Ethereum LSD market</strong></em>. The long-term effects of this behavior are simple and inevitable – as the seemingly endless liquidity incentives dry up and the DeFi integration gap lessens, the market’s invisible hand will drive reversion towards a Pareto distribution. The outright dominance of Lido’s LSD token (stETH) should drop as rational actors diversify risk.</p>\n<p>Much as the US Federal Reserve printed billions of dollars in response to the Covid-19 pandemic, Lido has been rapidly inflating and spraying their governance token (LDO), to the tune of tens of millions of dollars per month. By paying to elevate the utility of their stETH LSD, Lido has been attempting to entrench the first-mover advantages outlined in Hasu and Georgios’ paper. Retail investors, therefore, face a prisoner’s dilemma, with self-interested and profit-chasing actors seeking out stETH’s boosted value despite inherent risks being obscured beneath a flood of LDO incentive payments. Lido’s mask briefly slipped during the 3AC (Three Arrows Capital) collapse in June 2022 when stETH rapidly attracted a risk discount of as much as -6.6% compared to liquid ETH, representing around 18 months of rewards temporarily wiped out. To understand how the materialization of risk through this discount is a symptom of Lido losing its place as the current power law majority player, we have to consider the social and economic headwinds acting against Lido’s relentless quest for total market dominance. I will then describe how Rocket Pool can scale to challenge Lido in a technical sense. This scaling will occur in three distinct phases – pre-withdrawals, withdrawals, and post-withdrawals. Afterward, I will discuss the competitors that may complicate or hasten the process of rETH flipping stETH, focusing on cbETH, frxETH, and osETH.</p>\n<h2 id=\"2---social-headwinds-to-steth-growth\">2 - Social Headwinds to stETH Growth</h2>\n<p>Hasu and Georgios lay out the social arguments themselves:</p>\n<blockquote>\n<p>“One metric that matters for PoS security is how much of the stake is controlled by a single entity. For [centralized] exchanges 15-30%; at more than that, there might be social concerns about power centralization in the Ethereum ecosystem. A decentralized staking pool can control any share of the network, as long as each individual validator in the DAO is not too big and as long as the withdrawal credentials cannot change / be voted on.</p>\n<p>We have to emphasize how important it is that the decentralized staking pool by that point <strong><em>has shed all of its governance functionality</em>. Neither fees</strong>, nor withdrawal addresses, <strong>nor the validator registry</strong> can be allowed to be changed by human inputs.”</p>\n</blockquote>\n<p>Italics are not my own, but the emphasis is. In this section, the authors suggest that social limits placed on centralized exchanges may not apply to a decentralized protocol that meets the requisite governance criteria. It is Lido’s failure to meet these very criteria that is actively creating resistance to the protocol’s continued growth and dominance.</p>\n<p>Lido cannot have it both ways. They cannot grow like a centralized entity but claim to be a decentralized one.</p>\n<h3 id=\"governance-attackable\">Governance Attackable</h3>\n<p>Lido now sits at &gt;30% of the network, bigger than the 3 largest centralized exchanges combined, and is still bathed in governance. It seems that, despite their important emphasis two years prior, Hasu and Georgios have now conveniently forgotten gov minimization was a core part of their 2020 paper. In contrast to Lido’s ferocious appetite for growth, steps to <em><strong>“shed all of its governance functionality”</strong></em> have been conspicuously lackluster. An updated dual-governance structure gives voting power to LDO holders and a secondary veto power to stETH holders. But if anything this acts as a distraction to the fact that there have been no real steps taken to diminish Lido’s governance - something that has understandably drawn the ire of some of Ethereum’s influential core developers.</p>\n<p>The powers that be have been slow to change and give up control. Should individuals within this group become corrupted, they could affect significant negative changes to the core Lido protocol which would then spill over to infect the wider Ethereum ecosystem.</p>\n<p>One example would be misusing Lido’s outsized control of the Ethereum network for added value extraction, namely through multi-block MEV or reorg attacks. There is already a precedent that these legal but immoral actions are not taboo for a purely profit-driven Ethereum organization, as F2Pool has been known for small-scale attacks on blockchain consensus to increase their own profits. If Lido compels their hand-picked validators to implement these immoral value extraction methods at scale, the credible neutrality of Ethereum itself becomes challenged. This threat of cartel-ization is exactly why Hasu and Georgios placed great emphasis on stating that any protocol with governance control should have a hard upper ceiling on their market share.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/Qar7kbRlnYcxdpQWz2dXV.png?height=422&width=1012\" alt=\"Danny Ryan, Ethereum Foundation - https://notes.ethereum.org/@djrtwo/risks-of-lsd\"></p>\n<p>Reviewing a different liquid staking protocol helps to provide some interesting contrast in governance. Eschewing a tightly controlled and centralized structure, Rocket Pool operates through rough consensus between different groups of stakeholders. Overall protocol direction is driven by a DAO of node operators (the pDAO), with changes then worked on by a team of core developers.</p>\n<p>The core dev team has demonstrated its fierce alignment to the core ethos of Ethereum in numerous ways. First, the team was willing to completely restart work when the Ethereum core developers changed the staking contract from Casper in late 2018. Further, the team published a statement of intent to implement a self-imposed cap on Rocket Pool’s market share.</p>\n<p>Actual implementation is controlled by a second, external DAO (the oDAO), which operates at arm’s length to review and action protocol upgrades. The oDAO is composed of major parties from across the breadth of the Ethereum ecosystem and are strongly aligned by a combination of three ties: a financial bond, considerable social capital, and a natural alignment with the core principles of Ethereum.</p>\n<p>The quadratic voting power of individuals within the pDAO is linked to both their validator count and a capped amount of the RPL utility token. This means that individuals gain voting power by participating in the network and staking a certain amount of the RPL token, rather than simply by holding a large quantity of LDO tokens as in Lido&#39;s governance structure. This makes Rocket Pool&#39;s governance more robust and less susceptible to manipulation by a small group of individuals.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/MNSdSDP871r0OKMSmVNtp.png?height=840&width=841\" alt=\"\"></p>\n<p>This multi-party governance system provides anti-fragility in the face of attacks. In fact, it mirrors the rough consensus that Ethereum itself follows wherein multiple different parties signal towards the core developers, but no single party could do so in isolation. Rocket Pool’s governance is still nascent, but its methodical and deliberate progress down the pathway toward full decentralization ensures that the protocol is less likely to fall victim to a social attack.</p>\n<h3 id=\"rapidly-changing-feeincentive-structures\">Rapidly Changing Fee/Incentive Structures</h3>\n<p>One of the governance red flags raised by Hasu &amp; Georgios that should lead a protocol like Lido to self-cap is that <em><strong>“Fees… [should not] be allowed to be changed by human inputs.”</strong></em> Contrary to this stance, not only can Lido’s fees be changed, but they are actively being adjusted. While the protocol’s top-line 10% commission rate is steady, the flow of these funds has recently been redirected away from insurance towards a more generic treasury for other uses such as marketing. The fact that LDO token holders voted in this change to arguably strengthen their position while putting stETH holders at heightened risk raises questions about how effective Lido’s governance really is. The ability for Lido’s entire insurance profile to change based on a vote decided by a core group of founders is a distinct weakness.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/veccKmKc0E1EkcSh2OZ0i.png?height=710&width=1249\" alt=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0xb99f87eb8e168b8ad28a70fabbe94fe5e0d9023b04c112331df0880480f96a63\"></p>\n<p>A related issue is the general infancy of on-chain governance. DeFi tokens act as voting shares without any of the information rights those shares would have afforded to their owner in the traditional finance world. As such, the information asymmetry between those with the most to gain from governance (VCs, other protocols) and those who have the best interests of the protocol at heart (founders, active community members) will result in occasional exploitative governance votes.</p>\n<p>Dragonfly, a VC firm, attempted to pass a highly controversial vote to sell LDO from the Lido treasury to itself. Due to a strong social response, this vote failed; however, DAOs cannot rely on someone sounding the alarm every time a vote is secretly malicious. The web of governance is broad and all aspects of the Lido protocol are indirectly affected by each other. As long as the flows of capital remain flexible, the protocol will continue to be the focus of governance exploitation.</p>\n<p>Lido’s small group of 30 carefully selected validator companies can be very quick to respond to protocol changes, including unfavorable changes, leaving stETH holders with little time to react. Rocket Pool, by comparison, has a large set of node operators running validators. A benefit of this structure is that any attempt to change the flow of incentives will be slowed by gradual adoption. Take for example the future change to lower ETH collateral in mini pools. Because hundreds of operators will each have to make the decision to upgrade, this process will occur gradually, such that rETH holders can respond. With a set of only ~30 operators, coordinating changes that would change the flow of capital in Lido would occur much faster.</p>\n<h3 id=\"the-multichain-dilemma\">The Multichain Dilemma</h3>\n<p>One of the claimed advantages of a permissioned set of corporations running most of Ethereum’s validators is that for-profit enterprises will be more dedicated than home stakers.</p>\n<blockquote>\n<p>Lido’s CTO recently went so far as to claim that “[home stakers] who run nodes for fun will drop them…when it’s no longer fun…If your business [and] career depends on blockchains, you tend to be thoughtful and committed”.</p>\n</blockquote>\n<p>However, the elephant in the room is that many of Lido’s professional validators are providing their services to multiple different chains concurrently. This glaring conflict of interest calls into question just how committed Lido really is to Ethereum.</p>\n<p><a href=\"https://thedefiant.io/lido-under-fire\">https://thedefiant.io/lido-under-fire</a></p>\n<p>In the case of a widespread technical disruption event that knocks multiple validators offline across multiple chains, it’s unlikely that any professional operator would have sufficient staff resources available to restart all chains simultaneously. An incident in September saw 7,390 of Lido’s Ethereum validators operated by Bridgewater Capital go offline for over eight hours following the pre-planned Bellatrix hard-fork. If response times were so slow for a pre-planned event on a single chain, think how many more hours or even days it would have taken them to recover from a real crisis, and at what cost to their liquid stakers. It also raises the risk of a more profit-focused or centralized blockchain such as Solana offering monetary incentives for prioritized crisis handling. This is akin to a fire department being bribed to respond to fires in one specific neighborhood while the whole city is ablaze. By comparison, the technical difficulties of staking as an individual means that home stakers are far more likely to be dedicated to a single chain.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/d6JRHTWFTrHUVfPs5fstE.png?height=913&width=1360\" alt=\"https://lido.fi/\"></p>\n<p>But it can get even worse. In a true doomsday scenario where multiple blockchains halt and require a restart, a high degree of coordination is required between the validators. Attempting to do this for a single blockchain is difficult enough, but managing several at once would be all but impossible.</p>\n<p>Further, the negative effects of multichain validation extend to everyday scenarios too. Every chain a professional validator is responsible for has its own incentive structure. New incentives could be misaligned with old ones or vice versa. For example, becoming the majority validator in two competing chains and causing the smaller chain to fail or underperform is a concern for more centralized, smaller Cosmos chains. As Lido continues to expand across chains with no guiding principles, users must begin to question how aligned Lido is with Ethereum. Meanwhile, Rocket Pool serves only Ethereum, though users are free to run other validators on their hardware.</p>\n<h3 id=\"validator-registry\">Validator Registry</h3>\n<p>Another one of Hasu &amp; Georgios’ governance red flags that Lido exhibits is that Lido’s <em><strong>“validator registry can be … changed by human inputs.”</strong></em> Despite the warning, Lido’s validator registry remains both fully centralized and opaque. It is not a stretch to imagine the possible corruption of Lido’s DAO members for personal gain. Examples might include requiring validators to conduct immoral value extraction at scale or succumbing to pressure to censor transactions. Despite the glaring security risks this poses, there remains no plan for Lido to extricate humans from this onboarding process. In contrast, Rocket Pool remains the only staking service that provides permissionless onboarding for node operators. Anyone can be a node operator for Rocket Pool, thus the protocol is immune to these centralization risks.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/kiyWY_lpnIw72bcSftXTO.png?height=218&width=967\" alt=\"https://blog.lido.fi/additions-to-ethereum-node-operator-set-wave-4/ \"></p>\n<p>For these social reasons, the broad Ethereum ecosystem has exhibited an increasing pushback to Lido’s dominance. Future investors will be very keen on social risks as DAOs gain power and Lido presents an unparalleled risk.</p>\n<p>At this point, I would like to step back and make a meta point. Even if an individual disagreed with me that Rocket Pool is superior to Lido in governance resilience broadly as measured through these social vectors, the disparity in market share is unjustified. An individual who valued social risk very highly would have a roughly 50/50 split of rETH and stETH to mitigate risk. The issues of social pressure are most relevant for the market leader. As such, if I am correct about social issues, then rETH has incredible tailwinds, and if I am (moderately) wrong then rETH <em>still</em> has large tailwinds.</p>\n<p>I would argue that while these social factors are significant, they are still ancillary to economic forces. While the online narrative for Lido soured, the 3AC capitulation and ensuing mass stETH liquidation cascade presented, for seemingly the first time, a new element to the stETH market – risk.</p>\n<h2 id=\"3---economic-headwinds-to-steth-growth\">3 - Economic Headwinds to stETH Growth</h2>\n<p>Many retail investors have been lulled into viewing Lido’s stETH LSD token as always redeemable for ETH due to the vast liquidity reserves and the token’s history of staying on-peg. As often happens in such cases, this perception was exploited, leading to the price of overleveraged stETH collapsing by as much as -6.6% vs peg. While priced at peg, it takes a significant force to overcome a token’s inertia and cause this kind of drop - in this case the 3AC bankruptcy - but this same inertia means that a return to stability is not guaranteed and can only be accomplished through significant effort.</p>\n<h3 id=\"stakingrisk-free-or-risk-fee\">Staking––Risk Free or Risk Fee?</h3>\n<p>The various different LSD tokens fluctuate around their peg or reference price. The largest and most persistent discount vs peg is for Coinbase’s cbETH, followed by stETH, and the smallest is Rocket Pool’s rETH, which has consistently traded at a premium since the merge. The persistent stETH depeg can be traced back to the fact that hundreds of thousands of tokens were minted on leverage and subsequently dumped on secondary markets which depressed the price. Because every stETH minted on leverage is just as eligible to be redeemed for ETH, Lido is loosely engaging in fractional reserve banking by facilitating the creation of many more deposit receipts than there are deposits.</p>\n<p>Nansen analysis of stETH’s -6.6% depeg event during the 3AC capitulation revealed that most sales came from large wallets whereas buying pressure came from smaller retail investors. Thus, stETH’s price deviation from peg represents the risk discount or perceived likelihood of a bank run on Lido’s ETH deposits from small retail. Thus, the price at which retail became willing to buy up stETH is an accurate reflection of the risk the market associated with stETH.</p>\n<p>Looking at it from the other side, anyone buying stETH shortly before the collapse would have seen around 18 months of allegedly low-risk rewards wiped out in a matter of days - it is important not to undersell how big this depeg is. During this event there were clearly very few individuals who perceived stETH to be a risk-free wrapper on future ETH redemption.</p>\n<p>It’s worth noting that rETH also de-pegged at the same time, but to a much lesser extent, and also exhibited a quicker recovery. The APR in ETH staking is lower than other avenues in DeFi and as such the losses are more painful as they are much harder to earn back. In such a capital-intensive, low-yield environment, having proper risk management is crucial. Fortunately, the market has more or less priced all the LSD tokens as a function of perceived risk through their degree of ‘de-peg.’ From this pricing information, we can draw conclusions about LSD token risk.</p>\n<p>One naturally comes to ask, where does this risk come from? It can be grouped into three main categories: <strong>execution risk</strong>, <strong>tail risk</strong>, and <strong>centralization risk</strong>. I will show that Lido is at dangerously high-risk levels in the latter two categories and that this is calculable by comparing execution risks between tokens.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/QEhE9Y23jFu4SBwDu7WXf.png?height=556&width=898\" alt=\"Data courtesy of valdorff.eth -- range focused on May collapse. Note the adulterated adherence to the 1 ETH peg stETH held just prior to the sudden capitulation \"></p>\n<h3 id=\"execution-risk\">Execution Risk</h3>\n<p>I define execution risk as existential threats to a protocol that stem from necessary future upgrades.</p>\n<p>Some marginal risk between tokens can be allocated to individual protocols themselves and would largely be correlated with the extensiveness and complexity of the respective smart contracts. Upgrades to Ethereum itself also fall into this category and hence would apply equally to all LSD protocols since they are similarly at risk of a failed hard fork, for example. The successful completion of The Merge demonstrated the role of execution risk. Following The Merge, the stETH depeg dropped to 1% and rETH hit parity. It can be inferred then that a large part of the remaining depeg is now due to centralization risk and tail risk.</p>\n<h3 id=\"tail-risk\">Tail Risk</h3>\n<p>Next up, tail risk refers to a range of potential governance abuses and events that may occur on or off-chain, such as smart contract exploits, slashings, quadratic leaks, hardware failures, and custody errors. These events are difficult to predict and occur infrequently but are important to consider in risk management due to their potential severity. Furthermore, the resilience of an antifragile DeFi primitive, like wETH, should be measured by its ability to withstand its worst-case scenario.</p>\n<p>In the Ethereum ecosystem, node operator penalty events such as offline losses and slashings scale with the number of validators involved. Each of Lido&#39;s node operator companies manages thousands of validators. As a result, there is a higher protocol-wide tail risk exposure when compared to a more decentralized set of operators each running a smaller number of validators. In other words, Lido is placing a large number of eggs in a small number of baskets.</p>\n<p>Additionally, Lido does not have sufficient insurance to cover worst-case scenarios and has even begun redirecting funds away from its small protection fund of around 5,000 ETH. If losses exceed this amount, they would be socialized across all stETH holders. In contrast, other LSDs such as rETH and sETH2 have a much higher degree of protection, though only rETH offers true tail risk protection through a large amount of over-collateralization. For a proper comparison of how different LSD tokens provide insurance, <a href=\"https://mirror.xyz/dabdab.eth/udO6ovzWGglr7KMBSFHS8hy7_q9ORvZReetYvUCh3ho\">see this analysis by dabdab.</a></p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/3Aq93RKkxPmSz32EpFLhT.png?height=690&width=929\" alt=\"courtesy of dabdab.eth - notice how nearly the entire stETH supply is uninsured\"></p>\n<p>To make matters worse for Lido, there is no short-term path to solve the substantial dependence on early Lido node operators. The Bridgetower Capital incident mentioned earlier demonstrates that Lido operators are protected even when they perform poorly. The staked ETH that these operators manage cannot currently be withdrawn. Mitigating this risk through diversification by onboarding additional node operators is not possible, since it only leads to an increase of the third and final category: centralization risk.</p>\n<h3 id=\"centralization-risk\">Centralization RIsk</h3>\n<p>While the above two categories are bad enough for Lido itself, any event occurring within what should be a DeFi primitive has the potential to be realized as considerably worse, with its effects cascading through the entire industry built on top. This is an example of centralization risk, the idea that execution and tail risks have a greater impact as the size of any protocol grows.</p>\n<p>Since Lido has refused to self-cap at any size, it could one day hold a supermajority of staked ETH. Any failure within Lido would therefore spill over and affect the entire Ethereum ecosystem. This risk should manifest in higher sell pressure as Lido’s market dominance rises. Even if governance risks are resolved, the mere appearance of a risky supermajority from Lido could still generate this kind of sell pressure. In times of risk-off or volatile market conditions, the widening gaps between stETH and other lower-risk assets such as rETH represent a “flight to safety” with the market pricing in the potential adverse scenarios that could befall Lido.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/H-P33lz5jT6gTksdfpk5j.png?height=659&width=830\" alt=\"https://dune.com/LidoAnalytical/Lido-Finance-Extended  Lido: 4.6m ETH, Rocket Pool: 330k ETH \"></p>\n<p>Sitting at just over 30% of all validators and 75% of all liquid-staked ETH, stETH is an order of magnitude larger than rETH at 1.5% of all validators and 5% of liquid-staked ETH. Though Lido does not yet have a supermajority of all ETH, they have voted against self-capping and have maintained an exceptional, perhaps unnatural, lead.</p>\n<p>To recap, rETH has considerably less execution, tail, and centralization risk than stETH as demonstrated by the consistent premium rETH demands over stETH. In terms of execution risk, Rocket Pool handled the Merge well while one of Lido’s major node operators experienced significant downtime. With the highly complex Merge complete, the impact of future upgrades is likely to be minimal and so the relevance of execution risk is also minimal. However, Lido still faces marginally greater execution risk in that the concentration of validators means that any mistake will be more costly, as noted by the Blocktower incident.</p>\n<p>In terms of tail risk, rETH is vastly more insured than stETH with all deposits currently &gt;100% overcollateralized. This will protect against almost any severity of slashing, short of an ecosystem-wide failure. Thus, it is unlikely rETH holders will ever be hit. Further, upgrades in the Rocket Pool Smart Node are opt-in and so propagation throughout the system is gradual enough for risk-averse operators to wait for any bugs to appear. This also means that Rocket Pool nodes can run without any upgrades from the core team indefinitely. However, the oracle DAO does represent a source of centralization within the protocol. If the oracle DAO was compromised, massive damage could befall rETH as oracle data is manipulated. Such an attack would require either the coordination or compromise of a majority of the public, doxxed, Ethereum-aligned participants of the oDAO. I will elaborate on this in the Reflections of a Rocketeer section.</p>\n<p>Lastly, in terms of centralization risk, rETH is a minor player in the ecosystem and the dev team as well as the community have already signaled support for capping stake. When mitigating risk, rETH is the clear front-runner for LSDs. As such, the only puzzle that remains is how to scale Rocket Pool in a technical sense to meet the demand of being a core DeFi asset. I call this process the <strong>Orange Cascade</strong>.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/b63Ky5-8OojZ7G25rK1KE.png?height=669&width=1061\" alt=\"Anthony Sassano, turned orange by the sheer power of Rocket Pool, The Daily Gwei #332 https://youtu.be/x_I8WF5Vk9U?t=705\"></p>\n<h2 id=\"4---the-orange-cascade\">4 - The Orange Cascade</h2>\n<p>I will now discuss how stETH’s market share can drop from being a near monopoly to less than a majority. I begin by recapping the social and economic pressures pushing against stETH and providing tailwinds for rETH. Then, I elaborate on the factors that will allow rETH to scale prior to withdrawals. These factors are mainly ways to scale and improve the experience for node operators, including reducing the ETH bond, the MEV Smoothing Pool, the Rescue Node, and Rocketarb. Looking to the future, I discuss withdrawals and the importance of solo staker migration, the flight from stETH/cbETH, and liquidity migration. By this point, rETH should scale into the low millions ETH staked. However, the future after withdrawals will be even brighter due to native staking-as-a-service (StaaS), Eigenlayer, forced exits, and distributed validator technology (DVT). These technical assets will allow rETH, the healthiest LSD for Ethereum, to onboard the ideal 22% of all staked ETH, no matter what the total percent of ETH staked is.</p>\n<h3 id=\"the-orange-creep---pre-withdrawals\">The Orange Creep - Pre-Withdrawals</h3>\n<p>The researchers at Paradigm suggested that the first socially scalable and pro-MEV LSD could quickly attract the Lindy effect and dominate in a power-law distributed fashion. I suggested that Lido’s growth has been too aggressive such that what should have been a power-law field had become a single-player market with stETH at a dominant &gt;90% of LSD market cap in DeFi. There has been a growing resistance to this stETH dominance both socially and economically. Ultimately, most ETH remains unstaked and more funds are expected to enter in the months ahead. With greater awareness of risk in the market compared to the heady days of 2021, a much more stringent eye will be placed on tail risk scenarios.</p>\n<p>With stETH’s inflexible and inadequate insurance already being siphoned off towards generic ‘treasury’ uses, Lido will find itself unable to safely scale further. It may be the case that stETH has hit its relative peak already. In terms of social barriers to growth, Lido is overly governance dependent with corruptible human-appointed whitelists. Economically, the crashing liquidation cascade and lasting depeg in June demonstrated how stETH in fact has significantly larger centralization and slashing risks relative to other LSDs.</p>\n<p>A single major slashing event at any one of Lido’s node operators will permanently reduce trust in the system–since across large time scales, this becomes a question of when not if, will large investors will be willing to play ball? There is already proof that shaken confidence in wider markets can lead to years worth of yield being wiped away. How much worse would the impact be of a Lido-specific incident? What would the reaction be to mass stETH rebalance towards the red? It may be necessary for the ecosystem to learn this lesson the hard way through a major slashing event, but the pressure remains regardless.</p>\n<p>Even as Lido tries to increase stETH&#39;s LSD dominance through distorted incentives, better alternatives provided by competitors could very well see the market settle back into a traditional Pareto distribution.</p>\n<p>Rocket Pool is already the most tail risk resilient, socially scalable, and MEV friendly decentralized LSD protocol. It makes sense for it to be the one that benefits most. The pre-withdrawal era will also be marked by the 8ETH collateral reduction (LEB8s) and quality of life upgrades, the former reducing collateral requirements to 8 ETH per minipool and the latter providing unique ways by which Rocket Pool provides the best experience for node operators.</p>\n<p>The supply multiplier on LEB8s is sufficient to triple the rETH supply alone. Each set of 16 node operator ETH will produce 48 rETH, whereas previously it would only produce 16 rETH. However, the real significance lies in the fact that it lowers the barrier to entry. Many more people will be willing to bond 8 ETH than 16 ETH, so despite a floor projection of a 3x increase, we can expect even more growth.</p>\n<p>During this time period, there will be a proliferation of quality-of-life improvements, such as the MEV Smoothing Pool (the only way for small node operators to get equal EV to large operators), the Rescue Node, and Rocketarb. Collectively, these exclusive features will draw node operators to Rocket Pool and expand the rETH supply. The MEV Smoothing Pool is an opt-in system where each node operator shares MEV + tips with each other. This gives all participants a much higher chance of getting exposure to long-tail MEV which can often make up a huge portion of returns. An analysis was provided by Ken Smith of the Rocket Pool community here:</p>\n<p><a href=\"https://github.com/htimsk/SPanalysis\">https://github.com/htimsk/SPanalysis</a></p>\n<p>With hundreds of node operators participating, it is a powerful entity in its own right that makes joining profitable for other large entities. This in turn will draw larger players into the ecosystem and expand rETH supply.</p>\n<p>The Rescue Node is a community-led project that would allow any Rocket Pool node operator to take advantage of a secondary beacon node as a fallback. This can be useful during pruning or minor outages. Normally, this would be very tricky and costly to set up as it is an exceptional amount of redundancy, but the Rocket Pool network will soon provide this to all node operators in the network for no additional cost. There are currently some trust assumptions between users and the Rescue Node maintainers, however, the maintainers are all publicly known. Further, rate limits are in place so that users cannot overly depend on the Rescue Node as a centralizing delegate node.</p>\n<p>The direct result of the Rescue Node is that the performance of the protocol overall will markedly increase. There will be fewer instances of user downtime, resulting in higher rewards for rETH. Further, downtime can be very daunting to new node operators. The presence of the Rescue Node makes Rocket Pool a much more forgiving learning environment without sacrificing performance. Even for experienced users, it is a huge QoL benefit knowing that any downtime, planned or not, may no longer have to correspond to lost income. Most importantly, making node operation more accessible for users of the Rocket Pool ecosystem will attract new members and grow the TVL.</p>\n<p><a href=\"https://twitter.com/0xPatches/status/1597704860962795520\">https://twitter.com/0xPatches/status/1597704860962795520</a></p>\n<p>Lastly, Rocketarb is a way to profit off of the open market premium that rETH currently enjoys. The supply of rETH is limited by node operators and the deposit pool is full at 5k ETH. When a new mini pool is launched, 16 ETH worth of rETH becomes mintable at the native asset value. If you manage to mint that 16 ETH worth, you can pocket a 16 x 2-3% profit, or 0.3-0.45 ETH. The Rocketarb contract bundles mini pool creation with the rETH minting and sale so that the node operator is left with a mini pool and a lovely bonus for expanding the rETH supply.</p>\n<p><a href=\"https://github.com/xrchz/rocketarb/blob/main/README.md\">https://github.com/xrchz/rocketarb/blob/main/README.md</a></p>\n<p>This contract creates an incentive to spin up more rETH when there is more demand for the product, which previously did not exist. The opaque value that is generated by excess demand on the open market can now be captured by the protocol as an incentive to grow in a healthy way. Therefore, when stETH holders flee to rETH, as has happened many times before, there is now a way to capture that in the form of TVL growth without any inflationary incentives.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/yVwxXYmhTS_eqr2u70o0n.png?height=715&width=1568\" alt=\"https://rocketscan.io/rocketarb\"></p>\n<p>Rocketarb is also a glimpse into the future. After withdrawals, arbing LSDs to restore them to peg will be a very profitable business. The incredible work of the Rocket Pool community has simply found a way to get that benefit before withdrawals are live.</p>\n<p><a href=\"https://twitter.com/marceaueth/status/1593005393692995584\">https://twitter.com/marceaueth/status/1593005393692995584</a></p>\n<p>To draw parallels to another Web3 power struggle, Sushiswap was never able to flip Uniswap despite the fanfare with which it launched. But at the same time, Sushi was also never able to offer a compellingly better product which perhaps explains why it was able to break the monopolist grip that UNI had on dex volumes but make no further progress. It has been established that Lido’s stETH has both social and economic forces pushing against it, with liquidity and Lindy effects propping up its dominance. But with the advent of a level playing field between mature &amp; established players, Rocket Pool’s superior social narrative and higher resilience can push rETH&#39;s market cap over stETH&#39;s. The trendline for primitive DeFi assets is toward maximal security. This is how rETH will flip stETH.</p>\n<h3 id=\"the-orange-migration---withdrawals\">The Orange Migration - Withdrawals</h3>\n<p>In the next six months, it is likely that withdrawals will be live and rETH will gain three massive unique tailwinds: solo staker migration, the flight from stETH/cbETH, and liquidity mitigation.</p>\n<p><a href=\"https://twitter.com/vdWijden/status/1595386746786779137\">https://twitter.com/vdWijden/status/1595386746786779137</a></p>\n<p>The first group of users who will be able to transfer to Rocket pool after withdrawals are solo stakers who deposited before Rocket Pool&#39;s later launch. There is a strong economic argument for converting a single, regular validator into multiple minipools, at least four for withdrawals, and earning commission on liquid staking deposits. Someone who had 32 ETH staked could migrate and get exposure to 128 ETH. The Smoothing Pool is another benefit only available to Rocket Pool node operators which not only reduces the volatility of rewards but also increases the average return for most participants. Quality-of-life upgrades will continue to roll out.</p>\n<p>It is estimated that approximately 30% of the existing stake is managed by these early node operators. Most of this ETH was launched before Rocket Pool went live and certainly before it could be considered battle-tested. Despite so much ETH being staked before Rocket Pool was ready, Rocket Pool node operators still account for 15-25% of all node operators on the network. An increasing number of new node operators are choosing to use Rocket Pool instead of vanilla or other services. As such, it is reasonable to think that a large chunk of users who had staked before Rocket Pool launched will want to migrate over. The migrants will mainly impact the node operator supply, which has a magnified effect on TVL growth. If 10% of the ~4.2 million ETH early solo staked ETH migrates to LEB8s, then rETH capacity would increase by nearly 300%. The protocol would be able to handle 1.7 million rETH TVL. This capacity is going to be needed given the second group of migrants.</p>\n<p>The second group of migrants will be from stETH and cbETH. Being able to redeem LSDs for ETH without having to execute a secondary market sale means investors can instantly adjust their risk allocation without worrying about liquidity. Had this facility been available during the June 2022 collapse of 3AC, Lido’s TVL likely would have collapsed immensely.  As it was, the significant price drop of stETH vs ETH and concerns about slippage for larger portfolios acted as two disincentives to discourage investors from selling their stETH position at a loss. I expect several cohorts each with different reasons to go through this transition; a moral transitioning, as a response to a slashing event or hack depegging steth, or perhaps yield-seeking.</p>\n<p>Finally, and perhaps most importantly, withdrawals will cause the cost of maintaining adequate LSD liquidity to plummet, removing one of Lido’s strongest advantages. A natural arbitrage opens up via the purchase and redemption of a mispriced LSD. Rocket Pool already demonstrates the value of this in the Deposit Pool where rETH mints and burns help keep DEX prices stable. Liquidity can be concentrated tightly around the NAV with strong assurances that arbitrageurs will keep the peg close.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/0s5s4s8qlHjHz64ZhB0P_.png?height=356&width=677\" alt=\"taken from the #events tab of the Rocket Pool discord\"></p>\n<p>If the opportunity for this type of arbitrage is supported by Ethereum itself, the cost of liquidity will be greatly reduced, leveling the playing field for all staking protocols. Suddenly, the liquidity Lido gets from its multi-billion dollar Curve pool, which costs $20MM a month to maintain, will be available to everyone at no cost through the exit queue. MEV bots will patrol LSD prices looking to squeeze out any ETH for themselves. The type of liquidations that previously saw the price of stETH spiraling would now simply create a feast for arbitrageurs as market prices barely budge. The Lido permissioned operator set can accept new Ethereum deposits as quickly as the Ethereum network allows. However, just as Lido was a black hole for ETH, it may eventually follow a black hole&#39;s life trajectory and spew out all of that ETH in the future.</p>\n<p>Once the ability to enter and exit an LSD position becomes trivial, expect a surge in Lido’s competitors being integrated in DeFi apps. Further, and perhaps more nefariously, the drop in baseline risk level for all LSD tokens will spur on leveraged staking. Every LSD will be readily folded like icETH, packaged leveraged stETH. While these tokens promise incredible returns, they introduce huge risk to markets. The exit queue is not infinite and it is possible that we may see a second, larger rush in leveraged staking. If this is to pass, the fallout and dust will settle in favor of the most resilient asset.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/S6YNynw3JTlGndQv8XuNO.png?height=848&width=954\" alt=\"icETH leverages stETH against ETH to increase staking yield\"></p>\n<p>In fact, the first cases of liquidation from stETH deppegs are starting to creep up as novel leverage strategies develop. For example, the Gearbox protocol has created generalized leverage. One user used this generalized leverage to go long on stETH/ETH 8x. A slight depeg on stETH mixed with some oracle technicalities led to this user’s position being the first on the Gearbox protocol to be liquidated. Greed will push users to chase what appears to be safe returns by leveraging LSD tokens. The LSD that is most resilient will survive this.</p>\n<p><a href=\"https://twitter.com/gearbox_intern/status/1587957235703025664\">https://twitter.com/gearbox_intern/status/1587957235703025664</a></p>\n<h3 id=\"the-orange-future---post-withdrawals\">The Orange Future - Post-Withdrawals</h3>\n<p>The far future for Rocket Pool is exciting to consider. The pathway to a world dominating protocol is already clear and they consist of four major upgrades that will occur sometime after Shanghai. These upgrades, in vaguely the order we may see them go live are native staking-as-a-service (StaaS), Eigenlayer, forced exits, and distributed validator technology (DVT). Together, these upgrades will allow Rocket Pool to scale into many millions of ETH staked.</p>\n<p>One of the most prominent critiques of the Rocket Pool system is that it forces node operators to speculate on RPL. Many home stakers partake because they are skeptical of other tokens and so this is a large barrier. Further, holding RPL becomes a problem for some larger institutions. As such, the Rocket Pool team devised an upgrade that will introduce super nodes that can create novel relationships between the node operator and providers of ETH and RPL collateral. It will introduce an in-protocol way to separate the risk of three tranches: node operation, ETH, and RPL. Rocket Pool stands to greatly expand its total addressable market (TAM) since many individuals express the desire to only stake ETH, not wanting RPL exposure, or vice versa. The StaaS design will allow third party groups like the Node Operator Association to onboard these users and shift the burden of RPL collateral.</p>\n<p><a href=\"https://twitter.com/apolynya/status/1602875819751186432\">https://twitter.com/apolynya/status/1602875819751186432</a></p>\n<p>Eigenlayer represents a novel idea – stake rehypothecation. The general idea is to add new slashing conditions to a node’s ETH stake based on added tasks, such as oracle duties or data storage. This would allow markets to reuse the incredible amount of economic security locked in the deposit contract. The Eigenlayer team is working on a data availability layer for an initial product design, but other forms of implementation are being explored. In a sufficiently advanced market, a savvy node operator may be able to earn several times the native ETH yield by taking on additional burdens.</p>\n<p><a href=\"https://twitter.com/Jasper_ETH/status/1577132020106289152\">https://twitter.com/Jasper_ETH/status/1577132020106289152</a></p>\n<p>The future could have many bespoke setups, with some node operators doing pure ETH staking and others having a dozen extra responsibilities. This creates a challenge for centralized operators such as Lido and an opportunity for permissionless ones like Rocket Pool. For Lido, there will likely need to be a drawn out governance process centered on which Eigenlayer applications are safe to use and present an acceptable level of risk for the DAO. The APR of stETH will suffer as a result. For Rocket Pool, users will likely be free to experiment.</p>\n<p>Rocket Pool and Eigenlayer continue to communicate on how the two protocols can be incorporated in a way that makes profit sharing with rETH simple. This relationship between Eigenlayer and Rocket Pool is mutually beneficial. The Rocket Pool ecosystem is the most widely distributed node operator market available on top of Ethereum. Any Eigenlayer product that wants to immediately have strong decentralization can target Rocket Pool operators.</p>\n<p><a href=\"https://twitter.com/sreeramkannan/status/1595863297236271104\">https://twitter.com/sreeramkannan/status/1595863297236271104</a></p>\n<p>Another future upgrade is forced exits. Currently, there is no way for Rocket Pool to force a validator to exit. This is a limitation of the Ethereum spec and will require an EIP to change. Forced exits would be a useful feature for all LSD protocols to increase decentralization and safety. As such, it is being worked on collaboratively. Forced exits would help prevent bad actors and increase the value retained when actors do go rogue. As a result, the inclusion of forced exits may allow Rocket Pool to drop the bond requirement all the way to 2 ETH. This is a massive change. For perspective, if every current node operator switched to 2ETH pools, that would give Rocket Pool the capacity to onboard 15x as much rETH, or 2.4 million rETH. Currently, 16 node ETH creates 16 rETH, but with forced exits, 16 node ETH will accommodate 240 rETH. Without considering any increase in node operators, this upgrade alone will allow Rocket Pool to compete on the biggest stages.</p>\n<p>The drop in collateral from 16 ETH to 2 ETH will also signify a massive increase in the node operator base. If this drop amounts to even a 4x in the node base, despite being 8 times cheaper, <strong>then Rocket Pool will scale to 10 million ETH.</strong></p>\n<p>Last but far from least is distributed validator technology (DVT). In the past, I have been critical of DVT because I do not view it as a means of solving centralization issues. The long term plan for Lido centers on DVT, wherein my disdain originates. The premise of DVT is that several ‘committee’ members each run a node. If one node goes down for some reason, nothing happens as only some consensus threshold of the committee is needed to maintain uptime. There are huge benefits that can be drawn from this. DVT can prevent most losses from downtime or slashing, however, there are important things DVT cannot do.</p>\n<p>DVT does not mitigate centralization in and of itself. For example, if the Lido network’s ~30 node operators began operating on a DVT committee, the stETH token would have much better uptime and diminished tail risks, but the centralization and some tail risks, like smart contract risk and quadratic leaks, remain. Further, DVT in relation to MEV is a field of open exploration. One of the major reasons a bond exists for Rocket Pool is so that there can be some recompense for MEV theft. If it was trivial to steal MEV at the cost of a bond, it may be +EV to spin up mini pools and abandon them after receiving large MEV payouts. These issues must be resolved before it can be adopted by a large protocol.</p>\n<p>For Rocket Pool, DVT represents exciting technology that may enable an even lower bond and increase the overall effectiveness of stakers. Home stakers in aggregate tend to have slightly lower average uptime than institutional stakers, often due to unstable internet or power, but DVT would even the playing field greatly.</p>\n<p>Collectively, the post-withdrawal era will ensure Rocket Pool can scale to any demand level needed and ensure that node operation as well as liquid staking is competitive in the wider ecosystem. This timeline shows that one of Rocket Pool’s greatest criticisms, that it is capital inefficient, is moot. Rocket Pool can, and will, scale to take on Lido and Coinbase.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/puINDhmL9DTg0fUShQD0T.png?height=779&width=1570&size=medium\" alt=\"https://www.rated.network/?network=mainnet&amp;view=pool\"></p>\n<h2 id=\"5---a-new-challenger-arrives\">5 - A New Challenger Arrives</h2>\n<p>The history between Lido and Rocket Pool is well established by this point. However, the LSD ecosystem is rapidly expanding and a new generation of participants is hot on the heels of stETH and rETH. In this section, I will break down the other major LSD tokens that I think will fight for large chunks of the total stake. These tokens (cbETH, frxETH, and osETH) all exemplify different approaches to staking and have their own faults. I conclude by pointing the critical eye inwards and discussing areas Rocket Pool could improve in.</p>\n<h3 id=\"the-drain-of-cbeth\">The Drain of cbETH</h3>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/8Ak0E-fX9Ve8ATp0ZmnyR.png?height=662&width=1539\" alt=\"https://info.uniswap.org/#/tokens/0xbe9895146f7af43049ca1c1ae358b0541ea49704\"></p>\n<p>Hasu and Georgios argue that the domination of centralized exchanges (CEXs) in the Ethereum staking market can only be avoided if a competitor focuses on rapid scaling. Lido has interpreted this to mean prioritizing growth over decentralization. But curiously, the release of Coinbase’s cbETH LSD has actually provided a helpful demonstration of how, in the absence of incentives, market participants will gravitate to the most decentralized option. Currently, cbETH is used primarily on Uniswap. Approximately $6 million is locked in the cbETH/ETH 0.3% and 0.05% pools, a reflection of the low daily volumes since cbETH has a total value many orders of magnitude greater than this TVL. Uniswap is staunchly permissionless and easy to use so it is logical that this is where most cbETH has ended up. Outside of Uniswap, adoption has been poor. Curve, the dApp where stETH is most dominant, used to only have a few hundred cbETH in its cbETH/ETH pool. It has since grown to a still meager 2000 ETH TVL with the help of some incentives from the Curve protocol. This shows that without a strong liquidity incentivization campaign or a supportive public ethos, tokens do not naturally gain deep liquidity.</p>\n<p>The general illiquidity of cbETH has a myriad of effects. It has made impossible the safe use of cbETH in lending platforms like Euler, Maker, or Aave. The image below is taken from Euler’s frontend. It shows that cbETH would depend on a very insecure Uniswap v3 TWAP oracle. This oracle is easily attacked and any debt positions built around cbETH could be liquidated by malicious actors. A robust oracle, like one provided by Chainlink, requires high volume across multiple CEXs or DEXs. Further, lending platforms that want to be able to safely liquidate positions require tokens that have a large amount of inactive liquidity. The Curve stETH/ETH pool is the best example of this. The pool has several billions USD worth of liquidity but only sees some 10s of millions USD in trade daily. The excess buffer is useful in blackswan events when large amounts have to be sold, like during the 3AC capitulation.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/8SUajq1pTmK2DLnbi03zT.png?height=447&width=1588&size=large\" alt=\"https://app.euler.finance/\"></p>\n<p>As mentioned previously, illiquidity and the depressed prices that result, can trap holders and prevent them from selling. Those that do sell are likely selling to arbitrageurs as there are no productive uses for cbETH and competitors are higher earning. Currently, 1inch, a popular DEX aggregator, shows that only 2000 cbETH can be sold for ETH before incurring 1% slippage. The same transaction would only have 0.4% slippage for rETH. With limited yield opportunities and liquidity, most cbETH buyers on uniswap are likely holding the token for the arbitrage that will be available post-withdrawals. Thus, a pipeline is being constructed.</p>\n<p>Over time, existing or new Coinbase users will at some point want to exit their positions to cbETH. This could be due to ETH price collapse or a desire to explore DeFi. Both of these users will quickly realize that their best bet is to sell their cbETH to an arbitrageur. More and more cbETH will end up purchased with the explicit purpose of being burned. This huge cohort of buyers has no need for DeFi integrations and so are happy to sit on their illiquid cbETH that they bought at a discount and accumulate until withdrawals create a pathway for any LSD to be converted into ETH on peg. There will not be a reshuffling between small holders and big whales like the ecosystem saw with stETH during the 3AC crisis. There will be a unidirectional current pulling cbETH rapidly towards the burn address.</p>\n<p>Consider the wallet 0x7f507739b6242B048Be9185cf462BE816b8eFf1f, which has accumulated 1% of all circulating cbETH. This wallet has slowly migrated from wstETH to cbETH to buoy the token and consolidate for withdrawals. The owner is taking a risk, of course. There is a possibility that Coinbase will see the writing on the wallet and try to stop the damage. Instead of allowing these sleuthy cbETH whales from mass exiting, which would greatly hurt Coinbase’s cash flow, Coinbase may limit or even block cbETH redemptions. Such a move, exceedingly unlikely as it may it be, would have devastating effects on the cbETH/ETH peg as all confidence is lost. A bank run scenario may become possible. This is the gamble of engaging in the opaque world of CeDeFi.</p>\n<p>In conclusion, though it may seem scary to see how quickly cbETH supply has grown, it does not represent an existential threat to DeFi. In fact, DeFi has roundly rejected cbETH and, if what I believe is correct, DeFi is playing Coinbase into a long con – slowly accumulating cbETH to drain away Coinbase’s stake after withdrawals. The course of this grand arbitrage has sucked away liquidity, crippling any hope cbETH had of gaining DeFi adoption. Unless Coinbase makes an active stance to promote the DeFi usage of cbETH, it appears that DeFi will remain the battlegrounds of Lido and Rocket Pool.</p>\n<h3 id=\"frxeth---liquidity-vs-design\">frxETH - Liquidity vs Design</h3>\n<p>One of the most recent entrants to the LSD landscape is frxETH from the FRAX ecosystem. FRAX, a stablecoin, came to prominence through the FRAX DAO’s aggressive acquisition and use of liquidity-directing tokens (veCRV/vlCVX). The DAO attracts users to mint their stablecoin by creating profitable liquidity provision strategies for FRAX holders through the voting power of their DAO tokens. This model has clear merits. Pre-withdrawals, all major LSD tokens have to create liquidity and usually pay to rent it. By owning these liquidity-directing tokens, FRAX sets itself up to avoid the capital expenses incurred by competitors such as Lido. Since FRAX has had such great success with this model for stablecoins, the DAO has decided to venture into a new kind of stable, an LSD pegged to ETH.</p>\n<p>The frxETH tokenomics are unique in the world of LSDs. Most tokens either rebase for rewards (stETH) or passively increase in value (rETH). FRAX went a different route. The frxETH token itself does not accrue any staking rewards. In order for token holders to access the APR earned by the ETH locked in validators, users must deposit the frxETH token into a staking vault. All the rewards earned by the protocol’s staked ETH, minus fees, are then distributed to whatever users staked in that vault. Any users holding frxETH, not staking in the vault, will receive no rewards. Users are forced with a choice - either pursue yields in DeFi with frxETH or earn staking rewards in the vault.</p>\n<p>The goal here is valiant. This binary option will force the staked frxETH APR to be higher than any other LSD token simply because the DAO is pitting its own LPs against its own stakers. If the APR to LP in the Curve pool, the current main DeFi integration, was a hypothetical 20% while the staking vault reflected a 7% APR then users are likely to naturally migrate out of the vault and into the Curve pool. At equilibrium, the APR of the leading DeFi frxETH integration should come close to parity with the staked frxETH return, potentially over 10%. In theory, holders of other LSD tokens would see this yield and convert.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/jykNLTxBPT4PMBrqgIbT5.png?height=633&width=800\" alt=\"https://dune.com/struct3r/frax-frxeth\"></p>\n<p>Now the catch. First off, this model is counterintuitive to some core DeFi principles, namely those of capital efficiency and composability. This model is purposefully not capital efficient. FRAX could have incentivized a yield-bearing token such that the liquidity providers earn LP rewards along with the staking rewards. By forcing users to choose one or the other, the cost ends up being higher. Take for example a long-term hypothetical where the staked frxETH token is yielding 9% while the frxETH token in Curve earns 11%. The Curve liquidity providers would not provide liquidity unless the incentives beat out the staking rate, otherwise, they would migrate to the staking pool. This has to be paid for - either in incentives or by directing liquidity. The cost of paying LPs in this example to maintain the same level of liquidity would likely be dropped by ~30% since the Curve pool could have been 14% APR (assuming an 6% ETH rewards rate) had those ETH rewards not been redirected. As the TVL in the ecosystem builds, the cost savings become more and more important.</p>\n<p>Another confusing element to frxETH is that the staking vault <em>is</em> a liquid token, sfrxETH. The FRAX DAO is currently choosing only to incentivize the frxETH pool. Ostensibly, savvy DeFi buildoors will want to integrate sfrxETH as the actual ETH reward-bearing token. This will put FRAX in a similar situation to the one Lido faces in trying to migrate liquidity from the stETH token to the wstETH token. Having to support an ecosystem of two tokens is going to be more expensive than just one. As discussed earlier, financing liquidity for a top tier LSD can cost millions of USD/month. As such, even though FRAX is starting with a large capacity to incentivize liquidity, it is doing so on an inherently less capital-efficient system. For a stablecoin provider, this is worrying for a second reason.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/5g3_IWSxoG0k-F0_FXa8Q.png?height=662&width=1173\" alt=\"https://snapshot.org/#/balancer.eth/proposal/0x16fd7c010fa1d7318fab383a1a6cb59471dda824b53a1026cd197eea3890dcb4\"></p>\n<p>The costs of incentivizing frxETH are twofold. First, it is capital inefficient compared to other LSD tokens in order to create a facade of higher APRs (LSD APRs when including their DeFi strategies ought to be even with or higher than staked frxETH). Second, and more importantly for FRAX, liquidity tokens used to incentivize frxETH cannot be used to incentivize the FRAX stablecoin that underpins the whole FRAX ecosystem. By shifting incentives from FRAX base pairs towards frxETH pairings, the strength of FRAX is weakened. Liquidity is a zero-sum game and FRAX are using the liquidity power they have on an inefficient schema.</p>\n<p>In the post-withdrawal world, the liquidity-directing tokens that FRAX has accumulated suddenly will become much less valuable for LSD tokens. The exit queue will enable large orders to navigate outside the open market without damaging the LSD peg. Thus, FRAX will have lost its major edge in the LSD token wars. At this point, FRAX’s position as a very centralized staking provider will come into focus. Currently, the FRAX team runs all of the validators and there are no concrete plans to decentralize.</p>\n<h3 id=\"shadowy-super-stakewisers\">Shadowy Super Stakewisers</h3>\n<p>The most difficult LSD to analyze is one that currently does not exist – osETH. Stakewise is a staking service that currently operates with a permissioned set of nodes and a two token model. This is being completely redone for Stakewise v3, slated to launch sometime in 2023. In this release, Stakewise is challenging Rocket Pool’s dominant position over solo node operators by becoming permissionless. Users will be able to spin up validators and mint osETH against said validators in a fashion reminiscent of loan-to-value calculations. Many of the fine details about osETH have not been released and so this section should largely be taken as conjecture.</p>\n<p>The Stakewise v3 platform will allow individualized debt markets. The benefit of this structure is that risk can be managed on a case by case basis and so the previously lacking insurance cover provided by Stakewise may improve. Further, depending on the ratio for LTV that Stakewise allows, it may be possible to start running a validator with as little as 4-8 ETH. However, many difficulties lie ahead for the Stakewise team.</p>\n<p>The elephant in the room is that the SWISE team will have to migrate all their liquidity from sETH2 and rETH2 into a single token – osETH. A complete rebrand and tokenomic redesign is a costly venture that will force them to start over on integrations. DeFi governance is slow and this can be a time-consuming process. Another issue is that Stakewise is going to hope for a strong migration of solo stakers. This cohort, however, is notoriously risk-averse. Rocket Pool node operator registration is a good proxy of this, as the period following launch did not see a surge in registrations. Many solo ETH stakers will likely want to see mainnet resilience without any hacks before trusting funds to the protocol. It may be the case that most of the osETH supply is minted by Staking as a Service providers using Stakewise. However, it is not clear how these StaaS groups will draw demand.</p>\n<p>Concerns also remain around the reward schema. MEV stealing is a problem that has driven much of Rocket Pool’s insurance discussions. It is unclear how Stakewise will account for this issue in extreme LTV vaults. If they do solve this issue, they will provide a compelling alternative to Rocket Pool in the permissionless staking ecosystem.</p>\n<h3 id=\"reflections-of-a-rocketeer\">Reflections of a Rocketeer</h3>\n<p>The Ethereum ecosystem participants will ultimately be the ones to decide which LSD deserves to scale. In the pursuit of intellectual honesty, I will now explore some legitimate criticisms of the Rocket Pool protocol in the hopes of spurring even better iterations.</p>\n<p>One of the earliest criticisms of the protocol was that Rocket Pool is an attack vector on Ethereum consensus. Any agent that wanted to attack Ethereum’s consensus broadly could double their attacking power by launching Rocket Pool mini pools instead of solo validators. With LEB8s this vector is further amplified. One limitation of this issue is that minipools can only be launched if there is ETH in the deposit pool. For this attack to play out, two difficult conditions must be met. Primarily, this attack would require a long period of time to execute as the deposit pool would have to be repeatedly filled. It would additionally require that Rocket Pool scale well past the previously-discussed caps. As such, this criticism, while true, is unlikely to be relevant.</p>\n<p>A criticism that I’ve dealt with in detail now is that Rocket Pool is capital inefficient, cannot scale, and has distasteful tokenomics that require exposure to RPL. As discussed in section 4, rETH has a clear pathway to scaling up into the millions of ETH staked with planned, iterative upgrades. These will include a design overhaul that would allow users to enter with only ETH or only RPL exposure.</p>\n<p>There is significant discourse about reducing reliance on the core developer team and the oDAO. Currently, the majority of the team lives in Australia. Further, a majority of the oDAO resides in the US or EU. Both the core team and the oDAO have the power to wreak havoc on the protocol if corrupted and so the transition away from them is of paramount concern. The oDAO cannot be dissolved until certain changes are made in the core Ethereum spec such as better communication between the execution and consensus layers. The community is already brainstorming ways to migrate all of the oDAO duties to the decentralized protocol DAO, as shown in the table below.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/umHvNx8yrraAgJ1kQvwJ4.png?height=738&width=620\" alt=\"\"></p>\n<p>Another criticism of Rocket Pool’s governance is that node registrations are not sybil resistant, meaning one person could register multiple nodes. Currently, voting is done based on the quadratic root of effective RPL staked per node. A malicious agent could spin up many nodes and launch one mini pool on each in order to maximize their voting power in future votes. Such an attack has not yet been discovered, however, it may be hard to notice until after a vote has been compromised. As such, discussions have been ongoing about moving towards a linear scaling method until a more robust sybil mechanism is introduced.</p>\n<p><a href=\"https://dao.rocketpool.net/t/proposal-switch-to-linear-voting-power-to-resist-attackers/1213\">https://dao.rocketpool.net/t/proposal-switch-to-linear-voting-power-to-resist-attackers/1213</a></p>\n<p>Additionally, rETH holders lack a say in Rocket Pool governance. It is possible to become a delegate without being a node operator and champion rETH, however, the tables are stacked against this type of behavior. While the best governance is no governance, until that is possible, rETH interests should be represented more.</p>\n<p>A pessimistic view of Rocket Pool is that it is introducing a huge swath of people to node operations who have no business being node operators. Champions of professional staking sometimes see hobbyists as irrational. By lowering the barrier to entry, some would argue that we increase the risk to Ethereum by increasing the number of node operators who do not know what to do when things go wrong. The Rocket Pool Smart Node makes set-up incredibly straightforward. This ease of entry can be worrying to staking professionals because it allows people who have never run servers to now protect Ethereum.</p>\n<p>Keeping the network resilient despite the ease of access desired is a challenge that Rocket Pool is happily taking on. Even a complete novice can set up and effectively run a full node with the support of the Rocket Pool guides and community. The Rocket Pool Discord server is one of the most active in the ecosystem as a bastion of full-time node support and Ethereum knowledge. Additionally, the Rescue Node will reduce the impact of user error so the network does not suffer. DVT in time will only accelerate this process.</p>\n<p>Further, I find this criticism resoundingly anti-Ethereum. The long-term vision of Ethereum idealizes a world in which millions of light client nodes running on personal devices all contribute to the network. In this world, the barrier to entry must be incredibly low. Do not listen to the staking professionals – Ethereum staking will (and should!) only get easier while maintaining utmost security.</p>\n<p>Extreme security aficionados may have reservations about Rocket Pool. Currently, a limitation of the smart node is that it cannot be used on an air-gapped device for key generation. Further, there is always inherently more risk to Rocket Pool as an additional set of smart contracts over and above the Ethereum deposit contract – however, this same risk exists for all LSDs.</p>\n<p>Lastly, there is the attack that Rocket Pool is fighting a pointless fight. This cohort might argue that the hard work Rocket Pool has put into creating a highly tail-risk resilient LSD is moot because stakers only care about chasing yield. I believe this criticism paints the multi-billion dollar LSD ecosystem in an uncharitable light. For this thesis to be true, either the value of risk must approach zero or investors are in for a rude awakening. The former case is hard to imagine in the near future – there are too many avenues of risk to solve in any LSD. If the latter is true, that investors are casting a blind eye towards the ever-growing risks presented by more centralized LSDs, then it will likely be by their own painful realizations that risk gains value once more. As long as there are traders over-leveraging insecure products, there will be events that punish the yield seekers and reward the cautious. If the LSD ecosystem is to mature into the next-generation bond market, risk must be incredibly relevant to value.</p>\n<h2 id=\"6---the-underappreciated-art-of-counterparty-tokenomics\">6 - The Underappreciated Art of Counterparty Tokenomics</h2>\n<p>Lastly, I want to touch on the broader tokenomics around LSDs. There is an important tension that exists between the protocol utility/governance token (LDO, RPL, SWISE) and the LSD token itself (stETH, rETH, sETH2). This tension is ignored by most protocols, but is fundamental to a sustainable staking protocol. All staking protocols are two-sided ventures; most simply opt to centralize one of the sides. I will discuss LDO’s fee switch and RPL’s collateral system.</p>\n<p>As a means of deriving sustainable value, the fee switch is insignificant and will perpetuate the dangerous elements of LDO governance. Practically, the fee switch is soft capped at 5% of staking returns, since the other 5% has been guaranteed towards the elite node operator set. This already hints at the problem as a small core group of operators is due the same rewards as the entire DAO. There is an inefficient alignment as the node operators seem to be extracting too much value. For that 5% to be worthwhile, LDO will have to be at a maximum of one-twentieth (1/20) of the market cap of stETH, and not deviate. If LDO/ETH drops, your existing LDO stake will be worth less. If LDO/ETH increases, your stake will be worth more, but the rewards will be a smaller percent gain. In the vast majority of cases, it appears that holding stETH would be more rational for token holders because of this hard cap on potential fee earning. There is no unique value added, other than freely accessible governance, to LDO.</p>\n<p>In the fee switch design, the protocol token acts as a pure rent extraction mechanism and does not serve to align incentives. This has already become problematic as greed pushes DAO governances to distribute fees irrationally. This perhaps is already taking place as LDO has capped its insurance pool and opted to redirect those funds toward the treasury. This is not a diversion for direct rent extraction, however, it is emblematic of the type of behavior that simple structure DAOs tend towards.</p>\n<p>The Rocket Pool design does respect the tension between the protocol token holders and LSD token holders. Node operators are required to post RPL bonds in order to service the rETH demand and spin up minipools. This enables both a permissionless node operator set and ties the growth of rETH to RPL. There is no protocol treasury nor protocol commission so there is no impulse towards rent extraction broadly. Further, Rocket Pool recognizes that governance ought not to be open, as the desires of rETH holders require protocol alignment to be maintained. Thus, only RPL that is staked as a bond can be used in governance. This RPL does have a unique value add as both a license to collect commission and as collateral in case of a severe loss. This protocol alignment and lack of an extraction mechanism on top of a more capital-efficient system make the RPL system far more conducive to long-term survival.</p>\n<h2 id=\"7---conclusion\">7 - Conclusion:</h2>\n<p>The team behind Lido served an important role. The research Paradigm presented suggested that whatever entity was able to quickly and efficiently capitalize on liquid ETH staking would become wildly dominant. If the choice was either Lido exists or all Lido&#39;s ETH was split between Coinbase, Kraken, and Binance then clearly Lido&#39;s existence was net good. However, it is no longer the early days of the Beacon chain. The utility that Lido&#39;s stETH has offered to the ecosystem has peaked and now it is time to transition towards Rocket Pool and competitors. The actions that Lido took to maximize growth were all one-time affairs and will soon be rendered obsolete.</p>\n<p>In this paper, I began with an overview of the liquid staking ecosystem. In it, I described the near monopoly Lido has on the LSD market and how it extended beyond just a power law dynamic. The natural balance of power had been manipulated by Lido’s liquidity incentive campaign, one of the largest in all of DeFi. However, the golden age of Lido is over now as both the power of these incentives and the gap in DeFi are diminishing. I make the bold claim that rETH will flip stETH&#39;s market share and begin to outline the social and economic reasons for believing so.</p>\n<p>In the social world, stETH has already hit critical mass and attracted the ire of core ETH developers. I present 4 major arguments; the system is governance attackable, the fee distributions are volatile, the DAO and its operators are multichain, and the validator registry remains a powerful and centralized carrot/stick. In terms of economics, I detailed the rETH and stETH peg histories as a means of understanding the market implied risk. This risk I then break down into execution risk, centralization risk, and tail risk. The major point of this section is that rETH is engineered to be resistant in extreme scenarios which is the ideal trait for a base layer asset.</p>\n<p>After presenting these stETH headwinds / rETH tailwinds, I give my projection for how the shift in power will proceed. Major accelerants will be full rETH DeFi integration, a major CEX/Lido slashing event, enabling of withdrawals, and reducing collateral requirements. The post-withdrawal era will see Lido’s greatest asset, its powerful liquidity mining campaign, become nerfed as the exit queue reduces the costs that protocols will have to pay to maintain liquidity.</p>\n<p>With the case against stETH established, I shift focus toward the newest challengers in the LSD space. Starting with cbETH, which has quickly raced to the second most dominant LSD, I point out that there is no DeFi adoption and that cbETH may end up as a stepping stone for users to migrate towards rETH. Next, frxETH, by FRAX, is built on a capital inefficient system wherein the staking rewards are kept separate from the liquidity providers. I provide some conjecture on a future rival, osETH of Stakewise v3. This token aims to challenge Rocket Pool on permissionless node operators, however, the product is not yet live and will require a complete protocol reboot – no cheap, quick, or easy task. I conclude the section by taking a step back and looking at Rocket Pool itself through a critical lens.</p>\n<p>Lastly, I provide a short description of why the fundamental models behind RPL and LDO are different. I suggest that LDO&#39;s endgame is just a stETH wrapper giving users no unique value, not even governance, whereas RPL adds value to the system by functioning as collateral. These divergent models give LDO a clear value ceiling, but not for RPL.</p>\n<p>Why does this matter? LSDs are going to be an intrinsic part of Ethereum. Staked ETH will be the future bond market. If an LSD becomes too dominant, it can become an attack on the host chain. The asset that propagates and survives will be the one that is resilient in extreme cases just as Ethereum is. Rocket Pool has been building towards that future since 2017. It will not be the one that starts with a manipulated early head start or the one designed to maximize yield at all costs. The invisible hand of decentralization will test market participants. Today, people are free to run validators in any country. This may be a luxury of the moment as nation-states have not set their target on Ethereum yet. When that day comes, LSDs will not be the reason Ethereum fails. rETH is the path forward. You can choose to ignore it or bet against it, but rest assured, the Orange Cascade is coming.</p>\n<h2 id=\"8---postscript-ftx-fallout\">8 - Postscript: FTX Fallout</h2>\n<p>Following the merge, LSD pegs all quickly converged back towards parity. rETH held consistently at a premium during this process. Suddenly, the stETH/ETH ratio was where it was prior to the 3AC capitulation. Is this deserved? Has the risk left the ecosystem or has the rush of new stake post-merge combined with a dearth of yield opportunities obfuscated the risk Lido poses once more?</p>\n<p>FTX is dead. Volatility and calamity are crypto’s best friends. Thus, it should come as no surprise that the markets have been rocked yet again with cascading liquidations hitting most DeFi markets. The value of the SOL token has been cut in half in days. Many lenders, institutional and unsuspecting retail, are now bereft of their assets. For an asset aiming to be the base layer of DeFi, the market capitulation we experienced should be like a passing breeze. This recent fiasco has proved just the opposite for Lido. I will briefly discuss how the stETH peg held up, what is happening with stSOL, and why contagion is a real threat.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/adZz5VOoUdY4kRz-gixNN.png?height=615&width=926\" alt=\"https://dune.com/sheriffjohnbrown/rpcommunitydashedit\"></p>\n<p>Once again, when the broader market hits a downturn, the stETH peg collapses. This time the losses extended to ~1.5%. It is likely that many leveraged stETH/ETH positions were liquidated in this process as this was the largest single day peg hit since the 3AC cascade. Had this event occurred after withdrawals, Lido would have seen a max exodus of stake while Rocket Pool would have gained stake. While stETH dropped 1.5%, rETH increased its premium against its NAV, signaling how resilient rETH is in the eyes of the market.</p>\n<p>More concerning for the Lido DAO is the performance of stSOL, Lido’s liquid staking derivative for Solana. The entire Solana network has been struggling since the FTX news. Large swatches of SOL have exited or are waiting to exit, degrading the network’s security. At points, stSOL was reported to be trading at -10% on open markets compared to SOL. Volatility for the LSD is not an issue at face value, but this arbitrage opportunity has pushed large sums of SOL into their withdrawal queue. As such, the network is being stress tested and the Lido node operators that run Solana nodes have exceptional duties to attend to.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/17O2-3PT4ThZNR1Su4ZYr.png?height=364&width=747\" alt=\"https://dune.com/pavelm/stSOL\"></p>\n<p>The node operators are shared between all chains Lido operates on. The Solana Lido validators also run Ethereum validators. Perhaps not on the same hardware, but the same teams must manage both chains. The complexities of properly running one validator for one blockchain can be profound. Having to constantly monitor Telegram for updates about the Solana reboot is directly inhibitory to a team’s ability to service other networks. Imagine if the events of the FTX collapse had triggered severe fallout in the Ethereum ecosystem. Would the Lido operators who run both blockchains be forced to dedicate resources one way or the other? Further, Solana may have represented a cash cow for some validators. By abruptly losing a huge income stream, a professional validator may be forced to adjust staffing. As long as Lido continues to diversify across chains, their dedication towards Ethereum will fall and the risk for stETH holders will multiply. Further, it is unclear if the Lido insurance pool extends across every chain. If so, then the security model of stETH is even worse than I have described.</p>\n<p>There is only one LSD that has a value set identical to Ethereum itself - rETH. In the endgame, the social layer rules above all else. When that day comes, the decentralization and security of rETH will push it into the bedrock of DeFi.</p>\n<p>**</p>\n<h2 id=\"\">**</h2>\n<p><em>If you find submirror valuable, please consider donate to wong2.eth to help cover server cost.</em></p>\n","content:encodedSnippet":"analysis of the social and economic headwinds facing stETH, how these headwinds are reflected by market conditions creating tailwinds for rETH, breakdown of the broader LSD market, and the general Rocket Pool bull case\nDisclosure: I am paid a small weekly stipend as Rocket Pool Community Advocate by the Rocket Pool core team and hold a considerable sum of RPL tokens that have been gifted to me over the past few years in support of my contributions. I have a small allocation of both LDO and SWISE tokens.\nI would like to give a special thanks to silvv.eth and Nick Ashley for reviewing and editing this paper with me. A further thanks to all those in the Rocket Pool community who have contributed to this document, whether by providing writing input or by contributing towards something mentioned.\nTable of Contents\n1 - Power is not Law\nThe Monopolist Playbook\n2 - Social Headwinds to stETH Growth\nGovernance Attackable\nRapidly Changing Fee/Incentive Structures\nThe Multichain Dilemma\nValidator Registry\n3 - Economic Headwinds to stETH Growth\nStaking––Risk Free or Risk Fee?\nExecution Risk\nTail Risk\nCentralization Risk\n4 - The Orange Cascade\nThe Orange Creep - Pre-Withdrawals\nThe Orange Migration - Withdrawals\nThe Orange Future - Post-Withdrawals\n5 - A New Challenger Arrives\nThe Drain of cbETH\nfrxETH - Liquidity vs Design\nShadowy Super Stakewisers\nReflections of a Rocketeer\n6 - The Underappreciated Art of Counterparty Tokenomics\n7 - Conclusion\n8 - Postscript\n1 - Power is not Law\nThe Pareto principle, also known as the power law, is a phenomenon that occurs when a small number of individuals or groups control a disproportionate amount of a resource or outcome. This can be seen in many different fields, including economics, sociology, and ecology. For example, the global distribution of wealth is often described using the Pareto principle.\nThe Pareto principle was the foundation of a now-famous research paper from Hasu and Georgios of Paradigm, a Web3 investment firm. Writing about the nature of liquid staking, they argued that Ethereum’s proof-of-stake (PoS) system would be dominated by pools that were socially scalable and delivered the highest possible returns by accepting MEV (Maximal Extractable Value). They argued that a Pareto distribution would result whereby most staked ETH would be controlled either by a centralized exchange, or a less-centralized alternative that could launch first. As the first mover, this entity would have the most time in the market and therefore seem most trustworthy, prima facie. This is popularly referred to as the Lindy effect, with its growing time in the market translating to increased investor trust. Another advantage of being early is that liquidity tends to beget liquidity - liquidity is a lifeblood for protocols, being all the more critical for any liquid staking endeavor as the name suggests. The authors would go on to help found Lido, a protocol that now holds an oppressive ~90% of the Ethereum Liquid Staking Derivative (LSD) token market cap used in DeFi, much higher than the power law might suggest is natural.\nhttps://www.paradigm.xyz/2021/04/on-staking-pools-and-staking-derivatives\nThe Pareto principle only holds true in the presence of some environmental limiting pressure that prevents total ecosystem domination. For example, in a biological ecosystem, the balance between predator and prey populations can keep both populations in check. However, if there is an artificial disruption, such as hunting or the introduction of a non-native species, the ecosystem can collapse.\nThe claim that PoS ETH is already in a power law distribution often skips an important component--the limiting pressure. One can see this limiting pressure exemplified through the growth phases of a wild animal population as modeled by the logistic curve. In the first phase, exponential growth quickly brings the population to an extreme from essentially zero. In the middle of the curve, growth reaches an inflection point and slows as some pressure begins to mount. For predatory species, this may be decreasing food rations from over-predation. The final part of the curve is the approach towards carrying capacity – an asymptotic relationship for the population’s ceiling wherein risk or lack of food inhibits any further growth. Here the species holds a dominant, yet fluctuating, grasp on the ecosystem. Further growth is repudiated as it would diminish resources causing population collapse, which in turn would boost reproduction as resources become plentiful again -- a constant cycle around the steady state. Now, imagine if the counter force could be suppressed or hidden. What would happen to the bacteria population? It would consume with no end.\n\nThe Monopolist Playbook\nI posit that Lido has been artificially suppressing power law dynamics to maintain an unsustainably high proportion of the Ethereum LSD market. The long-term effects of this behavior are simple and inevitable – as the seemingly endless liquidity incentives dry up and the DeFi integration gap lessens, the market’s invisible hand will drive reversion towards a Pareto distribution. The outright dominance of Lido’s LSD token (stETH) should drop as rational actors diversify risk.\nMuch as the US Federal Reserve printed billions of dollars in response to the Covid-19 pandemic, Lido has been rapidly inflating and spraying their governance token (LDO), to the tune of tens of millions of dollars per month. By paying to elevate the utility of their stETH LSD, Lido has been attempting to entrench the first-mover advantages outlined in Hasu and Georgios’ paper. Retail investors, therefore, face a prisoner’s dilemma, with self-interested and profit-chasing actors seeking out stETH’s boosted value despite inherent risks being obscured beneath a flood of LDO incentive payments. Lido’s mask briefly slipped during the 3AC (Three Arrows Capital) collapse in June 2022 when stETH rapidly attracted a risk discount of as much as -6.6% compared to liquid ETH, representing around 18 months of rewards temporarily wiped out. To understand how the materialization of risk through this discount is a symptom of Lido losing its place as the current power law majority player, we have to consider the social and economic headwinds acting against Lido’s relentless quest for total market dominance. I will then describe how Rocket Pool can scale to challenge Lido in a technical sense. This scaling will occur in three distinct phases – pre-withdrawals, withdrawals, and post-withdrawals. Afterward, I will discuss the competitors that may complicate or hasten the process of rETH flipping stETH, focusing on cbETH, frxETH, and osETH.\n2 - Social Headwinds to stETH Growth\nHasu and Georgios lay out the social arguments themselves:\n“One metric that matters for PoS security is how much of the stake is controlled by a single entity. For [centralized] exchanges 15-30%; at more than that, there might be social concerns about power centralization in the Ethereum ecosystem. A decentralized staking pool can control any share of the network, as long as each individual validator in the DAO is not too big and as long as the withdrawal credentials cannot change / be voted on.\nWe have to emphasize how important it is that the decentralized staking pool by that point has shed all of its governance functionality. Neither fees, nor withdrawal addresses, nor the validator registry can be allowed to be changed by human inputs.”\nItalics are not my own, but the emphasis is. In this section, the authors suggest that social limits placed on centralized exchanges may not apply to a decentralized protocol that meets the requisite governance criteria. It is Lido’s failure to meet these very criteria that is actively creating resistance to the protocol’s continued growth and dominance.\nLido cannot have it both ways. They cannot grow like a centralized entity but claim to be a decentralized one.\nGovernance Attackable\nLido now sits at >30% of the network, bigger than the 3 largest centralized exchanges combined, and is still bathed in governance. It seems that, despite their important emphasis two years prior, Hasu and Georgios have now conveniently forgotten gov minimization was a core part of their 2020 paper. In contrast to Lido’s ferocious appetite for growth, steps to “shed all of its governance functionality” have been conspicuously lackluster. An updated dual-governance structure gives voting power to LDO holders and a secondary veto power to stETH holders. But if anything this acts as a distraction to the fact that there have been no real steps taken to diminish Lido’s governance - something that has understandably drawn the ire of some of Ethereum’s influential core developers.\nThe powers that be have been slow to change and give up control. Should individuals within this group become corrupted, they could affect significant negative changes to the core Lido protocol which would then spill over to infect the wider Ethereum ecosystem.\nOne example would be misusing Lido’s outsized control of the Ethereum network for added value extraction, namely through multi-block MEV or reorg attacks. There is already a precedent that these legal but immoral actions are not taboo for a purely profit-driven Ethereum organization, as F2Pool has been known for small-scale attacks on blockchain consensus to increase their own profits. If Lido compels their hand-picked validators to implement these immoral value extraction methods at scale, the credible neutrality of Ethereum itself becomes challenged. This threat of cartel-ization is exactly why Hasu and Georgios placed great emphasis on stating that any protocol with governance control should have a hard upper ceiling on their market share.\n\nReviewing a different liquid staking protocol helps to provide some interesting contrast in governance. Eschewing a tightly controlled and centralized structure, Rocket Pool operates through rough consensus between different groups of stakeholders. Overall protocol direction is driven by a DAO of node operators (the pDAO), with changes then worked on by a team of core developers.\nThe core dev team has demonstrated its fierce alignment to the core ethos of Ethereum in numerous ways. First, the team was willing to completely restart work when the Ethereum core developers changed the staking contract from Casper in late 2018. Further, the team published a statement of intent to implement a self-imposed cap on Rocket Pool’s market share.\nActual implementation is controlled by a second, external DAO (the oDAO), which operates at arm’s length to review and action protocol upgrades. The oDAO is composed of major parties from across the breadth of the Ethereum ecosystem and are strongly aligned by a combination of three ties: a financial bond, considerable social capital, and a natural alignment with the core principles of Ethereum.\nThe quadratic voting power of individuals within the pDAO is linked to both their validator count and a capped amount of the RPL utility token. This means that individuals gain voting power by participating in the network and staking a certain amount of the RPL token, rather than simply by holding a large quantity of LDO tokens as in Lido's governance structure. This makes Rocket Pool's governance more robust and less susceptible to manipulation by a small group of individuals.\n\nThis multi-party governance system provides anti-fragility in the face of attacks. In fact, it mirrors the rough consensus that Ethereum itself follows wherein multiple different parties signal towards the core developers, but no single party could do so in isolation. Rocket Pool’s governance is still nascent, but its methodical and deliberate progress down the pathway toward full decentralization ensures that the protocol is less likely to fall victim to a social attack.\nRapidly Changing Fee/Incentive Structures\nOne of the governance red flags raised by Hasu & Georgios that should lead a protocol like Lido to self-cap is that “Fees… [should not] be allowed to be changed by human inputs.” Contrary to this stance, not only can Lido’s fees be changed, but they are actively being adjusted. While the protocol’s top-line 10% commission rate is steady, the flow of these funds has recently been redirected away from insurance towards a more generic treasury for other uses such as marketing. The fact that LDO token holders voted in this change to arguably strengthen their position while putting stETH holders at heightened risk raises questions about how effective Lido’s governance really is. The ability for Lido’s entire insurance profile to change based on a vote decided by a core group of founders is a distinct weakness.\n\nA related issue is the general infancy of on-chain governance. DeFi tokens act as voting shares without any of the information rights those shares would have afforded to their owner in the traditional finance world. As such, the information asymmetry between those with the most to gain from governance (VCs, other protocols) and those who have the best interests of the protocol at heart (founders, active community members) will result in occasional exploitative governance votes.\nDragonfly, a VC firm, attempted to pass a highly controversial vote to sell LDO from the Lido treasury to itself. Due to a strong social response, this vote failed; however, DAOs cannot rely on someone sounding the alarm every time a vote is secretly malicious. The web of governance is broad and all aspects of the Lido protocol are indirectly affected by each other. As long as the flows of capital remain flexible, the protocol will continue to be the focus of governance exploitation.\nLido’s small group of 30 carefully selected validator companies can be very quick to respond to protocol changes, including unfavorable changes, leaving stETH holders with little time to react. Rocket Pool, by comparison, has a large set of node operators running validators. A benefit of this structure is that any attempt to change the flow of incentives will be slowed by gradual adoption. Take for example the future change to lower ETH collateral in mini pools. Because hundreds of operators will each have to make the decision to upgrade, this process will occur gradually, such that rETH holders can respond. With a set of only ~30 operators, coordinating changes that would change the flow of capital in Lido would occur much faster.\nThe Multichain Dilemma\nOne of the claimed advantages of a permissioned set of corporations running most of Ethereum’s validators is that for-profit enterprises will be more dedicated than home stakers.\nLido’s CTO recently went so far as to claim that “[home stakers] who run nodes for fun will drop them…when it’s no longer fun…If your business [and] career depends on blockchains, you tend to be thoughtful and committed”.\nHowever, the elephant in the room is that many of Lido’s professional validators are providing their services to multiple different chains concurrently. This glaring conflict of interest calls into question just how committed Lido really is to Ethereum.\nhttps://thedefiant.io/lido-under-fire\nIn the case of a widespread technical disruption event that knocks multiple validators offline across multiple chains, it’s unlikely that any professional operator would have sufficient staff resources available to restart all chains simultaneously. An incident in September saw 7,390 of Lido’s Ethereum validators operated by Bridgewater Capital go offline for over eight hours following the pre-planned Bellatrix hard-fork. If response times were so slow for a pre-planned event on a single chain, think how many more hours or even days it would have taken them to recover from a real crisis, and at what cost to their liquid stakers. It also raises the risk of a more profit-focused or centralized blockchain such as Solana offering monetary incentives for prioritized crisis handling. This is akin to a fire department being bribed to respond to fires in one specific neighborhood while the whole city is ablaze. By comparison, the technical difficulties of staking as an individual means that home stakers are far more likely to be dedicated to a single chain.\n\nBut it can get even worse. In a true doomsday scenario where multiple blockchains halt and require a restart, a high degree of coordination is required between the validators. Attempting to do this for a single blockchain is difficult enough, but managing several at once would be all but impossible.\nFurther, the negative effects of multichain validation extend to everyday scenarios too. Every chain a professional validator is responsible for has its own incentive structure. New incentives could be misaligned with old ones or vice versa. For example, becoming the majority validator in two competing chains and causing the smaller chain to fail or underperform is a concern for more centralized, smaller Cosmos chains. As Lido continues to expand across chains with no guiding principles, users must begin to question how aligned Lido is with Ethereum. Meanwhile, Rocket Pool serves only Ethereum, though users are free to run other validators on their hardware.\nValidator Registry\nAnother one of Hasu & Georgios’ governance red flags that Lido exhibits is that Lido’s “validator registry can be … changed by human inputs.” Despite the warning, Lido’s validator registry remains both fully centralized and opaque. It is not a stretch to imagine the possible corruption of Lido’s DAO members for personal gain. Examples might include requiring validators to conduct immoral value extraction at scale or succumbing to pressure to censor transactions. Despite the glaring security risks this poses, there remains no plan for Lido to extricate humans from this onboarding process. In contrast, Rocket Pool remains the only staking service that provides permissionless onboarding for node operators. Anyone can be a node operator for Rocket Pool, thus the protocol is immune to these centralization risks.\n\nFor these social reasons, the broad Ethereum ecosystem has exhibited an increasing pushback to Lido’s dominance. Future investors will be very keen on social risks as DAOs gain power and Lido presents an unparalleled risk.\nAt this point, I would like to step back and make a meta point. Even if an individual disagreed with me that Rocket Pool is superior to Lido in governance resilience broadly as measured through these social vectors, the disparity in market share is unjustified. An individual who valued social risk very highly would have a roughly 50/50 split of rETH and stETH to mitigate risk. The issues of social pressure are most relevant for the market leader. As such, if I am correct about social issues, then rETH has incredible tailwinds, and if I am (moderately) wrong then rETH still has large tailwinds.\nI would argue that while these social factors are significant, they are still ancillary to economic forces. While the online narrative for Lido soured, the 3AC capitulation and ensuing mass stETH liquidation cascade presented, for seemingly the first time, a new element to the stETH market – risk.\n3 - Economic Headwinds to stETH Growth\nMany retail investors have been lulled into viewing Lido’s stETH LSD token as always redeemable for ETH due to the vast liquidity reserves and the token’s history of staying on-peg. As often happens in such cases, this perception was exploited, leading to the price of overleveraged stETH collapsing by as much as -6.6% vs peg. While priced at peg, it takes a significant force to overcome a token’s inertia and cause this kind of drop - in this case the 3AC bankruptcy - but this same inertia means that a return to stability is not guaranteed and can only be accomplished through significant effort.\nStaking––Risk Free or Risk Fee?\nThe various different LSD tokens fluctuate around their peg or reference price. The largest and most persistent discount vs peg is for Coinbase’s cbETH, followed by stETH, and the smallest is Rocket Pool’s rETH, which has consistently traded at a premium since the merge. The persistent stETH depeg can be traced back to the fact that hundreds of thousands of tokens were minted on leverage and subsequently dumped on secondary markets which depressed the price. Because every stETH minted on leverage is just as eligible to be redeemed for ETH, Lido is loosely engaging in fractional reserve banking by facilitating the creation of many more deposit receipts than there are deposits.\nNansen analysis of stETH’s -6.6% depeg event during the 3AC capitulation revealed that most sales came from large wallets whereas buying pressure came from smaller retail investors. Thus, stETH’s price deviation from peg represents the risk discount or perceived likelihood of a bank run on Lido’s ETH deposits from small retail. Thus, the price at which retail became willing to buy up stETH is an accurate reflection of the risk the market associated with stETH.\nLooking at it from the other side, anyone buying stETH shortly before the collapse would have seen around 18 months of allegedly low-risk rewards wiped out in a matter of days - it is important not to undersell how big this depeg is. During this event there were clearly very few individuals who perceived stETH to be a risk-free wrapper on future ETH redemption.\nIt’s worth noting that rETH also de-pegged at the same time, but to a much lesser extent, and also exhibited a quicker recovery. The APR in ETH staking is lower than other avenues in DeFi and as such the losses are more painful as they are much harder to earn back. In such a capital-intensive, low-yield environment, having proper risk management is crucial. Fortunately, the market has more or less priced all the LSD tokens as a function of perceived risk through their degree of ‘de-peg.’ From this pricing information, we can draw conclusions about LSD token risk.\nOne naturally comes to ask, where does this risk come from? It can be grouped into three main categories: execution risk, tail risk, and centralization risk. I will show that Lido is at dangerously high-risk levels in the latter two categories and that this is calculable by comparing execution risks between tokens.\n\nExecution Risk\nI define execution risk as existential threats to a protocol that stem from necessary future upgrades.\nSome marginal risk between tokens can be allocated to individual protocols themselves and would largely be correlated with the extensiveness and complexity of the respective smart contracts. Upgrades to Ethereum itself also fall into this category and hence would apply equally to all LSD protocols since they are similarly at risk of a failed hard fork, for example. The successful completion of The Merge demonstrated the role of execution risk. Following The Merge, the stETH depeg dropped to 1% and rETH hit parity. It can be inferred then that a large part of the remaining depeg is now due to centralization risk and tail risk.\nTail Risk\nNext up, tail risk refers to a range of potential governance abuses and events that may occur on or off-chain, such as smart contract exploits, slashings, quadratic leaks, hardware failures, and custody errors. These events are difficult to predict and occur infrequently but are important to consider in risk management due to their potential severity. Furthermore, the resilience of an antifragile DeFi primitive, like wETH, should be measured by its ability to withstand its worst-case scenario.\nIn the Ethereum ecosystem, node operator penalty events such as offline losses and slashings scale with the number of validators involved. Each of Lido's node operator companies manages thousands of validators. As a result, there is a higher protocol-wide tail risk exposure when compared to a more decentralized set of operators each running a smaller number of validators. In other words, Lido is placing a large number of eggs in a small number of baskets.\nAdditionally, Lido does not have sufficient insurance to cover worst-case scenarios and has even begun redirecting funds away from its small protection fund of around 5,000 ETH. If losses exceed this amount, they would be socialized across all stETH holders. In contrast, other LSDs such as rETH and sETH2 have a much higher degree of protection, though only rETH offers true tail risk protection through a large amount of over-collateralization. For a proper comparison of how different LSD tokens provide insurance, see this analysis by dabdab.\n\nTo make matters worse for Lido, there is no short-term path to solve the substantial dependence on early Lido node operators. The Bridgetower Capital incident mentioned earlier demonstrates that Lido operators are protected even when they perform poorly. The staked ETH that these operators manage cannot currently be withdrawn. Mitigating this risk through diversification by onboarding additional node operators is not possible, since it only leads to an increase of the third and final category: centralization risk.\nCentralization RIsk\nWhile the above two categories are bad enough for Lido itself, any event occurring within what should be a DeFi primitive has the potential to be realized as considerably worse, with its effects cascading through the entire industry built on top. This is an example of centralization risk, the idea that execution and tail risks have a greater impact as the size of any protocol grows.\nSince Lido has refused to self-cap at any size, it could one day hold a supermajority of staked ETH. Any failure within Lido would therefore spill over and affect the entire Ethereum ecosystem. This risk should manifest in higher sell pressure as Lido’s market dominance rises. Even if governance risks are resolved, the mere appearance of a risky supermajority from Lido could still generate this kind of sell pressure. In times of risk-off or volatile market conditions, the widening gaps between stETH and other lower-risk assets such as rETH represent a “flight to safety” with the market pricing in the potential adverse scenarios that could befall Lido.\n\nSitting at just over 30% of all validators and 75% of all liquid-staked ETH, stETH is an order of magnitude larger than rETH at 1.5% of all validators and 5% of liquid-staked ETH. Though Lido does not yet have a supermajority of all ETH, they have voted against self-capping and have maintained an exceptional, perhaps unnatural, lead.\nTo recap, rETH has considerably less execution, tail, and centralization risk than stETH as demonstrated by the consistent premium rETH demands over stETH. In terms of execution risk, Rocket Pool handled the Merge well while one of Lido’s major node operators experienced significant downtime. With the highly complex Merge complete, the impact of future upgrades is likely to be minimal and so the relevance of execution risk is also minimal. However, Lido still faces marginally greater execution risk in that the concentration of validators means that any mistake will be more costly, as noted by the Blocktower incident.\nIn terms of tail risk, rETH is vastly more insured than stETH with all deposits currently >100% overcollateralized. This will protect against almost any severity of slashing, short of an ecosystem-wide failure. Thus, it is unlikely rETH holders will ever be hit. Further, upgrades in the Rocket Pool Smart Node are opt-in and so propagation throughout the system is gradual enough for risk-averse operators to wait for any bugs to appear. This also means that Rocket Pool nodes can run without any upgrades from the core team indefinitely. However, the oracle DAO does represent a source of centralization within the protocol. If the oracle DAO was compromised, massive damage could befall rETH as oracle data is manipulated. Such an attack would require either the coordination or compromise of a majority of the public, doxxed, Ethereum-aligned participants of the oDAO. I will elaborate on this in the Reflections of a Rocketeer section.\nLastly, in terms of centralization risk, rETH is a minor player in the ecosystem and the dev team as well as the community have already signaled support for capping stake. When mitigating risk, rETH is the clear front-runner for LSDs. As such, the only puzzle that remains is how to scale Rocket Pool in a technical sense to meet the demand of being a core DeFi asset. I call this process the Orange Cascade.\n\n4 - The Orange Cascade\nI will now discuss how stETH’s market share can drop from being a near monopoly to less than a majority. I begin by recapping the social and economic pressures pushing against stETH and providing tailwinds for rETH. Then, I elaborate on the factors that will allow rETH to scale prior to withdrawals. These factors are mainly ways to scale and improve the experience for node operators, including reducing the ETH bond, the MEV Smoothing Pool, the Rescue Node, and Rocketarb. Looking to the future, I discuss withdrawals and the importance of solo staker migration, the flight from stETH/cbETH, and liquidity migration. By this point, rETH should scale into the low millions ETH staked. However, the future after withdrawals will be even brighter due to native staking-as-a-service (StaaS), Eigenlayer, forced exits, and distributed validator technology (DVT). These technical assets will allow rETH, the healthiest LSD for Ethereum, to onboard the ideal 22% of all staked ETH, no matter what the total percent of ETH staked is.\nThe Orange Creep - Pre-Withdrawals\nThe researchers at Paradigm suggested that the first socially scalable and pro-MEV LSD could quickly attract the Lindy effect and dominate in a power-law distributed fashion. I suggested that Lido’s growth has been too aggressive such that what should have been a power-law field had become a single-player market with stETH at a dominant >90% of LSD market cap in DeFi. There has been a growing resistance to this stETH dominance both socially and economically. Ultimately, most ETH remains unstaked and more funds are expected to enter in the months ahead. With greater awareness of risk in the market compared to the heady days of 2021, a much more stringent eye will be placed on tail risk scenarios.\nWith stETH’s inflexible and inadequate insurance already being siphoned off towards generic ‘treasury’ uses, Lido will find itself unable to safely scale further. It may be the case that stETH has hit its relative peak already. In terms of social barriers to growth, Lido is overly governance dependent with corruptible human-appointed whitelists. Economically, the crashing liquidation cascade and lasting depeg in June demonstrated how stETH in fact has significantly larger centralization and slashing risks relative to other LSDs.\nA single major slashing event at any one of Lido’s node operators will permanently reduce trust in the system–since across large time scales, this becomes a question of when not if, will large investors will be willing to play ball? There is already proof that shaken confidence in wider markets can lead to years worth of yield being wiped away. How much worse would the impact be of a Lido-specific incident? What would the reaction be to mass stETH rebalance towards the red? It may be necessary for the ecosystem to learn this lesson the hard way through a major slashing event, but the pressure remains regardless.\nEven as Lido tries to increase stETH's LSD dominance through distorted incentives, better alternatives provided by competitors could very well see the market settle back into a traditional Pareto distribution.\nRocket Pool is already the most tail risk resilient, socially scalable, and MEV friendly decentralized LSD protocol. It makes sense for it to be the one that benefits most. The pre-withdrawal era will also be marked by the 8ETH collateral reduction (LEB8s) and quality of life upgrades, the former reducing collateral requirements to 8 ETH per minipool and the latter providing unique ways by which Rocket Pool provides the best experience for node operators.\nThe supply multiplier on LEB8s is sufficient to triple the rETH supply alone. Each set of 16 node operator ETH will produce 48 rETH, whereas previously it would only produce 16 rETH. However, the real significance lies in the fact that it lowers the barrier to entry. Many more people will be willing to bond 8 ETH than 16 ETH, so despite a floor projection of a 3x increase, we can expect even more growth.\nDuring this time period, there will be a proliferation of quality-of-life improvements, such as the MEV Smoothing Pool (the only way for small node operators to get equal EV to large operators), the Rescue Node, and Rocketarb. Collectively, these exclusive features will draw node operators to Rocket Pool and expand the rETH supply. The MEV Smoothing Pool is an opt-in system where each node operator shares MEV + tips with each other. This gives all participants a much higher chance of getting exposure to long-tail MEV which can often make up a huge portion of returns. An analysis was provided by Ken Smith of the Rocket Pool community here:\nhttps://github.com/htimsk/SPanalysis\nWith hundreds of node operators participating, it is a powerful entity in its own right that makes joining profitable for other large entities. This in turn will draw larger players into the ecosystem and expand rETH supply.\nThe Rescue Node is a community-led project that would allow any Rocket Pool node operator to take advantage of a secondary beacon node as a fallback. This can be useful during pruning or minor outages. Normally, this would be very tricky and costly to set up as it is an exceptional amount of redundancy, but the Rocket Pool network will soon provide this to all node operators in the network for no additional cost. There are currently some trust assumptions between users and the Rescue Node maintainers, however, the maintainers are all publicly known. Further, rate limits are in place so that users cannot overly depend on the Rescue Node as a centralizing delegate node.\nThe direct result of the Rescue Node is that the performance of the protocol overall will markedly increase. There will be fewer instances of user downtime, resulting in higher rewards for rETH. Further, downtime can be very daunting to new node operators. The presence of the Rescue Node makes Rocket Pool a much more forgiving learning environment without sacrificing performance. Even for experienced users, it is a huge QoL benefit knowing that any downtime, planned or not, may no longer have to correspond to lost income. Most importantly, making node operation more accessible for users of the Rocket Pool ecosystem will attract new members and grow the TVL.\nhttps://twitter.com/0xPatches/status/1597704860962795520\nLastly, Rocketarb is a way to profit off of the open market premium that rETH currently enjoys. The supply of rETH is limited by node operators and the deposit pool is full at 5k ETH. When a new mini pool is launched, 16 ETH worth of rETH becomes mintable at the native asset value. If you manage to mint that 16 ETH worth, you can pocket a 16 x 2-3% profit, or 0.3-0.45 ETH. The Rocketarb contract bundles mini pool creation with the rETH minting and sale so that the node operator is left with a mini pool and a lovely bonus for expanding the rETH supply.\nhttps://github.com/xrchz/rocketarb/blob/main/README.md\nThis contract creates an incentive to spin up more rETH when there is more demand for the product, which previously did not exist. The opaque value that is generated by excess demand on the open market can now be captured by the protocol as an incentive to grow in a healthy way. Therefore, when stETH holders flee to rETH, as has happened many times before, there is now a way to capture that in the form of TVL growth without any inflationary incentives.\n\nRocketarb is also a glimpse into the future. After withdrawals, arbing LSDs to restore them to peg will be a very profitable business. The incredible work of the Rocket Pool community has simply found a way to get that benefit before withdrawals are live.\nhttps://twitter.com/marceaueth/status/1593005393692995584\nTo draw parallels to another Web3 power struggle, Sushiswap was never able to flip Uniswap despite the fanfare with which it launched. But at the same time, Sushi was also never able to offer a compellingly better product which perhaps explains why it was able to break the monopolist grip that UNI had on dex volumes but make no further progress. It has been established that Lido’s stETH has both social and economic forces pushing against it, with liquidity and Lindy effects propping up its dominance. But with the advent of a level playing field between mature & established players, Rocket Pool’s superior social narrative and higher resilience can push rETH's market cap over stETH's. The trendline for primitive DeFi assets is toward maximal security. This is how rETH will flip stETH.\nThe Orange Migration - Withdrawals\nIn the next six months, it is likely that withdrawals will be live and rETH will gain three massive unique tailwinds: solo staker migration, the flight from stETH/cbETH, and liquidity mitigation.\nhttps://twitter.com/vdWijden/status/1595386746786779137\nThe first group of users who will be able to transfer to Rocket pool after withdrawals are solo stakers who deposited before Rocket Pool's later launch. There is a strong economic argument for converting a single, regular validator into multiple minipools, at least four for withdrawals, and earning commission on liquid staking deposits. Someone who had 32 ETH staked could migrate and get exposure to 128 ETH. The Smoothing Pool is another benefit only available to Rocket Pool node operators which not only reduces the volatility of rewards but also increases the average return for most participants. Quality-of-life upgrades will continue to roll out.\nIt is estimated that approximately 30% of the existing stake is managed by these early node operators. Most of this ETH was launched before Rocket Pool went live and certainly before it could be considered battle-tested. Despite so much ETH being staked before Rocket Pool was ready, Rocket Pool node operators still account for 15-25% of all node operators on the network. An increasing number of new node operators are choosing to use Rocket Pool instead of vanilla or other services. As such, it is reasonable to think that a large chunk of users who had staked before Rocket Pool launched will want to migrate over. The migrants will mainly impact the node operator supply, which has a magnified effect on TVL growth. If 10% of the ~4.2 million ETH early solo staked ETH migrates to LEB8s, then rETH capacity would increase by nearly 300%. The protocol would be able to handle 1.7 million rETH TVL. This capacity is going to be needed given the second group of migrants.\nThe second group of migrants will be from stETH and cbETH. Being able to redeem LSDs for ETH without having to execute a secondary market sale means investors can instantly adjust their risk allocation without worrying about liquidity. Had this facility been available during the June 2022 collapse of 3AC, Lido’s TVL likely would have collapsed immensely.  As it was, the significant price drop of stETH vs ETH and concerns about slippage for larger portfolios acted as two disincentives to discourage investors from selling their stETH position at a loss. I expect several cohorts each with different reasons to go through this transition; a moral transitioning, as a response to a slashing event or hack depegging steth, or perhaps yield-seeking.\nFinally, and perhaps most importantly, withdrawals will cause the cost of maintaining adequate LSD liquidity to plummet, removing one of Lido’s strongest advantages. A natural arbitrage opens up via the purchase and redemption of a mispriced LSD. Rocket Pool already demonstrates the value of this in the Deposit Pool where rETH mints and burns help keep DEX prices stable. Liquidity can be concentrated tightly around the NAV with strong assurances that arbitrageurs will keep the peg close.\n\nIf the opportunity for this type of arbitrage is supported by Ethereum itself, the cost of liquidity will be greatly reduced, leveling the playing field for all staking protocols. Suddenly, the liquidity Lido gets from its multi-billion dollar Curve pool, which costs $20MM a month to maintain, will be available to everyone at no cost through the exit queue. MEV bots will patrol LSD prices looking to squeeze out any ETH for themselves. The type of liquidations that previously saw the price of stETH spiraling would now simply create a feast for arbitrageurs as market prices barely budge. The Lido permissioned operator set can accept new Ethereum deposits as quickly as the Ethereum network allows. However, just as Lido was a black hole for ETH, it may eventually follow a black hole's life trajectory and spew out all of that ETH in the future.\nOnce the ability to enter and exit an LSD position becomes trivial, expect a surge in Lido’s competitors being integrated in DeFi apps. Further, and perhaps more nefariously, the drop in baseline risk level for all LSD tokens will spur on leveraged staking. Every LSD will be readily folded like icETH, packaged leveraged stETH. While these tokens promise incredible returns, they introduce huge risk to markets. The exit queue is not infinite and it is possible that we may see a second, larger rush in leveraged staking. If this is to pass, the fallout and dust will settle in favor of the most resilient asset.\n\nIn fact, the first cases of liquidation from stETH deppegs are starting to creep up as novel leverage strategies develop. For example, the Gearbox protocol has created generalized leverage. One user used this generalized leverage to go long on stETH/ETH 8x. A slight depeg on stETH mixed with some oracle technicalities led to this user’s position being the first on the Gearbox protocol to be liquidated. Greed will push users to chase what appears to be safe returns by leveraging LSD tokens. The LSD that is most resilient will survive this.\nhttps://twitter.com/gearbox_intern/status/1587957235703025664\nThe Orange Future - Post-Withdrawals\nThe far future for Rocket Pool is exciting to consider. The pathway to a world dominating protocol is already clear and they consist of four major upgrades that will occur sometime after Shanghai. These upgrades, in vaguely the order we may see them go live are native staking-as-a-service (StaaS), Eigenlayer, forced exits, and distributed validator technology (DVT). Together, these upgrades will allow Rocket Pool to scale into many millions of ETH staked.\nOne of the most prominent critiques of the Rocket Pool system is that it forces node operators to speculate on RPL. Many home stakers partake because they are skeptical of other tokens and so this is a large barrier. Further, holding RPL becomes a problem for some larger institutions. As such, the Rocket Pool team devised an upgrade that will introduce super nodes that can create novel relationships between the node operator and providers of ETH and RPL collateral. It will introduce an in-protocol way to separate the risk of three tranches: node operation, ETH, and RPL. Rocket Pool stands to greatly expand its total addressable market (TAM) since many individuals express the desire to only stake ETH, not wanting RPL exposure, or vice versa. The StaaS design will allow third party groups like the Node Operator Association to onboard these users and shift the burden of RPL collateral.\nhttps://twitter.com/apolynya/status/1602875819751186432\nEigenlayer represents a novel idea – stake rehypothecation. The general idea is to add new slashing conditions to a node’s ETH stake based on added tasks, such as oracle duties or data storage. This would allow markets to reuse the incredible amount of economic security locked in the deposit contract. The Eigenlayer team is working on a data availability layer for an initial product design, but other forms of implementation are being explored. In a sufficiently advanced market, a savvy node operator may be able to earn several times the native ETH yield by taking on additional burdens.\nhttps://twitter.com/Jasper_ETH/status/1577132020106289152\nThe future could have many bespoke setups, with some node operators doing pure ETH staking and others having a dozen extra responsibilities. This creates a challenge for centralized operators such as Lido and an opportunity for permissionless ones like Rocket Pool. For Lido, there will likely need to be a drawn out governance process centered on which Eigenlayer applications are safe to use and present an acceptable level of risk for the DAO. The APR of stETH will suffer as a result. For Rocket Pool, users will likely be free to experiment.\nRocket Pool and Eigenlayer continue to communicate on how the two protocols can be incorporated in a way that makes profit sharing with rETH simple. This relationship between Eigenlayer and Rocket Pool is mutually beneficial. The Rocket Pool ecosystem is the most widely distributed node operator market available on top of Ethereum. Any Eigenlayer product that wants to immediately have strong decentralization can target Rocket Pool operators.\nhttps://twitter.com/sreeramkannan/status/1595863297236271104\nAnother future upgrade is forced exits. Currently, there is no way for Rocket Pool to force a validator to exit. This is a limitation of the Ethereum spec and will require an EIP to change. Forced exits would be a useful feature for all LSD protocols to increase decentralization and safety. As such, it is being worked on collaboratively. Forced exits would help prevent bad actors and increase the value retained when actors do go rogue. As a result, the inclusion of forced exits may allow Rocket Pool to drop the bond requirement all the way to 2 ETH. This is a massive change. For perspective, if every current node operator switched to 2ETH pools, that would give Rocket Pool the capacity to onboard 15x as much rETH, or 2.4 million rETH. Currently, 16 node ETH creates 16 rETH, but with forced exits, 16 node ETH will accommodate 240 rETH. Without considering any increase in node operators, this upgrade alone will allow Rocket Pool to compete on the biggest stages.\nThe drop in collateral from 16 ETH to 2 ETH will also signify a massive increase in the node operator base. If this drop amounts to even a 4x in the node base, despite being 8 times cheaper, then Rocket Pool will scale to 10 million ETH.\nLast but far from least is distributed validator technology (DVT). In the past, I have been critical of DVT because I do not view it as a means of solving centralization issues. The long term plan for Lido centers on DVT, wherein my disdain originates. The premise of DVT is that several ‘committee’ members each run a node. If one node goes down for some reason, nothing happens as only some consensus threshold of the committee is needed to maintain uptime. There are huge benefits that can be drawn from this. DVT can prevent most losses from downtime or slashing, however, there are important things DVT cannot do.\nDVT does not mitigate centralization in and of itself. For example, if the Lido network’s ~30 node operators began operating on a DVT committee, the stETH token would have much better uptime and diminished tail risks, but the centralization and some tail risks, like smart contract risk and quadratic leaks, remain. Further, DVT in relation to MEV is a field of open exploration. One of the major reasons a bond exists for Rocket Pool is so that there can be some recompense for MEV theft. If it was trivial to steal MEV at the cost of a bond, it may be +EV to spin up mini pools and abandon them after receiving large MEV payouts. These issues must be resolved before it can be adopted by a large protocol.\nFor Rocket Pool, DVT represents exciting technology that may enable an even lower bond and increase the overall effectiveness of stakers. Home stakers in aggregate tend to have slightly lower average uptime than institutional stakers, often due to unstable internet or power, but DVT would even the playing field greatly.\nCollectively, the post-withdrawal era will ensure Rocket Pool can scale to any demand level needed and ensure that node operation as well as liquid staking is competitive in the wider ecosystem. This timeline shows that one of Rocket Pool’s greatest criticisms, that it is capital inefficient, is moot. Rocket Pool can, and will, scale to take on Lido and Coinbase.\n\n5 - A New Challenger Arrives\nThe history between Lido and Rocket Pool is well established by this point. However, the LSD ecosystem is rapidly expanding and a new generation of participants is hot on the heels of stETH and rETH. In this section, I will break down the other major LSD tokens that I think will fight for large chunks of the total stake. These tokens (cbETH, frxETH, and osETH) all exemplify different approaches to staking and have their own faults. I conclude by pointing the critical eye inwards and discussing areas Rocket Pool could improve in.\nThe Drain of cbETH\n\nHasu and Georgios argue that the domination of centralized exchanges (CEXs) in the Ethereum staking market can only be avoided if a competitor focuses on rapid scaling. Lido has interpreted this to mean prioritizing growth over decentralization. But curiously, the release of Coinbase’s cbETH LSD has actually provided a helpful demonstration of how, in the absence of incentives, market participants will gravitate to the most decentralized option. Currently, cbETH is used primarily on Uniswap. Approximately $6 million is locked in the cbETH/ETH 0.3% and 0.05% pools, a reflection of the low daily volumes since cbETH has a total value many orders of magnitude greater than this TVL. Uniswap is staunchly permissionless and easy to use so it is logical that this is where most cbETH has ended up. Outside of Uniswap, adoption has been poor. Curve, the dApp where stETH is most dominant, used to only have a few hundred cbETH in its cbETH/ETH pool. It has since grown to a still meager 2000 ETH TVL with the help of some incentives from the Curve protocol. This shows that without a strong liquidity incentivization campaign or a supportive public ethos, tokens do not naturally gain deep liquidity.\nThe general illiquidity of cbETH has a myriad of effects. It has made impossible the safe use of cbETH in lending platforms like Euler, Maker, or Aave. The image below is taken from Euler’s frontend. It shows that cbETH would depend on a very insecure Uniswap v3 TWAP oracle. This oracle is easily attacked and any debt positions built around cbETH could be liquidated by malicious actors. A robust oracle, like one provided by Chainlink, requires high volume across multiple CEXs or DEXs. Further, lending platforms that want to be able to safely liquidate positions require tokens that have a large amount of inactive liquidity. The Curve stETH/ETH pool is the best example of this. The pool has several billions USD worth of liquidity but only sees some 10s of millions USD in trade daily. The excess buffer is useful in blackswan events when large amounts have to be sold, like during the 3AC capitulation.\n\nAs mentioned previously, illiquidity and the depressed prices that result, can trap holders and prevent them from selling. Those that do sell are likely selling to arbitrageurs as there are no productive uses for cbETH and competitors are higher earning. Currently, 1inch, a popular DEX aggregator, shows that only 2000 cbETH can be sold for ETH before incurring 1% slippage. The same transaction would only have 0.4% slippage for rETH. With limited yield opportunities and liquidity, most cbETH buyers on uniswap are likely holding the token for the arbitrage that will be available post-withdrawals. Thus, a pipeline is being constructed.\nOver time, existing or new Coinbase users will at some point want to exit their positions to cbETH. This could be due to ETH price collapse or a desire to explore DeFi. Both of these users will quickly realize that their best bet is to sell their cbETH to an arbitrageur. More and more cbETH will end up purchased with the explicit purpose of being burned. This huge cohort of buyers has no need for DeFi integrations and so are happy to sit on their illiquid cbETH that they bought at a discount and accumulate until withdrawals create a pathway for any LSD to be converted into ETH on peg. There will not be a reshuffling between small holders and big whales like the ecosystem saw with stETH during the 3AC crisis. There will be a unidirectional current pulling cbETH rapidly towards the burn address.\nConsider the wallet 0x7f507739b6242B048Be9185cf462BE816b8eFf1f, which has accumulated 1% of all circulating cbETH. This wallet has slowly migrated from wstETH to cbETH to buoy the token and consolidate for withdrawals. The owner is taking a risk, of course. There is a possibility that Coinbase will see the writing on the wallet and try to stop the damage. Instead of allowing these sleuthy cbETH whales from mass exiting, which would greatly hurt Coinbase’s cash flow, Coinbase may limit or even block cbETH redemptions. Such a move, exceedingly unlikely as it may it be, would have devastating effects on the cbETH/ETH peg as all confidence is lost. A bank run scenario may become possible. This is the gamble of engaging in the opaque world of CeDeFi.\nIn conclusion, though it may seem scary to see how quickly cbETH supply has grown, it does not represent an existential threat to DeFi. In fact, DeFi has roundly rejected cbETH and, if what I believe is correct, DeFi is playing Coinbase into a long con – slowly accumulating cbETH to drain away Coinbase’s stake after withdrawals. The course of this grand arbitrage has sucked away liquidity, crippling any hope cbETH had of gaining DeFi adoption. Unless Coinbase makes an active stance to promote the DeFi usage of cbETH, it appears that DeFi will remain the battlegrounds of Lido and Rocket Pool.\nfrxETH - Liquidity vs Design\nOne of the most recent entrants to the LSD landscape is frxETH from the FRAX ecosystem. FRAX, a stablecoin, came to prominence through the FRAX DAO’s aggressive acquisition and use of liquidity-directing tokens (veCRV/vlCVX). The DAO attracts users to mint their stablecoin by creating profitable liquidity provision strategies for FRAX holders through the voting power of their DAO tokens. This model has clear merits. Pre-withdrawals, all major LSD tokens have to create liquidity and usually pay to rent it. By owning these liquidity-directing tokens, FRAX sets itself up to avoid the capital expenses incurred by competitors such as Lido. Since FRAX has had such great success with this model for stablecoins, the DAO has decided to venture into a new kind of stable, an LSD pegged to ETH.\nThe frxETH tokenomics are unique in the world of LSDs. Most tokens either rebase for rewards (stETH) or passively increase in value (rETH). FRAX went a different route. The frxETH token itself does not accrue any staking rewards. In order for token holders to access the APR earned by the ETH locked in validators, users must deposit the frxETH token into a staking vault. All the rewards earned by the protocol’s staked ETH, minus fees, are then distributed to whatever users staked in that vault. Any users holding frxETH, not staking in the vault, will receive no rewards. Users are forced with a choice - either pursue yields in DeFi with frxETH or earn staking rewards in the vault.\nThe goal here is valiant. This binary option will force the staked frxETH APR to be higher than any other LSD token simply because the DAO is pitting its own LPs against its own stakers. If the APR to LP in the Curve pool, the current main DeFi integration, was a hypothetical 20% while the staking vault reflected a 7% APR then users are likely to naturally migrate out of the vault and into the Curve pool. At equilibrium, the APR of the leading DeFi frxETH integration should come close to parity with the staked frxETH return, potentially over 10%. In theory, holders of other LSD tokens would see this yield and convert.\n\nNow the catch. First off, this model is counterintuitive to some core DeFi principles, namely those of capital efficiency and composability. This model is purposefully not capital efficient. FRAX could have incentivized a yield-bearing token such that the liquidity providers earn LP rewards along with the staking rewards. By forcing users to choose one or the other, the cost ends up being higher. Take for example a long-term hypothetical where the staked frxETH token is yielding 9% while the frxETH token in Curve earns 11%. The Curve liquidity providers would not provide liquidity unless the incentives beat out the staking rate, otherwise, they would migrate to the staking pool. This has to be paid for - either in incentives or by directing liquidity. The cost of paying LPs in this example to maintain the same level of liquidity would likely be dropped by ~30% since the Curve pool could have been 14% APR (assuming an 6% ETH rewards rate) had those ETH rewards not been redirected. As the TVL in the ecosystem builds, the cost savings become more and more important.\nAnother confusing element to frxETH is that the staking vault is a liquid token, sfrxETH. The FRAX DAO is currently choosing only to incentivize the frxETH pool. Ostensibly, savvy DeFi buildoors will want to integrate sfrxETH as the actual ETH reward-bearing token. This will put FRAX in a similar situation to the one Lido faces in trying to migrate liquidity from the stETH token to the wstETH token. Having to support an ecosystem of two tokens is going to be more expensive than just one. As discussed earlier, financing liquidity for a top tier LSD can cost millions of USD/month. As such, even though FRAX is starting with a large capacity to incentivize liquidity, it is doing so on an inherently less capital-efficient system. For a stablecoin provider, this is worrying for a second reason.\n\nThe costs of incentivizing frxETH are twofold. First, it is capital inefficient compared to other LSD tokens in order to create a facade of higher APRs (LSD APRs when including their DeFi strategies ought to be even with or higher than staked frxETH). Second, and more importantly for FRAX, liquidity tokens used to incentivize frxETH cannot be used to incentivize the FRAX stablecoin that underpins the whole FRAX ecosystem. By shifting incentives from FRAX base pairs towards frxETH pairings, the strength of FRAX is weakened. Liquidity is a zero-sum game and FRAX are using the liquidity power they have on an inefficient schema.\nIn the post-withdrawal world, the liquidity-directing tokens that FRAX has accumulated suddenly will become much less valuable for LSD tokens. The exit queue will enable large orders to navigate outside the open market without damaging the LSD peg. Thus, FRAX will have lost its major edge in the LSD token wars. At this point, FRAX’s position as a very centralized staking provider will come into focus. Currently, the FRAX team runs all of the validators and there are no concrete plans to decentralize.\nShadowy Super Stakewisers\nThe most difficult LSD to analyze is one that currently does not exist – osETH. Stakewise is a staking service that currently operates with a permissioned set of nodes and a two token model. This is being completely redone for Stakewise v3, slated to launch sometime in 2023. In this release, Stakewise is challenging Rocket Pool’s dominant position over solo node operators by becoming permissionless. Users will be able to spin up validators and mint osETH against said validators in a fashion reminiscent of loan-to-value calculations. Many of the fine details about osETH have not been released and so this section should largely be taken as conjecture.\nThe Stakewise v3 platform will allow individualized debt markets. The benefit of this structure is that risk can be managed on a case by case basis and so the previously lacking insurance cover provided by Stakewise may improve. Further, depending on the ratio for LTV that Stakewise allows, it may be possible to start running a validator with as little as 4-8 ETH. However, many difficulties lie ahead for the Stakewise team.\nThe elephant in the room is that the SWISE team will have to migrate all their liquidity from sETH2 and rETH2 into a single token – osETH. A complete rebrand and tokenomic redesign is a costly venture that will force them to start over on integrations. DeFi governance is slow and this can be a time-consuming process. Another issue is that Stakewise is going to hope for a strong migration of solo stakers. This cohort, however, is notoriously risk-averse. Rocket Pool node operator registration is a good proxy of this, as the period following launch did not see a surge in registrations. Many solo ETH stakers will likely want to see mainnet resilience without any hacks before trusting funds to the protocol. It may be the case that most of the osETH supply is minted by Staking as a Service providers using Stakewise. However, it is not clear how these StaaS groups will draw demand.\nConcerns also remain around the reward schema. MEV stealing is a problem that has driven much of Rocket Pool’s insurance discussions. It is unclear how Stakewise will account for this issue in extreme LTV vaults. If they do solve this issue, they will provide a compelling alternative to Rocket Pool in the permissionless staking ecosystem.\nReflections of a Rocketeer\nThe Ethereum ecosystem participants will ultimately be the ones to decide which LSD deserves to scale. In the pursuit of intellectual honesty, I will now explore some legitimate criticisms of the Rocket Pool protocol in the hopes of spurring even better iterations.\nOne of the earliest criticisms of the protocol was that Rocket Pool is an attack vector on Ethereum consensus. Any agent that wanted to attack Ethereum’s consensus broadly could double their attacking power by launching Rocket Pool mini pools instead of solo validators. With LEB8s this vector is further amplified. One limitation of this issue is that minipools can only be launched if there is ETH in the deposit pool. For this attack to play out, two difficult conditions must be met. Primarily, this attack would require a long period of time to execute as the deposit pool would have to be repeatedly filled. It would additionally require that Rocket Pool scale well past the previously-discussed caps. As such, this criticism, while true, is unlikely to be relevant.\nA criticism that I’ve dealt with in detail now is that Rocket Pool is capital inefficient, cannot scale, and has distasteful tokenomics that require exposure to RPL. As discussed in section 4, rETH has a clear pathway to scaling up into the millions of ETH staked with planned, iterative upgrades. These will include a design overhaul that would allow users to enter with only ETH or only RPL exposure.\nThere is significant discourse about reducing reliance on the core developer team and the oDAO. Currently, the majority of the team lives in Australia. Further, a majority of the oDAO resides in the US or EU. Both the core team and the oDAO have the power to wreak havoc on the protocol if corrupted and so the transition away from them is of paramount concern. The oDAO cannot be dissolved until certain changes are made in the core Ethereum spec such as better communication between the execution and consensus layers. The community is already brainstorming ways to migrate all of the oDAO duties to the decentralized protocol DAO, as shown in the table below.\n\nAnother criticism of Rocket Pool’s governance is that node registrations are not sybil resistant, meaning one person could register multiple nodes. Currently, voting is done based on the quadratic root of effective RPL staked per node. A malicious agent could spin up many nodes and launch one mini pool on each in order to maximize their voting power in future votes. Such an attack has not yet been discovered, however, it may be hard to notice until after a vote has been compromised. As such, discussions have been ongoing about moving towards a linear scaling method until a more robust sybil mechanism is introduced.\nhttps://dao.rocketpool.net/t/proposal-switch-to-linear-voting-power-to-resist-attackers/1213\nAdditionally, rETH holders lack a say in Rocket Pool governance. It is possible to become a delegate without being a node operator and champion rETH, however, the tables are stacked against this type of behavior. While the best governance is no governance, until that is possible, rETH interests should be represented more.\nA pessimistic view of Rocket Pool is that it is introducing a huge swath of people to node operations who have no business being node operators. Champions of professional staking sometimes see hobbyists as irrational. By lowering the barrier to entry, some would argue that we increase the risk to Ethereum by increasing the number of node operators who do not know what to do when things go wrong. The Rocket Pool Smart Node makes set-up incredibly straightforward. This ease of entry can be worrying to staking professionals because it allows people who have never run servers to now protect Ethereum.\nKeeping the network resilient despite the ease of access desired is a challenge that Rocket Pool is happily taking on. Even a complete novice can set up and effectively run a full node with the support of the Rocket Pool guides and community. The Rocket Pool Discord server is one of the most active in the ecosystem as a bastion of full-time node support and Ethereum knowledge. Additionally, the Rescue Node will reduce the impact of user error so the network does not suffer. DVT in time will only accelerate this process.\nFurther, I find this criticism resoundingly anti-Ethereum. The long-term vision of Ethereum idealizes a world in which millions of light client nodes running on personal devices all contribute to the network. In this world, the barrier to entry must be incredibly low. Do not listen to the staking professionals – Ethereum staking will (and should!) only get easier while maintaining utmost security.\nExtreme security aficionados may have reservations about Rocket Pool. Currently, a limitation of the smart node is that it cannot be used on an air-gapped device for key generation. Further, there is always inherently more risk to Rocket Pool as an additional set of smart contracts over and above the Ethereum deposit contract – however, this same risk exists for all LSDs.\nLastly, there is the attack that Rocket Pool is fighting a pointless fight. This cohort might argue that the hard work Rocket Pool has put into creating a highly tail-risk resilient LSD is moot because stakers only care about chasing yield. I believe this criticism paints the multi-billion dollar LSD ecosystem in an uncharitable light. For this thesis to be true, either the value of risk must approach zero or investors are in for a rude awakening. The former case is hard to imagine in the near future – there are too many avenues of risk to solve in any LSD. If the latter is true, that investors are casting a blind eye towards the ever-growing risks presented by more centralized LSDs, then it will likely be by their own painful realizations that risk gains value once more. As long as there are traders over-leveraging insecure products, there will be events that punish the yield seekers and reward the cautious. If the LSD ecosystem is to mature into the next-generation bond market, risk must be incredibly relevant to value.\n6 - The Underappreciated Art of Counterparty Tokenomics\nLastly, I want to touch on the broader tokenomics around LSDs. There is an important tension that exists between the protocol utility/governance token (LDO, RPL, SWISE) and the LSD token itself (stETH, rETH, sETH2). This tension is ignored by most protocols, but is fundamental to a sustainable staking protocol. All staking protocols are two-sided ventures; most simply opt to centralize one of the sides. I will discuss LDO’s fee switch and RPL’s collateral system.\nAs a means of deriving sustainable value, the fee switch is insignificant and will perpetuate the dangerous elements of LDO governance. Practically, the fee switch is soft capped at 5% of staking returns, since the other 5% has been guaranteed towards the elite node operator set. This already hints at the problem as a small core group of operators is due the same rewards as the entire DAO. There is an inefficient alignment as the node operators seem to be extracting too much value. For that 5% to be worthwhile, LDO will have to be at a maximum of one-twentieth (1/20) of the market cap of stETH, and not deviate. If LDO/ETH drops, your existing LDO stake will be worth less. If LDO/ETH increases, your stake will be worth more, but the rewards will be a smaller percent gain. In the vast majority of cases, it appears that holding stETH would be more rational for token holders because of this hard cap on potential fee earning. There is no unique value added, other than freely accessible governance, to LDO.\nIn the fee switch design, the protocol token acts as a pure rent extraction mechanism and does not serve to align incentives. This has already become problematic as greed pushes DAO governances to distribute fees irrationally. This perhaps is already taking place as LDO has capped its insurance pool and opted to redirect those funds toward the treasury. This is not a diversion for direct rent extraction, however, it is emblematic of the type of behavior that simple structure DAOs tend towards.\nThe Rocket Pool design does respect the tension between the protocol token holders and LSD token holders. Node operators are required to post RPL bonds in order to service the rETH demand and spin up minipools. This enables both a permissionless node operator set and ties the growth of rETH to RPL. There is no protocol treasury nor protocol commission so there is no impulse towards rent extraction broadly. Further, Rocket Pool recognizes that governance ought not to be open, as the desires of rETH holders require protocol alignment to be maintained. Thus, only RPL that is staked as a bond can be used in governance. This RPL does have a unique value add as both a license to collect commission and as collateral in case of a severe loss. This protocol alignment and lack of an extraction mechanism on top of a more capital-efficient system make the RPL system far more conducive to long-term survival.\n7 - Conclusion:\nThe team behind Lido served an important role. The research Paradigm presented suggested that whatever entity was able to quickly and efficiently capitalize on liquid ETH staking would become wildly dominant. If the choice was either Lido exists or all Lido's ETH was split between Coinbase, Kraken, and Binance then clearly Lido's existence was net good. However, it is no longer the early days of the Beacon chain. The utility that Lido's stETH has offered to the ecosystem has peaked and now it is time to transition towards Rocket Pool and competitors. The actions that Lido took to maximize growth were all one-time affairs and will soon be rendered obsolete.\nIn this paper, I began with an overview of the liquid staking ecosystem. In it, I described the near monopoly Lido has on the LSD market and how it extended beyond just a power law dynamic. The natural balance of power had been manipulated by Lido’s liquidity incentive campaign, one of the largest in all of DeFi. However, the golden age of Lido is over now as both the power of these incentives and the gap in DeFi are diminishing. I make the bold claim that rETH will flip stETH's market share and begin to outline the social and economic reasons for believing so.\nIn the social world, stETH has already hit critical mass and attracted the ire of core ETH developers. I present 4 major arguments; the system is governance attackable, the fee distributions are volatile, the DAO and its operators are multichain, and the validator registry remains a powerful and centralized carrot/stick. In terms of economics, I detailed the rETH and stETH peg histories as a means of understanding the market implied risk. This risk I then break down into execution risk, centralization risk, and tail risk. The major point of this section is that rETH is engineered to be resistant in extreme scenarios which is the ideal trait for a base layer asset.\nAfter presenting these stETH headwinds / rETH tailwinds, I give my projection for how the shift in power will proceed. Major accelerants will be full rETH DeFi integration, a major CEX/Lido slashing event, enabling of withdrawals, and reducing collateral requirements. The post-withdrawal era will see Lido’s greatest asset, its powerful liquidity mining campaign, become nerfed as the exit queue reduces the costs that protocols will have to pay to maintain liquidity.\nWith the case against stETH established, I shift focus toward the newest challengers in the LSD space. Starting with cbETH, which has quickly raced to the second most dominant LSD, I point out that there is no DeFi adoption and that cbETH may end up as a stepping stone for users to migrate towards rETH. Next, frxETH, by FRAX, is built on a capital inefficient system wherein the staking rewards are kept separate from the liquidity providers. I provide some conjecture on a future rival, osETH of Stakewise v3. This token aims to challenge Rocket Pool on permissionless node operators, however, the product is not yet live and will require a complete protocol reboot – no cheap, quick, or easy task. I conclude the section by taking a step back and looking at Rocket Pool itself through a critical lens.\nLastly, I provide a short description of why the fundamental models behind RPL and LDO are different. I suggest that LDO's endgame is just a stETH wrapper giving users no unique value, not even governance, whereas RPL adds value to the system by functioning as collateral. These divergent models give LDO a clear value ceiling, but not for RPL.\nWhy does this matter? LSDs are going to be an intrinsic part of Ethereum. Staked ETH will be the future bond market. If an LSD becomes too dominant, it can become an attack on the host chain. The asset that propagates and survives will be the one that is resilient in extreme cases just as Ethereum is. Rocket Pool has been building towards that future since 2017. It will not be the one that starts with a manipulated early head start or the one designed to maximize yield at all costs. The invisible hand of decentralization will test market participants. Today, people are free to run validators in any country. This may be a luxury of the moment as nation-states have not set their target on Ethereum yet. When that day comes, LSDs will not be the reason Ethereum fails. rETH is the path forward. You can choose to ignore it or bet against it, but rest assured, the Orange Cascade is coming.\n8 - Postscript: FTX Fallout\nFollowing the merge, LSD pegs all quickly converged back towards parity. rETH held consistently at a premium during this process. Suddenly, the stETH/ETH ratio was where it was prior to the 3AC capitulation. Is this deserved? Has the risk left the ecosystem or has the rush of new stake post-merge combined with a dearth of yield opportunities obfuscated the risk Lido poses once more?\nFTX is dead. Volatility and calamity are crypto’s best friends. Thus, it should come as no surprise that the markets have been rocked yet again with cascading liquidations hitting most DeFi markets. The value of the SOL token has been cut in half in days. Many lenders, institutional and unsuspecting retail, are now bereft of their assets. For an asset aiming to be the base layer of DeFi, the market capitulation we experienced should be like a passing breeze. This recent fiasco has proved just the opposite for Lido. I will briefly discuss how the stETH peg held up, what is happening with stSOL, and why contagion is a real threat.\n\nOnce again, when the broader market hits a downturn, the stETH peg collapses. This time the losses extended to ~1.5%. It is likely that many leveraged stETH/ETH positions were liquidated in this process as this was the largest single day peg hit since the 3AC cascade. Had this event occurred after withdrawals, Lido would have seen a max exodus of stake while Rocket Pool would have gained stake. While stETH dropped 1.5%, rETH increased its premium against its NAV, signaling how resilient rETH is in the eyes of the market.\nMore concerning for the Lido DAO is the performance of stSOL, Lido’s liquid staking derivative for Solana. The entire Solana network has been struggling since the FTX news. Large swatches of SOL have exited or are waiting to exit, degrading the network’s security. At points, stSOL was reported to be trading at -10% on open markets compared to SOL. Volatility for the LSD is not an issue at face value, but this arbitrage opportunity has pushed large sums of SOL into their withdrawal queue. As such, the network is being stress tested and the Lido node operators that run Solana nodes have exceptional duties to attend to.\n\nThe node operators are shared between all chains Lido operates on. The Solana Lido validators also run Ethereum validators. Perhaps not on the same hardware, but the same teams must manage both chains. The complexities of properly running one validator for one blockchain can be profound. Having to constantly monitor Telegram for updates about the Solana reboot is directly inhibitory to a team’s ability to service other networks. Imagine if the events of the FTX collapse had triggered severe fallout in the Ethereum ecosystem. Would the Lido operators who run both blockchains be forced to dedicate resources one way or the other? Further, Solana may have represented a cash cow for some validators. By abruptly losing a huge income stream, a professional validator may be forced to adjust staffing. As long as Lido continues to diversify across chains, their dedication towards Ethereum will fall and the risk for stETH holders will multiply. Further, it is unclear if the Lido insurance pool extends across every chain. If so, then the security model of stETH is even worse than I have described.\nThere is only one LSD that has a value set identical to Ethereum itself - rETH. In the endgame, the social layer rules above all else. When that day comes, the decentralization and security of rETH will push it into the bedrock of DeFi.\n**\n**\nIf you find submirror valuable, please consider donate to wong2.eth to help cover server cost.","guid":"https://mirror.xyz/0x04BEE613690e98A1959F236c38AbAa5f2439B14a/pnaLyH6W4j58vfypsOKHciF_BM5HFvTkouTd9uThesM","isoDate":"2022-12-25T16:50:00.000Z","from":"https://submirror.xyz/0x04BEE613690e98A1959F236c38AbAa5f2439B14a","hashId":"75791bd0d0d7913e90decccc39d07f8a"}]