[{"title":"10月25日 Discord AMA","link":"https://mirror.xyz/0xaF819C7d5B9E98AfD3b59561a33067a94393E9d2/I1g4fqQGkM3hd7HY5aDyybkPj1RyhR48ymqeuhEJKfo","pubDate":"Thu, 15 Dec 2022 15:31:08 GMT","content:encoded":"<p>Discord 音频 AMA 摘要，2022 年 10 月 25 日。</p>\n<p>Space and Time 参与者:</p>\n<ul>\n<li><p>Nate Holiday，首席执行官兼联合创始人</p>\n</li>\n<li><p><em>Spencer Reeves,</em> 创意总监</p>\n</li>\n</ul>\n<p>感谢所有出席的社区成员！</p>\n<p><code>[会议开始]</code></p>\n<p><em>介绍</em></p>\n<p>Spencer：我们很高兴你们都在这里，我们的社区在 SmartCon 之后绝对爆炸式增长。我的名字是<em>Spencer Reeves</em>，我是 Space and Time 的创意总监。我很高兴在这里与你们中的许多人互动，欢迎所有新面孔！我将把话筒交给 Nate。</p>\n<p>Nate：谢谢，Spencer，我对这次 AMA 感到非常兴奋，我整个星期都在期待它。正如Spencer 所说，我们对社区感到非常兴奋。我们很高兴你在这里，我们很高兴我们正在共同建设它。我们正在努力做很多令人兴奋的事情，我们希望在我们继续前进的过程中开始让社区参与进来。我想你会从我们这里看到我们在 Discord 上的参与度也越来越高。我叫 Nate Holiday，是 Space and Time 的首席执行官兼联合创始人，我真的很期待在接下来的一个小时里回答问题，并确保您对项目和我们正在构建的内容有尽可能多的访问权限和洞察力作为一家公司以及公司的员工和创始人，在我们继续构建它的过程中，我们希望与您进行非常公开和透明的接触。</p>\n<p><code>AMA</code></p>\n<p><strong>Space and Time项目是如何产生的？有什么故事？主要团队是如何组建的？</strong></p>\n<p>Nate：Space and Time 是一个为 Web3 原生构建的去中心化数据仓库。而Spencer和我，我们在数据仓库方面拥有丰富的经验。如果您考虑数据库和数据仓库，我们都在 Teradata 作为高管工作了很长时间。 Teradata 已经建立了业内领先、最重要的数据仓库之一。它已经存在了 40 年，并且还进行了整个云转型。 Teradata 开始将他们的数据仓库移植到云端，您开始看到其他类型的云提供商围绕 Snowflake 和 Databricks 以及各种类型的云提供商兴起。</p>\n<p>Web2 数据库和数据仓库的问题是，第一，它们非常集中。如果你考虑云服务，你甚至会放大数据库和数据仓库的集中化，因为一切都在转移到少数主要云提供商。其中一部分真的很好：如果你想建立新业务，有很多云服务可以让建立新业务变得非常容易，并且可以尽早开始。但是世界上的中心化数据库也存在很多问题。随着世界走向去中心化，随着世界从不同业务之间的无边界整合转变，我们坚信数据库和数据仓库的去中心化是新的前沿，是下一个前沿。</p>\n<p>我进入 Web3 是通过 Chainlink，作为 Chainlink 的战略顾问，我开始与团队围绕上市、数据战略和战略计划展开合作。对我来说变得非常明显的一件事是，正在构建的去中心化应用程序都是构建在我们帮助创建的 Web2 结构上的：这些集中式数据库，这些大型云服务提供商。少数人控制着多数人的大量数据。如果你正在构建去中心化的应用程序，我们应该有去中心化的数据库和数据仓库来支持它，将隐私带回互联网成员，确保你对你的数据有完全的控制权，同时也确保当你考虑正在构建的应用程序，它们可以被信任和验证。</p>\n<p>你看看当今世界上正在构建的 DeFi 应用程序，我想我们所有人都知道，在一周又一周的新闻中，你继续听到关于黑客的信息，你继续听到人们得到他们不应该得到的信息可以访问，有正在发生的内部工作。因此，这些集中式数据库存在一个已知问题。如果你正在构建一个去中心化的应用程序，你需要确保它是安全的，你需要确保它广泛分布，你需要确保你提供给最终用户、应用程序的实际数据， DeFi 项目，实际用户可以信任它。因此，我们看到了一个巨大的机会，我们可以致力于构建下一代数据库，下一代软件。</p>\n<p>如果你只是从数据库转换的角度考虑，你可以把它放在一张非常简单的幻灯片中，说二十年前它是内部部署数据库和数据仓库，你有世界上的 Oracles 和世界上的 Teradatas。现在你有，目前正在建设中，云数据库，你有各种类型的云服务器和数据库，为当今世界提供动力。而在未来，我们正在建设未来，下一代数据库技术和数据仓库，它是去中心化的。因此，我们真的很高兴能为这一旅程提供动力并进行建设。</p>\n<p><strong>对于技术水平不高的人，您能否用更简单的术语解释Space and Time？</strong></p>\n<p>Nate：是的，这是一个很好的问题，我们一直都在问这个问题。对于世界上的大多数人来说，甚至数据仓库的概念也是一个复杂的概念。我的想法是数据仓库允许将表大规模连接在一起以进行分析和建模并为业务流程提供动力。所以简单来说，数据库和数据仓库，我用不同的术语来使用它们，因为它们在行业中做不同的事情。但总的来说，对于不了解数据库和数据仓库的人来说，如果你去 ebay.com 或者你去你最喜欢的购物网站，他们会运行不同类型的推荐引擎来确定你可能喜欢什么，什么你可能喜欢看，你可能喜欢买什么。这些推荐引擎使用关于你和你这样的人的数据以及相似的模型来根据你在网络中的交互方式来确定他们应该向你展示什么。</p>\n<p>数据仓库还用于为企业提供动力，仅从账簿结账的角度来看，如果你今天想去经营一家企业，假设你是一家上市公司，你希望能够每周、每个月、肯定每个月都结账如果你是公开交易的，但即使是每一天，也需要数据库和数据仓库的力量才能确定当天、那一周、那个月、那个季度的成本和收入，以便能够确定您的业务所在的位置。显然，您对收入和成本的洞察力越多，您在建立业务时就越容易做出改变，以确保在结束一个月、结束一个季度时，您对结果有更多的控制权，这将给市场和投资者带来更大的信心。</p>\n<p>因此，这些只是我们考虑用例时的两个示例，我喜欢的另一个是游戏。如果您曾经下载过游戏并经历了这个入职流程，这个流程简单吗？那个过程很难吗？在这个过程中，有人会因为你要求的信息过于机密、他们不想给你，或者你有太多的步骤要经过而退出吗？例如，帮助一家游戏公司确定您何时吸引客户，这是什么样的？拥有该应用程序的数据能力是一个非常好的用例，以确保您可以与客户互动并以减少该游戏中入职摩擦的方式入职。然后也只是玩电子游戏。如果你想一想谁在你的社交网络中，你是如何与他们互动的，所有这些都是通过后端的数据库和数据仓库运行的，以通过技术设备和通过互联网。因此，我们正在为此提供动力，以便在您通过各种技术相互交流时减少世界上的摩擦。</p>\n<p><strong>我们听到很多关于 SQL Proof of SQL 的信息，你能详细解释一下它，它在《Space and Time》中扮演什么角色，以及为什么它如此新颖吗？</strong></p>\n<p>Nate：当然，SQL 证明是有远见的，它将改变市场，我们非常看好 SQL 证明。这就是为什么。如果您考虑一下我刚才谈到的所有业务流程，这些流程今天都在集中式数据库上运行，并由集中式数据仓库提供支持。今天，全世界都相信拥有服务器的人、拥有软件和数据库的人以及在这些服务器、软件和数据库上运行的实际公司不会造成伤害。我们只是相信这是一个公平和诚实的系统，而实际上，公司每天都在优化他们参与的方式，以有利于他们的用户参与，增加收入，降低成本。这很公平；他们有能力在一段时间内使用数据改善业务。</p>\n<p>但是，如果您考虑去中心化应用程序，现在您突然需要确保您可以信任您的资金流向。您知道，您与该应用程序交互的方式是否公平？如果你正在玩电子游戏，如果你正在使用 DeFi 协议，那么这些牌是否对你不利？因此，我们正在构建的真正令人兴奋的是，在未来一年、两年、三年、四年、五年、十年、二十年内，每个人都认为今天公平的集中式流程将转向智能合约，令人兴奋的部分是这些智能合约将会自动化，这样就没有人的参与和互动。令人兴奋的是，通过 SQL Proof of SQL，我们可以使向智能合约交付的数据可验证和防篡改，以便您作为用户可以信任它。所以你可以说，在运行时，是否有任何东西篡改了数据？有没有添加数据？是否删除了任何数据？他们是否改变了以前运行查询的方式，这样输出可能会有所不同，或者卡片的堆叠方式会有所不同？</p>\n<p>因此，围绕 Proof of SQL 的令人兴奋的部分是，智能合约现在可以查询整个数据仓库，而且从该数据仓库查询的内容比今天可以查询的内容大很多倍。所以这意味着防篡改分析的用例增长，对吧？因为对于您可以在数据仓库中执行的任何操作，现在您可以将防篡改、可验证、无需信任的结果交付给智能合约。所以现在您可以开始采用该业务逻辑或自动化，并且可以将其转移到可以信任的智能合约中。</p>\n<p>令人兴奋的是，它改变了权力动态。它说，如果你想参与 Web3 应用程序的新世界，你应该使用 SQL 证明，因为它向智能合约证明你所做的事情是公平和诚实的。而且它也向智能合约证明某些东西没有被篡改过。如果您考虑一下，用户会喜欢它，因为它是透明的，它是防篡改的。企业喜欢它还因为，想想看，它是公平和透明的。如果我今天是一个 DeFi 协议的首席执行官，该协议在链上为数亿美元或数十亿美元提供支持，并且我在集中式数据库中运行所有这些协议，我晚上将无法入睡。因为作为一家公司的首席执行官，我也希望有信心，如果我为数亿美元提供动力，我不会在第二天醒来时看到内部黑客或外部黑客，结果现在我必须决定如何最好地满足我们客户的需求，因为一亿美元被盗了。</p>\n<p>因此，在我们前进的过程中，双方都会喜欢能够为智能合约提供支持的防篡改分析的能力。</p>\n<p><strong>您是在构建一个仅用于其他 Web3 项目的产品，还是用于替换现有的 Web2 数据存储和处理解决方案？如果是后者，什么会吸引大公司在他们今天使用的解决方案上转向 Space and Time？</strong></p>\n<p>Nate：另一个很好的问题，Web3 的应用程序世界非常庞大，并且正在以非常快的速度增长。 Space and Time 是一个原生的 Web3 去中心化数据仓库，它将推动行业向前发展。我们正在为此建造它。因此，我们认为要吸引我们的 alpha 客户、beta 客户并最终通过生产发布，我们的重点是我们正在构建应用程序时赋予 Web3 世界权力。话虽这么说，在接下来的几年里，你将开始看到 Web3 和 Web2 的界限融合在一起。已经有 Web2 公司，顺便说一下，非常大的公司，他们打电话给我们说，“嘿，我们知道我们需要开始与区块链数据交互，但我们不确定如何去做，因为我们拥有所有这些集中的 Web2 数据库。我们拥有所有这些数据库和数据仓库专家的工程师，我们对他们都进行了 SQL 培训，但我们真的不知道如何考虑从不同的区块链中获取所有这些区块链数据 ”</p>\n<p>因为他们看到了一个正在生成区块链数据的世界，并且将会有多个区块链，他们将不得不与之交互。他们正在看着它，说：“我们将把所有这些数据从链下转移到我们的企业数据架构中，但我们不确定它适合哪里 ” 他们喜欢关于 Space and Time 的令人兴奋的部分是，他们将其视为入口，我们为数据编制索引，我们将其放入关系数据存储中，我们使其可供他们使用，它在数据仓库结构中他们知道并理解，现在它正在驱动 SQL 语言。因此，现在他们可以开始将他们的 ERP 系统、云端或本地的遗留数据仓库桥接在一起，并且他们可以开始在单一环境中将他们的数据架构桥接在一起。</p>\n<p>如果你想一想，从企业到企业的结构和 Web2 中真正强大的另一件事是这个概念，例如，假设Mike，Spencer和我都去听音乐会，我们坐在那里，我们喜欢这场音乐会，我们玩得很开心。如果您考虑为该音乐会提供支持的企业，那么有数十或数百家企业为该音乐会提供支持。有停车场，有食物，有衬衫，还有售票。坐在那里的所有这些人都在为我们提供服务，但实际上我们只是买票，食物被送到我们的座位上，或者我们去拿食物，然后我们就参加了这场音乐会。嗯，那场演唱会的后台系统今天很复杂。那场音乐会的结算在今天非常复杂。他们必须了解该用户做了什么、他们买了什么以及他们如何参加音乐会，他们必须决定如何将所有收入分配给参与的所有不同企业。</p>\n<p>而今天，这个过程需要数周或数月才能确定如何将其全部拆分。你想一想是什么推动了下一代消费者如何与一家企业互动，而这反过来又需要向许多不同的企业付款，Space and Time 正在构建的区块链用例和数据仓库用例正好位于其中。这非常强大，因为大多数企业都以这种方式运营，所以现在你开始整体地桥接 Web2 和 Web3。</p>\n<p><strong>封闭的 alpha 即将到来，人们如何参与？</strong></p>\n<p>Nate：我们的目标是在年底推出我们的封闭式 alpha。我们确实希望参与我们封闭的 alpha 测试。如果您有兴趣参与并且有一个需要数据的项目并且您希望能够与该数据进行交互，请联系 Mike、联系 Spencer、联系我们的团队。它关闭是因为我们想确保我们在 Web3 中测试的 DeFi 和游戏中有正确的用例，我们想确保您拥有正确的资源和支持，我们想确保您从 alpha 角度来看，拥有您需要的一切。但它有点侧重于业务用例。因此，如果您正在从事一个项目，并且想尝试一下我们正在启动的 alpha 项目，请联系我们，我们很乐意与您合作。</p>\n<p><strong>让我们换个话题，Spence，我们最近发布了我们的第一个Space and Time NFT，关于未来的版本，您能告诉我们什么？</strong></p>\n<p>Spencer：首先，我只想对大家表示感谢，感谢大家对我们从第一次 Space and Time NFT drop 中得到的惊人回应，我知道这有点像游击营销策略，我们只是突​​然发布了它。这首先是我们的想法，我们只是想让它变得公平，让每个人都有平等的机会获得一个。 Omar Aqil 是艺术家，我看到你们中的一些人在 Twitter 上给予他爱，我非常感谢。他实际上向我伸出了手，并且对你们给予他的支持以及他收到的所有赞美感到不知所措，所以我只想表达他对社区的感谢。</p>\n<p>就Space and Time 社区NFT的未来计划而言，我们总共收集了五个。我们已经发布了一个，我们还计划在未公开的未来日期再发布四个，我们现在正在调整智能合约的一些功能。一旦我们完成这些，我们就会为你们向社区推出更多 NFT。我们很高兴你们所有人这么早就来了，这就是我们发起这种倡议的目的，真正奖励你们来到这里，在我们的社区中如此活跃。每个在 Twitter 上大喊大叫的人，都不会被忽视！我们审视了所有这些，我们非常感谢绝对的支持，我们很高兴在未来发布更多。就为这些社区 NFT 添加一些实用性而言，目前它们没有实用性。就像我们说的，它们只是供你们佩戴，作为作为该项目早期支持者的荣誉徽章，但我们绝对期待未来也能为 NFT 添加一些Space and Time实用程序。</p>\n<p><strong>测试网的计划是什么？任何人都可以参加吗？是否有任何激励参与的计划？</strong></p>\n<p>Nate：我们计划明年 5 月推出测试网，它将是开放的。关于我们正在构建的令人兴奋的事情是，我们正在创建Space and Time以从主要区块链中获得干净的索引数据，这意味着如果您在测试网期间访问我们的网站并运行查询，您实际上将拥有区块链数据在主要链条上编入索引，准备就绪。所以即使你没有经营企业，即使你没有坐在那里说，“嘿，我没有要连接的 ERP 系统，我不是在制作视频游戏，所以我无法连接Unreal Engine 5，我不需要在大规模环境中合并我的链上和链下数据，”你仍然可以转到 Space and Time 并开始查看区块链数据并运行分析以独立获得更多洞察力将链下数据汇集在一起​​。这是一件非常强大的事情，因为现在你可以开始研究，例如，你遇到的简单问题，比如跨链某些代币的主要持有者，或者查看跨链流动资金池的能力。因此，您可以开始做一些非常强大的事情，因为来自主要链的区块链数据将被编入索引，以便您开始运行查询。</p>\n<p>这将是开放的，您可以开始尝试并参与测试网和测试版。因此，我们看到的令人兴奋的事情是我们希望让您随时可以使用这些数据。我们想让它易于使用。因此，我们将为您存储区块链数据。这不像您必须创建一个新实例来存储数据并为存储的数据付费。我们希望为您提供随时可用的索引数据。因此，当您登录到 Space and Time 并希望仅对区块链数据运行查询时，即使您没有链下数据，它也很容易为您提供，您可以继续运行该数据并运行那些分析，您不必弄清楚如何为数据索引付费。它应该就在那里，随时可以使用。所以我们非常兴奋，我们绝对欢迎大家加入我们在 5 月份推出的测试版本和beta版本。</p>\n<p><strong>当 Space and Time 进入主网时，是否任何人都可以操作节点，还是仅限于具有特殊权限的人？</strong></p>\n<p>Nate：我们希望尽可能多的人对运行节点感兴趣。如果您考虑一下，数据仓库就是节点集群。因此，当我们进入市场并构建节点运营商时，不同之处在于，如果您运行大规模分析，我们将在节点集群上运行它们。所以从集群的角度来看是三个或更多。所以这有点不同于“我有一台笔记本电脑在这里，它没有被使用，我只是想启动它”，但我们确实希望有尽可能多的人参与，也希望有尽可能多的企业参与节点操作可能的。我们正在与一些大型服务器和计算提供商合作，以考虑不同的选择，以及我们如何让可能无法访问服务器或节点集群的人也能参与节点操作。</p>\n<p>所以我们仍处于计划的早期阶段，但我坚信，如果你想参与公用事业，即使你没有大仓库或一堆服务器，你作为人们应该能够参与该生态系统和经济。如果您考虑出租房屋、AirBnB，例如，如果您考虑风骡或石油钻井平台，从某种意义上说，您希望能够参与可能拥有一部分石油钻井平台或实际资产的经济活动石油钻井平台，无需知道如何操作石油钻井平台，无需去钻实际的石油并将石油取出并出售给商品市场。所以我们以同样的方式考虑，因为显然操作服务器集群很复杂，所以我们正在考虑如何确保人们可以作为节点运营商或部分节点运营商参与 Space and Time，所以这是我们正在努力的事情。</p>\n<p><strong>该项目未来的资金计划是什么？当前的资金跑道是否延伸到主网，或者是否会有未来的融资轮次？</strong></p>\n<p>Nate：我们非常荣幸并感谢投资者群体对我们的资助和支持。目前没有计划在我们的测试网之前筹集更多资金。当我们考虑进入主网时，我们有足够的资金来启动进入主网。因此，在我们准备主网上线时，我们会关注市场，以确定什么是最适合企业运营的。但值得庆幸的是，我们已经成功地得到了投资界的支持，对许多人来说，这是一个非常艰难的市场。我们已经能够发展我们的投资社区，并得到他们的支持。所以我们对此表示感谢。但简单的答案是，我们有足够的资金通过主网运行。我们没有计划在今年筹集更多的资金。我们主网上线的目标是在秋天，9月/10月。我们将看看市场情况，我们将看看我们想从主网上线和主网启动的角度实现什么，并确定什么是对公司最好的，但目前还没有计划。</p>\n<p><strong>在上一届 AMA 会议上，有人问到 EVM 兼容网络的问题，Scott 回答说除了以太坊之外，还有支持 Solana 和 Flow 的计划。未来是否还有计划与 Aptos 和 Near 一起推出 SxT？</strong></p>\n<p>Nate：好问题；当您考虑在明年秋天全面投入主网时，我们看到这样一个世界，人们在其中运行应用程序和业务的主要区块链应该可以免费使用，并使用 Space and Time 中的关键数据存储索引。因此，这不是“如果”的问题，而是“何时”的问题。我们谈到了 Solana，我想你看的是 Mysten Labs 和 Sui，对吧？团队目前正在与他们合作为该数据编制索引。所以你看看 Near，你看看 Aptos，你看看 Flow。对我来说，这不是我们是否要这样做的问题，这只是通过数据索引工作并确保其可用最有意义的时间和优先级。但我们绝对希望将主要生态链编入索引，随时可供您作为商品运行查询，作为一种随时可以免费使用的东西。</p>\n<p><strong>Space and Time 参与了 Kwil 最近的一轮融资，看起来 Kwil 将成为 Space and Time 的直接竞争对手，Space and Time 投资该项目的原因是什么？</strong></p>\n<p>Nate：我们非常喜欢 Kwil 的团队，行业需要 Kwil 团队正在建设的东西。我只想先退后一步，考虑将行业数据用于 SQL 所需的不同用例。需要许多不同的用例来支持各种类型的业务和各种类型的分析。如果您考虑 Web2 中的 SQL 解决方案，它们非常庞大且各不相同。运行 Snowflake 数据仓库与 MySQL 有不同的原因。在数据库和数据仓库中操作的原因各不相同，我们不认为这是一个赢家通吃的市场。如果你考虑 Web3，我认为会有很多不同的很棒的、成功的项目，我们相信 Kwil 会成为其中之一。</p>\n<p>因此，当您考虑如何运行各种类型的分析以及这些分析的不同用例时，例如，您会对各种类型的简单 SQL 查询有不同的解决方案。它与 SQL 证明、大规模企业分析、所有主要链的索引有很大不同。所以我们看好 Kwil 的建筑，绝对，他们很棒。我们喜欢这个团队，我们认为在不同类型的用例中使用市场上各种类型的数据库有很多不同的原因。所以我们绝对不相信这是一个赢家通吃的市场，我们对他们在 Kwil 的建设感到兴奋。从某种意义上说，问题是如果您正在构建一个项目，为什么不对所有内容都使用Space and Time呢？虽然你可以，但在某些用例中它可能更有意义，例如，如果你在 Arweave 上，并且你需要运行快速分析，那么启动 Kwil 并在其中运行一些 SQL 分析可能更有意义Arweave 社区。因此，我们对他们正在构建的产品感到兴奋，我们相信许多人都有参与并赢得 SQL 市场的空间。 </p>\n<p><strong>Space and Time相比Web2存储商在数据存储安全方面有什么优势？ Space and Time 如何保护用户数据？</strong></p>\n<p>Nate：我不想太技术化，但是，如果您考虑去中心化网络，就会发现数据安全与中心化网络相比具有特定的优势。如果你将所有数据都放在一个中央数据库中，显然，从数据安全的角度来看，它会变得更容易被黑客攻击，更容易从整体上获取信息并从这个角度成为坏人。虽然 Space and Time 是一个开源项目并且我们希望它是这样，并且我们鼓励每个人共享数据并围绕数据相互交互，但我们也有端到端加密，这意味着如果您选择当您参与 Space and Time 时，您可以确定数据是否需要在静态和查询过程中加密。所以这提供了一个非常强大的数据安全能力，因为它总是被加密的。如果您选择加密——顺便说一下，它是可定制的——您可以确定要加密哪些表，然后该表在静态和动态中加密。我们还有一些非常独特的技术和合作伙伴关系，我们也正在使用这些技术和合作伙伴专门针对数据加密。</p>\n<p>然后，很明显，我认为通用的 Web3 响应考虑了我们拥有的各种类型的已知运营商以及围绕节点运营商的激励措施；确保节点运营商的数据和安全性以积极的方式参与是有价值的。我要指出的最后一部分是 SQL 证明。因此，Space and Time 的独特之处在于它具有数据的存储证明和 SQL 证明。因此，如果您在 Space and Time 中运行数据，如果您使用 SQL 证明来确保数据不被篡改，那么您将获得额外的安全级别。当数据进入时，您拥有额外级别的安全性以确保数据不被篡改并且存在存储证明。</p>\n<p>Scott 和团队正在构建的索引平台令人兴奋的事情之一是，他们也在推动对进入Space and Time 的实际索引数据的防篡改洞察。因此，在许多不同的领域中，索引数据的防篡改具有一定程度的安全性：SQL 证明、数据加密、网络去中心化以及围绕参与者激励的节点操作。因此，从数据安全的角度来看，有许多不同的领域存在制衡，所有这些都是在这方面对 Web2 的改进。</p>\n<p><strong>Chainlink 是传统市场和加密世界领先的预言机提供商，Space and Time 与 Chainlink 合作，以提高链上和链下数据库的及时性和准确性。您能告诉我们更多有关 Space and Time 如何使用 Chainlink 网络的信息吗？</strong></p>\n<p>Nate：Chainlink 是一个了不起的合作伙伴。他们是我们从第一天开始就与他们一起构建的人，我们甚至在考虑构建去中心化数据仓库和构建这个数据生态系统的结构时就构建了前一天。我想说的第一件事是，我们对 Web3 如此兴奋和看好的原因之一是能够在 Web3 的新数据标准上进行协作。成为 Chainlink BUILD 计划的一部分对我们来说真的很令人兴奋，因为我们可以与他们正在构建的先驱一起参与 Web3 的真正前瞻性数据开放标准构建。我们不必去构建预言机结构，因为 Chainlink 是预言机去中心化的领导者。</p>\n<p>因此，令我们兴奋的是，我们可以参与并专注于数据库，专注于数据仓库，以与 Chainlink 正在构建的生态系统进行交互。因此，我们开始参与并扩展我们的数据用例，而不必在其他人比我们能力强得多的领域自己构建所有内容。但我会给你举个例子。因此，当您考虑我们将如何使用 Chainlink 的预言机向前推进时，我们总是会讨论如何从智能合约查询数据仓库。这样做的能力与 Chainlink 预言机有关，对吧？我们总是谈论我们需要如何能够获取数据仓库中的数据并将其写回智能合约。做到这一点的能力，能够将其放回智能合约的促成因素，是与 Chainlink 围绕其预言机合作的要求和需要。因此，如果您从数据仓库的角度查看从Space and Time查询的内容之间的数据流，以及作为正在运行的分析，什么被放回链上，Chainlink 处于其中的中心。所以很明显，我非常看好 Chainlink。我认为他们作为一个团队正在建设的东西总是具有前瞻性思维，很高兴有一个专注于让我们走得更快并使我们的技术进一步扩展的合作伙伴，因此，我们非常高兴能与他们合作。</p>\n<p><strong>Space and Time 目前在未来可能的代币发行方面的立场如何？假设的Space and Time代币模型会是什么样子？</strong></p>\n<p>Nate：我们经常收到这个问题，所以我想直截了当。我们目前没有推出代币的计划。话虽这么说，我们相信代币是一种很棒的机制，例如，对于节点操作。你听到我谈到了Space and Time 的隐私和数据隐私。让人们围绕节点操作悬赏以成为优秀的演员是围绕项目代币经济学的一个非常好的用例，这是一种新经济。如果你和Spencer、我自己坐在一张桌子旁，我想我们看到了一个世界，我们想要一个世界，在这个世界中，我们将在明年秋天进入生产状态，并在我们推出节点运营商时，它在这一点上启动令牌是有意义的。这是我个人喜欢做的事情，也是我知道其他联合创始人喜欢做的事情。</p>\n<p>我们已经在研究各种类型的代币经济学和模型。如果市场允许我们，如果我们能够，我们正在考虑。您可以围绕社区做很多很酷的事情，对吗？假设你创建了一个新的数据模型，你创建了一个数据管道，你创建了一种新型的分析报告，你想与人们分享它，人们开始使用它，人们开始参与你构建的东西，它是对整个社区来说是一项净正资产。作为一个使用代币模型的社区，您可以做一些非常了不起的事情来增加 Space and Time 的分析和工具的整体使用和管道。所以这是一个很长的答案。目前没有推出代币的计划。这并不是说我们没有在做这件事，也不是说我们不想推出代币。我认为从某种意义上说，代币发布的最佳时机是在明年年底主网发布时。但要做到这一点，必须有很多事情到位。</p>\n<p><strong>迄今为止最大的发展挑战是什么？</strong></p>\n<p>Nate：我认为大多数人会假设 SQL 证明。如果您考虑围绕 SQL Proof of SQL 的创新，我再次非常看好 SQL Proof of SQL。我认为这将改变我们将数据传输到链上和链下智能合约的方式。但对公司来说，更大的工程挑战可能是混合事务和分析数据库，即 Space and Time 的实际数据库，很多人忽视了我们从技术角度构建的内容。在今天的 Web2 中，你有数据仓库，就像你有 Databricks，你有 Teradata，你有 Snowflake，所以你有运行大规模分析的数据仓库。所以如果你想问非常复杂的问题，你有一个数据仓库来回答这个问题。例如，“得克萨斯州有多少 18 到 22 岁的人喜欢某种类型的音乐？”这样的问题。这是一个与快速交易问题截然不同的问题，例如，“Nate 今天买了什么？”</p>\n<p>事务性问题在数据库中提出，分析性问题在数据仓库中提出。然后如果你想把这些数据集放在一起，你实际上需要 ETL 工具，这意味着你从数据库中提取-转换-加载到数据仓库中，这样你就可以开始提出更复杂的问题。因此，一家 Web2 公司将拥有多个数据仓库、多个数据库和 ETL 工具来将所有这些整合在一起，Space and Time 在同一环境中进行交易和分析。那个混合事务和分析处理系统非常复杂，因为 Web2 今天从来没有解决过那个解决方案。在 Web2 中，您要购买多个数据库和工具。所以我认为更大的技术壮举实际上是在单一环境中结合了交易和分析处理。它有效。我们正在构建它，我们将要发布它。我们真的很兴奋，因为 Scott 和我花了 10 年时间围绕 Web2 破碎的数据架构，这些架构将多个数据库拼凑在一起，试图将这两个过程合二为一，所以这可能是我们正在完成的一项更具挑战性的技术壮举。</p>\n<p><strong>是什么让 Space and Time 成为一个能够成功的独特项目？</strong></p>\n<p>Nate：我喜欢这个问题，Spencer，你想回复吗？</p>\n<p>Spencer：简短的回答是，我真的认为我们的团队在这里要承担很多责任。我的意思是，我们现在拥有业内最勤奋、最有才华的团队之一。显然，我们正在通过为智能合约提供防篡改分析来连接链上和链下数据，从而在该领域做一些创新，这是我们的主要工作。但是我们拥有最勤奋的团队之一，一些这个领域最有才华的密码学家，一些这个领域最有才华的数据库工程师，我们正在为这个项目夜以继日地工作，这里的每个人都非常热情我们有一个了不起的社区，你们，这让我们曝光了。我认为你们是我们这一整年努力的证明，从会议到后端编码的一切。所以不确定我是否在那里从技术上回答了 T，但也许我会把它传递给你，让你快速总结一下这个问题，Nate。</p>\n<p>Nate：当然，我不同意。我认为我们的团队是非凡的。你看看数据库、密码学、数据仓库方面的专家，我们有非常好的营销，我们也有一个非常好的进入市场的团队。该团队专注于交付项目，并且全天候工作。我要补充的另一件事是，我认为从商业角度来看，Web3 将会获胜。如果你正在构建一个新的应用程序，我坚信你将在 Web3 中构建新的应用程序作为一项业务。而且我认为 Web3 社区将继续高速增长，新的应用程序将主导市场。那是我的信念。这就是我们构建 Web3 原生内容的原因。因为我们可以接管所有 Web2 业务，并进行艰苦的工作，将其推倒重来，并将其转移到 Web3 结构中。但我认为在一段时间内，你会看到想要建立业务的人，想要参与不同项目的人，将想要参与 Web3 构建。经济学是不同的，经济学关注的是社区，我认为在一段时间内，Web3 业务结构将被证明是赢家。当我们交付我们正在构建的东西并在 Web3 结构中交付以供采用时，我认为这会创造出真正全面发展市场的能力的浪潮。因此，我们对这个机会感到非常兴奋，因为正在建立的市场实际上是为世界建立的下一代业务，我们将坐在其中。</p>\n<p>如果团队不专注于交付，它就不会发生。这将成为使我们能够成功的惯性和起源。但如果你说不出来，我非常、非常看好这个社区，因为我们都在这里，因为我们认为有更好的方式来相互交流。我们认为我们的数据有更好的使用方式。我们认为，有一种更好的方式来构建业务来为多数人而不是少数人提供动力。因此，我认为 Web3 的整体商业原则将在未来几年和几十年内继续加速并继续在市场上取胜。</p>\n<p><strong>总结</strong></p>\n<p>Spencer：太好了，伙计们，我想今天的 AMA 就到此为止了。大家，随时联系我们吧！我们希望在这里沟通零障碍，我们希望你们能与我们交谈。请在 Discord 上联系 Mike 和我本人。Mike在沟通和确保听到您所有的声音方面非常出色。我们想让 Discord AMA 变得更加常规。我们最近经常出差，所以很辛苦，但我们肯定会让这些变得更规律。我只想再次感谢大家的支持，我怎么强调我们还早呢。我们在这里制作还不到一整年，我们对未来有很多期待。所以我会用它来结束它。Mike，非常感谢你穿上它，感谢你组织一切。好的，伙计们，我们会在下一个节目中找到你。</p>\n<p>Nate：谢谢大家！</p>\n<p><code>[会议结束]</code></p>\n<p><strong>Space and Time链接：</strong></p>\n<p>网站： <a href=\"http://spaceandtime.io/\">http://spaceandtime.io</a></p>\n<p>推特： <a href=\"http://twitter.com/spaceandtimeDB\">http://twitter.com/spaceandtimeDB</a></p>\n<p>Discord： <a href=\"http://discord.com/spaceandtimeDB\">http://discord.com/spaceandtimeDB</a></p>\n<p>电报： <a href=\"http://t.me/spaceandtimeDB\">http://t.me/spaceandtimeDB</a></p>\n<p><em>LinkedIn</em>： <a href=\"http://linkedin.com/space-and-time-db\">http://linkedin.com/space-and-time-db</a></p>\n<h2 id=\"reddit：-httpredditcomrspaceandtimedb\">Reddit： <a href=\"http://reddit.com/r/spaceandtimeDB\">http://reddit.com/r/spaceandtimeDB</a></h2>\n<p><em>If you find submirror valuable, please consider donate to wong2.eth to help cover server cost.</em></p>\n","content:encodedSnippet":"Discord 音频 AMA 摘要，2022 年 10 月 25 日。\nSpace and Time 参与者:\nNate Holiday，首席执行官兼联合创始人\nSpencer Reeves, 创意总监\n感谢所有出席的社区成员！\n[会议开始]\n介绍\nSpencer：我们很高兴你们都在这里，我们的社区在 SmartCon 之后绝对爆炸式增长。我的名字是Spencer Reeves，我是 Space and Time 的创意总监。我很高兴在这里与你们中的许多人互动，欢迎所有新面孔！我将把话筒交给 Nate。\nNate：谢谢，Spencer，我对这次 AMA 感到非常兴奋，我整个星期都在期待它。正如Spencer 所说，我们对社区感到非常兴奋。我们很高兴你在这里，我们很高兴我们正在共同建设它。我们正在努力做很多令人兴奋的事情，我们希望在我们继续前进的过程中开始让社区参与进来。我想你会从我们这里看到我们在 Discord 上的参与度也越来越高。我叫 Nate Holiday，是 Space and Time 的首席执行官兼联合创始人，我真的很期待在接下来的一个小时里回答问题，并确保您对项目和我们正在构建的内容有尽可能多的访问权限和洞察力作为一家公司以及公司的员工和创始人，在我们继续构建它的过程中，我们希望与您进行非常公开和透明的接触。\nAMA\nSpace and Time项目是如何产生的？有什么故事？主要团队是如何组建的？\nNate：Space and Time 是一个为 Web3 原生构建的去中心化数据仓库。而Spencer和我，我们在数据仓库方面拥有丰富的经验。如果您考虑数据库和数据仓库，我们都在 Teradata 作为高管工作了很长时间。 Teradata 已经建立了业内领先、最重要的数据仓库之一。它已经存在了 40 年，并且还进行了整个云转型。 Teradata 开始将他们的数据仓库移植到云端，您开始看到其他类型的云提供商围绕 Snowflake 和 Databricks 以及各种类型的云提供商兴起。\nWeb2 数据库和数据仓库的问题是，第一，它们非常集中。如果你考虑云服务，你甚至会放大数据库和数据仓库的集中化，因为一切都在转移到少数主要云提供商。其中一部分真的很好：如果你想建立新业务，有很多云服务可以让建立新业务变得非常容易，并且可以尽早开始。但是世界上的中心化数据库也存在很多问题。随着世界走向去中心化，随着世界从不同业务之间的无边界整合转变，我们坚信数据库和数据仓库的去中心化是新的前沿，是下一个前沿。\n我进入 Web3 是通过 Chainlink，作为 Chainlink 的战略顾问，我开始与团队围绕上市、数据战略和战略计划展开合作。对我来说变得非常明显的一件事是，正在构建的去中心化应用程序都是构建在我们帮助创建的 Web2 结构上的：这些集中式数据库，这些大型云服务提供商。少数人控制着多数人的大量数据。如果你正在构建去中心化的应用程序，我们应该有去中心化的数据库和数据仓库来支持它，将隐私带回互联网成员，确保你对你的数据有完全的控制权，同时也确保当你考虑正在构建的应用程序，它们可以被信任和验证。\n你看看当今世界上正在构建的 DeFi 应用程序，我想我们所有人都知道，在一周又一周的新闻中，你继续听到关于黑客的信息，你继续听到人们得到他们不应该得到的信息可以访问，有正在发生的内部工作。因此，这些集中式数据库存在一个已知问题。如果你正在构建一个去中心化的应用程序，你需要确保它是安全的，你需要确保它广泛分布，你需要确保你提供给最终用户、应用程序的实际数据， DeFi 项目，实际用户可以信任它。因此，我们看到了一个巨大的机会，我们可以致力于构建下一代数据库，下一代软件。\n如果你只是从数据库转换的角度考虑，你可以把它放在一张非常简单的幻灯片中，说二十年前它是内部部署数据库和数据仓库，你有世界上的 Oracles 和世界上的 Teradatas。现在你有，目前正在建设中，云数据库，你有各种类型的云服务器和数据库，为当今世界提供动力。而在未来，我们正在建设未来，下一代数据库技术和数据仓库，它是去中心化的。因此，我们真的很高兴能为这一旅程提供动力并进行建设。\n对于技术水平不高的人，您能否用更简单的术语解释Space and Time？\nNate：是的，这是一个很好的问题，我们一直都在问这个问题。对于世界上的大多数人来说，甚至数据仓库的概念也是一个复杂的概念。我的想法是数据仓库允许将表大规模连接在一起以进行分析和建模并为业务流程提供动力。所以简单来说，数据库和数据仓库，我用不同的术语来使用它们，因为它们在行业中做不同的事情。但总的来说，对于不了解数据库和数据仓库的人来说，如果你去 ebay.com 或者你去你最喜欢的购物网站，他们会运行不同类型的推荐引擎来确定你可能喜欢什么，什么你可能喜欢看，你可能喜欢买什么。这些推荐引擎使用关于你和你这样的人的数据以及相似的模型来根据你在网络中的交互方式来确定他们应该向你展示什么。\n数据仓库还用于为企业提供动力，仅从账簿结账的角度来看，如果你今天想去经营一家企业，假设你是一家上市公司，你希望能够每周、每个月、肯定每个月都结账如果你是公开交易的，但即使是每一天，也需要数据库和数据仓库的力量才能确定当天、那一周、那个月、那个季度的成本和收入，以便能够确定您的业务所在的位置。显然，您对收入和成本的洞察力越多，您在建立业务时就越容易做出改变，以确保在结束一个月、结束一个季度时，您对结果有更多的控制权，这将给市场和投资者带来更大的信心。\n因此，这些只是我们考虑用例时的两个示例，我喜欢的另一个是游戏。如果您曾经下载过游戏并经历了这个入职流程，这个流程简单吗？那个过程很难吗？在这个过程中，有人会因为你要求的信息过于机密、他们不想给你，或者你有太多的步骤要经过而退出吗？例如，帮助一家游戏公司确定您何时吸引客户，这是什么样的？拥有该应用程序的数据能力是一个非常好的用例，以确保您可以与客户互动并以减少该游戏中入职摩擦的方式入职。然后也只是玩电子游戏。如果你想一想谁在你的社交网络中，你是如何与他们互动的，所有这些都是通过后端的数据库和数据仓库运行的，以通过技术设备和通过互联网。因此，我们正在为此提供动力，以便在您通过各种技术相互交流时减少世界上的摩擦。\n我们听到很多关于 SQL Proof of SQL 的信息，你能详细解释一下它，它在《Space and Time》中扮演什么角色，以及为什么它如此新颖吗？\nNate：当然，SQL 证明是有远见的，它将改变市场，我们非常看好 SQL 证明。这就是为什么。如果您考虑一下我刚才谈到的所有业务流程，这些流程今天都在集中式数据库上运行，并由集中式数据仓库提供支持。今天，全世界都相信拥有服务器的人、拥有软件和数据库的人以及在这些服务器、软件和数据库上运行的实际公司不会造成伤害。我们只是相信这是一个公平和诚实的系统，而实际上，公司每天都在优化他们参与的方式，以有利于他们的用户参与，增加收入，降低成本。这很公平；他们有能力在一段时间内使用数据改善业务。\n但是，如果您考虑去中心化应用程序，现在您突然需要确保您可以信任您的资金流向。您知道，您与该应用程序交互的方式是否公平？如果你正在玩电子游戏，如果你正在使用 DeFi 协议，那么这些牌是否对你不利？因此，我们正在构建的真正令人兴奋的是，在未来一年、两年、三年、四年、五年、十年、二十年内，每个人都认为今天公平的集中式流程将转向智能合约，令人兴奋的部分是这些智能合约将会自动化，这样就没有人的参与和互动。令人兴奋的是，通过 SQL Proof of SQL，我们可以使向智能合约交付的数据可验证和防篡改，以便您作为用户可以信任它。所以你可以说，在运行时，是否有任何东西篡改了数据？有没有添加数据？是否删除了任何数据？他们是否改变了以前运行查询的方式，这样输出可能会有所不同，或者卡片的堆叠方式会有所不同？\n因此，围绕 Proof of SQL 的令人兴奋的部分是，智能合约现在可以查询整个数据仓库，而且从该数据仓库查询的内容比今天可以查询的内容大很多倍。所以这意味着防篡改分析的用例增长，对吧？因为对于您可以在数据仓库中执行的任何操作，现在您可以将防篡改、可验证、无需信任的结果交付给智能合约。所以现在您可以开始采用该业务逻辑或自动化，并且可以将其转移到可以信任的智能合约中。\n令人兴奋的是，它改变了权力动态。它说，如果你想参与 Web3 应用程序的新世界，你应该使用 SQL 证明，因为它向智能合约证明你所做的事情是公平和诚实的。而且它也向智能合约证明某些东西没有被篡改过。如果您考虑一下，用户会喜欢它，因为它是透明的，它是防篡改的。企业喜欢它还因为，想想看，它是公平和透明的。如果我今天是一个 DeFi 协议的首席执行官，该协议在链上为数亿美元或数十亿美元提供支持，并且我在集中式数据库中运行所有这些协议，我晚上将无法入睡。因为作为一家公司的首席执行官，我也希望有信心，如果我为数亿美元提供动力，我不会在第二天醒来时看到内部黑客或外部黑客，结果现在我必须决定如何最好地满足我们客户的需求，因为一亿美元被盗了。\n因此，在我们前进的过程中，双方都会喜欢能够为智能合约提供支持的防篡改分析的能力。\n您是在构建一个仅用于其他 Web3 项目的产品，还是用于替换现有的 Web2 数据存储和处理解决方案？如果是后者，什么会吸引大公司在他们今天使用的解决方案上转向 Space and Time？\nNate：另一个很好的问题，Web3 的应用程序世界非常庞大，并且正在以非常快的速度增长。 Space and Time 是一个原生的 Web3 去中心化数据仓库，它将推动行业向前发展。我们正在为此建造它。因此，我们认为要吸引我们的 alpha 客户、beta 客户并最终通过生产发布，我们的重点是我们正在构建应用程序时赋予 Web3 世界权力。话虽这么说，在接下来的几年里，你将开始看到 Web3 和 Web2 的界限融合在一起。已经有 Web2 公司，顺便说一下，非常大的公司，他们打电话给我们说，“嘿，我们知道我们需要开始与区块链数据交互，但我们不确定如何去做，因为我们拥有所有这些集中的 Web2 数据库。我们拥有所有这些数据库和数据仓库专家的工程师，我们对他们都进行了 SQL 培训，但我们真的不知道如何考虑从不同的区块链中获取所有这些区块链数据 ”\n因为他们看到了一个正在生成区块链数据的世界，并且将会有多个区块链，他们将不得不与之交互。他们正在看着它，说：“我们将把所有这些数据从链下转移到我们的企业数据架构中，但我们不确定它适合哪里 ” 他们喜欢关于 Space and Time 的令人兴奋的部分是，他们将其视为入口，我们为数据编制索引，我们将其放入关系数据存储中，我们使其可供他们使用，它在数据仓库结构中他们知道并理解，现在它正在驱动 SQL 语言。因此，现在他们可以开始将他们的 ERP 系统、云端或本地的遗留数据仓库桥接在一起，并且他们可以开始在单一环境中将他们的数据架构桥接在一起。\n如果你想一想，从企业到企业的结构和 Web2 中真正强大的另一件事是这个概念，例如，假设Mike，Spencer和我都去听音乐会，我们坐在那里，我们喜欢这场音乐会，我们玩得很开心。如果您考虑为该音乐会提供支持的企业，那么有数十或数百家企业为该音乐会提供支持。有停车场，有食物，有衬衫，还有售票。坐在那里的所有这些人都在为我们提供服务，但实际上我们只是买票，食物被送到我们的座位上，或者我们去拿食物，然后我们就参加了这场音乐会。嗯，那场演唱会的后台系统今天很复杂。那场音乐会的结算在今天非常复杂。他们必须了解该用户做了什么、他们买了什么以及他们如何参加音乐会，他们必须决定如何将所有收入分配给参与的所有不同企业。\n而今天，这个过程需要数周或数月才能确定如何将其全部拆分。你想一想是什么推动了下一代消费者如何与一家企业互动，而这反过来又需要向许多不同的企业付款，Space and Time 正在构建的区块链用例和数据仓库用例正好位于其中。这非常强大，因为大多数企业都以这种方式运营，所以现在你开始整体地桥接 Web2 和 Web3。\n封闭的 alpha 即将到来，人们如何参与？\nNate：我们的目标是在年底推出我们的封闭式 alpha。我们确实希望参与我们封闭的 alpha 测试。如果您有兴趣参与并且有一个需要数据的项目并且您希望能够与该数据进行交互，请联系 Mike、联系 Spencer、联系我们的团队。它关闭是因为我们想确保我们在 Web3 中测试的 DeFi 和游戏中有正确的用例，我们想确保您拥有正确的资源和支持，我们想确保您从 alpha 角度来看，拥有您需要的一切。但它有点侧重于业务用例。因此，如果您正在从事一个项目，并且想尝试一下我们正在启动的 alpha 项目，请联系我们，我们很乐意与您合作。\n让我们换个话题，Spence，我们最近发布了我们的第一个Space and Time NFT，关于未来的版本，您能告诉我们什么？\nSpencer：首先，我只想对大家表示感谢，感谢大家对我们从第一次 Space and Time NFT drop 中得到的惊人回应，我知道这有点像游击营销策略，我们只是突​​然发布了它。这首先是我们的想法，我们只是想让它变得公平，让每个人都有平等的机会获得一个。 Omar Aqil 是艺术家，我看到你们中的一些人在 Twitter 上给予他爱，我非常感谢。他实际上向我伸出了手，并且对你们给予他的支持以及他收到的所有赞美感到不知所措，所以我只想表达他对社区的感谢。\n就Space and Time 社区NFT的未来计划而言，我们总共收集了五个。我们已经发布了一个，我们还计划在未公开的未来日期再发布四个，我们现在正在调整智能合约的一些功能。一旦我们完成这些，我们就会为你们向社区推出更多 NFT。我们很高兴你们所有人这么早就来了，这就是我们发起这种倡议的目的，真正奖励你们来到这里，在我们的社区中如此活跃。每个在 Twitter 上大喊大叫的人，都不会被忽视！我们审视了所有这些，我们非常感谢绝对的支持，我们很高兴在未来发布更多。就为这些社区 NFT 添加一些实用性而言，目前它们没有实用性。就像我们说的，它们只是供你们佩戴，作为作为该项目早期支持者的荣誉徽章，但我们绝对期待未来也能为 NFT 添加一些Space and Time实用程序。\n测试网的计划是什么？任何人都可以参加吗？是否有任何激励参与的计划？\nNate：我们计划明年 5 月推出测试网，它将是开放的。关于我们正在构建的令人兴奋的事情是，我们正在创建Space and Time以从主要区块链中获得干净的索引数据，这意味着如果您在测试网期间访问我们的网站并运行查询，您实际上将拥有区块链数据在主要链条上编入索引，准备就绪。所以即使你没有经营企业，即使你没有坐在那里说，“嘿，我没有要连接的 ERP 系统，我不是在制作视频游戏，所以我无法连接Unreal Engine 5，我不需要在大规模环境中合并我的链上和链下数据，”你仍然可以转到 Space and Time 并开始查看区块链数据并运行分析以独立获得更多洞察力将链下数据汇集在一起​​。这是一件非常强大的事情，因为现在你可以开始研究，例如，你遇到的简单问题，比如跨链某些代币的主要持有者，或者查看跨链流动资金池的能力。因此，您可以开始做一些非常强大的事情，因为来自主要链的区块链数据将被编入索引，以便您开始运行查询。\n这将是开放的，您可以开始尝试并参与测试网和测试版。因此，我们看到的令人兴奋的事情是我们希望让您随时可以使用这些数据。我们想让它易于使用。因此，我们将为您存储区块链数据。这不像您必须创建一个新实例来存储数据并为存储的数据付费。我们希望为您提供随时可用的索引数据。因此，当您登录到 Space and Time 并希望仅对区块链数据运行查询时，即使您没有链下数据，它也很容易为您提供，您可以继续运行该数据并运行那些分析，您不必弄清楚如何为数据索引付费。它应该就在那里，随时可以使用。所以我们非常兴奋，我们绝对欢迎大家加入我们在 5 月份推出的测试版本和beta版本。\n当 Space and Time 进入主网时，是否任何人都可以操作节点，还是仅限于具有特殊权限的人？\nNate：我们希望尽可能多的人对运行节点感兴趣。如果您考虑一下，数据仓库就是节点集群。因此，当我们进入市场并构建节点运营商时，不同之处在于，如果您运行大规模分析，我们将在节点集群上运行它们。所以从集群的角度来看是三个或更多。所以这有点不同于“我有一台笔记本电脑在这里，它没有被使用，我只是想启动它”，但我们确实希望有尽可能多的人参与，也希望有尽可能多的企业参与节点操作可能的。我们正在与一些大型服务器和计算提供商合作，以考虑不同的选择，以及我们如何让可能无法访问服务器或节点集群的人也能参与节点操作。\n所以我们仍处于计划的早期阶段，但我坚信，如果你想参与公用事业，即使你没有大仓库或一堆服务器，你作为人们应该能够参与该生态系统和经济。如果您考虑出租房屋、AirBnB，例如，如果您考虑风骡或石油钻井平台，从某种意义上说，您希望能够参与可能拥有一部分石油钻井平台或实际资产的经济活动石油钻井平台，无需知道如何操作石油钻井平台，无需去钻实际的石油并将石油取出并出售给商品市场。所以我们以同样的方式考虑，因为显然操作服务器集群很复杂，所以我们正在考虑如何确保人们可以作为节点运营商或部分节点运营商参与 Space and Time，所以这是我们正在努力的事情。\n该项目未来的资金计划是什么？当前的资金跑道是否延伸到主网，或者是否会有未来的融资轮次？\nNate：我们非常荣幸并感谢投资者群体对我们的资助和支持。目前没有计划在我们的测试网之前筹集更多资金。当我们考虑进入主网时，我们有足够的资金来启动进入主网。因此，在我们准备主网上线时，我们会关注市场，以确定什么是最适合企业运营的。但值得庆幸的是，我们已经成功地得到了投资界的支持，对许多人来说，这是一个非常艰难的市场。我们已经能够发展我们的投资社区，并得到他们的支持。所以我们对此表示感谢。但简单的答案是，我们有足够的资金通过主网运行。我们没有计划在今年筹集更多的资金。我们主网上线的目标是在秋天，9月/10月。我们将看看市场情况，我们将看看我们想从主网上线和主网启动的角度实现什么，并确定什么是对公司最好的，但目前还没有计划。\n在上一届 AMA 会议上，有人问到 EVM 兼容网络的问题，Scott 回答说除了以太坊之外，还有支持 Solana 和 Flow 的计划。未来是否还有计划与 Aptos 和 Near 一起推出 SxT？\nNate：好问题；当您考虑在明年秋天全面投入主网时，我们看到这样一个世界，人们在其中运行应用程序和业务的主要区块链应该可以免费使用，并使用 Space and Time 中的关键数据存储索引。因此，这不是“如果”的问题，而是“何时”的问题。我们谈到了 Solana，我想你看的是 Mysten Labs 和 Sui，对吧？团队目前正在与他们合作为该数据编制索引。所以你看看 Near，你看看 Aptos，你看看 Flow。对我来说，这不是我们是否要这样做的问题，这只是通过数据索引工作并确保其可用最有意义的时间和优先级。但我们绝对希望将主要生态链编入索引，随时可供您作为商品运行查询，作为一种随时可以免费使用的东西。\nSpace and Time 参与了 Kwil 最近的一轮融资，看起来 Kwil 将成为 Space and Time 的直接竞争对手，Space and Time 投资该项目的原因是什么？\nNate：我们非常喜欢 Kwil 的团队，行业需要 Kwil 团队正在建设的东西。我只想先退后一步，考虑将行业数据用于 SQL 所需的不同用例。需要许多不同的用例来支持各种类型的业务和各种类型的分析。如果您考虑 Web2 中的 SQL 解决方案，它们非常庞大且各不相同。运行 Snowflake 数据仓库与 MySQL 有不同的原因。在数据库和数据仓库中操作的原因各不相同，我们不认为这是一个赢家通吃的市场。如果你考虑 Web3，我认为会有很多不同的很棒的、成功的项目，我们相信 Kwil 会成为其中之一。\n因此，当您考虑如何运行各种类型的分析以及这些分析的不同用例时，例如，您会对各种类型的简单 SQL 查询有不同的解决方案。它与 SQL 证明、大规模企业分析、所有主要链的索引有很大不同。所以我们看好 Kwil 的建筑，绝对，他们很棒。我们喜欢这个团队，我们认为在不同类型的用例中使用市场上各种类型的数据库有很多不同的原因。所以我们绝对不相信这是一个赢家通吃的市场，我们对他们在 Kwil 的建设感到兴奋。从某种意义上说，问题是如果您正在构建一个项目，为什么不对所有内容都使用Space and Time呢？虽然你可以，但在某些用例中它可能更有意义，例如，如果你在 Arweave 上，并且你需要运行快速分析，那么启动 Kwil 并在其中运行一些 SQL 分析可能更有意义Arweave 社区。因此，我们对他们正在构建的产品感到兴奋，我们相信许多人都有参与并赢得 SQL 市场的空间。 \nSpace and Time相比Web2存储商在数据存储安全方面有什么优势？ Space and Time 如何保护用户数据？\nNate：我不想太技术化，但是，如果您考虑去中心化网络，就会发现数据安全与中心化网络相比具有特定的优势。如果你将所有数据都放在一个中央数据库中，显然，从数据安全的角度来看，它会变得更容易被黑客攻击，更容易从整体上获取信息并从这个角度成为坏人。虽然 Space and Time 是一个开源项目并且我们希望它是这样，并且我们鼓励每个人共享数据并围绕数据相互交互，但我们也有端到端加密，这意味着如果您选择当您参与 Space and Time 时，您可以确定数据是否需要在静态和查询过程中加密。所以这提供了一个非常强大的数据安全能力，因为它总是被加密的。如果您选择加密——顺便说一下，它是可定制的——您可以确定要加密哪些表，然后该表在静态和动态中加密。我们还有一些非常独特的技术和合作伙伴关系，我们也正在使用这些技术和合作伙伴专门针对数据加密。\n然后，很明显，我认为通用的 Web3 响应考虑了我们拥有的各种类型的已知运营商以及围绕节点运营商的激励措施；确保节点运营商的数据和安全性以积极的方式参与是有价值的。我要指出的最后一部分是 SQL 证明。因此，Space and Time 的独特之处在于它具有数据的存储证明和 SQL 证明。因此，如果您在 Space and Time 中运行数据，如果您使用 SQL 证明来确保数据不被篡改，那么您将获得额外的安全级别。当数据进入时，您拥有额外级别的安全性以确保数据不被篡改并且存在存储证明。\nScott 和团队正在构建的索引平台令人兴奋的事情之一是，他们也在推动对进入Space and Time 的实际索引数据的防篡改洞察。因此，在许多不同的领域中，索引数据的防篡改具有一定程度的安全性：SQL 证明、数据加密、网络去中心化以及围绕参与者激励的节点操作。因此，从数据安全的角度来看，有许多不同的领域存在制衡，所有这些都是在这方面对 Web2 的改进。\nChainlink 是传统市场和加密世界领先的预言机提供商，Space and Time 与 Chainlink 合作，以提高链上和链下数据库的及时性和准确性。您能告诉我们更多有关 Space and Time 如何使用 Chainlink 网络的信息吗？\nNate：Chainlink 是一个了不起的合作伙伴。他们是我们从第一天开始就与他们一起构建的人，我们甚至在考虑构建去中心化数据仓库和构建这个数据生态系统的结构时就构建了前一天。我想说的第一件事是，我们对 Web3 如此兴奋和看好的原因之一是能够在 Web3 的新数据标准上进行协作。成为 Chainlink BUILD 计划的一部分对我们来说真的很令人兴奋，因为我们可以与他们正在构建的先驱一起参与 Web3 的真正前瞻性数据开放标准构建。我们不必去构建预言机结构，因为 Chainlink 是预言机去中心化的领导者。\n因此，令我们兴奋的是，我们可以参与并专注于数据库，专注于数据仓库，以与 Chainlink 正在构建的生态系统进行交互。因此，我们开始参与并扩展我们的数据用例，而不必在其他人比我们能力强得多的领域自己构建所有内容。但我会给你举个例子。因此，当您考虑我们将如何使用 Chainlink 的预言机向前推进时，我们总是会讨论如何从智能合约查询数据仓库。这样做的能力与 Chainlink 预言机有关，对吧？我们总是谈论我们需要如何能够获取数据仓库中的数据并将其写回智能合约。做到这一点的能力，能够将其放回智能合约的促成因素，是与 Chainlink 围绕其预言机合作的要求和需要。因此，如果您从数据仓库的角度查看从Space and Time查询的内容之间的数据流，以及作为正在运行的分析，什么被放回链上，Chainlink 处于其中的中心。所以很明显，我非常看好 Chainlink。我认为他们作为一个团队正在建设的东西总是具有前瞻性思维，很高兴有一个专注于让我们走得更快并使我们的技术进一步扩展的合作伙伴，因此，我们非常高兴能与他们合作。\nSpace and Time 目前在未来可能的代币发行方面的立场如何？假设的Space and Time代币模型会是什么样子？\nNate：我们经常收到这个问题，所以我想直截了当。我们目前没有推出代币的计划。话虽这么说，我们相信代币是一种很棒的机制，例如，对于节点操作。你听到我谈到了Space and Time 的隐私和数据隐私。让人们围绕节点操作悬赏以成为优秀的演员是围绕项目代币经济学的一个非常好的用例，这是一种新经济。如果你和Spencer、我自己坐在一张桌子旁，我想我们看到了一个世界，我们想要一个世界，在这个世界中，我们将在明年秋天进入生产状态，并在我们推出节点运营商时，它在这一点上启动令牌是有意义的。这是我个人喜欢做的事情，也是我知道其他联合创始人喜欢做的事情。\n我们已经在研究各种类型的代币经济学和模型。如果市场允许我们，如果我们能够，我们正在考虑。您可以围绕社区做很多很酷的事情，对吗？假设你创建了一个新的数据模型，你创建了一个数据管道，你创建了一种新型的分析报告，你想与人们分享它，人们开始使用它，人们开始参与你构建的东西，它是对整个社区来说是一项净正资产。作为一个使用代币模型的社区，您可以做一些非常了不起的事情来增加 Space and Time 的分析和工具的整体使用和管道。所以这是一个很长的答案。目前没有推出代币的计划。这并不是说我们没有在做这件事，也不是说我们不想推出代币。我认为从某种意义上说，代币发布的最佳时机是在明年年底主网发布时。但要做到这一点，必须有很多事情到位。\n迄今为止最大的发展挑战是什么？\nNate：我认为大多数人会假设 SQL 证明。如果您考虑围绕 SQL Proof of SQL 的创新，我再次非常看好 SQL Proof of SQL。我认为这将改变我们将数据传输到链上和链下智能合约的方式。但对公司来说，更大的工程挑战可能是混合事务和分析数据库，即 Space and Time 的实际数据库，很多人忽视了我们从技术角度构建的内容。在今天的 Web2 中，你有数据仓库，就像你有 Databricks，你有 Teradata，你有 Snowflake，所以你有运行大规模分析的数据仓库。所以如果你想问非常复杂的问题，你有一个数据仓库来回答这个问题。例如，“得克萨斯州有多少 18 到 22 岁的人喜欢某种类型的音乐？”这样的问题。这是一个与快速交易问题截然不同的问题，例如，“Nate 今天买了什么？”\n事务性问题在数据库中提出，分析性问题在数据仓库中提出。然后如果你想把这些数据集放在一起，你实际上需要 ETL 工具，这意味着你从数据库中提取-转换-加载到数据仓库中，这样你就可以开始提出更复杂的问题。因此，一家 Web2 公司将拥有多个数据仓库、多个数据库和 ETL 工具来将所有这些整合在一起，Space and Time 在同一环境中进行交易和分析。那个混合事务和分析处理系统非常复杂，因为 Web2 今天从来没有解决过那个解决方案。在 Web2 中，您要购买多个数据库和工具。所以我认为更大的技术壮举实际上是在单一环境中结合了交易和分析处理。它有效。我们正在构建它，我们将要发布它。我们真的很兴奋，因为 Scott 和我花了 10 年时间围绕 Web2 破碎的数据架构，这些架构将多个数据库拼凑在一起，试图将这两个过程合二为一，所以这可能是我们正在完成的一项更具挑战性的技术壮举。\n是什么让 Space and Time 成为一个能够成功的独特项目？\nNate：我喜欢这个问题，Spencer，你想回复吗？\nSpencer：简短的回答是，我真的认为我们的团队在这里要承担很多责任。我的意思是，我们现在拥有业内最勤奋、最有才华的团队之一。显然，我们正在通过为智能合约提供防篡改分析来连接链上和链下数据，从而在该领域做一些创新，这是我们的主要工作。但是我们拥有最勤奋的团队之一，一些这个领域最有才华的密码学家，一些这个领域最有才华的数据库工程师，我们正在为这个项目夜以继日地工作，这里的每个人都非常热情我们有一个了不起的社区，你们，这让我们曝光了。我认为你们是我们这一整年努力的证明，从会议到后端编码的一切。所以不确定我是否在那里从技术上回答了 T，但也许我会把它传递给你，让你快速总结一下这个问题，Nate。\nNate：当然，我不同意。我认为我们的团队是非凡的。你看看数据库、密码学、数据仓库方面的专家，我们有非常好的营销，我们也有一个非常好的进入市场的团队。该团队专注于交付项目，并且全天候工作。我要补充的另一件事是，我认为从商业角度来看，Web3 将会获胜。如果你正在构建一个新的应用程序，我坚信你将在 Web3 中构建新的应用程序作为一项业务。而且我认为 Web3 社区将继续高速增长，新的应用程序将主导市场。那是我的信念。这就是我们构建 Web3 原生内容的原因。因为我们可以接管所有 Web2 业务，并进行艰苦的工作，将其推倒重来，并将其转移到 Web3 结构中。但我认为在一段时间内，你会看到想要建立业务的人，想要参与不同项目的人，将想要参与 Web3 构建。经济学是不同的，经济学关注的是社区，我认为在一段时间内，Web3 业务结构将被证明是赢家。当我们交付我们正在构建的东西并在 Web3 结构中交付以供采用时，我认为这会创造出真正全面发展市场的能力的浪潮。因此，我们对这个机会感到非常兴奋，因为正在建立的市场实际上是为世界建立的下一代业务，我们将坐在其中。\n如果团队不专注于交付，它就不会发生。这将成为使我们能够成功的惯性和起源。但如果你说不出来，我非常、非常看好这个社区，因为我们都在这里，因为我们认为有更好的方式来相互交流。我们认为我们的数据有更好的使用方式。我们认为，有一种更好的方式来构建业务来为多数人而不是少数人提供动力。因此，我认为 Web3 的整体商业原则将在未来几年和几十年内继续加速并继续在市场上取胜。\n总结\nSpencer：太好了，伙计们，我想今天的 AMA 就到此为止了。大家，随时联系我们吧！我们希望在这里沟通零障碍，我们希望你们能与我们交谈。请在 Discord 上联系 Mike 和我本人。Mike在沟通和确保听到您所有的声音方面非常出色。我们想让 Discord AMA 变得更加常规。我们最近经常出差，所以很辛苦，但我们肯定会让这些变得更规律。我只想再次感谢大家的支持，我怎么强调我们还早呢。我们在这里制作还不到一整年，我们对未来有很多期待。所以我会用它来结束它。Mike，非常感谢你穿上它，感谢你组织一切。好的，伙计们，我们会在下一个节目中找到你。\nNate：谢谢大家！\n[会议结束]\nSpace and Time链接：\n网站： http://spaceandtime.io\n推特： http://twitter.com/spaceandtimeDB\nDiscord： http://discord.com/spaceandtimeDB\n电报： http://t.me/spaceandtimeDB\nLinkedIn： http://linkedin.com/space-and-time-db\nReddit： http://reddit.com/r/spaceandtimeDB\nIf you find submirror valuable, please consider donate to wong2.eth to help cover server cost.","guid":"https://mirror.xyz/0xaF819C7d5B9E98AfD3b59561a33067a94393E9d2/I1g4fqQGkM3hd7HY5aDyybkPj1RyhR48ymqeuhEJKfo","isoDate":"2022-12-15T15:31:08.000Z","from":"https://submirror.xyz/0xaF819C7d5B9E98AfD3b59561a33067a94393E9d2","hashId":"1653e310d4c6051b7ce11f2bd98ae882"}]