[{"title":"信息真空期，美股会反弹吗？南方东英以太币期货 ETF 和南方东英比特币期货 ETF 目前均已跌破发行价~","link":"https://mirror.xyz/0x8c902B8839010BB1761201d42f788e7eD9FCFD77/KAe27gr_8z6bpW_e9oW0PpIdifK-J8_Pyh0zq-gp6oA","pubDate":"Mon, 19 Dec 2022 03:10:41 GMT","content:encoded":"<p>加密早餐（2022年12月 19日）--------推特：比特币橙子Trader；（看我推特，不迷路；如果你关注我、转发我、点赞我和评论我，你会暴富，不信你试试！~~）</p>\n<p>【最新动态】  纽约联储主席威廉姆斯表示，联邦基金利率不需要超过6%，加息幅度可能超过FOMC的终端利率预期。金山联储主席戴利表示，将利率峰值维持11个月是合理的起点，如有需要，将维持超过11个月。克利夫兰联储主席梅斯特称，没有看到服务业价格方面的通胀进展，明年需要让政策利率保持在5%以上。</p>\n<p>美国12月Markit制造业PMI初值录得46.2，为31个月新低。美国12月Markit服务业PMI初值录得44.4，为4个月新低。美国12月Markit综合PMI录得44.6，为4个月新低。美联储加息赌通胀产生了预期效果，但是经济成本正在增加，经济衰退的风险也随之增加。不过美国前财政萨默斯表示，美国最近的通胀数据令人鼓舞，即将到来的经济衰退可能会比此前预期的更晚到来。</p>\n<p>从美联储官员的讲话中不难看出，当前炒作美联储的政策转向为时尚早。现在最大的问题是市场与美联储产生了对抗，最新发布的经济预测显示明年年底的利率预期中值为5.1%，且2024年前不会降息。即便如此，投资者依然押注美联储2023年只会将利率上调至4.85%的峰值，之后将迅速转向，截止明年年底将降息50个基点。</p>\n<p>美国劳工统计局表示，没有发现任何证据表明其系统遭到破坏，也没有发现关于上周美国CPI数据的发布存在任何可疑活动。上周二，好于预期的通胀数据挂上劳工部网站前数秒内，美国国债期货大涨，这也导致了人们担心数据是否提前泄露。</p>\n<p>本周是信息真空的一周，没有任何美联储官员讲话，在刚刚宣布完成加息后，竟然没有一位官员站出来跟市场进行沟通。本周虽然没有官员讲话，但是有两个时间点的数据还是要关注下。</p>\n<p>本周四21:30，美国上周初请失业金人数公布，前值是21.1，最新公布的数据显示，美国上周首次申领失业救济人数意外降至9月以来最低，劳动力市场失衡持续。如果本次数据再低低于前值21.1万，有可能引发美股的下跌。</p>\n<p>本周五21:30，美国11月核心PCE物价指数公布，前值是5%，预测值为4.6%。这是美联储比较偏爱的通胀指标，所以要稍微重视下。</p>\n<p>未来值得关注的 12 个潜在叙事<a href=\"https://twitter.com/kindahangry/status/1603285156357251073?s=20&amp;t=7pz_Quh3GcY3DZy7sbeHhQ\">https://twitter.com/kindahangry/status/1603285156357251073?s=20&amp;t=7pz_Quh3GcY3DZy7sbeHhQ</a></p>\n<p>据港交所数据显示，南方东英以太币期货 ETF 和南方东英比特币期货 ETF 目前均已跌破发行价，其中南方东英以太币期货 ETF 当前价格为 7.280 港元，跌幅达到 6.73%；南方东英比特币期货 ETF 当前价格跌至 7.480 港元，跌幅为 4.23%。<a href=\"https://www.hkex.com.hk/Market-Data/Securities-Prices/Exchange-Traded-Products/Exchange-Traded-Products-Quote?sym=3068&amp;sc_lang=zh-HK\">https://www.hkex.com.hk/Market-Data/Securities-Prices/Exchange-Traded-Products/Exchange-Traded-Products-Quote?sym=3068&amp;sc_lang=zh-HK</a></p>\n<p>加密交易平台 Gemini 总裁兼首席执行官 Cameron Winklevoss 表示，债权人委员会财务顾问 Houlihan Lokey 已开始倡导一项计划，以解决 Genesis 和 DCG 的流动性问题，并为资金回收提供途径。目前仍处于早期阶段，讨论仍在进行中，但将会在有更多信息后发布通知。 据悉，Houlihan Lokey 是一家美国跨国独立投资银行和金融服务公司，主要服务领域包括并购、资本市场、财务重组和估值。</p>\n<p>据 DefiLlama 数据显示，全网 DeFi 协议总锁仓量（TVL）于昨日再度跌破 400 亿美元，创 2021 年 2 月 11 日以来新低。此前该数据于 11 月 23 日短时跌破 400 亿美元后迅速反弹至 420 亿美元附近。</p>\n<p>a16Z加密团队阅读的书籍和正在玩的游戏：<a href=\"https://a16zcrypto.com/some-books-were-reading-and-games-were-playing-this-winter/\">https://a16zcrypto.com/some-books-were-reading-and-games-were-playing-this-winter/</a></p>\n<p>Vitalik眼中22年的5件大事<a href=\"https://shows.banklesshq.com/p/vitaliks-top-5-crypto-wins-of-2022\">https://shows.banklesshq.com/p/vitaliks-top-5-crypto-wins-of-2022</a></p>\n<p>以太坊周报重点内容：核心开发者更新上海升级 EIP 细节及后续 Capella 升级的规划；扩容解决方案 EIP-4844 的 Devnet 3 预计将于下周发布；关于提议者构建者分离方案（PBS）拍卖机制的研究。<a href=\"https://weekinethereumnews.com/week-in-ethereum-news-december-17-2022/\">https://weekinethereumnews.com/week-in-ethereum-news-december-17-2022/</a></p>\n<p>Coinbase Ventures 投资版图：300 多个项目，重点布局基础设施<a href=\"https://foresightnews.pro/article/detail/21266\">https://foresightnews.pro/article/detail/21266</a></p>\n<p>没事来我们电报群吧，这里帅哥，美女多，代码也多，话题也多，机会多多，还可以防失联。（电报群搜索：橙子的朋友们）</p>\n<p>【行情分析】 比特币上周跟随美股下跌之后，目前为止没有任何起色，无论是从周线，日线级别，都无法看到积极的信号，更多的是弱势调整。</p>\n<p>4小时级别，反弹上升趋势终究被破坏，目前又要重新恢复调整态势，当前正处于再次验证底部支撑时候，所以下方15000附近的支撑将会变得至关重要。</p>\n<p>我们始终抱有大幅度反弹的期待，今年走熊以来市场一直没有像样的反弹走势，所以这种反弹一定会来，当然这也在某种程度上取决于宏观层面的市场数据和信心。</p>\n<h2 id=\"【风险提醒】-数字资产波动较大，风险极高，请谨慎参与，杜绝满仓梭哈，拒绝贷款杠杆；\">【风险提醒】 数字资产波动较大，风险极高，请谨慎参与，杜绝满仓梭哈，拒绝贷款杠杆；</h2>\n<p><em>If you find submirror valuable, please consider donate to wong2.eth to help cover server cost.</em></p>\n","content:encodedSnippet":"加密早餐（2022年12月 19日）--------推特：比特币橙子Trader；（看我推特，不迷路；如果你关注我、转发我、点赞我和评论我，你会暴富，不信你试试！~~）\n【最新动态】  纽约联储主席威廉姆斯表示，联邦基金利率不需要超过6%，加息幅度可能超过FOMC的终端利率预期。金山联储主席戴利表示，将利率峰值维持11个月是合理的起点，如有需要，将维持超过11个月。克利夫兰联储主席梅斯特称，没有看到服务业价格方面的通胀进展，明年需要让政策利率保持在5%以上。\n美国12月Markit制造业PMI初值录得46.2，为31个月新低。美国12月Markit服务业PMI初值录得44.4，为4个月新低。美国12月Markit综合PMI录得44.6，为4个月新低。美联储加息赌通胀产生了预期效果，但是经济成本正在增加，经济衰退的风险也随之增加。不过美国前财政萨默斯表示，美国最近的通胀数据令人鼓舞，即将到来的经济衰退可能会比此前预期的更晚到来。\n从美联储官员的讲话中不难看出，当前炒作美联储的政策转向为时尚早。现在最大的问题是市场与美联储产生了对抗，最新发布的经济预测显示明年年底的利率预期中值为5.1%，且2024年前不会降息。即便如此，投资者依然押注美联储2023年只会将利率上调至4.85%的峰值，之后将迅速转向，截止明年年底将降息50个基点。\n美国劳工统计局表示，没有发现任何证据表明其系统遭到破坏，也没有发现关于上周美国CPI数据的发布存在任何可疑活动。上周二，好于预期的通胀数据挂上劳工部网站前数秒内，美国国债期货大涨，这也导致了人们担心数据是否提前泄露。\n本周是信息真空的一周，没有任何美联储官员讲话，在刚刚宣布完成加息后，竟然没有一位官员站出来跟市场进行沟通。本周虽然没有官员讲话，但是有两个时间点的数据还是要关注下。\n本周四21:30，美国上周初请失业金人数公布，前值是21.1，最新公布的数据显示，美国上周首次申领失业救济人数意外降至9月以来最低，劳动力市场失衡持续。如果本次数据再低低于前值21.1万，有可能引发美股的下跌。\n本周五21:30，美国11月核心PCE物价指数公布，前值是5%，预测值为4.6%。这是美联储比较偏爱的通胀指标，所以要稍微重视下。\n未来值得关注的 12 个潜在叙事https://twitter.com/kindahangry/status/1603285156357251073?s=20&t=7pz_Quh3GcY3DZy7sbeHhQ\n据港交所数据显示，南方东英以太币期货 ETF 和南方东英比特币期货 ETF 目前均已跌破发行价，其中南方东英以太币期货 ETF 当前价格为 7.280 港元，跌幅达到 6.73%；南方东英比特币期货 ETF 当前价格跌至 7.480 港元，跌幅为 4.23%。https://www.hkex.com.hk/Market-Data/Securities-Prices/Exchange-Traded-Products/Exchange-Traded-Products-Quote?sym=3068&sc_lang=zh-HK\n加密交易平台 Gemini 总裁兼首席执行官 Cameron Winklevoss 表示，债权人委员会财务顾问 Houlihan Lokey 已开始倡导一项计划，以解决 Genesis 和 DCG 的流动性问题，并为资金回收提供途径。目前仍处于早期阶段，讨论仍在进行中，但将会在有更多信息后发布通知。 据悉，Houlihan Lokey 是一家美国跨国独立投资银行和金融服务公司，主要服务领域包括并购、资本市场、财务重组和估值。\n据 DefiLlama 数据显示，全网 DeFi 协议总锁仓量（TVL）于昨日再度跌破 400 亿美元，创 2021 年 2 月 11 日以来新低。此前该数据于 11 月 23 日短时跌破 400 亿美元后迅速反弹至 420 亿美元附近。\na16Z加密团队阅读的书籍和正在玩的游戏：https://a16zcrypto.com/some-books-were-reading-and-games-were-playing-this-winter/\nVitalik眼中22年的5件大事https://shows.banklesshq.com/p/vitaliks-top-5-crypto-wins-of-2022\n以太坊周报重点内容：核心开发者更新上海升级 EIP 细节及后续 Capella 升级的规划；扩容解决方案 EIP-4844 的 Devnet 3 预计将于下周发布；关于提议者构建者分离方案（PBS）拍卖机制的研究。https://weekinethereumnews.com/week-in-ethereum-news-december-17-2022/\nCoinbase Ventures 投资版图：300 多个项目，重点布局基础设施https://foresightnews.pro/article/detail/21266\n没事来我们电报群吧，这里帅哥，美女多，代码也多，话题也多，机会多多，还可以防失联。（电报群搜索：橙子的朋友们）\n【行情分析】 比特币上周跟随美股下跌之后，目前为止没有任何起色，无论是从周线，日线级别，都无法看到积极的信号，更多的是弱势调整。\n4小时级别，反弹上升趋势终究被破坏，目前又要重新恢复调整态势，当前正处于再次验证底部支撑时候，所以下方15000附近的支撑将会变得至关重要。\n我们始终抱有大幅度反弹的期待，今年走熊以来市场一直没有像样的反弹走势，所以这种反弹一定会来，当然这也在某种程度上取决于宏观层面的市场数据和信心。\n【风险提醒】 数字资产波动较大，风险极高，请谨慎参与，杜绝满仓梭哈，拒绝贷款杠杆；\nIf you find submirror valuable, please consider donate to wong2.eth to help cover server cost.","guid":"https://mirror.xyz/0x8c902B8839010BB1761201d42f788e7eD9FCFD77/KAe27gr_8z6bpW_e9oW0PpIdifK-J8_Pyh0zq-gp6oA","isoDate":"2022-12-19T03:10:41.000Z","from":"https://submirror.xyz/0x8c902B8839010BB1761201d42f788e7eD9FCFD77","hashId":"9eace0466be855ed2bb6109c3502b782"},{"title":"How to choose a data provider for your web3 project?","link":"https://mirror.xyz/0x0A9ee078998e6ECe11e1FF75fCbc7BeD5be005bB/VavqnrhXX07QJndzo7v9k7Ds9-rDpv5VsDuMBTs3KiQ","pubDate":"Mon, 19 Dec 2022 03:30:05 GMT","content:encoded":"<p><img src=\"https://miro.medium.com/max/1400/1*P8VczQOzjRKlsMxiV4DM_w.webp\" alt=\"\"></p>\n<p>Beyond cryptocurrency tokens, the blockchain also enables analysts to get a clearer picture of practically any GameFi project, NFT, marketplace, or DeFi protocol, thanks to Footprint.</p>\n<p>At Footprint, we’ve created a methodology that compiles and meaningfully aggregates the raw blockchain data. And this applies to programming integrations.</p>\n<h2 id=\"1--ways-to-work-with-the-blockchain-data\">1 . Ways to work with the blockchain data</h2>\n<p>Let’s first talk about programming integration methods. There are a few different ways to work with blockchain data, and your chosen approach will depend on your specific needs and goals. Here is a quick overview:</p>\n<p><img src=\"https://miro.medium.com/max/1368/0*Q671KUTscYGhn626.webp\" alt=\"\"></p>\n<h2 id=\"11-blockchain-explorers\">1.1 Blockchain explorers</h2>\n<p>A blockchain explorer is a website or tool that allows you to view the data stored on a blockchain. This can be a quick and easy way to access information about specific transactions, blocks, and other data on the blockchain.</p>\n<p>Blockchain explorers can be a useful tool for accessing and viewing data stored on a blockchain, but they do have some limitations for software integrations. Here are a few examples of things that blockchain explorers may lack:</p>\n<ul>\n<li>Mainly focused on raw data. Blockchain explorers typically display raw data from the blockchain. That requires implementing the abstractions over the raw data, which can be tedious, especially for projects focused on delivery rather than on the technical details of certain blockchains.</li>\n<li>Customization options: Blockchain explorers are typically designed to be user-friendly and easy to use, which means they may not offer many customization options. This can make it difficult to tailor the explorer to your specific needs or preferences.</li>\n<li>Advanced search functionality: Blockchain explorers often have basic search functionality but may not support more advanced search features such as Boolean operators or regular expressions. This can make it difficult to search for specific information on the blockchain.</li>\n<li>Interactivity: Many blockchain explorers are essentially read-only tools.</li>\n</ul>\n<p>While blockchain explorers can be a helpful way to access and view blockchain raw data, they do have some limitations that you should be aware of before deciding to implement your solution infrastructure based on them.</p>\n<p><img src=\"https://miro.medium.com/max/1400/0*tOPXWRQTo8Ze8xGY.webp\" alt=\"\"></p>\n<h2 id=\"12-own-indexing-solution\">1.2 Own indexing solution</h2>\n<p>Setting up your own indexer to work with blockchain data can have several advantages and potential disadvantages. Here are a few examples of each:</p>\n<p>Advantages:</p>\n<ul>\n<li>Customization: When you set up your indexer, you have complete control over how the data is indexed and accessed. This can allow you to tailor the indexer to your specific needs and preferences.</li>\n<li>Independence: By setting up your indexer, you are not relying on a third-party service to maintain and update the index. This can provide greater control and flexibility in your work with blockchain data.</li>\n<li>Improved security: When you set up your own indexer, you can implement your own security measures to protect the data and prevent unauthorized access.</li>\n</ul>\n<p>Disadvantages:</p>\n<ul>\n<li>Complexity: Setting up your indexer can be a complex and time-consuming process, especially if you are new to working with blockchain technology. You will need to understand the underlying technology and be willing to invest the time and effort required to get the indexer up and running.</li>\n<li>Maintenance: Once you have set up your indexer, you will be responsible for maintaining and updating it. This can require ongoing technical expertise and resources, which can be a disadvantage if you do not have the necessary knowledge or support.</li>\n<li>Cost: Setting up your own indexer can be expensive, as you must purchase the hardware and software required to run the indexer and pay for any associated costs, such as electricity and bandwidth.</li>\n</ul>\n<p>Overall, setting up your own indexer to work with blockchain data can provide greater control and customization, but it can also be a complex and expensive process. It’s important to consider the advantages and disadvantages carefully before deciding if this is the right approach.</p>\n<h2 id=\"13-database-as-a-service\">1.3 Database as a service</h2>\n<p>Using a third-party indexer to work with blockchain data can have several advantages and potential disadvantages. Here are a few examples of each:</p>\n<p>Advantages:</p>\n<ul>\n<li>Ease of use: Third-party indexers are typically designed to be easy to use, which means you can start working with the blockchain data quickly and without having to learn a lot of technical details or running your custom indexing solution (doesn’t matter whether it is self-developed or a ready-made SDK)</li>\n<li>Advanced search functionality: Many third-party indexers offer advanced search functionality, such as Boolean operators and regular expressions, making searching for specific information on the blockchain easier. These can have many actual implementations, but the indexed data is often added to a relational database, which implies full SQL support.</li>\n<li>Scalability: Third-party indexers are often designed to handle large volumes of data, which means they can be a good option if you need to search or access data from a large blockchain.</li>\n<li>Reliability: Third-party indexers are typically run by professional organizations with the resources and expertise to ensure the index is always up-to-date and accurate. Solutions are not always decentralized, as they are focused on processing huge amounts of data, but the vast majority are open source, which increases user confidence in the service.</li>\n</ul>\n<p>Disadvantages:</p>\n<ul>\n<li>Dependency: Using a third-party indexer, you rely on that service to maintain and update the index. If the indexer experiences technical issues or goes offline, you may not be able to access the blockchain data.</li>\n<li>Limited customization: Third-party indexers are typically designed to be easy to use, which means they may not offer many customization options. This can make it difficult to tailor the indexer to your specific needs or preferences.</li>\n<li>Cost: Some third-party indexers may charge a fee for their services, which can be a disadvantage if you work on a tight budget.</li>\n</ul>\n<p>In summary, using a third-party indexer to work with blockchain data can be a convenient and effective option, but limited and sometimes lack customization.</p>\n<h2 id=\"14-summary\">1.4 Summary</h2>\n<p>The goal of Footprint is primarily to lower the bar for entering analytics and working with web3 data. This approach is a balance between ease of use and flexibility. That is why one of our services is DaaS (Database as the service type). Before we take a closer look at the advantages of our service, we will also look at another implementation option for the indexer, namely a self-written solution or SDK.</p>\n<p>In the next chapters, we will explore the core feature that read-only blockchain APIs should have. We will look at the problem from different angles and consider alternative solutions. Some of the most important features of blockchain APIs include the following:</p>\n<ul>\n<li>Ease of use and flexibility</li>\n<li>Scalability</li>\n<li>Compatibility</li>\n</ul>\n<p>Ease of use and flexibility are two important features of blockchain APIs. A blockchain API that is easy to use will make it easier for developers to start building blockchain-based applications, allowing them to quickly prototype and test their ideas without spending a lot of time learning how to use the API.</p>\n<p>Flexibility, on the other hand, refers to the ability of a blockchain API to support a wide range of use cases and applications. A flexible blockchain API will allow developers to access different parts of the blockchain and build applications that interact with different types of smart contracts and other blockchain-based assets. This can be especially important for developers looking to build applications that can be used in various industries and contexts.</p>\n<p>Overall, having a blockchain API that is both easy to use and flexible can make it easier for developers to build innovative and useful applications that can take advantage of blockchain technology’s unique features and capabilities.</p>\n<h2 id=\"15-footprint-analytics\">1.5 Footprint Analytics</h2>\n<p>Ease of use and flexibility is ensured by our data organization, which affects all aspects of interactions with the Footprint ecosystem. Footprint has an API built on top of this data model that allows users to build full-fledged data pipelines for data analysis and machine learning applications. We call it a Data API. We are simultaneously supporting two types of API and two sub-types within one of them to cover most of the cases: Rest API and SQL API.</p>\n<p>REST API allows us to quickly integrate an application since each endpoint is a pre-built, hard-coded script that we have identified as one of the most popular. All endpoints come with easy-to-use tools for filtering, sorting, and pagination.</p>\n<p><img src=\"https://miro.medium.com/max/1400/0*2GOPeYnNFvc7uEJR.webp\" alt=\"\"></p>\n<p>Thanks to the SQL API’s more adaptable interface, you can obtain this for more specific cases. One benefit of using the same SQL queries in both the web application and the API is that it can simplify development and maintenance. By using the same queries in both interfaces, developers can avoid the need to write and maintain separate sets of queries for the web application and the API. This can save time and effort and reduce the risk of errors or inconsistencies between the two interfaces.</p>\n<p><img src=\"https://miro.medium.com/max/1400/0*UdAjA4nIA2uBSk3n.webp\" alt=\"\"></p>\n<p>Additionally, using the same SQL queries in both the web application and the API can make it easier for developers to create a seamless user experience. By using the same queries, developers can ensure that the data accessed and manipulated by the web application and the API is consistent, allowing users to switch between the two interfaces without encountering any inconsistencies or disruptions.</p>\n<h2 id=\"16-other-platforms\">1.6 Other platforms</h2>\n<p>Many alternative analytics solutions allow the user to analyze different networks according to various levels of requirements. However, for the most part, alternative solutions tend to go to extremes, implementing either a very flexible product that requires knowledge of query languages ​​or even programming languages or ​​a very simple interface with prepared scripts and, accordingly, low flexibility.</p>\n<p>Solutions like Moralis and Quicknode only have a REST API interface. Even though there are many endpoints, it still limits the developer in the flexibility of the data returned.</p>\n<p>Dune has recently introduced its API. This asynchronous solution implies the preliminary existence of a query on the platform under a certain id (dune.com/query/{{query id}}), by which it is possible to execute queries in the form of SQL. The key limitation of this solution is the need to pre-modify the SQL on the platform so that the updated query is subsequently executed.</p>\n<p>Chainbase releases SQL API in the same way as Footprint. Still, unlike Footprint, Chainbase does not have such sophisticated ETL, so SQL queries can only be executed for raw transactions.</p>\n<h2 id=\"2-scalability\">2. Scalability</h2>\n<p>Blockchain APIs should be able to handle large volumes of data and transactions, allowing developers to build applications that can be used by many users simultaneously.</p>\n<h2 id=\"21-footprint-analytics\">2.1 Footprint Analytics</h2>\n<h2 id=\"211-modern-open-data-stack\">2.1.1 Modern open data stack</h2>\n<p>The Footprint team has made several architectural upgrades since its launch in August 2021, thanks to its span ability to explore and iterate on technology. In less than a year and a half, the team has been able to implement these changes successfully. This is a testament to the team’s skill and expertise in technology and data science.</p>\n<p>Through experimentation, Footprint iteratively made three global architectural updates, ultimately arriving at an architecture that meets the requirements of the platform’s various use cases. More information on the evolution of the implementation can be found in the next article:</p>\n<p><a href=\"https://www.footprint.network/article/iceberg-spark-trino-a-modern-opensource-data-stack-for-blockchain-fp-HGZpPm3D\">https://www.footprint.network/article/iceberg-spark-trino-a-modern-opensource-data-stack-for-blockchain-fp-HGZpPm3D</a></p>\n<h2 id=\"212-sync-and-async-executions\">2.1.2 Sync and async executions</h2>\n<p>Within Footprint, there are two modes for executing queries to the SQL API — synchronous and asynchronous. API calls to the synchronous endpoint imply the SQL query will be executed by the Footprint servers as soon as an HTTP request is received from the application, thereby maintaining the connection. This makes sense when using lightweight requests, as in this case, the application does not have to wait long for execution. The details can be found on the following page:</p>\n<p><a href=\"https://docs.footprint.network/reference/post_native\">https://docs.footprint.network/reference/post_native</a></p>\n<p>For heavy requests, it is recommended to use an asynchronous request. Unlike a synchronous one, the client application does not have to maintain a connection with the server during execution. Instead, it can get the request-id immediately, according to which, after some time, separately get the execution results. As part of the asynchronous API, two-step should be covered to fetch the data — the following endpoint will be used to send an “order” for SQL execution:</p>\n<p><a href=\"https://docs.footprint.network/reference/post_native-async\">https://docs.footprint.network/reference/post_native-async</a></p>\n<p>The second step is to send a request to receive results by the identifier obtained when accessing the previous endpoint. The endpoint for this second step is described on the following page:</p>\n<p><a href=\"https://docs.footprint.network/reference/get_native-execution-id-results\">https://docs.footprint.network/reference/get_native-execution-id-results</a></p>\n<h2 id=\"22-other-solutions\">2.2 Other solutions</h2>\n<p>DuneV2 changes the whole database architecture. Dune is now transitioning away from a PostgreSQL database to an Instance of [[Apache Spark]] hosted on [[Databricks]]. Only asynchronous API.</p>\n<h2 id=\"3-compatibility\">3. Compatibility</h2>\n<p>Blockchain APIs should be compatible with a wide range of programming languages and development environments so that developers can use the tools and frameworks they are most familiar with.</p>\n<p>REST is easier to integrate since each programming language has many libraries that provide comfortable work with this type of API. However, in the end, both SQL APIs and REST work over HTTP, so the development experience is almost identical regarding sending a request by default.</p>\n<h2 id=\"4-summary\">4. Summary</h2>\n<p>As we have analyzed, in most cases, it is enough for an application to use ready-made DaaS solutions for the reason that they can return abstractions (not just raw data) and save a lot of time and money, as they ultimately allow teams to focus not on infrastructure but on the value of the product. Going through various solutions in the DaaS market,</p>\n<p>Footprint seems to be the most optimal to integrate, as it has the most flexible model for generating requests while being both easy to use and also having the modern open-source data stack under the hood, which ensures uninterrupted and, most importantly, fast execution of the most complex requests.</p>\n<hr>\n<p><em>If you find submirror valuable, please consider donate to wong2.eth to help cover server cost.</em></p>\n","content:encodedSnippet":"Beyond cryptocurrency tokens, the blockchain also enables analysts to get a clearer picture of practically any GameFi project, NFT, marketplace, or DeFi protocol, thanks to Footprint.\nAt Footprint, we’ve created a methodology that compiles and meaningfully aggregates the raw blockchain data. And this applies to programming integrations.\n1 . Ways to work with the blockchain data\nLet’s first talk about programming integration methods. There are a few different ways to work with blockchain data, and your chosen approach will depend on your specific needs and goals. Here is a quick overview:\n\n1.1 Blockchain explorers\nA blockchain explorer is a website or tool that allows you to view the data stored on a blockchain. This can be a quick and easy way to access information about specific transactions, blocks, and other data on the blockchain.\nBlockchain explorers can be a useful tool for accessing and viewing data stored on a blockchain, but they do have some limitations for software integrations. Here are a few examples of things that blockchain explorers may lack:\nMainly focused on raw data. Blockchain explorers typically display raw data from the blockchain. That requires implementing the abstractions over the raw data, which can be tedious, especially for projects focused on delivery rather than on the technical details of certain blockchains.\nCustomization options: Blockchain explorers are typically designed to be user-friendly and easy to use, which means they may not offer many customization options. This can make it difficult to tailor the explorer to your specific needs or preferences.\nAdvanced search functionality: Blockchain explorers often have basic search functionality but may not support more advanced search features such as Boolean operators or regular expressions. This can make it difficult to search for specific information on the blockchain.\nInteractivity: Many blockchain explorers are essentially read-only tools.\nWhile blockchain explorers can be a helpful way to access and view blockchain raw data, they do have some limitations that you should be aware of before deciding to implement your solution infrastructure based on them.\n\n1.2 Own indexing solution\nSetting up your own indexer to work with blockchain data can have several advantages and potential disadvantages. Here are a few examples of each:\nAdvantages:\nCustomization: When you set up your indexer, you have complete control over how the data is indexed and accessed. This can allow you to tailor the indexer to your specific needs and preferences.\nIndependence: By setting up your indexer, you are not relying on a third-party service to maintain and update the index. This can provide greater control and flexibility in your work with blockchain data.\nImproved security: When you set up your own indexer, you can implement your own security measures to protect the data and prevent unauthorized access.\nDisadvantages:\nComplexity: Setting up your indexer can be a complex and time-consuming process, especially if you are new to working with blockchain technology. You will need to understand the underlying technology and be willing to invest the time and effort required to get the indexer up and running.\nMaintenance: Once you have set up your indexer, you will be responsible for maintaining and updating it. This can require ongoing technical expertise and resources, which can be a disadvantage if you do not have the necessary knowledge or support.\nCost: Setting up your own indexer can be expensive, as you must purchase the hardware and software required to run the indexer and pay for any associated costs, such as electricity and bandwidth.\nOverall, setting up your own indexer to work with blockchain data can provide greater control and customization, but it can also be a complex and expensive process. It’s important to consider the advantages and disadvantages carefully before deciding if this is the right approach.\n1.3 Database as a service\nUsing a third-party indexer to work with blockchain data can have several advantages and potential disadvantages. Here are a few examples of each:\nAdvantages:\nEase of use: Third-party indexers are typically designed to be easy to use, which means you can start working with the blockchain data quickly and without having to learn a lot of technical details or running your custom indexing solution (doesn’t matter whether it is self-developed or a ready-made SDK)\nAdvanced search functionality: Many third-party indexers offer advanced search functionality, such as Boolean operators and regular expressions, making searching for specific information on the blockchain easier. These can have many actual implementations, but the indexed data is often added to a relational database, which implies full SQL support.\nScalability: Third-party indexers are often designed to handle large volumes of data, which means they can be a good option if you need to search or access data from a large blockchain.\nReliability: Third-party indexers are typically run by professional organizations with the resources and expertise to ensure the index is always up-to-date and accurate. Solutions are not always decentralized, as they are focused on processing huge amounts of data, but the vast majority are open source, which increases user confidence in the service.\nDisadvantages:\nDependency: Using a third-party indexer, you rely on that service to maintain and update the index. If the indexer experiences technical issues or goes offline, you may not be able to access the blockchain data.\nLimited customization: Third-party indexers are typically designed to be easy to use, which means they may not offer many customization options. This can make it difficult to tailor the indexer to your specific needs or preferences.\nCost: Some third-party indexers may charge a fee for their services, which can be a disadvantage if you work on a tight budget.\nIn summary, using a third-party indexer to work with blockchain data can be a convenient and effective option, but limited and sometimes lack customization.\n1.4 Summary\nThe goal of Footprint is primarily to lower the bar for entering analytics and working with web3 data. This approach is a balance between ease of use and flexibility. That is why one of our services is DaaS (Database as the service type). Before we take a closer look at the advantages of our service, we will also look at another implementation option for the indexer, namely a self-written solution or SDK.\nIn the next chapters, we will explore the core feature that read-only blockchain APIs should have. We will look at the problem from different angles and consider alternative solutions. Some of the most important features of blockchain APIs include the following:\nEase of use and flexibility\nScalability\nCompatibility\nEase of use and flexibility are two important features of blockchain APIs. A blockchain API that is easy to use will make it easier for developers to start building blockchain-based applications, allowing them to quickly prototype and test their ideas without spending a lot of time learning how to use the API.\nFlexibility, on the other hand, refers to the ability of a blockchain API to support a wide range of use cases and applications. A flexible blockchain API will allow developers to access different parts of the blockchain and build applications that interact with different types of smart contracts and other blockchain-based assets. This can be especially important for developers looking to build applications that can be used in various industries and contexts.\nOverall, having a blockchain API that is both easy to use and flexible can make it easier for developers to build innovative and useful applications that can take advantage of blockchain technology’s unique features and capabilities.\n1.5 Footprint Analytics\nEase of use and flexibility is ensured by our data organization, which affects all aspects of interactions with the Footprint ecosystem. Footprint has an API built on top of this data model that allows users to build full-fledged data pipelines for data analysis and machine learning applications. We call it a Data API. We are simultaneously supporting two types of API and two sub-types within one of them to cover most of the cases: Rest API and SQL API.\nREST API allows us to quickly integrate an application since each endpoint is a pre-built, hard-coded script that we have identified as one of the most popular. All endpoints come with easy-to-use tools for filtering, sorting, and pagination.\n\nThanks to the SQL API’s more adaptable interface, you can obtain this for more specific cases. One benefit of using the same SQL queries in both the web application and the API is that it can simplify development and maintenance. By using the same queries in both interfaces, developers can avoid the need to write and maintain separate sets of queries for the web application and the API. This can save time and effort and reduce the risk of errors or inconsistencies between the two interfaces.\n\nAdditionally, using the same SQL queries in both the web application and the API can make it easier for developers to create a seamless user experience. By using the same queries, developers can ensure that the data accessed and manipulated by the web application and the API is consistent, allowing users to switch between the two interfaces without encountering any inconsistencies or disruptions.\n1.6 Other platforms\nMany alternative analytics solutions allow the user to analyze different networks according to various levels of requirements. However, for the most part, alternative solutions tend to go to extremes, implementing either a very flexible product that requires knowledge of query languages ​​or even programming languages or ​​a very simple interface with prepared scripts and, accordingly, low flexibility.\nSolutions like Moralis and Quicknode only have a REST API interface. Even though there are many endpoints, it still limits the developer in the flexibility of the data returned.\nDune has recently introduced its API. This asynchronous solution implies the preliminary existence of a query on the platform under a certain id (dune.com/query/{{query id}}), by which it is possible to execute queries in the form of SQL. The key limitation of this solution is the need to pre-modify the SQL on the platform so that the updated query is subsequently executed.\nChainbase releases SQL API in the same way as Footprint. Still, unlike Footprint, Chainbase does not have such sophisticated ETL, so SQL queries can only be executed for raw transactions.\n2. Scalability\nBlockchain APIs should be able to handle large volumes of data and transactions, allowing developers to build applications that can be used by many users simultaneously.\n2.1 Footprint Analytics\n2.1.1 Modern open data stack\nThe Footprint team has made several architectural upgrades since its launch in August 2021, thanks to its span ability to explore and iterate on technology. In less than a year and a half, the team has been able to implement these changes successfully. This is a testament to the team’s skill and expertise in technology and data science.\nThrough experimentation, Footprint iteratively made three global architectural updates, ultimately arriving at an architecture that meets the requirements of the platform’s various use cases. More information on the evolution of the implementation can be found in the next article:\nhttps://www.footprint.network/article/iceberg-spark-trino-a-modern-opensource-data-stack-for-blockchain-fp-HGZpPm3D\n2.1.2 Sync and async executions\nWithin Footprint, there are two modes for executing queries to the SQL API — synchronous and asynchronous. API calls to the synchronous endpoint imply the SQL query will be executed by the Footprint servers as soon as an HTTP request is received from the application, thereby maintaining the connection. This makes sense when using lightweight requests, as in this case, the application does not have to wait long for execution. The details can be found on the following page:\nhttps://docs.footprint.network/reference/post_native\nFor heavy requests, it is recommended to use an asynchronous request. Unlike a synchronous one, the client application does not have to maintain a connection with the server during execution. Instead, it can get the request-id immediately, according to which, after some time, separately get the execution results. As part of the asynchronous API, two-step should be covered to fetch the data — the following endpoint will be used to send an “order” for SQL execution:\nhttps://docs.footprint.network/reference/post_native-async\nThe second step is to send a request to receive results by the identifier obtained when accessing the previous endpoint. The endpoint for this second step is described on the following page:\nhttps://docs.footprint.network/reference/get_native-execution-id-results\n2.2 Other solutions\nDuneV2 changes the whole database architecture. Dune is now transitioning away from a PostgreSQL database to an Instance of [[Apache Spark]] hosted on [[Databricks]]. Only asynchronous API.\n3. Compatibility\nBlockchain APIs should be compatible with a wide range of programming languages and development environments so that developers can use the tools and frameworks they are most familiar with.\nREST is easier to integrate since each programming language has many libraries that provide comfortable work with this type of API. However, in the end, both SQL APIs and REST work over HTTP, so the development experience is almost identical regarding sending a request by default.\n4. Summary\nAs we have analyzed, in most cases, it is enough for an application to use ready-made DaaS solutions for the reason that they can return abstractions (not just raw data) and save a lot of time and money, as they ultimately allow teams to focus not on infrastructure but on the value of the product. Going through various solutions in the DaaS market,\nFootprint seems to be the most optimal to integrate, as it has the most flexible model for generating requests while being both easy to use and also having the modern open-source data stack under the hood, which ensures uninterrupted and, most importantly, fast execution of the most complex requests.\nIf you find submirror valuable, please consider donate to wong2.eth to help cover server cost.","guid":"https://mirror.xyz/0x0A9ee078998e6ECe11e1FF75fCbc7BeD5be005bB/VavqnrhXX07QJndzo7v9k7Ds9-rDpv5VsDuMBTs3KiQ","isoDate":"2022-12-19T03:30:05.000Z","from":"https://submirror.xyz/0x0A9ee078998e6ECe11e1FF75fCbc7BeD5be005bB","hashId":"df3b4e9b081476b408756bfb770d3d20"}]