[{"creator":"The Markup","title":"Hospital Websites are Giving Facebook Sensitive Information","link":"https://hackernoon.com/hospital-websites-are-giving-facebook-sensitive-information?source=rss","pubDate":"Thu, 15 Dec 2022 00:39:15 GMT","content:encoded":"<p><em>This article was <a href=\"https://www.statnews.com/2022/06/16/facebook-meta-pixel-hospitals-data/\">copublished</a> with STAT, a national publication that delivers trusted and authoritative journalism about health, medicine, and the life sciences. Sign up for their health tech newsletter, delivered Tuesday and Thursday mornings, here:&nbsp;<a href=\"https://www.statnews.com/signup/health-tech/\">https://www.statnews.com/signup/health-tech/</a></em></p>\n<p>\\\nA tracking tool installed on many hospitals’ websites has been collecting patients’ sensitive health information—including details about their medical conditions, prescriptions, and doctor’s appointments—and sending it to Facebook.</p>\n<hr />\n<p><em><a href=\"https://themarkup.org/pixel-hunt/2022/06/16/facebook-is-receiving-sensitive-medical-information-from-hospital-websites#a-third-of-top-hospitals-websites-sent-patient-data-to-facebook\">https://themarkup.org/pixel-hunt/2022/06/16/facebook-is-receiving-sensitive-medical-information-from-hospital-websites#a-third-of-top-hospitals-websites-sent-patient-data-to-facebook</a></em></p>\n<hr />\n<p>The Markup tested the websites of <a href=\"https://www.newsweek.com/worlds-best-hospitals-2022/united-states\">Newsweek’s</a> top 100 hospitals in America. On 33 of them we found the tracker, called the Meta Pixel, sending Facebook a packet of data whenever a person clicked a button to schedule a doctor’s appointment.</p>\n<p>\\\nThe data is connected to an IP address—an identifier that’s like a computer’s mailing address and can generally be linked to a specific individual or household—creating an intimate receipt of the appointment request for Facebook.</p>\n<p>\\\nOn the website of University Hospitals Cleveland Medical Center, for example, clicking the “Schedule Online” button on a doctor’s page prompted the Meta Pixel to send Facebook the text of the button, the doctor’s name, and the search term we used to find her: “pregnancy termination.”</p>\n<p>\\\nClicking the “Schedule Online Now” button for a doctor on the website of Froedtert Hospital, in Wisconsin, prompted the Meta Pixel to send Facebook the text of the button, the doctor’s name, and the condition we selected from a dropdown menu: “Alzheimer’s.”</p>\n<p>\\\nThe Markup also found the Meta Pixel installed inside the password-protected patient portals of seven health systems.</p>\n<p>\\\nOn five of those systems’ pages, we documented the pixel sending Facebook data about real patients who volunteered to participate in the Pixel Hunt project, a collaboration between The Markup and Mozilla Rally.</p>\n<p>\\\nThe project is a <a href=\"https://rally.mozilla.org/current-studies/facebook-pixel-hunt/index.html?utm_source=markupweb\">crowd-sourced undertaking</a> in which anyone can install <a href=\"https://rally.mozilla.org/about-rally/?utm_source=markupweb\">Mozilla’s Rally browser add-on</a> in order to send The Markup data on the Meta Pixel as it appears on sites that they visit.</p>\n<p>\\\nThe data sent to hospitals included the names of patients’ medications, descriptions of their allergic reactions, and details about their upcoming doctor’s appointments.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/HgNYtFi17WbGLaRvGCmxhdy7K5L2-ina2hic.jpeg\" alt=\"\" /></p>\n<p>\\\nFormer regulators, health data security experts, and privacy advocates who reviewed The Markup’s findings said the hospitals in question may have violated the federal Health Insurance Portability and Accountability Act (HIPAA).</p>\n<p>\\\nThe law prohibits covered entities like hospitals from sharing personally identifiable health information with <a href=\"https://www.hhs.gov/hipaa/for-professionals/privacy/guidance/marketing/index.html\">third parties like Facebook</a>, except when an individual has expressly consented in advance or under certain contracts.</p>\n<p>\\\nNeither the hospitals nor Meta said they had such contracts in place, and The Markup found no evidence that the hospitals or Meta were otherwise obtaining patients’ express consent.</p>\n<p>\\\n“I am deeply troubled by what [the hospitals] are doing with the capture of their data and the sharing of it,” said David Holtzman, a health privacy consultant who previously served as a senior privacy adviser in the U.S. Department of Health and Human Services’ Office for Civil Rights, which enforces HIPAA.</p>\n<p>\\\n“I cannot say [sharing this data] is for certain a HIPAA violation. It is quite likely a HIPAA violation.”</p>\n<p>\\\nUniversity Hospitals Cleveland Medical Center spokesperson George Stamatis did not respond to The Markup’s questions but said in a brief statement that the hospital “comport[s] with all applicable federal and state laws and regulatory requirements.”</p>\n<p>\\\nAfter reviewing The Markup’s findings, Froedtert Hospital removed the Meta Pixel from its website “out of an abundance of caution,” Steve Schooff, a spokesperson for the hospital, wrote in a statement.</p>\n<p>\\\nAs of June 15, six other hospitals had also removed pixels from their appointment booking pages and at least five of the seven health systems that had Meta Pixels installed in their patient portals had removed those pixels.</p>\n<p>\\\nThe 33 hospitals The Markup found sending patient appointment details to Facebook collectively reported more than 26&nbsp;million patient admissions and outpatient visits in 2020, according to the most <a href=\"https://guide.prod.iam.aha.org/guide/\">recent data available</a> from the American Hospital Association.</p>\n<p>\\\nOur investigation was limited to just over 100 hospitals; the data sharing likely affects many more patients and institutions than we identified.</p>\n<p>\\\nFacebook itself is not subject to HIPAA, but the experts interviewed for this story expressed concerns about how the advertising giant might use the personal health data it’s collecting for its own profit.</p>\n<p>\\\n“This is an extreme example of exactly how far the tentacles of Big Tech reach into what we think of as a protected data space,” said Nicholson Price, a University of Michigan law professor who studies big data and health care.</p>\n<p>\\\n“I think this is creepy, problematic, and potentially illegal” from the hospitals’ point of view.</p>\n<p>\\\nThe Markup was unable to determine whether Facebook used the data to target advertisements, train its recommendation algorithms, or profit in other ways.</p>\n<p>\\\nFacebook’s parent company, Meta, did not respond to questions. Instead, spokesperson Dale Hogan sent a brief email paraphrasing the company’s <a href=\"https://www.facebook.com/business/help/361948878201809?id=188852726110565\">sensitive health data policy</a>.</p>\n<p>\\\n“If Meta’s signals filtering systems detect that a business is sending potentially sensitive health data from their app or website through their use of Meta Business Tools, which in some cases can happen in error, that potentially sensitive data will be removed before it can be stored in our ads systems,” Hogan wrote.</p>\n<p>\\\nMeta did not respond to follow-up questions, but Hogan appears to be referencing a sensitive health information filtering system that the company launched in July 2020 in response to a <a href=\"https://www.wsj.com/articles/you-give-apps-sensitive-personal-information-then-they-tell-facebook-11550851636\">Wall Street Journal article</a> and New York Department of Financial Services investigation.</p>\n<p>\\\nMeta told the investigators that the filtering system was “not yet operating with complete accuracy,” according to the department’s February 2021 <a href=\"https://www.dfs.ny.gov/system/files/documents/2021/02/facebook_report_20210218.pdf\">final report</a>.</p>\n<p>\\\nThe Markup was unable to confirm whether any of the data referenced in this story was in fact removed before being stored by Meta.</p>\n<p>\\\nHowever, a recent <a href=\"https://themarkup.org/pixel-hunt/2022/06/15/facebook-and-anti-abortion-clinics-are-collecting-highly-sensitive-info-on-would-be-patients\">joint investigation with Reveal</a> found that Meta’s sensitive health information filtering system didn’t block information about appointments a reporter requested with crisis pregnancy centers.</p>\n<p>\\\nInternally, Facebook employees have been blunt about how well—or not so well—the company generally protects sensitive data.</p>\n<p>\\\n“We do not have an adequate level of control and explainability over how our systems use data, and thus we can’t confidently make controlled policy changes or external commitments such as ‘we will not use X data for Y purpose.’ ” Facebook engineers on the ad and business product team wrote in a 2021 privacy overview that was <a href=\"https://www.vice.com/en/article/akvmke/facebook-doesnt-know-what-it-does-with-your-data-or-where-it-goes\">leaked to Vice</a>.</p>\n<h2 id=\"almostanypatientwouldbenbspshocked\"><strong>“Almost Any Patient Would Be&nbsp;Shocked”</strong></h2>\n<p>The Meta Pixel is a snippet of code that tracks users as they navigate through a website, logging which pages they visit, which buttons they click, and certain information they enter into forms. </p>\n<p>\\\nIt’s one of the most prolific tracking tools on the internet—present on more than 30&nbsp;percent of the most popular sites on the web, according to The Markup’s <a href=\"https://themarkup.org/blacklight/2020/09/22/blacklight-tracking-advertisers-digital-privacy-sensitive-websites\">analysis</a>.</p>\n<p>\\\nIn exchange for installing its pixel, Meta provides website owners analytics about the ads they’ve placed on Facebook and Instagram and tools to target people who’ve visited their website.</p>\n<p>\\\nThe Meta Pixel sends information to Facebook via scripts running in a person’s internet browser, so each data packet comes labeled with an IP address that can be used in combination with other data to <a href=\"https://us.norton.com/internetsecurity-privacy-what-does-an-ip-address-tell-you.html\">identify an individual or household</a>.</p>\n<p>\\\nHIPAA lists IP addresses as one of the <a href=\"https://www.luc.edu/its/aboutits/itspoliciesguidelines/hipaainformation/18hipaaidentifiers/\">18 identifiers</a> that, when linked to information about a person’s health conditions, care, or payment, can qualify the data as protected health information.</p>\n<p>\\\nUnlike anonymized or aggregate health data, hospitals can’t share protected health information with third parties except under the strict terms of business associate agreements that restrict how the data can be used.</p>\n<p>\\\nIn addition, if a patient is logged in to Facebook when they visit a hospital’s website where a Meta Pixel is installed, some browsers will attach third-party cookies—another tracking mechanism—that allow Meta to link pixel data to specific Facebook accounts.</p>\n<p>\\\nAnd in several cases we found—using both dummy accounts created by our reporters and data from Mozilla Rally volunteers—that the Meta Pixel made it even easier to identify patients.</p>\n<p>\\\nWhen The Markup clicked the “Finish Booking” button on a Scripps Memorial Hospital doctor’s page, the pixel sent Facebook not just the name of the doctor and her field of medicine but also the first name, last name, email address, phone number, zip code, and city of residence we entered into the booking form.</p>\n<p>\\\nThe Meta Pixel “hashed” those personal details—obscuring them through a form of cryptography—before sending them to Facebook. </p>\n<p>\\\nBut that hashing doesn’t prevent Facebook from using the data. In fact, Meta <a href=\"https://www.facebook.com/business/help/611774685654668?id=1205376682832142\">explicitly uses</a> the hashed information to link pixel data to Facebook profiles.</p>\n<p>\\\nUsing a <a href=\"https://crackstation.net/\">free online tool,</a> The Markup was also able to reverse most of our hashed test information that the pixel on Scripps Memorial Hospital’s website sent to Facebook.</p>\n<p>\\\nScripps Memorial didn’t respond to The Markup’s questions but it did remove the Meta Pixel from the final webpages in the appointment booking process after we shared our findings with the hospital.</p>\n<p>\\\nOn other hospitals’ websites, we documented the Meta Pixel collecting similarly intimate information about real patients.</p>\n<p>\\\nWhen one real patient who participated in the Pixel Hunt study logged in to the MyChart portal for Piedmont Healthcare, a Georgia health system, the Meta Pixel installed in the portal told Facebook the patient’s name, the name of their doctor, and the time of their upcoming appointment, according to data collected by the participant’s Mozilla Rally browser extension.</p>\n<h3 id=\"themetapixelcollectssensitivehealthinformationandsharesitwithnbspfacebook\">The Meta Pixel collects sensitive health information and shares it with&nbsp;Facebook</h3>\n<h4 id=\"themetapixelinstalledonpiedmonthealthcaresmychartportalsentfacebookdetailsaboutarealpatientsupcomingdoctorsappointmentincludingdatetimethepatientsnameandthenameoftheirnbspdoctor\">The Meta Pixel installed on Piedmont Healthcare’s MyChart portal sent Facebook details about a real patient's upcoming doctor's appointment, including date, time, the patient’s name, and the name of their&nbsp;doctor</h4>\n<ol>\n<li>1Patient name</li>\n<li>2Date and time of appointment</li>\n<li>3Name of provider</li>\n</ol>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/HgNYtFi17WbGLaRvGCmxhdy7K5L2-7jb2hzj.png\" alt=\"\" /></p>\n<p>\\\nWhen another Pixel Hunt participant used the MyChart portal for Novant Health, a North Carolina–based health system, the pixel told Facebook the type of allergic reaction the patient had to a specific medication.</p>\n<p>\\\nThe Markup created our own MyChart account through Novant Health to further investigate and found the Meta Pixel collecting a variety of other sensitive information.</p>\n<p>\\\nClicking on one button prompted the pixel to tell Facebook the name and dosage of a medication in our health record, as well as any notes we had entered about the prescription. The pixel also told Facebook which button we clicked in response to a question about sexual orientation.</p>\n<p>\\\n“Our Meta pixel placement is guided by a third party vendor and it has been removed while we continue to look into this matter,” Novant spokesperson Megan Rivers wrote in an email.</p>\n<p>\\\nEpic Systems, the software company behind MyChart, has “specifically recommended heightened caution around the use of custom analytics scripts,” Stirling Martin, a senior vice president for the company, wrote in an email.</p>\n<p>\\\nFacebook is <a href=\"https://www.washingtonpost.com/news/posteverything/wp/2018/04/18/facebook-knows-a-ton-about-your-health-now-they-want-to-make-money-off-it/\">able to infer intimate details</a> about people’s health conditions using other means—for example, the fact that a person “liked” a Facebook group associated with a particular disease—but the data collected by pixels on hospitals’ websites is more direct. </p>\n<p>\\\nAnd in sharing it with Facebook, experts said, health care providers risk damaging patients’ trust in an increasingly digitized health system.</p>\n<p><img src=\"https://cdn.hackernoon.com/images/HgNYtFi17WbGLaRvGCmxhdy7K5L2-kjc2hys.png\" alt=\"\" /></p>\n<p><img src=\"https://cdn.hackernoon.com/images/HgNYtFi17WbGLaRvGCmxhdy7K5L2-t2d2hyx.png\" alt=\"\" /></p>\n<p>\\\n<em>The Markup found that filling out a survey through Novant Health shared sensitive information like sexual orientation with Facebook via the Meta Pixel.</em> <em>Source: www.novantmychart.org</em></p>\n<p>\\\n“Almost any patient would be shocked to find out that Facebook is being provided an easy way to associate their prescriptions with their name,” said Glenn Cohen, faculty director of Harvard Law School’s Petrie-Flom Center for Health Law Policy, Biotechnology, and Bioethics.</p>\n<p>\\\n“Even if perhaps there’s something in the legal architecture that permits this to be lawful, it’s totally outside the expectations of what patients think the health privacy laws are doing for them.”</p>\n<h2 id=\"legalnbspimplications\"><strong>Legal&nbsp;Implications</strong></h2>\n<p>Facebook’s data collection on hospital websites has been the subject of class action lawsuits in several states, with mixed results.</p>\n<p>\\\nThose cases involve types of data that health law experts said are sensitive but less regulated than the health information The Markup documented the Meta Pixel collecting.</p>\n<p>\\\nIn 2016, a group of plaintiffs <a href=\"https://www.documentcloud.org/documents/22037870-smith-v-facebook-complaint?responsive=1&title=1\">sued Facebook</a> and a handful of health systems and organizations, alleging that the organizations had breached their own privacy policies and several state and federal laws—including wiretapping and intrusion on seclusion statutes—by collecting data via tracking technology on the health care providers’ websites.</p>\n<p>\\\nThe U.S. District Court for the Northern District of California <a href=\"https://www.documentcloud.org/documents/22037871-smith-v-facebook-order-on-motion-to-dismiss?responsive=1&title=1\">dismissed that case</a> in 2017 for a variety of reasons, including that the plaintiffs failed to prove that Facebook had collected “protected health information,” as defined by HIPAA. </p>\n<p>\\\nRather, the court found, Facebook had tracked plaintiffs on public-facing pages of the websites—such as the homepage or informational pages about diseases—where there was no evidence that the plaintiffs had established a patient relationship with the provider.</p>\n<p>\\\nIn 2019, plaintiffs brought a <a href=\"https://www.documentcloud.org/documents/22037876-partners-civil-complaint?responsive=1&title=1\">similar class action lawsuit</a> in Suffolk County Superior Court against Massachusetts-based Partners Healthcare System, which has since changed its name to Mass General Brigham, alleging that the system had violated patients’ privacy and its own policies by installing the Meta Pixel and other tracking tools on its websites.</p>\n<p>\\\nThe parties <a href=\"https://angeion-public.s3.amazonaws.com/www.MAcookiesettlement.com/docs/Long+Form+Notice_Final.pdf\">settled the case</a> in January, with Mass General Brigham denying the allegations and admitting no wrongdoing or liability but paying $18.4&nbsp;million to the plaintiffs and their attorneys. </p>\n<p>\\\nAfter the settlement, Mass General Brigham appears to have removed Meta Pixel and other tracking tools from many of its hospitals’ websites—but not all of them.</p>\n<p>\\\nWhen The Markup tested the website of Brigham and Women’s Faulkner Hospital, clicking the “Request Appointment” button on a doctor’s page caused the Meta Pixel to send Facebook the text of the button, the doctor’s name, and the doctor’s field of medicine. Mass General did not respond to The Markup’s request for comment.</p>\n<p>\\\nAs with all such data we found the Meta Pixel collecting, it was sent to Facebook along with our computer’s public IP address.</p>\n<p>\\\n“When an individual has sought out a provider and indicated that they want to make an appointment, at that point, any individually identifiable health information that they’ve provided in this session, in the past, or certainly in the future, is protected under HIPAA and could not be shared with a third party like Facebook,” Holtzman said.</p>\n<p>\\\nThe U.S. Department of Human Services’ Office for Civil Rights “cannot comment on open or potential investigations,” spokesperson Rachel Seeger wrote in an emailed statement.</p>\n<p>\\\n“Generally, HIPAA covered entities and business associates should not be sharing identifiable information with social media companies unless they have HIPAA authorization [from the individual] and consent under state law,” said Iliana Peters, a privacy lawyer with the firm Polsinelli who previously headed HIPAA enforcement for the Office for Civil Rights.</p>\n<p>\\\nPatients have the right to file HIPAA complaints with their medical providers, who are required to investigate the complaints, Peters said, adding, “I would hope that institutions would respond quickly to those types of complaints so that they aren’t escalated to a state or federal regulator.”</p>\n<h2 id=\"plausiblenbspdeniability\"><strong>\"Plausible&nbsp;Deniability</strong>\"</h2>\n<p>Most of the hospitals The Markup contacted for this story did not respond to our questions or explain why they chose to install Meta Pixel on their websites. But some did defend their use of the tracker.</p>\n<p>\\\n“The use of this type of code was vetted,” wrote Chris King, a spokesperson for Northwestern Memorial Hospital, in Chicago. King did not respond to follow-up questions about the vetting process.</p>\n<p>\\\nKing said that no protected health information is hosted on or accessible through Northwestern Memorial’s website and that “Facebook automatically recognizes anything that might be close to personal information and does not store this data.”</p>\n<p>\\\nIn fact, Meta explicitly states in its <a href=\"https://www.facebook.com/legal/technology_terms\">business tools terms of service</a> that the pixel and other trackers do collect personally identifiable information for a variety of purposes.</p>\n<p>\\\nHouston Methodist Hospital, in Texas, was the only institution to provide detailed responses to The Markup’s questions. </p>\n<p>\\\nThe hospital began using the pixel in 2017, spokesperson Stefanie Asin wrote, and is “confident” in Facebook’s safeguards and that the data being shared isn’t protected health information.</p>\n<p>\\\nWhen The Markup tested Houston Methodist’s website, clicking the “Schedule Appointment” button on a doctor’s page prompted the Meta Pixel to send Facebook the text of the button, the name of the doctor, and the search term we used to find the doctor: “Home abortion.”</p>\n<p>\\\nHouston Methodist doesn’t categorize that data as protected health information, Asin wrote, because a person who clicks the “Schedule Appointment” button may not follow through and confirm the appointment, or, they may be booking the appointment for a family member rather than for themself.</p>\n<p>\\\n“The click doesn’t mean they scheduled,” she wrote. “It’s also worth noting that people often are exploring for a spouse, friend, elderly parent.”</p>\n<p>\\\nAsin added that Houston Methodist believes Facebook “uses tools to detect and reject any health information, providing a barrier that prevents passage of [protected health information].”</p>\n<p>\\\nDespite defending its use of the Meta Pixel, Houston Methodist Hospital removed the pixel from its website several days after responding to The Markup’s questions.</p>\n<p>\\\n“Since our further examination of the topic is ongoing, we elected to remove the pixel for now to be sure we are doing everything we can to protect our patients’ privacy while we are evaluating,” Asin wrote in a follow-up email.</p>\n<p>\\\nFacebook did not launch its sensitive health data filtering system until July 2020, three years after Houston Methodist began using the pixel, according to the New York Department of Financial Services’ investigation.</p>\n<p>\\\nAnd as recently as February of last year, the department reported that the system’s accuracy was poor.</p>\n<p>\\\nThat type of Band-Aid fix is a prime example, privacy advocates say, of the online advertising industry’s inability to police itself.</p>\n<p>\\\n“The evil genius of Facebook’s system is they create this little piece of code that does the snooping for them and then they just put it out into the universe and Facebook can try to claim plausible deniability,” said Alan Butler, executive director of the Electronic Privacy Information Center.</p>\n<p>\\\n“The fact that this is out there in the wild on the websites of hospitals is evidence of how broken the rules are.”</p>\n<hr />\n<p><em>This article was copublished with STAT, a national publication that delivers trusted and authoritative journalism about health, medicine, and the life sciences. Sign up for their health tech newsletter, delivered Tuesday and Thursday mornings, here:&nbsp;<a href=\"https://www.statnews.com/signup/health-tech/\">https://www.statnews.com/signup/health-tech/</a></em></p>\n<h3 id=\"update\">Update</h3>\n<p>After the publication of this story, Duke Health told The Markup that it had removed the Meta Pixel from its website.</p>\n<p>\\\nDuke Health spokesperson Sarah Avery said, “Duke Health is committed to protecting the privacy of health information of our patients. Upon investigation of the issue raised in the report that appeared this morning, we have removed the MetaPixel image.”</p>\n<hr />\n<p><em>Credits: <a href=\"https://themarkup.org/people/todd-feathers/\">Todd Feathers</a>, <a href=\"https://themarkup.org/people/simon-fondrie-teitler/\">Simon Fondrie-Teitler</a>, <a href=\"https://themarkup.org/people/angie-waller/\">Angie Waller</a>, <a href=\"https://themarkup.org/people/surya-mattu/\">Surya Mattu</a>, <a href=\"https://themarkup.org/people/micha-gorelick\">Micha Gorelick</a>, <a href=\"https://themarkup.org/people/gabe-hongsdusit\">Gabriel Hongsdusit</a>, <a href=\"https://themarkup.org/people/jill-jaroff\">Jill Jaroff</a>, <a href=\"https://themarkup.org/people/rina-palta\">Rina Palta</a>, <a href=\"https://rally.mozilla.org/about-rally/?utm_source=markupweb\">Mozilla Rally</a></em></p>\n<p>\\\n<em>Also published <a href=\"https://themarkup.org/pixel-hunt/2022/06/16/facebook-is-receiving-sensitive-medical-information-from-hospital-websites\">here</a></em></p>\n<p>\\\n<em>Photo by <a href=\"https://unsplash.com/@solenfeyissa?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Solen Feyissa</a> on <a href=\"https://unsplash.com/s/photos/hospital?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Unsplash</a></em></p>","content:encodedSnippet":"This article was copublished with STAT, a national publication that delivers trusted and authoritative journalism about health, medicine, and the life sciences. Sign up for their health tech newsletter, delivered Tuesday and Thursday mornings, here: https://www.statnews.com/signup/health-tech/\n\\\nA tracking tool installed on many hospitals’ websites has been collecting patients’ sensitive health information—including details about their medical conditions, prescriptions, and doctor’s appointments—and sending it to Facebook.\nhttps://themarkup.org/pixel-hunt/2022/06/16/facebook-is-receiving-sensitive-medical-information-from-hospital-websites#a-third-of-top-hospitals-websites-sent-patient-data-to-facebook\nThe Markup tested the websites of Newsweek’s top 100 hospitals in America. On 33 of them we found the tracker, called the Meta Pixel, sending Facebook a packet of data whenever a person clicked a button to schedule a doctor’s appointment.\n\\\nThe data is connected to an IP address—an identifier that’s like a computer’s mailing address and can generally be linked to a specific individual or household—creating an intimate receipt of the appointment request for Facebook.\n\\\nOn the website of University Hospitals Cleveland Medical Center, for example, clicking the “Schedule Online” button on a doctor’s page prompted the Meta Pixel to send Facebook the text of the button, the doctor’s name, and the search term we used to find her: “pregnancy termination.”\n\\\nClicking the “Schedule Online Now” button for a doctor on the website of Froedtert Hospital, in Wisconsin, prompted the Meta Pixel to send Facebook the text of the button, the doctor’s name, and the condition we selected from a dropdown menu: “Alzheimer’s.”\n\\\nThe Markup also found the Meta Pixel installed inside the password-protected patient portals of seven health systems.\n\\\nOn five of those systems’ pages, we documented the pixel sending Facebook data about real patients who volunteered to participate in the Pixel Hunt project, a collaboration between The Markup and Mozilla Rally.\n\\\nThe project is a crowd-sourced undertaking in which anyone can install Mozilla’s Rally browser add-on in order to send The Markup data on the Meta Pixel as it appears on sites that they visit.\n\\\nThe data sent to hospitals included the names of patients’ medications, descriptions of their allergic reactions, and details about their upcoming doctor’s appointments.\n\\\n \n\\\nFormer regulators, health data security experts, and privacy advocates who reviewed The Markup’s findings said the hospitals in question may have violated the federal Health Insurance Portability and Accountability Act (HIPAA).\n\\\nThe law prohibits covered entities like hospitals from sharing personally identifiable health information with third parties like Facebook, except when an individual has expressly consented in advance or under certain contracts.\n\\\nNeither the hospitals nor Meta said they had such contracts in place, and The Markup found no evidence that the hospitals or Meta were otherwise obtaining patients’ express consent.\n\\\n“I am deeply troubled by what [the hospitals] are doing with the capture of their data and the sharing of it,” said David Holtzman, a health privacy consultant who previously served as a senior privacy adviser in the U.S. Department of Health and Human Services’ Office for Civil Rights, which enforces HIPAA.\n\\\n“I cannot say [sharing this data] is for certain a HIPAA violation. It is quite likely a HIPAA violation.”\n\\\nUniversity Hospitals Cleveland Medical Center spokesperson George Stamatis did not respond to The Markup’s questions but said in a brief statement that the hospital “comport[s] with all applicable federal and state laws and regulatory requirements.”\n\\\nAfter reviewing The Markup’s findings, Froedtert Hospital removed the Meta Pixel from its website “out of an abundance of caution,” Steve Schooff, a spokesperson for the hospital, wrote in a statement.\n\\\nAs of June 15, six other hospitals had also removed pixels from their appointment booking pages and at least five of the seven health systems that had Meta Pixels installed in their patient portals had removed those pixels.\n\\\nThe 33 hospitals The Markup found sending patient appointment details to Facebook collectively reported more than 26 million patient admissions and outpatient visits in 2020, according to the most recent data available from the American Hospital Association.\n\\\nOur investigation was limited to just over 100 hospitals; the data sharing likely affects many more patients and institutions than we identified.\n\\\nFacebook itself is not subject to HIPAA, but the experts interviewed for this story expressed concerns about how the advertising giant might use the personal health data it’s collecting for its own profit.\n\\\n“This is an extreme example of exactly how far the tentacles of Big Tech reach into what we think of as a protected data space,” said Nicholson Price, a University of Michigan law professor who studies big data and health care.\n\\\n“I think this is creepy, problematic, and potentially illegal” from the hospitals’ point of view.\n\\\nThe Markup was unable to determine whether Facebook used the data to target advertisements, train its recommendation algorithms, or profit in other ways.\n\\\nFacebook’s parent company, Meta, did not respond to questions. Instead, spokesperson Dale Hogan sent a brief email paraphrasing the company’s sensitive health data policy.\n\\\n“If Meta’s signals filtering systems detect that a business is sending potentially sensitive health data from their app or website through their use of Meta Business Tools, which in some cases can happen in error, that potentially sensitive data will be removed before it can be stored in our ads systems,” Hogan wrote.\n\\\nMeta did not respond to follow-up questions, but Hogan appears to be referencing a sensitive health information filtering system that the company launched in July 2020 in response to a Wall Street Journal article and New York Department of Financial Services investigation.\n\\\nMeta told the investigators that the filtering system was “not yet operating with complete accuracy,” according to the department’s February 2021 final report.\n\\\nThe Markup was unable to confirm whether any of the data referenced in this story was in fact removed before being stored by Meta.\n\\\nHowever, a recent joint investigation with Reveal found that Meta’s sensitive health information filtering system didn’t block information about appointments a reporter requested with crisis pregnancy centers.\n\\\nInternally, Facebook employees have been blunt about how well—or not so well—the company generally protects sensitive data.\n\\\n“We do not have an adequate level of control and explainability over how our systems use data, and thus we can’t confidently make controlled policy changes or external commitments such as ‘we will not use X data for Y purpose.’ ” Facebook engineers on the ad and business product team wrote in a 2021 privacy overview that was leaked to Vice.\n“Almost Any Patient Would Be Shocked”\nThe Meta Pixel is a snippet of code that tracks users as they navigate through a website, logging which pages they visit, which buttons they click, and certain information they enter into forms. \n\\\nIt’s one of the most prolific tracking tools on the internet—present on more than 30 percent of the most popular sites on the web, according to The Markup’s analysis.\n\\\nIn exchange for installing its pixel, Meta provides website owners analytics about the ads they’ve placed on Facebook and Instagram and tools to target people who’ve visited their website.\n\\\nThe Meta Pixel sends information to Facebook via scripts running in a person’s internet browser, so each data packet comes labeled with an IP address that can be used in combination with other data to identify an individual or household.\n\\\nHIPAA lists IP addresses as one of the 18 identifiers that, when linked to information about a person’s health conditions, care, or payment, can qualify the data as protected health information.\n\\\nUnlike anonymized or aggregate health data, hospitals can’t share protected health information with third parties except under the strict terms of business associate agreements that restrict how the data can be used.\n\\\nIn addition, if a patient is logged in to Facebook when they visit a hospital’s website where a Meta Pixel is installed, some browsers will attach third-party cookies—another tracking mechanism—that allow Meta to link pixel data to specific Facebook accounts.\n\\\nAnd in several cases we found—using both dummy accounts created by our reporters and data from Mozilla Rally volunteers—that the Meta Pixel made it even easier to identify patients.\n\\\nWhen The Markup clicked the “Finish Booking” button on a Scripps Memorial Hospital doctor’s page, the pixel sent Facebook not just the name of the doctor and her field of medicine but also the first name, last name, email address, phone number, zip code, and city of residence we entered into the booking form.\n\\\nThe Meta Pixel “hashed” those personal details—obscuring them through a form of cryptography—before sending them to Facebook. \n\\\nBut that hashing doesn’t prevent Facebook from using the data. In fact, Meta explicitly uses the hashed information to link pixel data to Facebook profiles.\n\\\nUsing a free online tool, The Markup was also able to reverse most of our hashed test information that the pixel on Scripps Memorial Hospital’s website sent to Facebook.\n\\\nScripps Memorial didn’t respond to The Markup’s questions but it did remove the Meta Pixel from the final webpages in the appointment booking process after we shared our findings with the hospital.\n\\\nOn other hospitals’ websites, we documented the Meta Pixel collecting similarly intimate information about real patients.\n\\\nWhen one real patient who participated in the Pixel Hunt study logged in to the MyChart portal for Piedmont Healthcare, a Georgia health system, the Meta Pixel installed in the portal told Facebook the patient’s name, the name of their doctor, and the time of their upcoming appointment, according to data collected by the participant’s Mozilla Rally browser extension.\nThe Meta Pixel collects sensitive health information and shares it with Facebook\nThe Meta Pixel installed on Piedmont Healthcare’s MyChart portal sent Facebook details about a real patient's upcoming doctor's appointment, including date, time, the patient’s name, and the name of their doctor\n1Patient name\n2Date and time of appointment\n3Name of provider\n\\\n \n\\\nWhen another Pixel Hunt participant used the MyChart portal for Novant Health, a North Carolina–based health system, the pixel told Facebook the type of allergic reaction the patient had to a specific medication.\n\\\nThe Markup created our own MyChart account through Novant Health to further investigate and found the Meta Pixel collecting a variety of other sensitive information.\n\\\nClicking on one button prompted the pixel to tell Facebook the name and dosage of a medication in our health record, as well as any notes we had entered about the prescription. The pixel also told Facebook which button we clicked in response to a question about sexual orientation.\n\\\n“Our Meta pixel placement is guided by a third party vendor and it has been removed while we continue to look into this matter,” Novant spokesperson Megan Rivers wrote in an email.\n\\\nEpic Systems, the software company behind MyChart, has “specifically recommended heightened caution around the use of custom analytics scripts,” Stirling Martin, a senior vice president for the company, wrote in an email.\n\\\nFacebook is able to infer intimate details about people’s health conditions using other means—for example, the fact that a person “liked” a Facebook group associated with a particular disease—but the data collected by pixels on hospitals’ websites is more direct. \n\\\nAnd in sharing it with Facebook, experts said, health care providers risk damaging patients’ trust in an increasingly digitized health system.\n\n\n\\\nThe Markup found that filling out a survey through Novant Health shared sensitive information like sexual orientation with Facebook via the Meta Pixel. Source: www.novantmychart.org\n\\\n“Almost any patient would be shocked to find out that Facebook is being provided an easy way to associate their prescriptions with their name,” said Glenn Cohen, faculty director of Harvard Law School’s Petrie-Flom Center for Health Law Policy, Biotechnology, and Bioethics.\n\\\n“Even if perhaps there’s something in the legal architecture that permits this to be lawful, it’s totally outside the expectations of what patients think the health privacy laws are doing for them.”\nLegal Implications\nFacebook’s data collection on hospital websites has been the subject of class action lawsuits in several states, with mixed results.\n\\\nThose cases involve types of data that health law experts said are sensitive but less regulated than the health information The Markup documented the Meta Pixel collecting.\n\\\nIn 2016, a group of plaintiffs sued Facebook and a handful of health systems and organizations, alleging that the organizations had breached their own privacy policies and several state and federal laws—including wiretapping and intrusion on seclusion statutes—by collecting data via tracking technology on the health care providers’ websites.\n\\\nThe U.S. District Court for the Northern District of California dismissed that case in 2017 for a variety of reasons, including that the plaintiffs failed to prove that Facebook had collected “protected health information,” as defined by HIPAA. \n\\\nRather, the court found, Facebook had tracked plaintiffs on public-facing pages of the websites—such as the homepage or informational pages about diseases—where there was no evidence that the plaintiffs had established a patient relationship with the provider.\n\\\nIn 2019, plaintiffs brought a similar class action lawsuit in Suffolk County Superior Court against Massachusetts-based Partners Healthcare System, which has since changed its name to Mass General Brigham, alleging that the system had violated patients’ privacy and its own policies by installing the Meta Pixel and other tracking tools on its websites.\n\\\nThe parties settled the case in January, with Mass General Brigham denying the allegations and admitting no wrongdoing or liability but paying $18.4 million to the plaintiffs and their attorneys. \n\\\nAfter the settlement, Mass General Brigham appears to have removed Meta Pixel and other tracking tools from many of its hospitals’ websites—but not all of them.\n\\\nWhen The Markup tested the website of Brigham and Women’s Faulkner Hospital, clicking the “Request Appointment” button on a doctor’s page caused the Meta Pixel to send Facebook the text of the button, the doctor’s name, and the doctor’s field of medicine. Mass General did not respond to The Markup’s request for comment.\n\\\nAs with all such data we found the Meta Pixel collecting, it was sent to Facebook along with our computer’s public IP address.\n\\\n“When an individual has sought out a provider and indicated that they want to make an appointment, at that point, any individually identifiable health information that they’ve provided in this session, in the past, or certainly in the future, is protected under HIPAA and could not be shared with a third party like Facebook,” Holtzman said.\n\\\nThe U.S. Department of Human Services’ Office for Civil Rights “cannot comment on open or potential investigations,” spokesperson Rachel Seeger wrote in an emailed statement.\n\\\n“Generally, HIPAA covered entities and business associates should not be sharing identifiable information with social media companies unless they have HIPAA authorization [from the individual] and consent under state law,” said Iliana Peters, a privacy lawyer with the firm Polsinelli who previously headed HIPAA enforcement for the Office for Civil Rights.\n\\\nPatients have the right to file HIPAA complaints with their medical providers, who are required to investigate the complaints, Peters said, adding, “I would hope that institutions would respond quickly to those types of complaints so that they aren’t escalated to a state or federal regulator.”\n\"Plausible Deniability\"\nMost of the hospitals The Markup contacted for this story did not respond to our questions or explain why they chose to install Meta Pixel on their websites. But some did defend their use of the tracker.\n\\\n“The use of this type of code was vetted,” wrote Chris King, a spokesperson for Northwestern Memorial Hospital, in Chicago. King did not respond to follow-up questions about the vetting process.\n\\\nKing said that no protected health information is hosted on or accessible through Northwestern Memorial’s website and that “Facebook automatically recognizes anything that might be close to personal information and does not store this data.”\n\\\nIn fact, Meta explicitly states in its business tools terms of service that the pixel and other trackers do collect personally identifiable information for a variety of purposes.\n\\\nHouston Methodist Hospital, in Texas, was the only institution to provide detailed responses to The Markup’s questions. \n\\\nThe hospital began using the pixel in 2017, spokesperson Stefanie Asin wrote, and is “confident” in Facebook’s safeguards and that the data being shared isn’t protected health information.\n\\\nWhen The Markup tested Houston Methodist’s website, clicking the “Schedule Appointment” button on a doctor’s page prompted the Meta Pixel to send Facebook the text of the button, the name of the doctor, and the search term we used to find the doctor: “Home abortion.”\n\\\nHouston Methodist doesn’t categorize that data as protected health information, Asin wrote, because a person who clicks the “Schedule Appointment” button may not follow through and confirm the appointment, or, they may be booking the appointment for a family member rather than for themself.\n\\\n“The click doesn’t mean they scheduled,” she wrote. “It’s also worth noting that people often are exploring for a spouse, friend, elderly parent.”\n\\\nAsin added that Houston Methodist believes Facebook “uses tools to detect and reject any health information, providing a barrier that prevents passage of [protected health information].”\n\\\nDespite defending its use of the Meta Pixel, Houston Methodist Hospital removed the pixel from its website several days after responding to The Markup’s questions.\n\\\n“Since our further examination of the topic is ongoing, we elected to remove the pixel for now to be sure we are doing everything we can to protect our patients’ privacy while we are evaluating,” Asin wrote in a follow-up email.\n\\\nFacebook did not launch its sensitive health data filtering system until July 2020, three years after Houston Methodist began using the pixel, according to the New York Department of Financial Services’ investigation.\n\\\nAnd as recently as February of last year, the department reported that the system’s accuracy was poor.\n\\\nThat type of Band-Aid fix is a prime example, privacy advocates say, of the online advertising industry’s inability to police itself.\n\\\n“The evil genius of Facebook’s system is they create this little piece of code that does the snooping for them and then they just put it out into the universe and Facebook can try to claim plausible deniability,” said Alan Butler, executive director of the Electronic Privacy Information Center.\n\\\n“The fact that this is out there in the wild on the websites of hospitals is evidence of how broken the rules are.”\nThis article was copublished with STAT, a national publication that delivers trusted and authoritative journalism about health, medicine, and the life sciences. Sign up for their health tech newsletter, delivered Tuesday and Thursday mornings, here: https://www.statnews.com/signup/health-tech/\nUpdate\nAfter the publication of this story, Duke Health told The Markup that it had removed the Meta Pixel from its website.\n\\\nDuke Health spokesperson Sarah Avery said, “Duke Health is committed to protecting the privacy of health information of our patients. Upon investigation of the issue raised in the report that appeared this morning, we have removed the MetaPixel image.”\nCredits: Todd Feathers, Simon Fondrie-Teitler, Angie Waller, Surya Mattu, Micha Gorelick, Gabriel Hongsdusit, Jill Jaroff, Rina Palta, Mozilla Rally\n\\\nAlso published here\n\\\nPhoto by Solen Feyissa on Unsplash","dc:creator":"The Markup","content":"A tracking tool installed on many hospitals’ websites has been collecting patients’ sensitive health information. The Markup tested the websites of Newsweek’s (https://www.newsweek.com/worlds-best-hospitals-2022/United-states) top 100 hospitals in America. On 33 of them we found the tracker, called the Meta Pixel, sending Facebook a packet of data whenever a person clicked a button to schedule a doctor's appointment. The data is connected to an IP address, which can generally be linked to a specific individual or household.","contentSnippet":"A tracking tool installed on many hospitals’ websites has been collecting patients’ sensitive health information. The Markup tested the websites of Newsweek’s (https://www.newsweek.com/worlds-best-hospitals-2022/United-states) top 100 hospitals in America. On 33 of them we found the tracker, called the Meta Pixel, sending Facebook a packet of data whenever a person clicked a button to schedule a doctor's appointment. The data is connected to an IP address, which can generally be linked to a specific individual or household.","guid":"https://hackernoon.com/hospital-websites-are-giving-facebook-sensitive-information?source=rss","categories":["facebook","data","info","hospital","healthcare","sensitive-data","themarkup","hackernoon-top-story"],"isoDate":"2022-12-15T00:39:15.000Z","from":"https://hackernoon.com/feed","hashId":"5d41c95f1efca049f239db4a2f9ed21d"},{"creator":"Pro Publica","title":"This Job Training Program Is Helping People With Autism Fight Cybercrime","link":"https://hackernoon.com/this-job-training-program-is-helping-people-with-autism-fight-cybercrime?source=rss","pubDate":"Thu, 15 Dec 2022 01:26:29 GMT","content:encoded":"<p><em>This story was originally published on <a href=\"https://www.propublica.org/article/autistic-adults-train-for-cybersecurity-jobs\">ProPublica</a> by&nbsp;<a href=\"https://www.propublica.org/people/renee-dudley\">Renee Dudley</a>.</em></p>\n<p>\\\nThomas van Ruitenbeek’s life fell apart in 2012, when a psychotic episode and a diagnosis of autism derailed his pursuit of a digital communication degree at a university in Utrecht, the Netherlands. </p>\n<p>\\\nFor the better part of a year, the 25-year-old wouldn’t respond when spoken to, his father said, and his blue, wide-set eyes revealed little cognition. He rarely left his parents’ duplex and filled his time studying daily newspapers, convinced they contained secret messages. </p>\n<p>\\\nSometimes, he worked up the energy to paint miniature figurines from the medieval fantasy-themed board game Warhammer. Mostly, he did nothing.</p>\n<p>\\\nThe psychotic episode and the autism diagnosis locked him into a state of isolation that had been deepening since his childhood, solidifying his long-held belief that he was an outsider. Van Ruitenbeek’s parents took him to appointments with doctors and therapists. </p>\n<p>\\\nWhen he grew strong enough, they supported his return to work. He did simple tasks — mostly cutting and packaging yarn — at a job he obtained through the local mental health department. </p>\n<p>\\\nThat was a far cry from his earlier aspirations of being a video game designer and hardly the life his parents had hoped he would have. They worried about what would happen when they grew old and could no longer look after him.</p>\n<p>\\\nThen, during a meeting with his coach at the mental health department in 2013, van Ruitenbeek and his parents got an unexpected bit of hope. </p>\n<p>\\\nA short distance away, a first-time entrepreneur named Peter van Hofweegen and his business partner were figuring out how to launch an education and job placement program geared toward autistic young adults who were interested in computers.</p>\n<p>\\\nThe number of people diagnosed with autism is hard to ascertain, but the statistics that are available suggest it’s on the rise. </p>\n<p>\\\nAn estimated 100,000 autistic Americans turn 18 every year, according to <a href=\"https://drexel.edu/autismoutcomes/topics/employment/\">Drexel University’s Autism Institute</a>, and a growing number of programs in the U.S. and elsewhere aim to employ tech-savvy autistic people.</p>\n<p>\\\nBut van Hofweegen’s program was something different. He and his partner sought primarily to recruit socially isolated, seemingly unemployable dropouts who almost certainly would be passed over even by employers who welcome candidates with neurological differences like autism. </p>\n<p>\\\nThey wanted people who couldn’t make it on their own and had been “sitting for years in their parents’ homes,” van Hofweegen said. The number of students in his program would be small, but the stakes were large. </p>\n<p>\\\nIf they could be doing meaningful, sophisticated work, what kind of a model might that provide for the uncounted numbers of people with autism around the world seemingly sentenced to constricted, unproductive lives.</p>\n<p>\\\nThe untested model drew skepticism even from other autism advocates, who viewed it as well-intentioned but overly idealistic. But van Ruitenbeek’s coach, Anita de Winter, saw it as a godsend. </p>\n<p>\\\nShe had worked with hundreds of autistic adults who struggled to find meaningful work and become independent. De Winter described the program to van Ruitenbeek without betraying her enthusiasm. She didn’t want him to be disappointed if it didn’t work out.</p>\n<p>\\\n“This might be for someone like you,” she told him.</p>\n<p>\\\nVan Hofweegen’s path to autism advocacy traces back to 1996, when his first child was born. The boy, named Thijs, sustained an injury during birth and was diagnosed with cerebral palsy. </p>\n<p>\\\nDoctors told van Hofweegen and his then-wife that Thijs might never walk or talk. But with the help of specialists, he learned to both move and speak.</p>\n<p>\\\nThijs went far beyond that. After proclaiming a desire to learn how to swim at age 5, and taking seven years to pass his basic swimming test, Thijs persisted through intermediate and advanced levels alongside much younger classmates. </p>\n<p>\\\nWhen he swam the 50-meter freestyle test to pass the advanced level, he earned a standing ovation from the other students’ parents. Van Hofweegen never forgot that moment. (He continued to ponder it even as Thijs developed into a competitive swimmer and won a silver medal in the men’s 400-meter freestyle at the Paralympic Games in 2016.) </p>\n<p>\\\nIt showed what a person could accomplish with the right support and accommodations.</p>\n<p>\\\nWhile helping out at an event in 2012 for people struggling with unemployment, van Hofweegen met Frans de Bie, an IT guru and fellow volunteer. A year earlier, de Bie had sold his 40-person tech company. Like van Hofweegen, de Bie drew inspiration from his personal life. </p>\n<p>\\\nHe had grown up alongside foster siblings, and he understood the transformative power of a supportive environment. He also was motivated by his son and daughter, who have dyslexia.</p>\n<p>\\\nThe new friends hit upon an idea. Van Hofweegen had read a survey saying 20,000 Dutch people were not participating in the workforce because of their autism. Perhaps they could start an organization that would help autistic people interested in technology to find work. </p>\n<p>\\\nAfter more than 25 years in management roles at hotels and at a temporary-job placement agency, van Hofweegen quit his job. A short time later, in late 2013, he and de Bie incorporated an organization they called ITvitae.</p>\n<p>\\\nThe Dutch have a saying: “God created the earth, but the Dutch created the Netherlands.” That’s because for centuries, the country’s citizens reclaimed land from the North Sea using their iconic system of dikes, canals and windmills. </p>\n<p>\\\nAbout a third of the country’s fertile land is below sea level. The Netherlands, half the size of South Carolina, remains among the world’s leading economies in part because its people have maximized its geographical resources.</p>\n<p>\\\nAnd so it was culturally ingrained in van Hofweegen and de Bie to maximize the country’s human resources. Partly because de Bie was familiar with the unmet demand for IT jobs in the Netherlands, a <a href=\"https://www.computable.nl/artikel/nieuws/carriere/7233117/250449/aantal-vacatures-in-ict-branche-stijgt-flink.html\">gap currently estimated at 100,000</a>, and because the country has a robust tech sector, the co-founders wanted to focus on that area.</p>\n<p>\\\nThe two men saw ITvitae — the name is an amalgam of “information technology” and “curriculum vitae,” which they pronounce ee-tay-vee-tay — as a way to fill tech-sector jobs and strengthen the Dutch economy as much as they considered it a social enterprise to lift up autistic people who felt excluded from the job market.</p>\n<p>\\\nCommon traits found in autistic people often prevent them from being hired or even applying to jobs in the first place. They may struggle to interpret social cues, pause frequently when speaking, exhibit disruptive eccentricities or avoid eye contact. </p>\n<p>\\\nYet employers have found that other <a href=\"https://www.autismspeaks.org/job-seekers-students-employees\">characteristics</a> make them excellent employees. They tend to be thorough and fastidious, have the ability to go deep on specific topics and focus for prolonged periods of time. </p>\n<p>\\\nThose traits lend themselves to careers in technology and cybersecurity, among many other fields.</p>\n<p>\\\nVan Hofweegen and de Bie envisioned a six-month course focused on preparing students to be software testers — a natural fit for autistic people, who tend to be methodical rule-followers. </p>\n<p>\\\nAs the students embarked on coursework, van Hofweegen would find employers by cold-calling IT and software companies as well as by tapping the connections of his board members.</p>\n<p>\\\nThe co-founders believed ITvitae could generate revenue primarily by charging employers a recruiting fee for each hire. </p>\n<p>\\\nDe Bie believed employers would be willing to pay because the amount he proposed was less than the typical cost of specialized, third-party technical training for new or existing employees.</p>\n<p>\\\nThe first challenge was finding students. After winding their way through various government agencies, van Hofweegen and de Bie found de Winter, who worked near where they lived. </p>\n<p>\\\n“Do you know these types of people?” van Hofweegen asked her in 2013 after laying out the vision for ITvitae. She replied, “How many do you want?”</p>\n<p>\\\nAs the co-founders prepared to interview about 30 candidates for 11 slots, de Winter explained the potential pitfalls. Autistic people tend to process language literally, she told them, and might be unable to respond to classic prompts. </p>\n<p>\\\nThe question “what do you hope to get from your time at ITvitae?” might elicit a blank stare. That’s because, to an autistic person, there’s no basis for what the outcomes of the new program might be. Alternatively, the list of answers could be endless and paralyzing. </p>\n<p>\\\nThey needed something concrete and technical to discuss. So de Bie concocted a simple tool that would serve as a discussion topic and gauge applicants’ computer interest: He asked the candidates to draw maps of their home computer networks and be prepared to describe them.</p>\n<p>\\\nVan Hofweegen and de Bie were full of enthusiasm. But, as they continued to talk with de Winter, they realized how much they still had to learn about the very people they wanted to help. They were, perhaps, in over their heads.</p>\n<p>\\\nFor as long as he could remember, van Ruitenbeek knew he was different but felt that he couldn’t let other people know that. It was as if he were “living undercover,” he said. He was constantly afraid that asking the wrong question would cause him to be bullied, so he never asked questions.</p>\n<p>\\\nWhile his twin sister played with other children, he withdrew to solitary activities, learning to design his own websites on topics ranging from outer space to dinosaurs. But his life took a darker turn after his psychotic episode in Utrecht.</p>\n<p>\\\nVan Ruitenbeek had planned to spend the summer day catching up on coursework when suddenly he began to feel that he was outside his own body. </p>\n<p>\\\nHis vision narrowed and his mind compelled him to follow what he believed were secret hand signals made by strangers, which eventually directed him to a bar to order a draft Heineken. He then lurched outside the bar in a stupor. </p>\n<p>\\\nVan Ruitenbeek rambled in halting, slurred speech when his sister and father reached him by phone. Frantic with worry, Henk van Ruitenbeek drove through Utrecht and eventually found his son standing on a sidewalk, staring vacantly. He got him in the car and took him home.</p>\n<p>\\\nIn the aftermath, with a new diagnosis of autism, van Ruitenbeek believed his life was over. He had thought it was not rational or even possible to set goals for himself. Then de Winter mentioned ITvitae, and he knew he badly wanted a slot there. </p>\n<p>\\\nThe ITvitae interview, he later said, was “like a ticket out of my situation.” More nervous than he had ever been, he told himself: “I have to make it. I have to do my best.”</p>\n<p>\\\nThe interview, which took place in late 2013, was difficult for everyone. Although van Hofweegen and de Bie were pleasant and upbeat, van Ruitenbeek felt he was in “hostile territory.” </p>\n<p>\\\nThen again, everything beyond his parents’ home seemed that way at the time. </p>\n<p>\\\nHe stuttered severely when describing his recovery from psychosis, and it took him an uncomfortably long time to utter a single sentence. He was visibly perspiring. “This isn’t working,” de Bie thought.</p>\n<p>\\\nWhen de Bie pivoted to the network drawing and other technical questions, the interview shifted. Van Ruitenbeek stuttered less. De Bie, impressed by his remarks about website design, decided before the interview ended that van Ruitenbeek should have a space at ITvitae.</p>\n<p>\\\nDe Bie thought it was obvious that van Ruitenbeek — and most of the other candidates — had raw computer talent. Van Hofweegen welled with tears. “What are these wonderful people doing at home?” he wondered.</p>\n<p>\\\nAdvocates for people with autism in the United States often ask the same question. </p>\n<p>\\\nParents of autistic teenagers describe the <a href=\"https://drexel.edu/autismoutcomes/blog/overview/2015/August/falling-off-the-services-cliff/\">“cliff” of high school or college graduation</a>, marked by the struggle to navigate the transition from years of special education and support to independent working life. </p>\n<p>\\\nFirm data is hard to come by, but some estimates suggest millions of autistic American adults are unemployed or underemployed. Of those who find work, most are in low-wage and part-time jobs, according to Drexel’s Autism Institute.</p>\n<p>\\\nAt the same time, demand for workers with technical skills has far outpaced supply. In the cybersecurity field alone, the U.S. faces a <a href=\"https://www.cyberseek.org/heatmap.html\">shortfall</a> of more than 225,000 workers, according to CyberSeek, an organization that provides job market data. </p>\n<p>\\\nThe number of available tech-related jobs in the U.S. nearly doubled from 2020 to 2021, analytics company <a href=\"https://datapeople.io/tech-hiring-report/state-of-the-tech-hiring-market/\">Datapeople reported</a>.</p>\n<p>\\\nOver the past decade, a variety of opportunities for autistic adults in the U.S. — ranging from technical training and job placement programs in various cities, to targeted hiring and retention efforts at large employers — have aimed to bridge the tech workforce gap. </p>\n<p>\\\nBut the results so far have been modest, said Michael Bernick, a San Francisco-based attorney who has written two books on employment strategies for the neurodiverse.</p>\n<p>\\\nThat’s partly because many initiatives <a href=\"https://hbr.org/2017/05/neurodiversity-as-a-competitive-advantage\">expect job candidates</a> to have higher education, credentials and the ability to work with minimal support, said Bernick, who was director of the California labor department from 1999 to 2004. “</p>\n<p>\\\nThey are looking for people who have significant tech skills,” he said. “Of that group, not all are college graduates, but they’re also not the long-term unemployed, sitting in their parents’ basements.” </p>\n<p>\\\nSomeone like van Ruitenbeek wouldn’t have stood a chance.</p>\n<p>\\\nOne widely publicized initiative is the Neurodiversity @ Work Employer Roundtable, a collection of about four dozen private employers — <a href=\"https://disabilityin.org/what-we-do/committees/neurodiversity-at-work-roundtable/\">including Microsoft, SAP, Google</a> and more — that foster neurodiversity hiring programs. </p>\n<p>\\\nParticipating companies offer screening and interview processes to accommodate autistic candidates; about 1,200 neurodiverse candidates have gotten jobs with Roundtable employers over the past decade, said Neil Barnett of Microsoft, a leader of the group. </p>\n<p>\\\nBarnett, who has discussed the initiative with Bernick, hopes that Roundtable employers will continue to expand their hiring of neurodiverse candidates with a variety of skills, including outside of tech.</p>\n<p>\\\nAutistic adults who are interested in computers represent just a sliver of autistic job seekers, according to the national advocacy organization Autism Speaks; Bernick puts the figure around 10% to 15%. </p>\n<p>\\\nDue in part to prominent figures such as Elon Musk, who has <a href=\"https://www.thestreet.com/markets/elon-musk-ted-talk\">said he has Asperger’s syndrome</a>, which is now considered a type of <a href=\"https://www.autismspeaks.org/types-autism-what-asperger-syndrome\">autism spectrum disorder</a>, and pop culture caricatures of socially awkward workers in Silicon Valley, the notion that autistic people inherently possess extraordinary tech competencies has become a cliché. </p>\n<p>\\\nBernick said he once had hopes of a tech career for his own autistic son. But his son had neither uncommon skills nor a deep interest in computers.</p>\n<p>\\\nWhile the 10% to 15% estimated by Bernick may seem like a small slice relative to popular perception, efforts to employ that group are nonetheless important, especially given the dramatic need in the tech sector, advocates and researchers said. </p>\n<p>\\\nBernick said programs in the U.S. should expand their efforts to find autistic job seekers who have computer capabilities but lack the credentials — precisely the types of people van Hofweegen and de Bie recruited for their inaugural class.</p>\n<p>\\\nIn February 2014, after a six-month stint cutting yarn, van Ruitenbeek rode his bicycle to ITvitae’s space for the first day of class. He was nervous. In social settings, he always felt as though he were “from another planet,” he said. </p>\n<p>\\\nHere, though, he was surrounded by people who felt the same way.</p>\n<p>\\\nShortly after their arrival, de Bie assigned the students to assemble the furniture they would be using. When he returned several hours later, he found they had put it together flawlessly. </p>\n<p>\\\nHe asked how everyone was getting along and discovered that none of the students had bothered with introductions. De Bie was surprised and amused; he was still learning how autistic people function.</p>\n<p>\\\nVan Hofweegen and de Bie, who refused to use the word “disability,” told the students they had “different operating systems” than the neurotypical people they grew up with. </p>\n<p>\\\nIt helped to reassure them that they belonged in the classroom, and eventually the workplace, as they all began to “learn how to learn again” following what for some was years away from school, van Hofweegen said. </p>\n<p>\\\nDe Bie eased the students into a school setting by leading a training on basic Microsoft programming, networking and security. That was followed by a 40-day course on software testing offered by an organization that issues certifications for technical specialties in the Netherlands.</p>\n<p>\\\nAfter only a short time, van Ruitenbeek said he began to feel “at home for the first time in my life.” He enjoyed his coursework and excelled at it. He gradually began interacting with other students as he felt more at ease and less afraid of making social mistakes. </p>\n<p>\\\nWhen he grumbled about commuting by bike, a classmate offered to drive him to and from ITvitae. Van Ruitenbeek gladly accepted.</p>\n<p>\\\nYet, for all his progress, van Ruitenbeek continued to face obstacles. Conversation remained difficult due to his stutter, and he lacked the energy to work the 32-hour week that most employers expected of ITvitae’s graduates. </p>\n<p>\\\nSometimes his father worried it was all too much for him. He was one of three students for whom van Hofweegen struggled to find a job.</p>\n<p>\\\nWhen the coursework drew to a close, the students took a formal exam to be certified in software testing. Van Ruitenbeek breezed through the questions, except for one that confounded him: None of the multiple choice answers were technically correct. </p>\n<p>\\\nSo he selected the answer that he suspected the test-maker wanted. He picked correctly and scored 100%. “It was my first achievement,” van Ruitenbeek said. “I could do something.”</p>\n<p>\\\nA short time later, a director from the testing company visited ITvitae and van Hofweegen told him that a student had spotted a mistake in the exam. Van Hofweegen, who has an uncanny ability to sense an opportunity and pounce, suggested that van Ruitenbeek could be a test reviewer. </p>\n<p>\\\nThe company invited him to join a small group of volunteers who look over exams for accuracy and clarity. Van Ruitenbeek readily agreed. To prepare, he plowed through a textbook on ethical hacking.</p>\n<p>\\\nThe work led him to his next self-discovery: Ethical hacking was fun. Once unable to set goals for the future, van Ruitenbeek now dreamed of a career in cybersecurity. He would hunt for hidden vulnerabilities in software and networks, and prevent them from falling prey to malicious hackers.</p>\n<p>\\\nFollowing the success of their first class, van Hofweegen and de Bie recruited another class, then another, each with a maximum of 14 students. </p>\n<p>\\\nAfter the first year, with steady revenue generated mainly from fees paid by employers, the co-founders began taking salaries, and they hired additional staff. ITvitae’s mission spread to autistic job seekers and their supporters across the Netherlands.</p>\n<p>\\\nAs the organization grew, van Hofweegen and de Bie relocated ITvitae to a floor in a former monastery, which had been converted into offices. The founders thought its tree-shaded walking paths and seclusion would impart a serenity that the students needed. </p>\n<p>\\\nThe organization also began offering new courses in software development, data science and cybersecurity, all specialties in high demand. </p>\n<p>\\\nStudents delighted in being able to focus exclusively on topics that fascinated them, a luxury — for many of the students, a necessity — that traditional educational settings couldn’t provide.</p>\n<p>\\\nCertain similarities emerged among ITvitae’s students. Before joining, nearly half had been sitting at home, unemployed and socially isolated, for longer than two years. Many passed the time playing video games and lost track of whether it was day or night. </p>\n<p>\\\nThey told van Hofweegen and de Bie they felt worthless and never fit in; many reported having been bullied and struggling through periods of depression.</p>\n<p>\\\nITvitae turned away about two-thirds of applicants, most frequently because of untreated mental health issues. Other candidates simply weren’t ready. One 2022 applicant said he hadn’t left his home for 10 years and spent most of his time gaming. </p>\n<p>\\\n“It was such a big thing for him to be here” for the interview, de Bie said. “But then traveling regularly, studying in a group, doing exams — that would have been too heavy for him. I had to tell him it’s not the right time.”</p>\n<p>\\\nMale students at ITvitae outnumber female students 10 to 1, both because autism is more prevalent in men and more likely to go undiagnosed or misdiagnosed in women. Many experience sensory challenges, such as headaches if the light is too bright or if there’s too much noise. </p>\n<p>\\\nOne student was distracted by the sound of blinking eyelashes. Most struggle to varying degrees with communication.</p>\n<p>\\\nTo help both prospective employers and job candidates work through the inevitable miscommunications, ITvitae staff members accompanied students to job interviews. </p>\n<p>\\\nSaskia Meeuwessen, who was hired as the CEO of ITvitae as it expanded, recalled joining a student at an interview for a cybersecurity job with the Dutch National Police. </p>\n<p>\\\nThe interviewer asked the candidate to introduce himself. The student froze: It wasn’t a question he had practiced. Nonetheless, he was later invited for a second meeting with an interviewer who was more experienced in interacting with autistic people.</p>\n<p>\\\nThat interviewer sat down and, with no social niceties, asked, “When I type www.google.nl, what happens?” Meeuwessen thought to herself, “Well, Google shows up, what a silly question.” </p>\n<p>\\\nBut the candidate had a completely different reaction, launching into nuanced details about internet servers and connections. For 90 minutes, Meeuwessen “sat there, listening to stuff that I really didn’t understand,” she said. The candidate was hired on the spot.</p>\n<p>\\\nThanks in part to its gradually sloped coastline, the Netherlands is a popular landing spot for the underwater fiber optic cables connecting the United States and Europe. Fast, reliable and inexpensive internet connectivity has fostered a flourishing tech sector. </p>\n<p>\\\nBut that connectivity has negative consequences, too. Hackers who can’t rely on the fragile internet connections in their home countries use servers in the Netherlands to commit crimes.</p>\n<p>\\\nTo counter these hackers, the Dutch National Police established an elite force called the High Tech Crime Unit, or HTCU. </p>\n<p>\\\nThe unit has become renowned both for its success disrupting the operations of cyberattackers and for its innovative culture, which for years has included hiring unconventional candidates, including those with autism.</p>\n<p>\\\nIn 2017, at van Hofweegen’s urging, the HTCU brought on a graduate from ITvitae. He proved to be an open-source intelligence wizard. Another graduate followed. </p>\n<p>\\\nThen the floodgates opened, and about 30 ITvitae graduates were eventually hired to jobs in regional police squads, where they handle data analysis, digital forensics and other technical specialties.</p>\n<p>\\\nThe National Police’s embrace of a neurodiverse workforce extended beyond its partnership with ITvitae. Its most renowned hiring initiative for autistic employees began with a 2016 murder case.</p>\n<p>\\\nA 50-year-old Turkish man <a href=\"https://www.hogeraad.nl/actueel/nieuwsoverzicht/2020/april/liquidatie-leiden/\">had been shot</a> more than 30 times in the Dutch city of Leiden and died two days later. The National Police collected surveillance camera footage and quickly identified the suspects. </p>\n<p>\\\nTheir work also seemed to link the murder to a number of cold cases in Amsterdam. The National Police took over those investigations, inheriting 1,700 hours of camera footage. Watching the tapes was a marathon of drudgery that none of the National Police detectives wanted to take on.</p>\n<p>\\\nOne National Police detective, Jory de Groot, happened upon an idea. De Groot, who has a foster brother with Down syndrome, volunteered with a group that organized trips for young adults with disabilities. On a weekend shortly after the murder, she led a <a href=\"https://www.autitravel.nl/?gclid=CjwKCAjwoMSWBhAdEiwAVJ2ndlaS5qbbSd6rgP0EzSVW4JrdWri3uLJ8a9x1nOpQQnhY1fNQQ7IPrxoC9vYQAvD_BwE\">group</a> of people with autism. </p>\n<p>\\\nDe Groot, then 26, described her job to one participant on the trip and mentioned the painstaking work of watching security footage. Some autistic people <a href=\"https://blogs.scientificamerican.com/beautiful-minds/autism-more-than-meets-the-eye/\">excel</a> at recognizing small details, the woman told de Groot. They might love the very task that neurotypical detectives loathe.</p>\n<p>\\\nDe Groot then contracted four people from <a href=\"https://www.autitalent.nl/\">AutiTalent</a>, a Dutch job placement organization for autistic people. She prepared her colleagues, advising them against asking typical get-to-know-you questions, and set up a radio-free office in a quiet corner of their building.</p>\n<p>\\\nWhen the autistic contractors arrived, the National Police detectives tested their abilities by having them watch the footage collected in the Leiden murder. </p>\n<p>\\\nThe detectives had already watched the tapes, which included the days leading up to the shooting, and knew precisely when the suspects would be seen on the day of the shooting.</p>\n<p>\\\nBefore long, one of the contractors spotted a suspect on the tape — but not when the detectives expected. The contractor found the suspect casing the crime scene the day before the attack. </p>\n<p>\\\nThe detectives had missed it. “It was really important evidence that we overlooked,” de Groot said. </p>\n<p>\\\nEventually, the two suspects were convicted in the Leiden murder.</p>\n<p>\\\nAs word of the feat reverberated through the National Police, requests for more AutiTalent contractors flooded in. Eventually, 50 autistic people were working as “camera footage specialists,” a newly created role, across the National Police.</p>\n<p>\\\n De Groot’s original team grew to six people, who increasingly talked with one another and with their police colleagues as they became more comfortable. </p>\n<p>\\\nThe contractors joined detectives from the start of investigations, rather than stepping in after they were already in progress, and took part in briefings. Additional contractors from AutiTalent became “audio specialists,” who transcribed interrogations and wiretaps.</p>\n<p>\\\nThe high profile of the contractors led some members of the National Police force to speak out about their own autism, which they’d previously hidden. </p>\n<p>\\\nThe outpouring prompted de Groot to work with those employees and an advocacy organization to establish an “Autism Embassy” at the National Police. </p>\n<p>\\\nNow about a dozen workplace “ambassadors” — employees with autism who volunteer for the role — offer an ear and advice to both autistic colleagues and their managers.</p>\n<p>\\\nThe National Police’s embrace of autistic contractors has been partially driven by government-proposed targets, accompanied by subsidies, for industry and government to hire 125,000 people who have difficulty finding work because of a disability. </p>\n<p>\\\nThat sort of government-centric approach is unlikely to occur in the U.S. Still, law enforcement agencies in the U.S. could draw lessons from the Dutch experiment, said Michael Bernick, the attorney who has focused on employment strategies for autistic people.</p>\n<p>\\\nAmid ITvitae’s successes, van Ruitenbeek was still floundering. He had enjoyed his time as a volunteer test reviewer in 2014, but it didn’t lead to a job. A subsequent internship with a computer security consultancy also didn’t land him permanent employment. </p>\n<p>\\\nYet another internship, with an organization that maintained supercomputers, failed when he experienced a psychotic episode in late 2016.</p>\n<p>\\\nIt happened when van Ruitenbeek was commuting to the company’s Amsterdam office by train. He knew public transportation was a stressor for him, but he thought he could push through it. He couldn’t. That day, he believed everyone on the train was talking about him. </p>\n<p>\\\nHe didn’t fully lose control, as he had in Utrecht. Still, he realized he couldn’t continue to commute and work normally with the organization any longer. He quit.</p>\n<p>\\\nIt had been more than two years since his ITvitae graduation, and van Ruitenbeek was again feeling hopeless. He mostly stayed at his parents’ home, where he tinkered with developing his own video game. </p>\n<p>\\\nHe sometimes rode his bike to ITvitae’s offices — “just as a place to go,” he said — where he read books on cybersecurity and tried to ground himself.</p>\n<p>\\\nVan Ruitenbeek happened to be at ITvitae one day in late 2017 when Pim Takkenberg, then a director at the Dutch cybersecurity firm Northwave and a former leader of the National Police’s High Tech Crime Unit, was there. </p>\n<p>\\\nEarlier that year, Takkenberg had overseen the development of a training program for ITvitae’s cybersecurity students. </p>\n<p>\\\nDuring the visit, van Hofweegen, ever scouting, made a request: “Pim, I have a person here, who is extremely vulnerable but extremely brilliant. I want you to talk to him.”</p>\n<p>\\\nAfter a brief chat, Takkenberg agreed to give van Ruitenbeek a “hack test” to assess his aptitude for penetration testing. The prospect alone was enough to help van Ruitenbeek regain some hope. </p>\n<p>\\\nA few months later, on exam day, Takkenberg instructed him to find vulnerabilities in a piece of software, which hackers could exploit to attack the hypothetical client. Takkenberg jokingly warned him not to cheat. </p>\n<p>\\\nVan Ruitenbeek took him literally, assuming he meant not to research anything on the internet. In reality, using the internet would have been allowed, even expected.</p>\n<p>\\\nVan Ruitenbeek found the main vulnerabilities. Takkenberg was impressed but remained skeptical. Van Ruitenbeek still had trouble with conversation, and he was able to work only three days a week. </p>\n<p>\\\nAddressing the doubts, van Hofweegen said: “You want a problem solved. He communicates better with computers than with people. In a technical world, it’s not so bad.”</p>\n<p>\\\nTakkenberg offered him a trial six-month internship. But he needed someone who could work 40 hours a week. They found a compromise. Van Ruitenbeek would start with three days a week, then gradually increase to five days. </p>\n<p>\\\nNorthwave also allowed van Ruitenbeek to work from home occasionally, a major concession before the pandemic. He went on a special diet and began exercising to improve his health and boost his energy. </p>\n<p>\\\nHe was determined to have a permanent place at Northwave, where he might finally gain the independence and fulfillment he’d long chased.</p>\n<p>\\\nOver their nearly nine years together as business partners, van Hofweegen and de Bie proved there was space in the labor market for people who had been overlooked by employers and who previously thought themselves to be shut out of the workforce. </p>\n<p>\\\nSince 2014, ITvitae has graduated and placed nearly 500 students in technical jobs spanning sectors from agriculture to chip manufacturing to law enforcement. </p>\n<p>\\\nBernick called that total “striking” and said, “We don’t have any company in the United States that comes near that number, even over a 10-year period.”</p>\n<p>\\\nDe Bie’s early assessment that employers would be willing to pay a fee to hire ITvitae’s graduates proved to be right. It costs the equivalent of $30,000 to educate, coach and find employment for each student. </p>\n<p>\\\nAbout a third of that is generated from tuition while the remainder comes from the employer.</p>\n<p>\\\nAs ITvitae’s Meeuwessen points out, autism doesn’t end when students gain employment. That’s why the organization provides regular coaching to help graduates navigate changes — anything from a new manager to a schedule shift — they perceive as disruptive and unsettling. </p>\n<p>\\\n“As soon as something happens, they start to doubt. If there’s doubt, they get unstable and that’s bad,” Meeuwessen said. “Most are doing just fine after many years, but it’s a process.”</p>\n<p>\\\nFor all the success, there have been setbacks. Even with coaching, some students struggle. ITvitae occasionally hears from an employer that a former student has stopped showing up to work and hasn’t responded to messages, sometimes for weeks. </p>\n<p>\\\n“We go to their houses,” van Hofweegen said. “We knock on the door. We call the parents. And we still can’t make them understand why they need to communicate with their employers.”</p>\n<p>\\\nA few times, the problems have been far more dire than an inability to show up at work. De Bie keeps a photo on his desk of a talented software programmer who specialized in a language called C#. After his graduation, he was hired by a prestigious global corporation. </p>\n<p>\\\nHis coach regularly checked in, and, by all appearances, his first few months at the company were successful. Then came word that the student had taken his life, one of three graduates to die by suicide. </p>\n<p>\\\nEven before graduating, the programmer had obtained an illegal drug from China with the intention of overdosing. He waited to take it. He wanted to finish his education and get a job to prove that he was capable of success. </p>\n<p>\\\n“For him, that was enough,” van Hofweegen said.</p>\n<p>\\\nWhen van Ruitenbeek started at Northwave in 2018, being in an office with other people scared him. Takkenberg knew that van Ruitenbeek wouldn’t be comfortable speaking to clients or even colleagues right away and tried to smooth the transition. </p>\n<p>\\\nHe and his team organized roles that accommodated van Ruitenbeek and other ITvitae graduates “in doing the things they’re good at and not doing the stuff they really hate to do.” </p>\n<p>\\\nSo, after van Ruitenbeek rooted out the vulnerabilities in a network, another colleague would meet with the client to explain the findings. </p>\n<p>\\\nThrough a government program for people who need work accommodations, de Winter helped van Ruitenbeek borrow a car so he could avoid the stress of public transportation.</p>\n<p>\\\nVan Ruitenbeek found an accepting culture at Northwave. He began to confide in colleagues, who looked after him. As van Ruitenbeek’s trust in them grew, he started asking questions and giving more than yes and no answers. </p>\n<p>\\\nHe successfully pursued a notoriously difficult, globally recognized certification for his line of work, which Takkenberg said was a “big sign” that the intern’s abilities were exceptional. </p>\n<p>\\\nOnce the internship ended, Takkenberg gave him a permanent job sniffing out gaps in software that could make it vulnerable to being penetrated by malicious hackers. </p>\n<p>\\\n“He is one of the best pen-testers we have,” Takkenberg said. “Because of his talent to focus and stay focused, he always will find the small details.”</p>\n<p>\\\nShortly after van Ruitenbeek started in his permanent position, he and Takkenberg discussed his goals for his first year. They decided van Ruitenbeek should find a CVE, short for common vulnerabilities and exposures, security flaws in software that are formally and publicly cataloged. </p>\n<p>\\\nTakkenberg was ecstatic when, by the midyear check-in, van Ruitenbeek had uncovered six. “OK, that goal is done,” Takkenberg said. “For the rest of the year, let’s focus on your social skills.”</p>\n<p>\\\nA short time later, van Ruitenbeek attended a company golf outing. Takkenberg, who retains the rough-around-the-edges demeanor of an ex-cop, joked that van Ruitenbeek would probably excel despite never having played. </p>\n<p>\\\n“We know you read eight books in a month for fun, Thomas,” he teased. “So you probably read a book about how to golf to prepare for this.” Van Ruitenbeek was able to recognize that Takkenberg was joking, something he’s sure would have eluded him in the past. </p>\n<p>\\\nIt was a revelation.</p>\n<p>\\\nThen, during a weekend retreat with his team, van Ruitenbeek carted along some records and a record player. Music had long been a passion that allowed him to express himself when he lacked the words to do so. </p>\n<p>\\\nOne evening, he worked up the courage to play records for about 15 of his colleagues. The airy, electronic music helped everyone relax. </p>\n<p>\\\nWord of his talent spread, and the next day, he found himself DJing a barbecue for Northwave’s entire cyber unit, more than 50 people.</p>\n<p>\\\nTakkenberg decided to splurge on a DJ booth for Northwave. He dubbed van Ruitenbeek the company’s official DJ and assigned him to play music at its Friday afternoon happy hours.</p>\n<p>\\\nVan Ruitenbeek became the center of Northwave’s social gatherings.</p>\n<p>\\\nVan Ruitenbeek spinning records at the company retreat Credit: Courtesy of Pim Takkenberg</p>\n<p>When COVID-19 hit, van Ruitenbeek found himself longing for the company of colleagues. </p>\n<p>\\\n“I mostly miss the casual chats,” he said of the days that he works from home, about half his schedule these days. “That is the biggest change of my life since Northwave,” he said. “Social development. Now I am outgoing.”</p>\n<p>\\\nVan Ruitenbeek has started mentoring a new autistic employee. He also began working with Northwave’s sales team to write proposals and even meet with clients. </p>\n<p>\\\nThat’s not to say there aren’t challenges. But now, when the workload feels too heavy, or he senses he’s becoming over-stressed, van Ruitenbeek asks for help. “I used to think I had to shoulder it on my own,” he said.</p>\n<p>\\\nNow 35, van Ruitenbeek is becoming financially independent. He received a promotion and raise. He leased his own car and, in 2021, with help from his family, van Ruitenbeek purchased a one-bedroom apartment just a short walk from them. </p>\n<p>\\\nGiving a tour of his new home, he showed off the view of a pond beyond the sliding doors of his living room. He had carefully organized scores of records on shelves below his DJ equipment. </p>\n<p>\\\nTucked away in a corner, he displayed the artifacts of his period of isolation: shelves filled with the Warhammer figurines he painted as he recovered from his psychosis.</p>\n<p>\\\nIf you meet van Ruitenbeek today, you wouldn’t likely guess his history. Compact and ruddy, he makes eye contact when he speaks — in fluent English when he was interviewed for this article — and is often self-deprecating and quick to smile. </p>\n<p>\\\nHis easy banter with his father, a reliable source of support, encouragement and protection, was unimaginable in the aftermath of his psychosis a decade ago.</p>\n<p>\\\nWhen he entered the working world, van Ruitenbeek had to consciously mimic social behavior and speech that he observed in peers. </p>\n<p>\\\nOver time, though, being social gradually became second nature. He felt like a foreign language student who once had to rehearse sentences in his mind but eventually spoke the new language fluently.</p>\n<p>\\\nIn April, van Ruitenbeek attended the graduation of this year’s cybersecurity class at ITvitae’s monastery, sitting among the new graduates’ families and friends on a drizzly afternoon. </p>\n<p>\\\nAn ITvitae manager named Jessica van der Ploeg told the 11 new graduates, who were going on to jobs at global bank ING, consulting giant Deloitte and the Dutch Ministry of Defense, “The job market is waiting for you, for your talent and for who you are.”</p>\n<p>\\\nVan der Ploeg acknowledged that many incoming ITvitae students feel shut out of society because of their autism, just as van Ruitenbeek once did. </p>\n<p>\\\nAlluding to an analogy ITvitae often uses to describe the communication gap between people with autism and their neurotypical peers, she said, “It’s us Windows users who sometimes don’t know how Linux works.”</p>\n<p>\\\nVan Ruitenbeek listened intently. At various points in his life, he had been unable to express emotion. Now he had tears streaming down his face.</p>\n<hr />\n<p><em>Photo by <a href=\"https://unsplash.com/@sigmund?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Sigmund</a> on <a href=\"https://unsplash.com/s/photos/cybersecurity?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Unsplash</a></em></p>","content:encodedSnippet":"This story was originally published on ProPublica by Renee Dudley.\n\\\nThomas van Ruitenbeek’s life fell apart in 2012, when a psychotic episode and a diagnosis of autism derailed his pursuit of a digital communication degree at a university in Utrecht, the Netherlands. \n\\\nFor the better part of a year, the 25-year-old wouldn’t respond when spoken to, his father said, and his blue, wide-set eyes revealed little cognition. He rarely left his parents’ duplex and filled his time studying daily newspapers, convinced they contained secret messages. \n\\\nSometimes, he worked up the energy to paint miniature figurines from the medieval fantasy-themed board game Warhammer. Mostly, he did nothing.\n\\\nThe psychotic episode and the autism diagnosis locked him into a state of isolation that had been deepening since his childhood, solidifying his long-held belief that he was an outsider. Van Ruitenbeek’s parents took him to appointments with doctors and therapists. \n\\\nWhen he grew strong enough, they supported his return to work. He did simple tasks — mostly cutting and packaging yarn — at a job he obtained through the local mental health department. \n\\\nThat was a far cry from his earlier aspirations of being a video game designer and hardly the life his parents had hoped he would have. They worried about what would happen when they grew old and could no longer look after him.\n\\\nThen, during a meeting with his coach at the mental health department in 2013, van Ruitenbeek and his parents got an unexpected bit of hope. \n\\\nA short distance away, a first-time entrepreneur named Peter van Hofweegen and his business partner were figuring out how to launch an education and job placement program geared toward autistic young adults who were interested in computers.\n\\\nThe number of people diagnosed with autism is hard to ascertain, but the statistics that are available suggest it’s on the rise. \n\\\nAn estimated 100,000 autistic Americans turn 18 every year, according to Drexel University’s Autism Institute, and a growing number of programs in the U.S. and elsewhere aim to employ tech-savvy autistic people.\n\\\nBut van Hofweegen’s program was something different. He and his partner sought primarily to recruit socially isolated, seemingly unemployable dropouts who almost certainly would be passed over even by employers who welcome candidates with neurological differences like autism. \n\\\nThey wanted people who couldn’t make it on their own and had been “sitting for years in their parents’ homes,” van Hofweegen said. The number of students in his program would be small, but the stakes were large. \n\\\nIf they could be doing meaningful, sophisticated work, what kind of a model might that provide for the uncounted numbers of people with autism around the world seemingly sentenced to constricted, unproductive lives.\n\\\nThe untested model drew skepticism even from other autism advocates, who viewed it as well-intentioned but overly idealistic. But van Ruitenbeek’s coach, Anita de Winter, saw it as a godsend. \n\\\nShe had worked with hundreds of autistic adults who struggled to find meaningful work and become independent. De Winter described the program to van Ruitenbeek without betraying her enthusiasm. She didn’t want him to be disappointed if it didn’t work out.\n\\\n“This might be for someone like you,” she told him.\n\\\nVan Hofweegen’s path to autism advocacy traces back to 1996, when his first child was born. The boy, named Thijs, sustained an injury during birth and was diagnosed with cerebral palsy. \n\\\nDoctors told van Hofweegen and his then-wife that Thijs might never walk or talk. But with the help of specialists, he learned to both move and speak.\n\\\nThijs went far beyond that. After proclaiming a desire to learn how to swim at age 5, and taking seven years to pass his basic swimming test, Thijs persisted through intermediate and advanced levels alongside much younger classmates. \n\\\nWhen he swam the 50-meter freestyle test to pass the advanced level, he earned a standing ovation from the other students’ parents. Van Hofweegen never forgot that moment. (He continued to ponder it even as Thijs developed into a competitive swimmer and won a silver medal in the men’s 400-meter freestyle at the Paralympic Games in 2016.) \n\\\nIt showed what a person could accomplish with the right support and accommodations.\n\\\nWhile helping out at an event in 2012 for people struggling with unemployment, van Hofweegen met Frans de Bie, an IT guru and fellow volunteer. A year earlier, de Bie had sold his 40-person tech company. Like van Hofweegen, de Bie drew inspiration from his personal life. \n\\\nHe had grown up alongside foster siblings, and he understood the transformative power of a supportive environment. He also was motivated by his son and daughter, who have dyslexia.\n\\\nThe new friends hit upon an idea. Van Hofweegen had read a survey saying 20,000 Dutch people were not participating in the workforce because of their autism. Perhaps they could start an organization that would help autistic people interested in technology to find work. \n\\\nAfter more than 25 years in management roles at hotels and at a temporary-job placement agency, van Hofweegen quit his job. A short time later, in late 2013, he and de Bie incorporated an organization they called ITvitae.\n\\\nThe Dutch have a saying: “God created the earth, but the Dutch created the Netherlands.” That’s because for centuries, the country’s citizens reclaimed land from the North Sea using their iconic system of dikes, canals and windmills. \n\\\nAbout a third of the country’s fertile land is below sea level. The Netherlands, half the size of South Carolina, remains among the world’s leading economies in part because its people have maximized its geographical resources.\n\\\nAnd so it was culturally ingrained in van Hofweegen and de Bie to maximize the country’s human resources. Partly because de Bie was familiar with the unmet demand for IT jobs in the Netherlands, a gap currently estimated at 100,000, and because the country has a robust tech sector, the co-founders wanted to focus on that area.\n\\\nThe two men saw ITvitae — the name is an amalgam of “information technology” and “curriculum vitae,” which they pronounce ee-tay-vee-tay — as a way to fill tech-sector jobs and strengthen the Dutch economy as much as they considered it a social enterprise to lift up autistic people who felt excluded from the job market.\n\\\nCommon traits found in autistic people often prevent them from being hired or even applying to jobs in the first place. They may struggle to interpret social cues, pause frequently when speaking, exhibit disruptive eccentricities or avoid eye contact. \n\\\nYet employers have found that other characteristics make them excellent employees. They tend to be thorough and fastidious, have the ability to go deep on specific topics and focus for prolonged periods of time. \n\\\nThose traits lend themselves to careers in technology and cybersecurity, among many other fields.\n\\\nVan Hofweegen and de Bie envisioned a six-month course focused on preparing students to be software testers — a natural fit for autistic people, who tend to be methodical rule-followers. \n\\\nAs the students embarked on coursework, van Hofweegen would find employers by cold-calling IT and software companies as well as by tapping the connections of his board members.\n\\\nThe co-founders believed ITvitae could generate revenue primarily by charging employers a recruiting fee for each hire. \n\\\nDe Bie believed employers would be willing to pay because the amount he proposed was less than the typical cost of specialized, third-party technical training for new or existing employees.\n\\\nThe first challenge was finding students. After winding their way through various government agencies, van Hofweegen and de Bie found de Winter, who worked near where they lived. \n\\\n“Do you know these types of people?” van Hofweegen asked her in 2013 after laying out the vision for ITvitae. She replied, “How many do you want?”\n\\\nAs the co-founders prepared to interview about 30 candidates for 11 slots, de Winter explained the potential pitfalls. Autistic people tend to process language literally, she told them, and might be unable to respond to classic prompts. \n\\\nThe question “what do you hope to get from your time at ITvitae?” might elicit a blank stare. That’s because, to an autistic person, there’s no basis for what the outcomes of the new program might be. Alternatively, the list of answers could be endless and paralyzing. \n\\\nThey needed something concrete and technical to discuss. So de Bie concocted a simple tool that would serve as a discussion topic and gauge applicants’ computer interest: He asked the candidates to draw maps of their home computer networks and be prepared to describe them.\n\\\nVan Hofweegen and de Bie were full of enthusiasm. But, as they continued to talk with de Winter, they realized how much they still had to learn about the very people they wanted to help. They were, perhaps, in over their heads.\n\\\nFor as long as he could remember, van Ruitenbeek knew he was different but felt that he couldn’t let other people know that. It was as if he were “living undercover,” he said. He was constantly afraid that asking the wrong question would cause him to be bullied, so he never asked questions.\n\\\nWhile his twin sister played with other children, he withdrew to solitary activities, learning to design his own websites on topics ranging from outer space to dinosaurs. But his life took a darker turn after his psychotic episode in Utrecht.\n\\\nVan Ruitenbeek had planned to spend the summer day catching up on coursework when suddenly he began to feel that he was outside his own body. \n\\\nHis vision narrowed and his mind compelled him to follow what he believed were secret hand signals made by strangers, which eventually directed him to a bar to order a draft Heineken. He then lurched outside the bar in a stupor. \n\\\nVan Ruitenbeek rambled in halting, slurred speech when his sister and father reached him by phone. Frantic with worry, Henk van Ruitenbeek drove through Utrecht and eventually found his son standing on a sidewalk, staring vacantly. He got him in the car and took him home.\n\\\nIn the aftermath, with a new diagnosis of autism, van Ruitenbeek believed his life was over. He had thought it was not rational or even possible to set goals for himself. Then de Winter mentioned ITvitae, and he knew he badly wanted a slot there. \n\\\nThe ITvitae interview, he later said, was “like a ticket out of my situation.” More nervous than he had ever been, he told himself: “I have to make it. I have to do my best.”\n\\\nThe interview, which took place in late 2013, was difficult for everyone. Although van Hofweegen and de Bie were pleasant and upbeat, van Ruitenbeek felt he was in “hostile territory.” \n\\\nThen again, everything beyond his parents’ home seemed that way at the time. \n\\\nHe stuttered severely when describing his recovery from psychosis, and it took him an uncomfortably long time to utter a single sentence. He was visibly perspiring. “This isn’t working,” de Bie thought.\n\\\nWhen de Bie pivoted to the network drawing and other technical questions, the interview shifted. Van Ruitenbeek stuttered less. De Bie, impressed by his remarks about website design, decided before the interview ended that van Ruitenbeek should have a space at ITvitae.\n\\\nDe Bie thought it was obvious that van Ruitenbeek — and most of the other candidates — had raw computer talent. Van Hofweegen welled with tears. “What are these wonderful people doing at home?” he wondered.\n\\\nAdvocates for people with autism in the United States often ask the same question. \n\\\nParents of autistic teenagers describe the “cliff” of high school or college graduation, marked by the struggle to navigate the transition from years of special education and support to independent working life. \n\\\nFirm data is hard to come by, but some estimates suggest millions of autistic American adults are unemployed or underemployed. Of those who find work, most are in low-wage and part-time jobs, according to Drexel’s Autism Institute.\n\\\nAt the same time, demand for workers with technical skills has far outpaced supply. In the cybersecurity field alone, the U.S. faces a shortfall of more than 225,000 workers, according to CyberSeek, an organization that provides job market data. \n\\\nThe number of available tech-related jobs in the U.S. nearly doubled from 2020 to 2021, analytics company Datapeople reported.\n\\\nOver the past decade, a variety of opportunities for autistic adults in the U.S. — ranging from technical training and job placement programs in various cities, to targeted hiring and retention efforts at large employers — have aimed to bridge the tech workforce gap. \n\\\nBut the results so far have been modest, said Michael Bernick, a San Francisco-based attorney who has written two books on employment strategies for the neurodiverse.\n\\\nThat’s partly because many initiatives expect job candidates to have higher education, credentials and the ability to work with minimal support, said Bernick, who was director of the California labor department from 1999 to 2004. “\n\\\nThey are looking for people who have significant tech skills,” he said. “Of that group, not all are college graduates, but they’re also not the long-term unemployed, sitting in their parents’ basements.” \n\\\nSomeone like van Ruitenbeek wouldn’t have stood a chance.\n\\\nOne widely publicized initiative is the Neurodiversity @ Work Employer Roundtable, a collection of about four dozen private employers — including Microsoft, SAP, Google and more — that foster neurodiversity hiring programs. \n\\\nParticipating companies offer screening and interview processes to accommodate autistic candidates; about 1,200 neurodiverse candidates have gotten jobs with Roundtable employers over the past decade, said Neil Barnett of Microsoft, a leader of the group. \n\\\nBarnett, who has discussed the initiative with Bernick, hopes that Roundtable employers will continue to expand their hiring of neurodiverse candidates with a variety of skills, including outside of tech.\n\\\nAutistic adults who are interested in computers represent just a sliver of autistic job seekers, according to the national advocacy organization Autism Speaks; Bernick puts the figure around 10% to 15%. \n\\\nDue in part to prominent figures such as Elon Musk, who has said he has Asperger’s syndrome, which is now considered a type of autism spectrum disorder, and pop culture caricatures of socially awkward workers in Silicon Valley, the notion that autistic people inherently possess extraordinary tech competencies has become a cliché. \n\\\nBernick said he once had hopes of a tech career for his own autistic son. But his son had neither uncommon skills nor a deep interest in computers.\n\\\nWhile the 10% to 15% estimated by Bernick may seem like a small slice relative to popular perception, efforts to employ that group are nonetheless important, especially given the dramatic need in the tech sector, advocates and researchers said. \n\\\nBernick said programs in the U.S. should expand their efforts to find autistic job seekers who have computer capabilities but lack the credentials — precisely the types of people van Hofweegen and de Bie recruited for their inaugural class.\n\\\nIn February 2014, after a six-month stint cutting yarn, van Ruitenbeek rode his bicycle to ITvitae’s space for the first day of class. He was nervous. In social settings, he always felt as though he were “from another planet,” he said. \n\\\nHere, though, he was surrounded by people who felt the same way.\n\\\nShortly after their arrival, de Bie assigned the students to assemble the furniture they would be using. When he returned several hours later, he found they had put it together flawlessly. \n\\\nHe asked how everyone was getting along and discovered that none of the students had bothered with introductions. De Bie was surprised and amused; he was still learning how autistic people function.\n\\\nVan Hofweegen and de Bie, who refused to use the word “disability,” told the students they had “different operating systems” than the neurotypical people they grew up with. \n\\\nIt helped to reassure them that they belonged in the classroom, and eventually the workplace, as they all began to “learn how to learn again” following what for some was years away from school, van Hofweegen said. \n\\\nDe Bie eased the students into a school setting by leading a training on basic Microsoft programming, networking and security. That was followed by a 40-day course on software testing offered by an organization that issues certifications for technical specialties in the Netherlands.\n\\\nAfter only a short time, van Ruitenbeek said he began to feel “at home for the first time in my life.” He enjoyed his coursework and excelled at it. He gradually began interacting with other students as he felt more at ease and less afraid of making social mistakes. \n\\\nWhen he grumbled about commuting by bike, a classmate offered to drive him to and from ITvitae. Van Ruitenbeek gladly accepted.\n\\\nYet, for all his progress, van Ruitenbeek continued to face obstacles. Conversation remained difficult due to his stutter, and he lacked the energy to work the 32-hour week that most employers expected of ITvitae’s graduates. \n\\\nSometimes his father worried it was all too much for him. He was one of three students for whom van Hofweegen struggled to find a job.\n\\\nWhen the coursework drew to a close, the students took a formal exam to be certified in software testing. Van Ruitenbeek breezed through the questions, except for one that confounded him: None of the multiple choice answers were technically correct. \n\\\nSo he selected the answer that he suspected the test-maker wanted. He picked correctly and scored 100%. “It was my first achievement,” van Ruitenbeek said. “I could do something.”\n\\\nA short time later, a director from the testing company visited ITvitae and van Hofweegen told him that a student had spotted a mistake in the exam. Van Hofweegen, who has an uncanny ability to sense an opportunity and pounce, suggested that van Ruitenbeek could be a test reviewer. \n\\\nThe company invited him to join a small group of volunteers who look over exams for accuracy and clarity. Van Ruitenbeek readily agreed. To prepare, he plowed through a textbook on ethical hacking.\n\\\nThe work led him to his next self-discovery: Ethical hacking was fun. Once unable to set goals for the future, van Ruitenbeek now dreamed of a career in cybersecurity. He would hunt for hidden vulnerabilities in software and networks, and prevent them from falling prey to malicious hackers.\n\\\nFollowing the success of their first class, van Hofweegen and de Bie recruited another class, then another, each with a maximum of 14 students. \n\\\nAfter the first year, with steady revenue generated mainly from fees paid by employers, the co-founders began taking salaries, and they hired additional staff. ITvitae’s mission spread to autistic job seekers and their supporters across the Netherlands.\n\\\nAs the organization grew, van Hofweegen and de Bie relocated ITvitae to a floor in a former monastery, which had been converted into offices. The founders thought its tree-shaded walking paths and seclusion would impart a serenity that the students needed. \n\\\nThe organization also began offering new courses in software development, data science and cybersecurity, all specialties in high demand. \n\\\nStudents delighted in being able to focus exclusively on topics that fascinated them, a luxury — for many of the students, a necessity — that traditional educational settings couldn’t provide.\n\\\nCertain similarities emerged among ITvitae’s students. Before joining, nearly half had been sitting at home, unemployed and socially isolated, for longer than two years. Many passed the time playing video games and lost track of whether it was day or night. \n\\\nThey told van Hofweegen and de Bie they felt worthless and never fit in; many reported having been bullied and struggling through periods of depression.\n\\\nITvitae turned away about two-thirds of applicants, most frequently because of untreated mental health issues. Other candidates simply weren’t ready. One 2022 applicant said he hadn’t left his home for 10 years and spent most of his time gaming. \n\\\n“It was such a big thing for him to be here” for the interview, de Bie said. “But then traveling regularly, studying in a group, doing exams — that would have been too heavy for him. I had to tell him it’s not the right time.”\n\\\nMale students at ITvitae outnumber female students 10 to 1, both because autism is more prevalent in men and more likely to go undiagnosed or misdiagnosed in women. Many experience sensory challenges, such as headaches if the light is too bright or if there’s too much noise. \n\\\nOne student was distracted by the sound of blinking eyelashes. Most struggle to varying degrees with communication.\n\\\nTo help both prospective employers and job candidates work through the inevitable miscommunications, ITvitae staff members accompanied students to job interviews. \n\\\nSaskia Meeuwessen, who was hired as the CEO of ITvitae as it expanded, recalled joining a student at an interview for a cybersecurity job with the Dutch National Police. \n\\\nThe interviewer asked the candidate to introduce himself. The student froze: It wasn’t a question he had practiced. Nonetheless, he was later invited for a second meeting with an interviewer who was more experienced in interacting with autistic people.\n\\\nThat interviewer sat down and, with no social niceties, asked, “When I type www.google.nl, what happens?” Meeuwessen thought to herself, “Well, Google shows up, what a silly question.” \n\\\nBut the candidate had a completely different reaction, launching into nuanced details about internet servers and connections. For 90 minutes, Meeuwessen “sat there, listening to stuff that I really didn’t understand,” she said. The candidate was hired on the spot.\n\\\nThanks in part to its gradually sloped coastline, the Netherlands is a popular landing spot for the underwater fiber optic cables connecting the United States and Europe. Fast, reliable and inexpensive internet connectivity has fostered a flourishing tech sector. \n\\\nBut that connectivity has negative consequences, too. Hackers who can’t rely on the fragile internet connections in their home countries use servers in the Netherlands to commit crimes.\n\\\nTo counter these hackers, the Dutch National Police established an elite force called the High Tech Crime Unit, or HTCU. \n\\\nThe unit has become renowned both for its success disrupting the operations of cyberattackers and for its innovative culture, which for years has included hiring unconventional candidates, including those with autism.\n\\\nIn 2017, at van Hofweegen’s urging, the HTCU brought on a graduate from ITvitae. He proved to be an open-source intelligence wizard. Another graduate followed. \n\\\nThen the floodgates opened, and about 30 ITvitae graduates were eventually hired to jobs in regional police squads, where they handle data analysis, digital forensics and other technical specialties.\n\\\nThe National Police’s embrace of a neurodiverse workforce extended beyond its partnership with ITvitae. Its most renowned hiring initiative for autistic employees began with a 2016 murder case.\n\\\nA 50-year-old Turkish man had been shot more than 30 times in the Dutch city of Leiden and died two days later. The National Police collected surveillance camera footage and quickly identified the suspects. \n\\\nTheir work also seemed to link the murder to a number of cold cases in Amsterdam. The National Police took over those investigations, inheriting 1,700 hours of camera footage. Watching the tapes was a marathon of drudgery that none of the National Police detectives wanted to take on.\n\\\nOne National Police detective, Jory de Groot, happened upon an idea. De Groot, who has a foster brother with Down syndrome, volunteered with a group that organized trips for young adults with disabilities. On a weekend shortly after the murder, she led a group of people with autism. \n\\\nDe Groot, then 26, described her job to one participant on the trip and mentioned the painstaking work of watching security footage. Some autistic people excel at recognizing small details, the woman told de Groot. They might love the very task that neurotypical detectives loathe.\n\\\nDe Groot then contracted four people from AutiTalent, a Dutch job placement organization for autistic people. She prepared her colleagues, advising them against asking typical get-to-know-you questions, and set up a radio-free office in a quiet corner of their building.\n\\\nWhen the autistic contractors arrived, the National Police detectives tested their abilities by having them watch the footage collected in the Leiden murder. \n\\\nThe detectives had already watched the tapes, which included the days leading up to the shooting, and knew precisely when the suspects would be seen on the day of the shooting.\n\\\nBefore long, one of the contractors spotted a suspect on the tape — but not when the detectives expected. The contractor found the suspect casing the crime scene the day before the attack. \n\\\nThe detectives had missed it. “It was really important evidence that we overlooked,” de Groot said. \n\\\nEventually, the two suspects were convicted in the Leiden murder.\n\\\nAs word of the feat reverberated through the National Police, requests for more AutiTalent contractors flooded in. Eventually, 50 autistic people were working as “camera footage specialists,” a newly created role, across the National Police.\n\\\n De Groot’s original team grew to six people, who increasingly talked with one another and with their police colleagues as they became more comfortable. \n\\\nThe contractors joined detectives from the start of investigations, rather than stepping in after they were already in progress, and took part in briefings. Additional contractors from AutiTalent became “audio specialists,” who transcribed interrogations and wiretaps.\n\\\nThe high profile of the contractors led some members of the National Police force to speak out about their own autism, which they’d previously hidden. \n\\\nThe outpouring prompted de Groot to work with those employees and an advocacy organization to establish an “Autism Embassy” at the National Police. \n\\\nNow about a dozen workplace “ambassadors” — employees with autism who volunteer for the role — offer an ear and advice to both autistic colleagues and their managers.\n\\\nThe National Police’s embrace of autistic contractors has been partially driven by government-proposed targets, accompanied by subsidies, for industry and government to hire 125,000 people who have difficulty finding work because of a disability. \n\\\nThat sort of government-centric approach is unlikely to occur in the U.S. Still, law enforcement agencies in the U.S. could draw lessons from the Dutch experiment, said Michael Bernick, the attorney who has focused on employment strategies for autistic people.\n\\\nAmid ITvitae’s successes, van Ruitenbeek was still floundering. He had enjoyed his time as a volunteer test reviewer in 2014, but it didn’t lead to a job. A subsequent internship with a computer security consultancy also didn’t land him permanent employment. \n\\\nYet another internship, with an organization that maintained supercomputers, failed when he experienced a psychotic episode in late 2016.\n\\\nIt happened when van Ruitenbeek was commuting to the company’s Amsterdam office by train. He knew public transportation was a stressor for him, but he thought he could push through it. He couldn’t. That day, he believed everyone on the train was talking about him. \n\\\nHe didn’t fully lose control, as he had in Utrecht. Still, he realized he couldn’t continue to commute and work normally with the organization any longer. He quit.\n\\\nIt had been more than two years since his ITvitae graduation, and van Ruitenbeek was again feeling hopeless. He mostly stayed at his parents’ home, where he tinkered with developing his own video game. \n\\\nHe sometimes rode his bike to ITvitae’s offices — “just as a place to go,” he said — where he read books on cybersecurity and tried to ground himself.\n\\\nVan Ruitenbeek happened to be at ITvitae one day in late 2017 when Pim Takkenberg, then a director at the Dutch cybersecurity firm Northwave and a former leader of the National Police’s High Tech Crime Unit, was there. \n\\\nEarlier that year, Takkenberg had overseen the development of a training program for ITvitae’s cybersecurity students. \n\\\nDuring the visit, van Hofweegen, ever scouting, made a request: “Pim, I have a person here, who is extremely vulnerable but extremely brilliant. I want you to talk to him.”\n\\\nAfter a brief chat, Takkenberg agreed to give van Ruitenbeek a “hack test” to assess his aptitude for penetration testing. The prospect alone was enough to help van Ruitenbeek regain some hope. \n\\\nA few months later, on exam day, Takkenberg instructed him to find vulnerabilities in a piece of software, which hackers could exploit to attack the hypothetical client. Takkenberg jokingly warned him not to cheat. \n\\\nVan Ruitenbeek took him literally, assuming he meant not to research anything on the internet. In reality, using the internet would have been allowed, even expected.\n\\\nVan Ruitenbeek found the main vulnerabilities. Takkenberg was impressed but remained skeptical. Van Ruitenbeek still had trouble with conversation, and he was able to work only three days a week. \n\\\nAddressing the doubts, van Hofweegen said: “You want a problem solved. He communicates better with computers than with people. In a technical world, it’s not so bad.”\n\\\nTakkenberg offered him a trial six-month internship. But he needed someone who could work 40 hours a week. They found a compromise. Van Ruitenbeek would start with three days a week, then gradually increase to five days. \n\\\nNorthwave also allowed van Ruitenbeek to work from home occasionally, a major concession before the pandemic. He went on a special diet and began exercising to improve his health and boost his energy. \n\\\nHe was determined to have a permanent place at Northwave, where he might finally gain the independence and fulfillment he’d long chased.\n\\\nOver their nearly nine years together as business partners, van Hofweegen and de Bie proved there was space in the labor market for people who had been overlooked by employers and who previously thought themselves to be shut out of the workforce. \n\\\nSince 2014, ITvitae has graduated and placed nearly 500 students in technical jobs spanning sectors from agriculture to chip manufacturing to law enforcement. \n\\\nBernick called that total “striking” and said, “We don’t have any company in the United States that comes near that number, even over a 10-year period.”\n\\\nDe Bie’s early assessment that employers would be willing to pay a fee to hire ITvitae’s graduates proved to be right. It costs the equivalent of $30,000 to educate, coach and find employment for each student. \n\\\nAbout a third of that is generated from tuition while the remainder comes from the employer.\n\\\nAs ITvitae’s Meeuwessen points out, autism doesn’t end when students gain employment. That’s why the organization provides regular coaching to help graduates navigate changes — anything from a new manager to a schedule shift — they perceive as disruptive and unsettling. \n\\\n“As soon as something happens, they start to doubt. If there’s doubt, they get unstable and that’s bad,” Meeuwessen said. “Most are doing just fine after many years, but it’s a process.”\n\\\nFor all the success, there have been setbacks. Even with coaching, some students struggle. ITvitae occasionally hears from an employer that a former student has stopped showing up to work and hasn’t responded to messages, sometimes for weeks. \n\\\n“We go to their houses,” van Hofweegen said. “We knock on the door. We call the parents. And we still can’t make them understand why they need to communicate with their employers.”\n\\\nA few times, the problems have been far more dire than an inability to show up at work. De Bie keeps a photo on his desk of a talented software programmer who specialized in a language called C#. After his graduation, he was hired by a prestigious global corporation. \n\\\nHis coach regularly checked in, and, by all appearances, his first few months at the company were successful. Then came word that the student had taken his life, one of three graduates to die by suicide. \n\\\nEven before graduating, the programmer had obtained an illegal drug from China with the intention of overdosing. He waited to take it. He wanted to finish his education and get a job to prove that he was capable of success. \n\\\n“For him, that was enough,” van Hofweegen said.\n\\\nWhen van Ruitenbeek started at Northwave in 2018, being in an office with other people scared him. Takkenberg knew that van Ruitenbeek wouldn’t be comfortable speaking to clients or even colleagues right away and tried to smooth the transition. \n\\\nHe and his team organized roles that accommodated van Ruitenbeek and other ITvitae graduates “in doing the things they’re good at and not doing the stuff they really hate to do.” \n\\\nSo, after van Ruitenbeek rooted out the vulnerabilities in a network, another colleague would meet with the client to explain the findings. \n\\\nThrough a government program for people who need work accommodations, de Winter helped van Ruitenbeek borrow a car so he could avoid the stress of public transportation.\n\\\nVan Ruitenbeek found an accepting culture at Northwave. He began to confide in colleagues, who looked after him. As van Ruitenbeek’s trust in them grew, he started asking questions and giving more than yes and no answers. \n\\\nHe successfully pursued a notoriously difficult, globally recognized certification for his line of work, which Takkenberg said was a “big sign” that the intern’s abilities were exceptional. \n\\\nOnce the internship ended, Takkenberg gave him a permanent job sniffing out gaps in software that could make it vulnerable to being penetrated by malicious hackers. \n\\\n“He is one of the best pen-testers we have,” Takkenberg said. “Because of his talent to focus and stay focused, he always will find the small details.”\n\\\nShortly after van Ruitenbeek started in his permanent position, he and Takkenberg discussed his goals for his first year. They decided van Ruitenbeek should find a CVE, short for common vulnerabilities and exposures, security flaws in software that are formally and publicly cataloged. \n\\\nTakkenberg was ecstatic when, by the midyear check-in, van Ruitenbeek had uncovered six. “OK, that goal is done,” Takkenberg said. “For the rest of the year, let’s focus on your social skills.”\n\\\nA short time later, van Ruitenbeek attended a company golf outing. Takkenberg, who retains the rough-around-the-edges demeanor of an ex-cop, joked that van Ruitenbeek would probably excel despite never having played. \n\\\n“We know you read eight books in a month for fun, Thomas,” he teased. “So you probably read a book about how to golf to prepare for this.” Van Ruitenbeek was able to recognize that Takkenberg was joking, something he’s sure would have eluded him in the past. \n\\\nIt was a revelation.\n\\\nThen, during a weekend retreat with his team, van Ruitenbeek carted along some records and a record player. Music had long been a passion that allowed him to express himself when he lacked the words to do so. \n\\\nOne evening, he worked up the courage to play records for about 15 of his colleagues. The airy, electronic music helped everyone relax. \n\\\nWord of his talent spread, and the next day, he found himself DJing a barbecue for Northwave’s entire cyber unit, more than 50 people.\n\\\nTakkenberg decided to splurge on a DJ booth for Northwave. He dubbed van Ruitenbeek the company’s official DJ and assigned him to play music at its Friday afternoon happy hours.\n\\\nVan Ruitenbeek became the center of Northwave’s social gatherings.\n\\\nVan Ruitenbeek spinning records at the company retreat Credit: Courtesy of Pim Takkenberg\nWhen COVID-19 hit, van Ruitenbeek found himself longing for the company of colleagues. \n\\\n“I mostly miss the casual chats,” he said of the days that he works from home, about half his schedule these days. “That is the biggest change of my life since Northwave,” he said. “Social development. Now I am outgoing.”\n\\\nVan Ruitenbeek has started mentoring a new autistic employee. He also began working with Northwave’s sales team to write proposals and even meet with clients. \n\\\nThat’s not to say there aren’t challenges. But now, when the workload feels too heavy, or he senses he’s becoming over-stressed, van Ruitenbeek asks for help. “I used to think I had to shoulder it on my own,” he said.\n\\\nNow 35, van Ruitenbeek is becoming financially independent. He received a promotion and raise. He leased his own car and, in 2021, with help from his family, van Ruitenbeek purchased a one-bedroom apartment just a short walk from them. \n\\\nGiving a tour of his new home, he showed off the view of a pond beyond the sliding doors of his living room. He had carefully organized scores of records on shelves below his DJ equipment. \n\\\nTucked away in a corner, he displayed the artifacts of his period of isolation: shelves filled with the Warhammer figurines he painted as he recovered from his psychosis.\n\\\nIf you meet van Ruitenbeek today, you wouldn’t likely guess his history. Compact and ruddy, he makes eye contact when he speaks — in fluent English when he was interviewed for this article — and is often self-deprecating and quick to smile. \n\\\nHis easy banter with his father, a reliable source of support, encouragement and protection, was unimaginable in the aftermath of his psychosis a decade ago.\n\\\nWhen he entered the working world, van Ruitenbeek had to consciously mimic social behavior and speech that he observed in peers. \n\\\nOver time, though, being social gradually became second nature. He felt like a foreign language student who once had to rehearse sentences in his mind but eventually spoke the new language fluently.\n\\\nIn April, van Ruitenbeek attended the graduation of this year’s cybersecurity class at ITvitae’s monastery, sitting among the new graduates’ families and friends on a drizzly afternoon. \n\\\nAn ITvitae manager named Jessica van der Ploeg told the 11 new graduates, who were going on to jobs at global bank ING, consulting giant Deloitte and the Dutch Ministry of Defense, “The job market is waiting for you, for your talent and for who you are.”\n\\\nVan der Ploeg acknowledged that many incoming ITvitae students feel shut out of society because of their autism, just as van Ruitenbeek once did. \n\\\nAlluding to an analogy ITvitae often uses to describe the communication gap between people with autism and their neurotypical peers, she said, “It’s us Windows users who sometimes don’t know how Linux works.”\n\\\nVan Ruitenbeek listened intently. At various points in his life, he had been unable to express emotion. Now he had tears streaming down his face.\nPhoto by Sigmund on Unsplash","dc:creator":"Pro Publica","content":"An estimated 100,000 autistic Americans turn 18 every year, according to Drexel University’s Autism Institute. Thomas van Ruitenbeek, 25, from Utrecht, the Netherlands, was diagnosed with autism in 2012. He had a psychotic episode and a diagnosis of autism derailed his pursuit of a digital communication degree. He did simple tasks — mostly cutting and packaging yarn — at a job he obtained through the local mental health department. After learning to swim at age 5, he learned to both move and speak, he went beyond that to learn how to.","contentSnippet":"An estimated 100,000 autistic Americans turn 18 every year, according to Drexel University’s Autism Institute. Thomas van Ruitenbeek, 25, from Utrecht, the Netherlands, was diagnosed with autism in 2012. He had a psychotic episode and a diagnosis of autism derailed his pursuit of a digital communication degree. He did simple tasks — mostly cutting and packaging yarn — at a job he obtained through the local mental health department. After learning to swim at age 5, he learned to both move and speak, he went beyond that to learn how to.","guid":"https://hackernoon.com/this-job-training-program-is-helping-people-with-autism-fight-cybercrime?source=rss","categories":["autism","cybersecurity","jobs","mental-health","propublica","cyber-security","cybersecurity-jobs","tech-jobs"],"isoDate":"2022-12-15T01:26:29.000Z","from":"https://hackernoon.com/feed","hashId":"2fc5baaa1794f6bf97341cf2fb835b51"},{"creator":"Dmitry Mishunin","title":"Dmitry Mishunin: Building the Standard of DeFi Security ","link":"https://hackernoon.com/dmitry-mishunin-building-the-standard-of-defi-security?source=rss","pubDate":"Thu, 15 Dec 2022 01:37:41 GMT","content:encoded":"<h2 id=\"soletsstarttellusabitaboutyourselfforexamplenameprofessionandpersonalinterests\">So let’s start! Tell us a bit about yourself. For example, name, profession, and personal interests.</h2>\n<p><strong>I am Dmitry Mishunin, and for the last 5 years, I’ve been the CEO of HashEx – a tier-1 security and intelligence operation for DeFi. The company performs audits, creates tools for the decentralized market, and popularizes the idea that crypto has to be safe.</strong></p>\n<p>\\\nThe Crypto world, as well as IT and technology, have been my interests for many years now – it was exciting to watch this grow from an idea into a huge system that could rival classical banking. </p>\n<p>\\\nAside from that, I provide comments to IT media, attend events as a speaker, and enjoy recreational sports. </p>\n<h2 id=\"interestingwhatwasyourlatesthackernoontopstoryabout\">Interesting! What was your latest Hackernoon Top story about?</h2>\n<p>It was a research conducted by the fantastic HashEx team called \"<strong><a href=\"https://hackernoon.com/how-ethereum-staking-is-creating-a-$10-billion-ponzi-scheme\">How Ethereum Staking is Creating a $10 Billion Ponzi Scheme</a></strong>\". It’s an in-depth take on one of the largest Ponzi schemes in history, that utilizes the new Ethereum staking. </p>\n<p>\\\nI really do recommend this article and not just for views.</p>\n<h2 id=\"doyouusuallywriteonsimilartopicsifnotwhatdoyouusuallywriteabout\">Do you usually write on similar topics? If not, what do you usually write about?</h2>\n<p>Working in security with HashEx, I have to follow all the updates and biggest security breaches, so naturally, this is the topic I want to discuss the most. </p>\n<p>\\\nIn HashEx, we usually publish these articles on our website and blogs, and it’s always good to get the information out there and make it a discussion topic. This is how we make security an issue that doesn’t only pose questions but provides answers.</p>\n<h2 id=\"greatwhatisyourusualwritingroutinelikeifyouhaveone\">Great! What is your usual writing routine like (if you have one?)</h2>\n<p>It’s way more mundane than it sounds. Usually, the process starts with several days or weeks of research and gathering data, sometimes just watching the market. Then there’s your story. </p>\n<p>\\\nSometimes ideas come in a conversation or just from reading news or contemplating issues. When it comes to imagining possible future developments, this is pretty much the way to go.</p>\n<h2 id=\"beingawriterintechcanbeachallengeitsnotoftenourmainrolebutanadditiontoanotheronewhatisthebiggestchallengeyouhavewhenitcomestowriting\">Being a writer in tech can be a challenge. It’s not often our main role, but an addition to another one. What is the biggest challenge you have when it comes to writing?</h2>\n<p>The hardest thing is to sit down and deliver the material in a digestible way so that readers don’t stumble upon complicated terms and understand the point of the text. </p>\n<p>\\\nAnd it’s not always easy to spread the thoughts over several pages. You get an idea, boil it down and end up with two sentences that pretty much reflect the point.</p>\n<h2 id=\"whatisthenextthingyouhopetoachieveinyourcareer\">What is the next thing you hope to achieve in your career?</h2>\n<p>My goal is to establish HashEx as the number 1 DeFiSecurity and Intelligence company – make it the standard of DeFi security. Our mission is to bring back trust in blockchain, especially for regular users. </p>\n<p>\\\nThe technology provides massive possibilities but gets incredibly bad rep because of scammers. I want to change that.</p>\n<h2 id=\"wowthatsadmirablenowsomethingmorecasualwhatisyourguiltypleasureofchoice\">Wow, that’s admirable. Now, something more casual: What is your guilty pleasure of choice?</h2>\n<p>Vegging, either on a couch or somewhere warm with a hookah. Sleeping in as well, but that’s something everyone can probably relate to.</p>\n<h2 id=\"doyouhaveanontechrelatedhobbyifyeswhatisit\">Do you have a non-tech-related hobby? If yes, what is it?</h2>\n<p>I do, a few actually: track racing, jogging, snowboarding, kite surfing, and cross-stitching.</p>\n<h2 id=\"whatcanthehackernooncommunityexpecttoreadfromyounext\">What can the Hacker Noon community expect to read from you next?</h2>\n<p>I want my next article to be about how to become a smart contracts auditor. It’s not as impossible as it seems! And of course, we continue to research blockchain vulnerabilities. So, pretty soon you can expect a new article about DeFi Security.</p>\n<h2 id=\"whatsyouropiniononhackernoonasaplatformforwriters\">What’s your opinion on HackerNoon as a platform for writers?</h2>\n<p>One of the best things about Hackernoon is that it’s unlike tabloid-style investigations about literally everything. You collect opinions and ideas from thinking people. It’s important to have a source of well-researched information, and users value this. </p>\n<p>\\\nIt’s amazing that HackerNoon has built this community and you don’t need to wander online looking for information and the latest updates.</p>\n<h2 id=\"thanksfortakingtimetojoinourmeetthewriterhttpshackernooncomtaggedmeetthewriterseriesitwasapleasuredoyouhaveanyclosingwords\">Thanks for taking time to join our “<a href=\"https://hackernoon.com/tagged/meet-the-writer\">Meet the writer</a>” series. It was a pleasure. Do you have any closing words?</h2>\n<p>\\\nThank you for having me! And I’m very grateful to be nominated as a HackerNoon Contributor of the Year on the subject of \"Information Security”. </p>","content:encodedSnippet":"So let’s start! Tell us a bit about yourself. For example, name, profession, and personal interests.\nI am Dmitry Mishunin, and for the last 5 years, I’ve been the CEO of HashEx – a tier-1 security and intelligence operation for DeFi. The company performs audits, creates tools for the decentralized market, and popularizes the idea that crypto has to be safe.\n\\\nThe Crypto world, as well as IT and technology, have been my interests for many years now – it was exciting to watch this grow from an idea into a huge system that could rival classical banking. \n\\\nAside from that, I provide comments to IT media, attend events as a speaker, and enjoy recreational sports. \nInteresting! What was your latest Hackernoon Top story about?\nIt was a research conducted by the fantastic HashEx team called \"How Ethereum Staking is Creating a $10 Billion Ponzi Scheme\". It’s an in-depth take on one of the largest Ponzi schemes in history, that utilizes the new Ethereum staking. \n\\\nI really do recommend this article and not just for views.\nDo you usually write on similar topics? If not, what do you usually write about?\nWorking in security with HashEx, I have to follow all the updates and biggest security breaches, so naturally, this is the topic I want to discuss the most. \n\\\nIn HashEx, we usually publish these articles on our website and blogs, and it’s always good to get the information out there and make it a discussion topic. This is how we make security an issue that doesn’t only pose questions but provides answers.\nGreat! What is your usual writing routine like (if you have one?)\nIt’s way more mundane than it sounds. Usually, the process starts with several days or weeks of research and gathering data, sometimes just watching the market. Then there’s your story. \n\\\nSometimes ideas come in a conversation or just from reading news or contemplating issues. When it comes to imagining possible future developments, this is pretty much the way to go.\nBeing a writer in tech can be a challenge. It’s not often our main role, but an addition to another one. What is the biggest challenge you have when it comes to writing?\nThe hardest thing is to sit down and deliver the material in a digestible way so that readers don’t stumble upon complicated terms and understand the point of the text. \n\\\nAnd it’s not always easy to spread the thoughts over several pages. You get an idea, boil it down and end up with two sentences that pretty much reflect the point.\nWhat is the next thing you hope to achieve in your career?\nMy goal is to establish HashEx as the number 1 DeFiSecurity and Intelligence company – make it the standard of DeFi security. Our mission is to bring back trust in blockchain, especially for regular users. \n\\\nThe technology provides massive possibilities but gets incredibly bad rep because of scammers. I want to change that.\nWow, that’s admirable. Now, something more casual: What is your guilty pleasure of choice?\nVegging, either on a couch or somewhere warm with a hookah. Sleeping in as well, but that’s something everyone can probably relate to.\nDo you have a non-tech-related hobby? If yes, what is it?\nI do, a few actually: track racing, jogging, snowboarding, kite surfing, and cross-stitching.\nWhat can the Hacker Noon community expect to read from you next?\nI want my next article to be about how to become a smart contracts auditor. It’s not as impossible as it seems! And of course, we continue to research blockchain vulnerabilities. So, pretty soon you can expect a new article about DeFi Security.\nWhat’s your opinion on HackerNoon as a platform for writers?\nOne of the best things about Hackernoon is that it’s unlike tabloid-style investigations about literally everything. You collect opinions and ideas from thinking people. It’s important to have a source of well-researched information, and users value this. \n\\\nIt’s amazing that HackerNoon has built this community and you don’t need to wander online looking for information and the latest updates.\nThanks for taking time to join our “Meet the writer” series. It was a pleasure. Do you have any closing words?\n\\\nThank you for having me! And I’m very grateful to be nominated as a HackerNoon Contributor of the Year on the subject of \"Information Security”.","dc:creator":"Dmitry Mishunin","content":"I am Dmitry Mishunin, and for the last 5 years, I’ve been the CEO of HashEx – a tier-1 security and intelligence operation for DeFi. The company performs audits, creates tools for the decentralized market, and popularizes the idea that crypto has to be safe.","contentSnippet":"I am Dmitry Mishunin, and for the last 5 years, I’ve been the CEO of HashEx – a tier-1 security and intelligence operation for DeFi. The company performs audits, creates tools for the decentralized market, and popularizes the idea that crypto has to be safe.","guid":"https://hackernoon.com/dmitry-mishunin-building-the-standard-of-defi-security?source=rss","categories":["meet-the-writer","hackernoon-writers","writers","ceo-insights","ceo","tech-ceo-interviews","defi","defi-security"],"isoDate":"2022-12-15T01:37:41.000Z","from":"https://hackernoon.com/feed","hashId":"987d4fd79162b294b7371726e3466acb"},{"creator":"Stylianos Kampakis","title":"Ai Adoption: What You Need to Know About Anomaly Detection and Unsupervised Learning","link":"https://hackernoon.com/ai-adoption-what-you-need-to-know-about-anomaly-detection-and-unsupervised-learning?source=rss","pubDate":"Thu, 15 Dec 2022 01:53:20 GMT","content:encoded":"<p>In this article, I'm going to discuss the topic of AI adoption. I'm going to talk about a couple of ways that organizations and companies can adopt AI more easily. </p>\n<p>\\\nMore specifically, I'm going to talk about two areas of machine learning which I believe can be very easily integrated into existing systems and infrastructures, independent of the industry or the company, and can very quickly add value.</p>\n<h2 id=\"risksbehindaiadoption\">Risks Behind AI Adoption</h2>\n<p>One of the challenges behind AI adoption is that there are significant risks and this makes many companies hesitant to adopt AI.</p>\n<p>\\</p>\n<ol>\n<li><p>One of the major risks is obviously the risk of hiring. If you hire the wrong person or people, then you will have incurred a huge waste of time and money.</p>\n<p>\\</p></li>\n<li><p>Another issue is that a company might not be ready for the adoption of AI in terms of the culture. Unless the senior executives buy into AI, but also the middle layers, then it's very unlikely that AI can work well. </p>\n<p>\\\nAnd this is one of the topics that I've discussed and talked about a lot in my work, also in my book&nbsp;<a href=\"https://thedatascientist.com/decision-makers-handbook-data-science/\">The Decision Makers Handbook to Data Science</a>. And unless a company has the right culture for AI, it's very likely going to fail AI adoption. So that being said, companies might be hesitant to adopt AI, and then this creates a culture of fear and the problem perpetuates itself.</p>\n<p>\\</p></li>\n</ol>\n<p>Some other risks are obviously the risks of breaking things, right? So, if you're a company that has been going on for 20 or 30 years, maybe you're running some legacy systems and rebuilding these systems in a way that they can integrate with AI. </p>\n<p>\\\nWhether we're talking about a product or developing another platform internally in one way or another, there might not be a huge incentive to make these changes because you're afraid you must break things. </p>\n<p>\\\nAnd this is why, if an organization is very defensive around the adoption of AI, it's very important to start with some&nbsp;<a href=\"https://tesseract.academy/the-importance-of-c-suite-buy-in-for-ai-success/\">use cases</a>&nbsp;which are easy to understand, they're easy to implement, and the management, upper management, and mid-level management can easily understand and they support.</p>\n<p>\\\nThat's why, unfortunately, many AI initiatives fail; whether we're talking about products or services because, sometimes, service providers or product developers pitch ideas. Companies that might seem a little bit too far out there. </p>\n<p>\\\nMaybe the valuation is not clear, or maybe adopting these technologies would require a significant change in the culture or the infrastructure layer of a company.</p>\n<h2 id=\"twotypesoftechnologies\">Two Types of Technologies</h2>\n<p>There are two types of technologies that I believe can very easily add value without much effort. And these two technologies are:</p>\n<h2 id=\"anomalydetection\">Anomaly Detection</h2>\n<p>The term anomaly detection refers to a class of methods and algorithms in machine learning which are used to identify points that are, in a sense, unusual. These are points that do not seem to follow the regular patterns of behavior. </p>\n<p>\\\nAnd the thing with anomaly detection is that it can be very useful in contexts like fraud but can also be used in other domains like manufacturing. You can use anomaly detection to detect whether some machine is not behaving as it should and then act against this.</p>\n<p>\\n Maybe this machine is about to break down, or similarly in retail, maybe you want to use anomaly detection to detect spikes in demand or to detect issues with the supply chain.</p>\n<p>\\n The benefits of anomaly detection are that it doesn't really require that much to integrate with existing systems. In many cases, you can just take data as they are and it's very easy to just feed them into algorithms. </p>\n<p>\\\nAnd the thing is those anomaly detection algorithms, require fine-tuning, but they do not require training.</p>\n<p>\\n So, one of the main roadblocks to using AI, in many cases, is the absence of what we call labeled data. So, these are data points that have a target variable. </p>\n<p>\\\nSo, if we're talking, for example, about images, then labeled data is data that has been labeled as “this is an image of a human”, “this is an image of an animal”, et cetera. </p>\n<p>\\\nSo, anomaly detection doesn't require labeled data, which means that it is much easier and faster to roll out than<a href=\"https://thedatascientist.com/supervised-pca-practical-algorithm-datasets-lots-features/\"> supervised learning</a>. Obviously, supervised learning is still king in terms of the applications of machine learning, but even if it's king, it's not always feasible to use it. </p>\n<p>\\\nThat's why anomaly detection can be so powerful if we're talking about early AI adoption</p>\n<h2 id=\"unsupervisedlearning\">Unsupervised Learning</h2>\n<p>On a similar note, the second family of techniques and methods that I’d like to discuss is <a href=\"https://thedatascientist.com/the-best-ways-to-solve-a-machine-learning-problem/\">unsupervised learning</a>. Anomaly detection can also be seen as a subset of unsupervised learning. </p>\n<p>\\\nBut unsupervised learning also includes the topics and methods like&nbsp;<a href=\"https://thedatascientist.com/natural-language-processing-data-science-tutorial-python/\">clustering</a>. And clustering is one of the most famous cases and applications of data science.</p>\n<p>\\n So, for example, user segmentation is a very famous application, or pretty much any kind of segmentation. </p>\n<p>\\\nAnd I believe that the combination of dashboards, which can help an organization extract useful insight, and the addition of some basic unsupervised learning and clustering on this dashboard can be a very good way to educate the management of the uses of AI and help them better understand how AI can add value in an organization.</p>\n<p>\\n Again, the benefit of using unsupervised learning is that you don't really require labeled data, you only need data that is structured in one way or another. But obviously, in some cases, you can also deal with structured data like text, as long as it's digitized. </p>\n<p>\\\nBut the important thing is, much like anomaly detection, you don't really need to spend time leveling cases.</p>\n<p>\\n So that's very powerful because you can get a useful system and, at the same, time you can get decision-makers within a company. They can get used to AI. And this is going to obviously help the gradual adoption and improve the understanding of what AI can do and how it can be used.</p>\n<p>\\n Therefore, if a company is quite risk averse in that sense, I think that using these techniques, these methods can be a very good way to start with AI adoption.</p>\n<h3 id=\"conclusionthebestoptionforaiadoption\">Conclusion - The Best Option for AI Adoption</h3>\n<p>There are many other ways to do AI adoption. And in this article, I'm just referring to two methods that can be used by risk-averse organizations. Obviously, if an organization wants to move faster, then the best option by far is to go for supervised learning.</p>","content:encodedSnippet":"In this article, I'm going to discuss the topic of AI adoption. I'm going to talk about a couple of ways that organizations and companies can adopt AI more easily. \n\\\nMore specifically, I'm going to talk about two areas of machine learning which I believe can be very easily integrated into existing systems and infrastructures, independent of the industry or the company, and can very quickly add value.\nRisks Behind AI Adoption\nOne of the challenges behind AI adoption is that there are significant risks and this makes many companies hesitant to adopt AI.\n\\\n\n\nOne of the major risks is obviously the risk of hiring. If you hire the wrong person or people, then you will have incurred a huge waste of time and money.\n\\\nAnother issue is that a company might not be ready for the adoption of AI in terms of the culture. Unless the senior executives buy into AI, but also the middle layers, then it's very unlikely that AI can work well. \n\\\nAnd this is one of the topics that I've discussed and talked about a lot in my work, also in my book The Decision Makers Handbook to Data Science. And unless a company has the right culture for AI, it's very likely going to fail AI adoption. So that being said, companies might be hesitant to adopt AI, and then this creates a culture of fear and the problem perpetuates itself.\n\\\nSome other risks are obviously the risks of breaking things, right? So, if you're a company that has been going on for 20 or 30 years, maybe you're running some legacy systems and rebuilding these systems in a way that they can integrate with AI. \n\\\nWhether we're talking about a product or developing another platform internally in one way or another, there might not be a huge incentive to make these changes because you're afraid you must break things. \n\\\nAnd this is why, if an organization is very defensive around the adoption of AI, it's very important to start with some use cases which are easy to understand, they're easy to implement, and the management, upper management, and mid-level management can easily understand and they support.\n\\\nThat's why, unfortunately, many AI initiatives fail; whether we're talking about products or services because, sometimes, service providers or product developers pitch ideas. Companies that might seem a little bit too far out there. \n\\\nMaybe the valuation is not clear, or maybe adopting these technologies would require a significant change in the culture or the infrastructure layer of a company.\nTwo Types of Technologies\nThere are two types of technologies that I believe can very easily add value without much effort. And these two technologies are:\nAnomaly Detection\nThe term anomaly detection refers to a class of methods and algorithms in machine learning which are used to identify points that are, in a sense, unusual. These are points that do not seem to follow the regular patterns of behavior. \n\\\nAnd the thing with anomaly detection is that it can be very useful in contexts like fraud but can also be used in other domains like manufacturing. You can use anomaly detection to detect whether some machine is not behaving as it should and then act against this.\n\\n Maybe this machine is about to break down, or similarly in retail, maybe you want to use anomaly detection to detect spikes in demand or to detect issues with the supply chain.\n\\n The benefits of anomaly detection are that it doesn't really require that much to integrate with existing systems. In many cases, you can just take data as they are and it's very easy to just feed them into algorithms. \n\\\nAnd the thing is those anomaly detection algorithms, require fine-tuning, but they do not require training.\n\\n So, one of the main roadblocks to using AI, in many cases, is the absence of what we call labeled data. So, these are data points that have a target variable. \n\\\nSo, if we're talking, for example, about images, then labeled data is data that has been labeled as “this is an image of a human”, “this is an image of an animal”, et cetera. \n\\\nSo, anomaly detection doesn't require labeled data, which means that it is much easier and faster to roll out than supervised learning. Obviously, supervised learning is still king in terms of the applications of machine learning, but even if it's king, it's not always feasible to use it. \n\\\nThat's why anomaly detection can be so powerful if we're talking about early AI adoption\nUnsupervised Learning\nOn a similar note, the second family of techniques and methods that I’d like to discuss is unsupervised learning. Anomaly detection can also be seen as a subset of unsupervised learning. \n\\\nBut unsupervised learning also includes the topics and methods like clustering. And clustering is one of the most famous cases and applications of data science.\n\\n So, for example, user segmentation is a very famous application, or pretty much any kind of segmentation. \n\\\nAnd I believe that the combination of dashboards, which can help an organization extract useful insight, and the addition of some basic unsupervised learning and clustering on this dashboard can be a very good way to educate the management of the uses of AI and help them better understand how AI can add value in an organization.\n\\n Again, the benefit of using unsupervised learning is that you don't really require labeled data, you only need data that is structured in one way or another. But obviously, in some cases, you can also deal with structured data like text, as long as it's digitized. \n\\\nBut the important thing is, much like anomaly detection, you don't really need to spend time leveling cases.\n\\n So that's very powerful because you can get a useful system and, at the same, time you can get decision-makers within a company. They can get used to AI. And this is going to obviously help the gradual adoption and improve the understanding of what AI can do and how it can be used.\n\\n Therefore, if a company is quite risk averse in that sense, I think that using these techniques, these methods can be a very good way to start with AI adoption.\nConclusion - The Best Option for AI Adoption\nThere are many other ways to do AI adoption. And in this article, I'm just referring to two methods that can be used by risk-averse organizations. Obviously, if an organization wants to move faster, then the best option by far is to go for supervised learning.","dc:creator":"Stylianos Kampakis","content":"I'm going to talk about a couple of ways which organizations and companies can use in order to adopt AI more easily.","contentSnippet":"I'm going to talk about a couple of ways which organizations and companies can use in order to adopt AI more easily.","guid":"https://hackernoon.com/ai-adoption-what-you-need-to-know-about-anomaly-detection-and-unsupervised-learning?source=rss","categories":["ai-adoption","unsupervised-learning","supervised-learning","clustering","anomaly-detection","artificial-intelligence","ai","detection"],"isoDate":"2022-12-15T01:53:20.000Z","from":"https://hackernoon.com/feed","hashId":"37dbd49dfa7336e331057a1767cf50bf"},{"creator":"Anti Danilevski","title":"FTX Is Not the Only Reason. What Is Happening in the Crypto Market, and How to Look Into the Future","link":"https://hackernoon.com/ftx-is-not-the-only-reason-what-is-happening-in-the-crypto-market-and-how-to-look-into-the-future?source=rss","pubDate":"Thu, 15 Dec 2022 02:16:32 GMT","content:encoded":"<div class=\"paragraph\">This year was truly a shock for many, and this is not only about geopolitics but also about the situation in the cryptocurrency market. Crypto investors lost more than $2 trillion in a year. First Terra/Luna, now FTX shock. </div><div class=\"paragraph\">I will try to tell you, without panic, what happened, what preceded it, and what can be expected.</div><div class=\"paragraph\">Let&#x27;s start with the fact that the cryptocurrency market is rarely calm, but the storm of 2022 turned out to be brighter than most of the previous ones. </div><div class=\"paragraph\">In this regard, many investors immediately lost billions of dollars. Each negative event entailed a wave of new bankruptcies, and the loudest of them was the bankruptcy of the FTX crypto exchange.</div><div class=\"paragraph\">Why am I writing about this? Not because it is terrible in itself, this is a business, and in principle, it is impossible for everyone to develop only successfully. </div><div class=\"paragraph\">But! These developments undermine confidence in the industry, which, let me remind you, arose precisely because of the loss of faith in traditional financial institutions after the 2008 crisis.</div><div class=\"paragraph\">Some investors reacted to the bankruptcies with calls for fair regulation. The rest blame intermediaries and say the recent turmoil should speed up the transition to decentralized platforms.</div><h2><strong>An Excursion Into History. What Happened to the Cryptocurrency Exchange Rate?</strong></h2><div class=\"paragraph\">Having peaked in November 2021, the total capitalization of crypto assets fell by 73% over the next 12 months. What do we see now? </div><div class=\"paragraph\">In percentage terms, the collapse was less deep than during the 2018 crypto winter (-84%). But he burned far more investor money—over $2 trillion.</div><div class=\"paragraph\">What I want to draw attention to in this picture. If previous fluctuations in the cryptocurrency market were caused by problems within the industry itself, then the current chaos began with an external factor. </div><div class=\"paragraph\">I mean, a surge in inflation and an increase in interest rates by central banks. This, in turn, reduced investor appetite for high-risk, high-yield assets, in particular cryptocurrencies.</div><h2><strong>Why Is This Important, and What Does It Entail?</strong></h2><div class=\"paragraph\">The crisis in the cryptocurrency market has not only deprived someone of some investment but also destroyed the beliefs of many investors that cryptocurrencies, like gold, have the status of a “haven”, since they are allegedly not associated with traditional financial assets. </div><div class=\"paragraph\">It turned out that the sharp rise in the rate of cryptocurrencies in recent years rested on a shaky foundation: many investors took out large loans and invested in tokens and crypto projects, and other cryptocurrencies were often used as collateral. </div><div class=\"paragraph\">This relationship reinforced the effect of high-profile bankruptcies. This could be my recommendation for prudence when creating an investment portfolio, but that&#x27;s not what we&#x27;re talking about now.</div><div class=\"paragraph\"><strong>What Led to the Collapse?</strong></div><div class=\"paragraph\">The collapse of the FTX crypto exchange was preceded by several other major bankruptcies, which led to the fact that investors begin to lose faith in the entire market.</div><div class=\"paragraph\">TerraUSD, which has already set everyone on edge, has become the “first sign”. To peg to the dollar, its creator, Do Kwon, used complex links with the mother token Luna. </div><div class=\"paragraph\">Next - TerraUSD “killed” Alameda Research, a cryptocurrency trading company founded in September 2017. Attention, by whom? That&#x27;s right, by Sam Bankman-Fried and Tara Mac Aulay. </div><div class=\"paragraph\">They wanted to cash in on the project by shorting Luna. But they dug a hole for themselves, bringing down the entire market and getting their other long positions liquidated.</div><div class=\"paragraph\">In turn, companies that invested in TerraUSD-related tokens and derivatives, such as Three Arrows Capital, went bankrupt. Other companies &quot;fell&quot; along the chain, for example, Voyager Digital, which provided Three Arrows with a large loan.</div><div class=\"paragraph\"><strong>What’s the Deal With FTX?</strong></div><div class=\"paragraph\">In November, another shock occurred - the collapse of the crypto-empire of Sam Bankman-Fried himself, the youngest billionaire, who charmed investors, journalists, and government officials. </div><div class=\"paragraph\">One of the largest exchanges – his FTX has burst. Now, when analysts are trying to get to the bottom of the reasons for the collapse of the Sam Bankman-Fried crypto empire, everyone is beginning to understand that alarm bells were heard from everywhere. </div><div class=\"paragraph\">But no one heard them (or did not want to).</div><div class=\"paragraph\">Sam Benkman-Fried&#x27;s success story was almost perfect. In just three years, FTX has gone from zero to a $32 billion company and is now back to zero.</div><div class=\"paragraph\">And in a few days, the man who saved other cryptocurrency projects and became the face of the industry at conferences and on Capitol Hill lost a fortune of $ 15.6 billion. As a result, FTX went bankrupt, as I said, trying to bail out Alameda Research, a trading firm owned by Bankman-Fried.</div><div class=\"paragraph\">What did it entail? What can be distinguished from the brightest events? The collapse of FTX caused problems for cryptocurrency broker Genesis, leaving them with a massive $3 billion hole in their balance sheet. </div><div class=\"paragraph\">Genesis Trading is one of the big parts of the Grayscale trust equity lending market that has been stuck with debt for already bankrupt 3AC, BlockFi, and Celsius. Sadly, they all went down in history with clients&#x27; money. </div><div class=\"paragraph\">And they used in their chains schemes with scrolling and re-pledge of ETHE and GBTC shares. And, unfortunately, the dissolution of the Grayscale trusts, which is the largest public BTC hodler in the world, may be required.</div><h2><strong>What Are the Consequences of the Crisis?</strong></h2><div class=\"paragraph\">Terra&#x27;s critics (including me) said the platform was doomed to fail because it attracted investors with unacceptably high-interest rates. </div><div class=\"paragraph\">The thing is that Terra and other highly profitable DeFi projects have become another reincarnation of financial pyramids, where the first investors receive huge income by attracting new participants.</div><div class=\"paragraph\">The collapse of FTX showed that even seemingly reliable crypto businesses can have hidden flaws. </div><div class=\"paragraph\">He also exposed the danger of crosstalk, where the problems of one part of an industry spread unexpectedly quickly to others, causing huge losses. </div><div class=\"paragraph\">Unfortunately, all this can temporarily slow down investments in cryptocurrencies and reduce the level of trust in them.</div><div class=\"paragraph\">Someone can say that proof of reserves comes to the rescue - a system for confirming reserves. At first glance, it is fine, it shows the number of assets the exchange has, but does not show liabilities to manufacturers. </div><div class=\"paragraph\">In my opinion, any exchange that gives APY on credit products above 10% is playing with users&#x27; money, because there is nowhere else for such rates to appear. </div><div class=\"paragraph\">So, if you see “tasty” annual rates on the exchange, 15-20-30%, please know that at any moment the exchange can lose like FTX, and you need to run from there as soon as possible. </div><div class=\"paragraph\">And right now, go to the exchange you work with website, and take a look at how many products and many APY it offers. And after the analysis, if necessary, run away if it isn&#x27;t too late.</div><h2><strong>What Does All This Mean for the Cryptocurrency Market’s Future?</strong></h2><div class=\"paragraph\">Cryptocurrencies arose because people didn&#x27;t trust Wall Street. But a series of bankruptcies of crypto companies raises a logical question: can cryptocurrencies now be trusted?</div><div class=\"paragraph\">A lot of us hope, and I am among those who harbor hopes, that confidence will be restored when the state introduces fair market regulation. </div><div class=\"paragraph\">But the FTX bankruptcy appears to have derailed the regulatory bill that Bankman-Fried had lobbied hard for. </div><div class=\"paragraph\">This document was opposed by some owners of DeFi platforms, who believed that the law only takes into account the interests of large centralized exchanges, including FTX.</div><div class=\"paragraph\"><strong>What&#x27;s next? Conceptually, I am one of those people who see every crisis as an opportunity, no matter how trite it may sound. </strong></div><div class=\"paragraph\"><strong>I believe that this picture will teach us to weigh the risks (although all of them, of course, cannot be weighed) and provide ground for developing better and more appropriate aspects of regulation.</strong></div><div class=\"paragraph\"><strong>Sound regulation can eventually make cryptocurrencies a more stable and trustworthy asset. </strong></div><div class=\"paragraph\"><strong>At the same time, it is not yet clear which part of the industry participants will undergo strict face control by regulators, and what consequences this exit from the market will entail.</strong></div><div class=\"Divider\"><i></i><i></i><i></i><i></i><i></i><i></i></div><div class=\"paragraph\"><em>Photo by </em><a href=\"https://unsplash.com/@hadijasaidi?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\"><em>Hadija Saidi</em></a><em> on </em><a href=\"https://unsplash.com/s/photos/future?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\"><em>Unsplash</em></a><em></em></div>","content:encodedSnippet":"This year was truly a shock for many, and this is not only about geopolitics but also about the situation in the cryptocurrency market. Crypto investors lost more than $2 trillion in a year. First Terra/Luna, now FTX shock. \nI will try to tell you, without panic, what happened, what preceded it, and what can be expected.\nLet's start with the fact that the cryptocurrency market is rarely calm, but the storm of 2022 turned out to be brighter than most of the previous ones. \nIn this regard, many investors immediately lost billions of dollars. Each negative event entailed a wave of new bankruptcies, and the loudest of them was the bankruptcy of the FTX crypto exchange.\nWhy am I writing about this? Not because it is terrible in itself, this is a business, and in principle, it is impossible for everyone to develop only successfully. \nBut! These developments undermine confidence in the industry, which, let me remind you, arose precisely because of the loss of faith in traditional financial institutions after the 2008 crisis.\nSome investors reacted to the bankruptcies with calls for fair regulation. The rest blame intermediaries and say the recent turmoil should speed up the transition to decentralized platforms.\nAn Excursion Into History. What Happened to the Cryptocurrency Exchange Rate?\nHaving peaked in November 2021, the total capitalization of crypto assets fell by 73% over the next 12 months. What do we see now? \nIn percentage terms, the collapse was less deep than during the 2018 crypto winter (-84%). But he burned far more investor money—over $2 trillion.\nWhat I want to draw attention to in this picture. If previous fluctuations in the cryptocurrency market were caused by problems within the industry itself, then the current chaos began with an external factor. \nI mean, a surge in inflation and an increase in interest rates by central banks. This, in turn, reduced investor appetite for high-risk, high-yield assets, in particular cryptocurrencies.\nWhy Is This Important, and What Does It Entail?\nThe crisis in the cryptocurrency market has not only deprived someone of some investment but also destroyed the beliefs of many investors that cryptocurrencies, like gold, have the status of a “haven”, since they are allegedly not associated with traditional financial assets. \nIt turned out that the sharp rise in the rate of cryptocurrencies in recent years rested on a shaky foundation: many investors took out large loans and invested in tokens and crypto projects, and other cryptocurrencies were often used as collateral. \nThis relationship reinforced the effect of high-profile bankruptcies. This could be my recommendation for prudence when creating an investment portfolio, but that's not what we're talking about now.\nWhat Led to the Collapse?\nThe collapse of the FTX crypto exchange was preceded by several other major bankruptcies, which led to the fact that investors begin to lose faith in the entire market.\nTerraUSD, which has already set everyone on edge, has become the “first sign”. To peg to the dollar, its creator, Do Kwon, used complex links with the mother token Luna. \nNext - TerraUSD “killed” Alameda Research, a cryptocurrency trading company founded in September 2017. Attention, by whom? That's right, by Sam Bankman-Fried and Tara Mac Aulay. \nThey wanted to cash in on the project by shorting Luna. But they dug a hole for themselves, bringing down the entire market and getting their other long positions liquidated.\nIn turn, companies that invested in TerraUSD-related tokens and derivatives, such as Three Arrows Capital, went bankrupt. Other companies \"fell\" along the chain, for example, Voyager Digital, which provided Three Arrows with a large loan.\nWhat’s the Deal With FTX?\nIn November, another shock occurred - the collapse of the crypto-empire of Sam Bankman-Fried himself, the youngest billionaire, who charmed investors, journalists, and government officials. \nOne of the largest exchanges – his FTX has burst. Now, when analysts are trying to get to the bottom of the reasons for the collapse of the Sam Bankman-Fried crypto empire, everyone is beginning to understand that alarm bells were heard from everywhere. \nBut no one heard them (or did not want to).\nSam Benkman-Fried's success story was almost perfect. In just three years, FTX has gone from zero to a $32 billion company and is now back to zero.\nAnd in a few days, the man who saved other cryptocurrency projects and became the face of the industry at conferences and on Capitol Hill lost a fortune of $ 15.6 billion. As a result, FTX went bankrupt, as I said, trying to bail out Alameda Research, a trading firm owned by Bankman-Fried.\nWhat did it entail? What can be distinguished from the brightest events? The collapse of FTX caused problems for cryptocurrency broker Genesis, leaving them with a massive $3 billion hole in their balance sheet. \nGenesis Trading is one of the big parts of the Grayscale trust equity lending market that has been stuck with debt for already bankrupt 3AC, BlockFi, and Celsius. Sadly, they all went down in history with clients' money. \nAnd they used in their chains schemes with scrolling and re-pledge of ETHE and GBTC shares. And, unfortunately, the dissolution of the Grayscale trusts, which is the largest public BTC hodler in the world, may be required.\nWhat Are the Consequences of the Crisis?\nTerra's critics (including me) said the platform was doomed to fail because it attracted investors with unacceptably high-interest rates. \nThe thing is that Terra and other highly profitable DeFi projects have become another reincarnation of financial pyramids, where the first investors receive huge income by attracting new participants.\nThe collapse of FTX showed that even seemingly reliable crypto businesses can have hidden flaws. \nHe also exposed the danger of crosstalk, where the problems of one part of an industry spread unexpectedly quickly to others, causing huge losses. \nUnfortunately, all this can temporarily slow down investments in cryptocurrencies and reduce the level of trust in them.\nSomeone can say that proof of reserves comes to the rescue - a system for confirming reserves. At first glance, it is fine, it shows the number of assets the exchange has, but does not show liabilities to manufacturers. \nIn my opinion, any exchange that gives APY on credit products above 10% is playing with users' money, because there is nowhere else for such rates to appear. \nSo, if you see “tasty” annual rates on the exchange, 15-20-30%, please know that at any moment the exchange can lose like FTX, and you need to run from there as soon as possible. \nAnd right now, go to the exchange you work with website, and take a look at how many products and many APY it offers. And after the analysis, if necessary, run away if it isn't too late.\nWhat Does All This Mean for the Cryptocurrency Market’s Future?\nCryptocurrencies arose because people didn't trust Wall Street. But a series of bankruptcies of crypto companies raises a logical question: can cryptocurrencies now be trusted?\nA lot of us hope, and I am among those who harbor hopes, that confidence will be restored when the state introduces fair market regulation. \nBut the FTX bankruptcy appears to have derailed the regulatory bill that Bankman-Fried had lobbied hard for. \nThis document was opposed by some owners of DeFi platforms, who believed that the law only takes into account the interests of large centralized exchanges, including FTX.\nWhat's next? Conceptually, I am one of those people who see every crisis as an opportunity, no matter how trite it may sound. \nI believe that this picture will teach us to weigh the risks (although all of them, of course, cannot be weighed) and provide ground for developing better and more appropriate aspects of regulation.\nSound regulation can eventually make cryptocurrencies a more stable and trustworthy asset. \nAt the same time, it is not yet clear which part of the industry participants will undergo strict face control by regulators, and what consequences this exit from the market will entail.\n\nPhoto by Hadija Saidi on Unsplash","dc:creator":"Anti Danilevski","content":"Crypto investors lost more than $2 trillion in a year in the cryptocurrency market. The collapse of the FTX crypto exchange was preceded by several other major bankruptcies, which led to the fact that investors begin to lose faith in the entire market. Inflation and an increase in interest rates by central banks reduced investor appetite for high-risk, high-yield assets, in particular cryptocurrencies. In just three years, FTX has gone from zero to a $32 billion company and is back to zero.","contentSnippet":"Crypto investors lost more than $2 trillion in a year in the cryptocurrency market. The collapse of the FTX crypto exchange was preceded by several other major bankruptcies, which led to the fact that investors begin to lose faith in the entire market. Inflation and an increase in interest rates by central banks reduced investor appetite for high-risk, high-yield assets, in particular cryptocurrencies. In just three years, FTX has gone from zero to a $32 billion company and is back to zero.","guid":"https://hackernoon.com/ftx-is-not-the-only-reason-what-is-happening-in-the-crypto-market-and-how-to-look-into-the-future?source=rss","categories":["ftx","alameda","sbf","cryptocurrency","crypto","future-of-cryptos","crypto-market","crypto-exchange"],"isoDate":"2022-12-15T02:16:32.000Z","from":"https://hackernoon.com/feed","hashId":"66105f93ed7ac33f2cf6a431403fb4a7"},{"creator":"Sam Bankman-Fried","title":"What SBF would have testified in front of Congress","link":"https://hackernoon.com/what-sbf-would-have-testified-in-front-of-congress?source=rss","pubDate":"Thu, 15 Dec 2022 05:48:20 GMT","content:encoded":"<p>:::tip\nSam Bankman-Fried’s Written Testimony Notes Dec 12, 2022, is part of&nbsp;<strong><a href=\"https://hackernoon.com/u/legalpdf?ref=hackernoon.com\">HackerNoon’s Legal PDF Series</a></strong>. SBF was scheduled to testify before Congress a day before his <a href=\"https://hackernoon.com/it-happened-sbf-arrested-in-the-bahamas-per-criminal-charges-and-extradition-request-by-the-us\">arrest</a> on Dec 12, 2022 in the Bahamas. So, these are the notes that he would have presented in front of Congress that we never actually got to hear. </p>\n<p>This is the table of links. </p>\n<p>:::</p>\n<p>\\\n<a href=\"https://hackernoon.com/preview/fIZSqzR4pF4BKhfkLIgB\">Intro</a></p>\n<p><a href=\"https://hackernoon.com/preview/NUC9epa2cBtiSveVEVhs\">What happened</a></p>\n<p>What went wrong</p>\n<ol>\n<li><a href=\"https://hackernoon.com/preview/2Ff6hLWcTzAibruFQHyE\">Alameda Research became insolvent when the economic environment changed</a> </li>\n<li><a href=\"https://hackernoon.com/preview/KbylEWjEGImxbztoddMy\">Failures of FTX’s internal controls</a> </li>\n<li><a href=\"https://hackernoon.com/preview/KxDGJ1Qq5SwjiCbClLt1\">Binance’s role in FTX’ collapse</a></li>\n</ol>\n<p><a href=\"https://hackernoon.com/preview/6TtrSVuqPNfdWcNUYYRU\">My mistakes as FTX’s CEO</a></p>\n<p><a href=\"https://hackernoon.com/preview/5PBFEtQZJxYB3rT2LItD\">FTX International’s Jurisdictions</a></p>\n<p><a href=\"https://hackernoon.com/preview/Kv4QRyQVlyRuEXfHjO4r\">FTX US</a></p>\n<p><a href=\"https://hackernoon.com/preview/rNCRrNDXS87FaJnP1tS9\">Misstatements</a></p>\n<p><a href=\"https://hackernoon.com/preview/I2FapLQNjP5gx965jefS\">Accusations</a></p>\n<p>:::tip\nContinue reading <a href=\"https://hackernoon.com/preview/fIZSqzR4pF4BKhfkLIgB\">here</a></p>\n<p>:::</p>\n<p>\\</p>","content:encodedSnippet":":::tip\nSam Bankman-Fried’s Written Testimony Notes Dec 12, 2022, is part of HackerNoon’s Legal PDF Series. SBF was scheduled to testify before Congress a day before his arrest on Dec 12, 2022 in the Bahamas. So, these are the notes that he would have presented in front of Congress that we never actually got to hear. \nThis is the table of links. \n:::\n\\\nIntro\nWhat happened\nWhat went wrong\nAlameda Research became insolvent when the economic environment changed \nFailures of FTX’s internal controls \nBinance’s role in FTX’ collapse\nMy mistakes as FTX’s CEO\nFTX International’s Jurisdictions\nFTX US\nMisstatements\nAccusations\n:::tip\nContinue reading here\n:::\n\\","dc:creator":"Sam Bankman-Fried","content":"Sam Bankman-Fried’s Written Testimony Notes Dec 12, 2022, is part of HackerNoon’s Legal PDF Series. SBF was scheduled to testify before Congress a day before his arrest on Dec 12, 2022 in the Bahamas. So, these are the notes that he would have presented in front of Congress that we never actually got to hear.\nThis is the table of links.","contentSnippet":"Sam Bankman-Fried’s Written Testimony Notes Dec 12, 2022, is part of HackerNoon’s Legal PDF Series. SBF was scheduled to testify before Congress a day before his arrest on Dec 12, 2022 in the Bahamas. So, these are the notes that he would have presented in front of Congress that we never actually got to hear.\nThis is the table of links.","guid":"https://hackernoon.com/what-sbf-would-have-testified-in-front-of-congress?source=rss","categories":["sbf","ftx","sbf-indictment","sbf-testimonial","congress","sam-bankman-fried","alameda","ftx-bankruptcy","hackernoon-es","hackernoon-hi","hackernoon-zh","hackernoon-vi","hackernoon-fr","hackernoon-pt","hackernoon-ja"],"isoDate":"2022-12-15T05:48:20.000Z","from":"https://hackernoon.com/feed","hashId":"239bc05ac8c86b4df972fd02c57fc30a"},{"creator":"Web3 Bites","title":"How TinyTap is Impacting the Education Industry Through NFTs ","link":"https://hackernoon.com/how-tinytap-through-nfts-is-impacting-the-education-industry?source=rss","pubDate":"Thu, 15 Dec 2022 06:51:02 GMT","content:encoded":"<h2 id=\"understandingthefungibilityofnfts\">Understanding the Fungibility of NFTs</h2>\n<p><a href=\"https://www.theverge.com/22310188/nft-explainer-what-is-blockchain-crypto-art-faq\">As per Mitchell et al</a>, when something is \"non-fungible,\" it signifies that it is unreplaceable since it is one of a kind.</p>\n<p>\\\nIn my opinion, the non-fungibility of NFTs leads to liquidity problems and liquidity premiums, which makes it very difficult to sell your NFT in the open market. The lack of liquidity in the NFT market may be a challenge for investors and startups alike.</p>\n<p>\\\nA few web3 startups are trying to solve this illiquidity problem through different protocols and technology, such as NFTs fractionalizations, NFT oracles, price discovery tools, NFT-backed loans and NFT marketplace aggregators. The technological approach that wins, in the end, shall depend on the adoption of such technologies and how efficiently it solves the NFT liquidity problem.</p>\n<h2 id=\"understandingtheimportanceofnftsforoureconomy\">Understanding the Importance of NFTs for our Economy</h2>\n<p>Tokens that can't be exchanged for other coins are a new twist on cryptocurrency 101. Various assets, such as real estate, lending contracts, and even works of art, are traded and lent via today's complex financial networks. NFTs contribute to the reinvention of this infrastructure by allowing digital representations of physical assets.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/7rEmNIeHNFOBfZZtUMQerOZIGGH3-pna3o98.jpeg\" alt=\"\" /></p>\n<p>In my opinion, if there is one clear advantage of NFTs, it is the tokenisation of non-fungible real-world assets such as diamonds and real estate. The tokenisation of diamonds or real estate through NFTs is an important use case of NFTs, which transforms a physical asset into a digital one, simplifies operations, and eliminates intermediaries.</p>\n<p>\\\nIf an NFT represents a piece of real art on a blockchain which can be traded in a decentralised manner, then there is no longer any need for intermediaries, and the artist may communicate directly with the audience.</p>\n<p>\\\nFurthermore, NFTs can be used to represent real estate property, removing illiquidity in the real estate market. This is a good use case of NFTs and how they can be applied to real-world assets. </p>\n<p>\\\nReal estate is non-liquid because it can take months to sell a property. Even if we have an NFT that represents a $1 million USD house, it may still cost $1 million USD to buy that real-estate-backed NFT. However, suppose we fractionalized the real-estate-backed NFT into lower ticket volumes, such as 10,000 fractional NFTs each for 100$. In that case, we may remove the illiquidity by lowering the barrier to entry and allowing for fractional ownership where users can now buy the ownership in the real estate property for $100.</p>\n<h2 id=\"animocabrandsandtinytraptodisruptthenfteconomywitheducatorsandpublishersfocusednftauctions\">Animoca Brands and TinyTrap to Disrupt the NFT Economy With Educators and Publishers-Focused NFT Auctions</h2>\n<p><a href=\"https://www.tinytap.com\">TinyTap</a>, the premier platform for user-generated educational games, and Animoca Brands, a firm promoting intellectual property rights for gaming and the open metaverse, have announced that the second batch of teacher-authored Publisher NFTs will be auctioned on OpenSea beginning at 19:00 (EST) on 15 December 2022.</p>\n<p>:::info\n<strong>Vested Interest Disclosure</strong>:&nbsp;<em>The author is an independent contributor publishing via our&nbsp;<strong><a href=\"https://sponsor.hackernoon.com/brand-as-author?ref=hackernoon.com\">brand-as-author program</a></strong>. Be it through direct compensation, media partnerships, or networking. The author has a vested interest in the company/ies mentioned in this story. HackerNoon has reviewed the report for quality, but the claims herein belong to the author. #DYOR</em></p>\n<p>:::</p>\n<p>TinyTap is a platform where users do not need coding knowledge to learn to program. To allows teachers to create and share interactive lessons with their students while also earning a cut of the profits. Educators' access to funding, co-publishers ability to monetise their work, and the community at large are all bolstered by TinyTap's new Publisher NFTs, built on Web3 technology. In my opinion, this can help the education industry by opening new avenues and opportunities for teachers, universities and students alike!</p>\n<p>\\\nDon’t forget to like and share the story!</p>\n<p>Image credits: <a href=\"https://unsplash.com/@shubzweb3\">Shubham's Web3</a>.</p>","content:encodedSnippet":"Understanding the Fungibility of NFTs\nAs per Mitchell et al, when something is \"non-fungible,\" it signifies that it is unreplaceable since it is one of a kind.\n\\\nIn my opinion, the non-fungibility of NFTs leads to liquidity problems and liquidity premiums, which makes it very difficult to sell your NFT in the open market. The lack of liquidity in the NFT market may be a challenge for investors and startups alike.\n\\\nA few web3 startups are trying to solve this illiquidity problem through different protocols and technology, such as NFTs fractionalizations, NFT oracles, price discovery tools, NFT-backed loans and NFT marketplace aggregators. The technological approach that wins, in the end, shall depend on the adoption of such technologies and how efficiently it solves the NFT liquidity problem.\nUnderstanding the Importance of NFTs for our Economy\nTokens that can't be exchanged for other coins are a new twist on cryptocurrency 101. Various assets, such as real estate, lending contracts, and even works of art, are traded and lent via today's complex financial networks. NFTs contribute to the reinvention of this infrastructure by allowing digital representations of physical assets.\n\\\n \nIn my opinion, if there is one clear advantage of NFTs, it is the tokenisation of non-fungible real-world assets such as diamonds and real estate. The tokenisation of diamonds or real estate through NFTs is an important use case of NFTs, which transforms a physical asset into a digital one, simplifies operations, and eliminates intermediaries.\n\\\nIf an NFT represents a piece of real art on a blockchain which can be traded in a decentralised manner, then there is no longer any need for intermediaries, and the artist may communicate directly with the audience.\n\\\nFurthermore, NFTs can be used to represent real estate property, removing illiquidity in the real estate market. This is a good use case of NFTs and how they can be applied to real-world assets. \n\\\nReal estate is non-liquid because it can take months to sell a property. Even if we have an NFT that represents a $1 million USD house, it may still cost $1 million USD to buy that real-estate-backed NFT. However, suppose we fractionalized the real-estate-backed NFT into lower ticket volumes, such as 10,000 fractional NFTs each for 100$. In that case, we may remove the illiquidity by lowering the barrier to entry and allowing for fractional ownership where users can now buy the ownership in the real estate property for $100.\nAnimoca Brands and TinyTrap to Disrupt the NFT Economy With Educators and Publishers-Focused NFT Auctions\nTinyTap, the premier platform for user-generated educational games, and Animoca Brands, a firm promoting intellectual property rights for gaming and the open metaverse, have announced that the second batch of teacher-authored Publisher NFTs will be auctioned on OpenSea beginning at 19:00 (EST) on 15 December 2022.\n:::info\nVested Interest Disclosure: The author is an independent contributor publishing via our brand-as-author program. Be it through direct compensation, media partnerships, or networking. The author has a vested interest in the company/ies mentioned in this story. HackerNoon has reviewed the report for quality, but the claims herein belong to the author. #DYOR\n:::\nTinyTap is a platform where users do not need coding knowledge to learn to program. To allows teachers to create and share interactive lessons with their students while also earning a cut of the profits. Educators' access to funding, co-publishers ability to monetise their work, and the community at large are all bolstered by TinyTap's new Publisher NFTs, built on Web3 technology. In my opinion, this can help the education industry by opening new avenues and opportunities for teachers, universities and students alike!\n\\\nDon’t forget to like and share the story!\nImage credits: Shubham's Web3.","dc:creator":"Web3 Bites","content":"When something is \"non-fungible,\" it signifies that it is unreplaceable since it is one of a kind. NFTs have the potential to eliminate intermediaries, streamline trade, and launch whole new marketplaces. They may be used to depict real estate or artwork digitally, for instance, digitally. The concept of and the need for uniquely identifying material possessions have been around for some time, but when you couple these ideas with the security of a distributed ledger and smart contracts, you've got a tremendous agent of transformation!","contentSnippet":"When something is \"non-fungible,\" it signifies that it is unreplaceable since it is one of a kind. NFTs have the potential to eliminate intermediaries, streamline trade, and launch whole new marketplaces. They may be used to depict real estate or artwork digitally, for instance, digitally. The concept of and the need for uniquely identifying material possessions have been around for some time, but when you couple these ideas with the security of a distributed ledger and smart contracts, you've got a tremendous agent of transformation!","guid":"https://hackernoon.com/how-tinytap-through-nfts-is-impacting-the-education-industry?source=rss","categories":["nft","web3","education","animocabrands","good-company","non-fungible-tokens","enterthemetaverse","online-education"],"isoDate":"2022-12-15T06:51:02.000Z","from":"https://hackernoon.com/feed","hashId":"50940a9cac604e9c90cc1141d98701d8"},{"creator":"Web3 Bites","title":"How Nexera ID is Bringing Privacy and Security to DeFi","link":"https://hackernoon.com/how-nexera-id-is-bringing-privacy-and-security-to-defi?source=rss","pubDate":"Thu, 15 Dec 2022 07:43:17 GMT","content:encoded":"<h2 id=\"whydoweneedtoselfcustodyourdigitalassets\">Why Do We Need to Self-Custody our Digital Assets</h2>\n<p>Self-custodial wallets are <a href=\"https://www.binance.com/en/blog/ecosystem/what-is-a-selfcustodial-wallet-and-why-should-you-choose-trust-wallet-4498166712312335636\">ways to store</a> cryptocurrency that give users full control over their own private keys and assets. No one, not even the wallet provider, has access to the user's private key. This means that the user always has full control over his or her cash. In my opinion, self-custody is a novel way to protect your assets when there is a lack of trust between intermediaries. However, self-custody needs to be balanced with the correct set of measures such as protecting and safeguarding private keys as some users may find later that they may have misplaced their private keys leading to the loss of their digital assets.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/7rEmNIeHNFOBfZZtUMQerOZIGGH3-d6b3o11.jpeg\" alt=\"\" /></p>\n<p>On the other hand, a custodial wallet is run by a third party that holds the user's private keys and, by extension, their digital assets. Custodial wallets are like banks, where they are in charge of your money, which you can get back at any time as long as you haven't broken any rules that would stop you from getting your money back. However, if the custodian goes bankrupt, it may lead to investors losing all of their investments.</p>\n<h2 id=\"complianceattheforefrontunderstandingknowyourtransaction\">Compliance at the Forefront - Understanding “Know Your Transaction”</h2>\n<p>The term <em><a href=\"https://www.scorechain.com/resources/crypto-glossary/kyt\">\"know-your-transaction\"</a></em> and “<a href=\"https://www.scorechain.com/resources/crypto-glossary/know-your-customer-kyc\">know-your-customer</a>” refers to a procedure used by financial institutions to compile data on their customers' transactions in order to determine compliance with anti-money laundering laws. In doing so, it determines whether or not the exchange of money in question is legitimate and free of any ties to illegal activities in the financial sector. In my opinion, a digital wallet also needs to comply with regulations around money laundering and financing terrorism by implementing digital identities to curb any misuse of the application. A wallet that focuses on privacy, compliance and security is an ideal suite which should be provided to users.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/7rEmNIeHNFOBfZZtUMQerOZIGGH3-kma3o84.jpeg\" alt=\"\" /></p>\n<p>In my view, it is critical for non-custodial wallets to have digital identities and controls to ensure that the application complies with local laws and does not help criminals in laundering proceeds from illegal activities, hacks, or drug smuggling. </p>\n<p>\\\nDigital wallets that focus on privacy by design and compliance may be the future. Even though for many, these two terms may not go hand-in-hand. Applications can be created which are decentralised in nature, comply with local laws as well as protect personal and sensitive data.</p>\n<h2 id=\"whatisnexeraidbyallianceblockandhowdoesithelpuserstoselfcustodyassets\">What is Nexera ID by AllianceBlock and How does it Help Users to Self-Custody Assets</h2>\n<p><a href=\"https://allianceblock.io/\">AllianceBlock</a>, a web3 company&nbsp;for the DeFi infrastructure that creates interoperability between decentralised and conventional financial systems, has introduced Nexera ID. Nexera ID is an innovative wallet system that encourages personal security, privacy, and asset possession by its users, and it does so by use of a programmable smart wallet.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/7rEmNIeHNFOBfZZtUMQerOZIGGH3-j093o3k.png\" alt=\"\" /></p>\n<p>Nexera ID is a cutting-edge digital wallet that uses a special digital token known as a MetaNFT to safely store your digital assets and identification information. Users may establish their own rules for the handling of digital assets, the disclosure of personal information, and the performance of wallet operations, such as the activation of recovery mechanisms.</p>\n<p>:::tip\n<strong>Vested Interest Disclosure</strong>:&nbsp;<em>The author is an independent contributor publishing via our&nbsp;<strong><a href=\"https://sponsor.hackernoon.com/brand-as-author?ref=hackernoon.com\">brand-as-author program</a></strong>. Be it through direct compensation, media partnerships, or networking. The author has a vested interest in the company/ies mentioned in this story. HackerNoon has reviewed the report for quality, but the claims herein belong to the author. #DYOR</em></p>\n<p>:::</p>\n<p>\\\nNexera ID is a self-custodial smart wallet with extensive recovery capabilities that are built on top of Nexera Protocol and makes use of \"soul-bound\" MetaNFTs. Organizations and companies may utilise ZKPs to authenticate and verify a user's identification without disclosing personally identifying information by using Nexera's ID integration with Know-Your-Transaction (KYT), Know-Your-Business (KYB), and Know-Your-Customer (KYC) verifications. An open-source trustless identification verification (TIDV) system enables this by connecting to various know-your-customer (KYC) services. In my opinion, this is a key feature which helps users to comply, custody and secure their assets based on best industry practices.</p>\n<p>\\\n<em>Don’t forget to like and share the story!</em></p>\n<p><em>Image credits: <a href=\"https://unsplash.com/@asyfaul\">Muhammad Asyfaul</a>, Ferhat Deniz and <a href=\"https://unsplash.com/@matthewhenry\">Matthew Henry</a>.</em></p>","content:encodedSnippet":"Why Do We Need to Self-Custody our Digital Assets\nSelf-custodial wallets are ways to store cryptocurrency that give users full control over their own private keys and assets. No one, not even the wallet provider, has access to the user's private key. This means that the user always has full control over his or her cash. In my opinion, self-custody is a novel way to protect your assets when there is a lack of trust between intermediaries. However, self-custody needs to be balanced with the correct set of measures such as protecting and safeguarding private keys as some users may find later that they may have misplaced their private keys leading to the loss of their digital assets.\n\\\n \nOn the other hand, a custodial wallet is run by a third party that holds the user's private keys and, by extension, their digital assets. Custodial wallets are like banks, where they are in charge of your money, which you can get back at any time as long as you haven't broken any rules that would stop you from getting your money back. However, if the custodian goes bankrupt, it may lead to investors losing all of their investments.\nCompliance at the Forefront - Understanding “Know Your Transaction”\nThe term \"know-your-transaction\" and “know-your-customer” refers to a procedure used by financial institutions to compile data on their customers' transactions in order to determine compliance with anti-money laundering laws. In doing so, it determines whether or not the exchange of money in question is legitimate and free of any ties to illegal activities in the financial sector. In my opinion, a digital wallet also needs to comply with regulations around money laundering and financing terrorism by implementing digital identities to curb any misuse of the application. A wallet that focuses on privacy, compliance and security is an ideal suite which should be provided to users.\n\\\n \nIn my view, it is critical for non-custodial wallets to have digital identities and controls to ensure that the application complies with local laws and does not help criminals in laundering proceeds from illegal activities, hacks, or drug smuggling. \n\\\nDigital wallets that focus on privacy by design and compliance may be the future. Even though for many, these two terms may not go hand-in-hand. Applications can be created which are decentralised in nature, comply with local laws as well as protect personal and sensitive data.\nWhat is Nexera ID by AllianceBlock and How does it Help Users to Self-Custody Assets\nAllianceBlock, a web3 company for the DeFi infrastructure that creates interoperability between decentralised and conventional financial systems, has introduced Nexera ID. Nexera ID is an innovative wallet system that encourages personal security, privacy, and asset possession by its users, and it does so by use of a programmable smart wallet.\n\\\n \nNexera ID is a cutting-edge digital wallet that uses a special digital token known as a MetaNFT to safely store your digital assets and identification information. Users may establish their own rules for the handling of digital assets, the disclosure of personal information, and the performance of wallet operations, such as the activation of recovery mechanisms.\n:::tip\nVested Interest Disclosure: The author is an independent contributor publishing via our brand-as-author program. Be it through direct compensation, media partnerships, or networking. The author has a vested interest in the company/ies mentioned in this story. HackerNoon has reviewed the report for quality, but the claims herein belong to the author. #DYOR\n:::\n\\\nNexera ID is a self-custodial smart wallet with extensive recovery capabilities that are built on top of Nexera Protocol and makes use of \"soul-bound\" MetaNFTs. Organizations and companies may utilise ZKPs to authenticate and verify a user's identification without disclosing personally identifying information by using Nexera's ID integration with Know-Your-Transaction (KYT), Know-Your-Business (KYB), and Know-Your-Customer (KYC) verifications. An open-source trustless identification verification (TIDV) system enables this by connecting to various know-your-customer (KYC) services. In my opinion, this is a key feature which helps users to comply, custody and secure their assets based on best industry practices.\n\\\nDon’t forget to like and share the story!\nImage credits: Muhammad Asyfaul, Ferhat Deniz and Matthew Henry.","dc:creator":"Web3 Bites","content":"AllianceBlock is helping to close the gap between decentralised finance and traditional finance by solving problems in both areas and bringing them closer together. ","contentSnippet":"AllianceBlock is helping to close the gap between decentralised finance and traditional finance by solving problems in both areas and bringing them closer together.","guid":"https://hackernoon.com/how-nexera-id-is-bringing-privacy-and-security-to-defi?source=rss","categories":["crypto","defi","web3","self-custody","privacy","security","crypto-security","good-company"],"isoDate":"2022-12-15T07:43:17.000Z","from":"https://hackernoon.com/feed","hashId":"1d2301ed7d8666dd26c514e2632ad742"},{"creator":"Blockchain Oracle Summit","title":"Cross-Chain Liquidity Issues and How A Collider Aggregation Proxy Can Solve Them","link":"https://hackernoon.com/cross-chain-liquidity-issues-and-how-a-collider-aggregation-proxy-can-solve-them?source=rss","pubDate":"Thu, 15 Dec 2022 08:38:32 GMT","content:encoded":"<p>In the presentation below, Shamil Khalilov, founder and CTO of Hardron Network, evaluates the challenges faced by layer-2 cross-chain bridges and how Hardron aims to solve these issues.</p>\n<p><a href=\"https://youtu.be/w2vMuwQLmuc?embedable=true\">https://youtu.be/w2vMuwQLmuc?embedable=true</a></p>\n<p>Below you will find more elaboration on key points highlighted during his talk.</p>\n<h2 id=\"whatishardronnetwork\">What is Hardron Network</h2>\n<p><a href=\"https://hardron.network/\">Hardron Network</a>&nbsp;is a layer-2 cross-chain bridge built on the&nbsp;<a href=\"https://interchain.io/\">Interchain</a>&nbsp;network. Shamil Khalilov is the founder and CTO of the protocol. He has spent the last two years focussing exclusively on building bridges on layer-2 networks in order to address the liquidity issue that many well-known bridging protocols face.</p>\n<p>\\\nShamil also played a major role in developing the Neutrino Protocol, an algorithmic price-stable assetization protocol. It enables the creation of stablecoins pegged to real-world assets such as commodities and national currencies.</p>\n<p>\\\n<em>More in-depth information about Neutrino can be found on their <a href=\"https://medium.com/@neutrinoteam\">page</a>.</em></p>\n<h2 id=\"layer2crosschainbridges\">Layer 2 Cross-Chain Bridges</h2>\n<p>Cross-chain bridges enable the transfer of data and digital assets across different blockchains. Blockchains typically operate in silos and cannot interact with other blockchain ecosystems.</p>\n<p>\\</p>\n<blockquote>\n  <p>Cross-chain bridges help users access and interact with dApps on different blockchains, thus facilitating a more  interoperable Web3 ecosystem. Layer 2 cross-chain bridges are – obviously – bridges built on Layer 2 blockchains.</p>\n</blockquote>\n<p>\\\nLayer 2 blockchains are secondary networks built on top of underlying layer-1 protocols. Some examples of layer-2 blockchains include the&nbsp;<a href=\"https://lightning.network/\">Lightning Network</a>, which is built on top of&nbsp;<a href=\"https://developer.bitcoin.org/devguide/block_chain.html\">Bitcoin</a>; and Polygon or&nbsp;<a href=\"https://www.metis.io/\">Metis</a>, which are built on top of&nbsp;<a href=\"https://ethereum.org/en/developers/docs/intro-to-ethereum/\">Ethereum</a>.</p>\n<p>\\\nThese layer-2 networks help to ease congestion on the networks they are built on, thus improving the efficiency and overall scalability of the system.</p>\n<p>\\\n<em>A more detailed explanation of layer 1s and layer 2s can be found in&nbsp;<a href=\"https://thedefiant.io/what-are-layer-1s-and-layer-2s\">this article</a>.</em></p>\n<p>\\\nIn his presentation, Shamil highlights some of the biggest challenges related to cross-chain bridges. He introduces popular examples of cross-chain bridges like&nbsp;<a href=\"https://docs.wormhole.com/wormhole/\">Wormhole</a>&nbsp;and&nbsp;<a href=\"https://docs.multichain.org/getting-started/introduction\">Multichain</a>, and explains how these protocols address those issues.</p>\n<h2 id=\"wormholesrecursivewrappingproblemexplained\">Wormhole’s Recursive Wrapping Problem: Explained</h2>\n<p>Wormhole is a cross-chain bridge built on&nbsp;<a href=\"https://docs.solana.com/introduction\">Solana</a>. The protocol bridges assets by locking users’ assets in smart contracts and minting new wrapped tokens on the destination chain.</p>\n<p>\\</p>\n<blockquote>\n  <p>Wrapped tokens are tokens that have their value pegged to other cryptocurrencies that are native to other blockchains.</p>\n</blockquote>\n<p>\\\nAn example of a wrapped token is Wrapped Bitcoin (WBTC) - an ERC20 token on the Ethereum Blockchain. WBTC brings the ability to trade BTC on other blockchains like Ethereum and Solana. Wrapped tokens are one of the key elements that facilitate interoperability between blockchains.</p>\n<p>\\\nShamil discovered that while the Wormhole system has a healthy liquidity of tokens and is considered quite trustless with 19 validators, it faces a critical issue called the “recursive wrapping problem.”</p>\n<p>\\\nThe recursive wrapping problem arises when the target chain cannot distinguish the origin chain of a wrapped token. For example, if a user wraps USDC on Ethereum and Polygon, then wants to send them to Solana using Wormhole, the system would recognize them as two different tokens, naming them as “Ethereum Wrapped USDC” and “Polygon Wrapped USDC” correspondingly.</p>\n<p>\\\nMore details about the inner workings of Wormhole can be found in this video:</p>\n<p><a href=\"https://www.youtube.com/embed/ngnWF5widJU?embedable=true\">https://www.youtube.com/embed/ngnWF5widJU?embedable=true</a></p>\n<h2 id=\"multichainspermissionedwrappedtokenlistinganalternative\">Multichain’s Permissioned Wrapped Token Listing: An Alternative</h2>\n<p>According to Shamil, one huge challenge faced by many cross-chain bridges is that most of the liquidity is locked on the Ethereum network and maintaining liquidity on Ethereum costs a lot in gas fees. </p>\n<p>\\\nHowever, Multichain solves this issue for some tokens with permissioned wrapped token listing where users have to fill in a google form to wrap a token. Users can transfer their wrapped tokens across different chains without interacting with Ethereum, thus helping save on gas fees.</p>\n<p>\\\nMore information about how Multichain works can be found in their documentation&nbsp;<a href=\"https://docs.multichain.org/getting-started/how-it-works\">here</a>.</p>\n<h2 id=\"theliquidityprobleminbridges\">The Liquidity Problem in Bridges</h2>\n<p>Other issues Shamil brings to light are the scarcity of liquid-wrapped tokens as well as price discrepancies of the same token on different blockchains. The lack of wrapped token liquidity would result in much higher market volatility. </p>\n<p>\\\nLower liquidity levels would also make cross-chain bridges far more susceptible to market manipulations. </p>\n<p>\\\nIn contrast, high liquidity would mean a much more stable market. </p>\n<p>\\\nShamil provides the example of the&nbsp;<a href=\"https://cryptoslate.com/swissborg-report-explains-cause-of-the-death-spiral-of-ust/\">collapse of the Terra stablecoin</a>, UST, where users who had wrapped UST on Wormhole lost all their funds. </p>\n<p>\\\n<em>Check out&nbsp;<a href=\"https://cryptoslate.com/coinbase-users-lose-wormhole-luna-ust-after-sending-it-to-the-exchange/\">this article</a>&nbsp;for more details of what happened.</em></p>\n<h2 id=\"hardronnetworkscollidertreasury\">Hardron Network’s Collider Treasury</h2>\n<p>According to Shamil, Hardron Network offers solutions to such scenarios with its “<strong>collider treasury</strong>” where bridging only occurs with liquid assets. </p>\n<p>\\</p>\n<blockquote>\n  <p><strong>When a token’s value plunges to 0, users would lose only about 50% of their funds.</strong> </p>\n</blockquote>\n<p>\\\nThe Collider also uses a collider aggregation proxy to detect price discrepancies of the same token on different chains. </p>\n<p>\\\nSuppose there is a price difference of more than 2%. In that case, the Collider helps to align the markets by stabilizing the prices to prevent huge losses to liquidity providers during volatile market conditions.</p>\n<p>\\\nWith so many layer-1 and layer-2 blockchains being created and built upon, the conversation around the need for an interoperable future has never been more important. </p>\n<p>\\\nWhile there are still many challenges related to cross-chain bridges, work is being done by Shamil and Hardron Network to improve the interoperability of dApps across the different ecosystems while maintaining a high level of security.</p>\n<p>\\\nThe Blockchain Oracle Summit was the world’s first conference to focus solely on oracle security and design. Leading builders from across the ecosystem gathered in Berlin to take deep dives into their work, facilitating the transfer and use of data on-chain.</p>","content:encodedSnippet":"In the presentation below, Shamil Khalilov, founder and CTO of Hardron Network, evaluates the challenges faced by layer-2 cross-chain bridges and how Hardron aims to solve these issues.\nhttps://youtu.be/w2vMuwQLmuc?embedable=true\nBelow you will find more elaboration on key points highlighted during his talk.\nWhat is Hardron Network\nHardron Network is a layer-2 cross-chain bridge built on the Interchain network. Shamil Khalilov is the founder and CTO of the protocol. He has spent the last two years focussing exclusively on building bridges on layer-2 networks in order to address the liquidity issue that many well-known bridging protocols face.\n\\\nShamil also played a major role in developing the Neutrino Protocol, an algorithmic price-stable assetization protocol. It enables the creation of stablecoins pegged to real-world assets such as commodities and national currencies.\n\\\nMore in-depth information about Neutrino can be found on their page.\nLayer 2 Cross-Chain Bridges\nCross-chain bridges enable the transfer of data and digital assets across different blockchains. Blockchains typically operate in silos and cannot interact with other blockchain ecosystems.\n\\\n\n  \nCross-chain bridges help users access and interact with dApps on different blockchains, thus facilitating a more  interoperable Web3 ecosystem. Layer 2 cross-chain bridges are – obviously – bridges built on Layer 2 blockchains.\n\\\nLayer 2 blockchains are secondary networks built on top of underlying layer-1 protocols. Some examples of layer-2 blockchains include the Lightning Network, which is built on top of Bitcoin; and Polygon or Metis, which are built on top of Ethereum.\n\\\nThese layer-2 networks help to ease congestion on the networks they are built on, thus improving the efficiency and overall scalability of the system.\n\\\nA more detailed explanation of layer 1s and layer 2s can be found in this article.\n\\\nIn his presentation, Shamil highlights some of the biggest challenges related to cross-chain bridges. He introduces popular examples of cross-chain bridges like Wormhole and Multichain, and explains how these protocols address those issues.\nWormhole’s Recursive Wrapping Problem: Explained\nWormhole is a cross-chain bridge built on Solana. The protocol bridges assets by locking users’ assets in smart contracts and minting new wrapped tokens on the destination chain.\n\\\n\n  \nWrapped tokens are tokens that have their value pegged to other cryptocurrencies that are native to other blockchains.\n\\\nAn example of a wrapped token is Wrapped Bitcoin (WBTC) - an ERC20 token on the Ethereum Blockchain. WBTC brings the ability to trade BTC on other blockchains like Ethereum and Solana. Wrapped tokens are one of the key elements that facilitate interoperability between blockchains.\n\\\nShamil discovered that while the Wormhole system has a healthy liquidity of tokens and is considered quite trustless with 19 validators, it faces a critical issue called the “recursive wrapping problem.”\n\\\nThe recursive wrapping problem arises when the target chain cannot distinguish the origin chain of a wrapped token. For example, if a user wraps USDC on Ethereum and Polygon, then wants to send them to Solana using Wormhole, the system would recognize them as two different tokens, naming them as “Ethereum Wrapped USDC” and “Polygon Wrapped USDC” correspondingly.\n\\\nMore details about the inner workings of Wormhole can be found in this video:\nhttps://www.youtube.com/embed/ngnWF5widJU?embedable=true\nMultichain’s Permissioned Wrapped Token Listing: An Alternative\nAccording to Shamil, one huge challenge faced by many cross-chain bridges is that most of the liquidity is locked on the Ethereum network and maintaining liquidity on Ethereum costs a lot in gas fees. \n\\\nHowever, Multichain solves this issue for some tokens with permissioned wrapped token listing where users have to fill in a google form to wrap a token. Users can transfer their wrapped tokens across different chains without interacting with Ethereum, thus helping save on gas fees.\n\\\nMore information about how Multichain works can be found in their documentation here.\nThe Liquidity Problem in Bridges\nOther issues Shamil brings to light are the scarcity of liquid-wrapped tokens as well as price discrepancies of the same token on different blockchains. The lack of wrapped token liquidity would result in much higher market volatility. \n\\\nLower liquidity levels would also make cross-chain bridges far more susceptible to market manipulations. \n\\\nIn contrast, high liquidity would mean a much more stable market. \n\\\nShamil provides the example of the collapse of the Terra stablecoin, UST, where users who had wrapped UST on Wormhole lost all their funds. \n\\\nCheck out this article for more details of what happened.\nHardron Network’s Collider Treasury\nAccording to Shamil, Hardron Network offers solutions to such scenarios with its “collider treasury” where bridging only occurs with liquid assets. \n\\\n\n  \nWhen a token’s value plunges to 0, users would lose only about 50% of their funds. \n\\\nThe Collider also uses a collider aggregation proxy to detect price discrepancies of the same token on different chains. \n\\\nSuppose there is a price difference of more than 2%. In that case, the Collider helps to align the markets by stabilizing the prices to prevent huge losses to liquidity providers during volatile market conditions.\n\\\nWith so many layer-1 and layer-2 blockchains being created and built upon, the conversation around the need for an interoperable future has never been more important. \n\\\nWhile there are still many challenges related to cross-chain bridges, work is being done by Shamil and Hardron Network to improve the interoperability of dApps across the different ecosystems while maintaining a high level of security.\n\\\nThe Blockchain Oracle Summit was the world’s first conference to focus solely on oracle security and design. Leading builders from across the ecosystem gathered in Berlin to take deep dives into their work, facilitating the transfer and use of data on-chain.","dc:creator":"Blockchain Oracle Summit","content":"Shamil Khalilov, founder and CTO of Hardron Network, evaluates the challenges faced by layer-2 cross-chain bridges and how Hardron aims to solve these issues. Layer 2 blockchains are secondary networks built on top of underlying layer-1 protocols. Shamil also played a major role in developing the Neutrino Protocol, an algorithmic price-stable assetization protocol. In his presentation, Shamil highlights some of the biggest challenges related to cross-chains.","contentSnippet":"Shamil Khalilov, founder and CTO of Hardron Network, evaluates the challenges faced by layer-2 cross-chain bridges and how Hardron aims to solve these issues. Layer 2 blockchains are secondary networks built on top of underlying layer-1 protocols. Shamil also played a major role in developing the Neutrino Protocol, an algorithmic price-stable assetization protocol. In his presentation, Shamil highlights some of the biggest challenges related to cross-chains.","guid":"https://hackernoon.com/cross-chain-liquidity-issues-and-how-a-collider-aggregation-proxy-can-solve-them?source=rss","categories":["oraclesummit","crosschain-bridge","blockchain-oracles","hardronnetwork","ethereum","good-company","wrapped-tokens","recursive-wrapping-wormhole","hackernoon-es","hackernoon-hi","hackernoon-zh","hackernoon-vi","hackernoon-fr","hackernoon-pt","hackernoon-ja"],"isoDate":"2022-12-15T08:38:32.000Z","from":"https://hackernoon.com/feed","hashId":"806185025b30b27c11fbd529c8d9f281"},{"creator":"Brian Wallace","title":"What Will the Jobs of the Future Look Like?","link":"https://hackernoon.com/what-will-the-jobs-of-the-future-look-like?source=rss","pubDate":"Thu, 15 Dec 2022 08:44:27 GMT","content:encoded":"<div class=\"paragraph\">With the condition of the economy being as uncertain as ever, it’s important to understand what this means when it comes to the jobs of the future. Workers between the ages of 18 and 24 are now more likely to change jobs <a href=\"https://www.zippia.com/advice/career-change-statistics/#:~:text=In%20the%20United%20States%2C%20people,change%20jobs%20about%201.9%20times.\">about five times on average,</a> which is about twice as many job changes compared to the older generations. In fact, more than 90% of people stated feeling happier at their jobs when they have more control over their work hours and the opportunity to work remotely with about 61% of workers considering switching jobs if they are able to work from home. </div><div class=\"paragraph\"><a href=\"https://hackernoon.com/how-remote-working-will-reshape-the-world-by-2030-6x2035cb\">Working from home</a> comes with several benefits, including gaining more time with family, saving more money, and increasing morale which all accumulate into increased happiness experienced outside of work. The <a href=\"https://www.executiveplacements.com/jobs-of-the-future.asp\">jobs of the future</a> would entail changes to the workplace that resonate with our new needs, such as having workspaces designed for comfort with attractive perks that include nap rooms and the ability to bring your pets to work. Other changes could also include having more choices in where you want to work, sharing ideas with workers across different groups and locations, and using digital assistants to help complete assignments.</div><div class=\"paragraph\">As companies continue to use more technology to streamline work, it’s important for workers to value their creativity and human relationships in order to hold a successful career. Skills like cognitive flexibility, people management, emotional intelligence, and innovation will remain important for jobs of the future. </div><div class=\"paragraph\">In recent years, there have been particular <a href=\"https://www.bls.gov/ooh/fastest-growing.htm\">occupations that have grown quickly</a> and are predicted to continuously grow at a fast pace for the next few years. For example, home health aides are expected to add 924,000 new jobs by 2031 with a median annual salary of $29,430. Restaurant cooks are also predicted to add at least 459,900 new jobs by 2031 with a median annual salary of $39,010. Software developers come next with about 370,600 new jobs added to the job market within 10 years with an appealing median annual salary of $120,730. </div><div class=\"paragraph\">The job landscape is continuously changing, so it’s best to know what jobs are and will be in high demand in the near future. </div><div class=\"image-container\"><img src=\"https://cdn.hackernoon.com/images/mRtmiu2SfNY3sGIulKnQU0BZTv23-ek93olh.jpeg\" alt=\"\" loading=\"auto\"/></div><div class=\"image-container\"><img src=\"https://cdn.hackernoon.com/images/mRtmiu2SfNY3sGIulKnQU0BZTv23-xra3obp.jpeg\" alt=\"\" loading=\"auto\"/></div><div class=\"paragraph\"></div>","content:encodedSnippet":"With the condition of the economy being as uncertain as ever, it’s important to understand what this means when it comes to the jobs of the future. Workers between the ages of 18 and 24 are now more likely to change jobs about five times on average, which is about twice as many job changes compared to the older generations. In fact, more than 90% of people stated feeling happier at their jobs when they have more control over their work hours and the opportunity to work remotely with about 61% of workers considering switching jobs if they are able to work from home. \nWorking from home comes with several benefits, including gaining more time with family, saving more money, and increasing morale which all accumulate into increased happiness experienced outside of work. The jobs of the future would entail changes to the workplace that resonate with our new needs, such as having workspaces designed for comfort with attractive perks that include nap rooms and the ability to bring your pets to work. Other changes could also include having more choices in where you want to work, sharing ideas with workers across different groups and locations, and using digital assistants to help complete assignments.\nAs companies continue to use more technology to streamline work, it’s important for workers to value their creativity and human relationships in order to hold a successful career. Skills like cognitive flexibility, people management, emotional intelligence, and innovation will remain important for jobs of the future. \nIn recent years, there have been particular occupations that have grown quickly and are predicted to continuously grow at a fast pace for the next few years. For example, home health aides are expected to add 924,000 new jobs by 2031 with a median annual salary of $29,430. Restaurant cooks are also predicted to add at least 459,900 new jobs by 2031 with a median annual salary of $39,010. Software developers come next with about 370,600 new jobs added to the job market within 10 years with an appealing median annual salary of $120,730. \nThe job landscape is continuously changing, so it’s best to know what jobs are and will be in high demand in the near future.","dc:creator":"Brian Wallace","content":"Workers between the ages of 18 and 24 are now more likely to change jobs about five times on average. More than 90% of people stated feeling happier at their jobs when they have more control over their work hours and the opportunity to work remotely. The jobs of the future would entail changes to the workplace that resonate with our new needs, such as having workspaces designed for comfort with attractive perks that include nap rooms and the ability to bring your pets to work. Skills like cognitive flexibility, people management, emotional intelligence, and innovation will remain important for jobs of future.","contentSnippet":"Workers between the ages of 18 and 24 are now more likely to change jobs about five times on average. More than 90% of people stated feeling happier at their jobs when they have more control over their work hours and the opportunity to work remotely. The jobs of the future would entail changes to the workplace that resonate with our new needs, such as having workspaces designed for comfort with attractive perks that include nap rooms and the ability to bring your pets to work. Skills like cognitive flexibility, people management, emotional intelligence, and innovation will remain important for jobs of future.","guid":"https://hackernoon.com/what-will-the-jobs-of-the-future-look-like?source=rss","categories":["jobs","tech-jobs","future","future-of-work","remote-jobs","technology","careers","infographic"],"isoDate":"2022-12-15T08:44:27.000Z","from":"https://hackernoon.com/feed","hashId":"ca67f51e322e55fe49c249784fc149e1"},{"creator":"Sam Bankman-Fried","title":"'I would like to start by formally stating, under oath: I fucked up'","link":"https://hackernoon.com/i-would-like-to-start-by-formally-stating-under-oath-i-fucked-up?source=rss","pubDate":"Thu, 15 Dec 2022 10:25:35 GMT","content:encoded":"<p>:::tip\nSam Bankman-Fried’s Written Testimony Notes Dec 12, 2022, is part of&nbsp;<strong><a href=\"https://hackernoon.com/u/legalpdf?ref=hackernoon.com\">HackerNoon’s Legal PDF Series</a></strong>. SBF was scheduled to testify before Congress a day before his <a href=\"https://hackernoon.com/it-happened-sbf-arrested-in-the-bahamas-per-criminal-charges-and-extradition-request-by-the-us\">arrest</a> on Dec 12, 2022 in the Bahamas. So, these are the notes that he would have presented in front of Congress that we never actually got to hear. You can jump to any part <a href=\"https://hackernoon.com/what-sbf-would-have-testified-in-front-of-congress\">here</a>.</p>\n<p>This is part 1 of 11.</p>\n<p>:::</p>\n<p>\\\n \\n I would like to start by formally stating, under oath:</p>\n<p>\\\nI fucked up.</p>\n<p>\\\nI know that it doesn’t mean much to say that I’m sorry. And so I’m dedicating as much of myself as I can to doing right by customers. When all is said and done, I’ll judge myself primarily by one metric: whether I have eventually been able to make customers whole. If I fail our customers in this regard, I have failed myself.</p>\n<p>\\\nLast year, my net worth was valued at $20b.</p>\n<p>\\\nToday, I would be wrong to say that I have nothing: I have a loving family, and food on my plate, and that’s more than life has given billions of people. But last I saw, I believe my bank account had about $100k in it. I don’t know for sure, because I have been denied access to many of my own personal passwords, data, documents, and accounts.</p>\n<p>\\\nAs of today, I and many other members of FTX International’s former management team are missing access to key data–data that could help inform customers, inform the Chapter 11 team’s decisions, and inform foreign regulators looking after FTX International. <a href=\"https://hackernoon.com/the-ftx-sbf-chapter-11-court-filing-by-john-r-ray-iii\">Nearly all of this data is held by the Chapter 11 team</a>.</p>\n<p>\\\nIn fact, many of us are still missing access to our own personal data, which is being held hostage by the Chapter 11 team’s leadership. When we have asked for access to our own personal data and passwords, an example response reads “you should take steps, as we’ve suggested to others in the same position, to reset 2FA/passwords for any relevant personal accounts”.</p>\n<p>\\\nAs such, much of my testimony is less confident and detailed than I would want it to be, and I apologize if I am unable to confidently answer completely reasonable questions. I unfortunately cannot access most of FTX’s current or historical data right now in order to explore or confirm my understanding. I also cannot access most of my own notes, writings, spreadsheets, data, or email. Mr. Ray’s team has even refused to return to me my credentials for purely personal accounts. I deeply regret giving in to pressure to sign forms that precipitated the Chapter 11 filing just a few days after FTX International became potentially insolvent. Among other things, the Chapter 11 team was thrust into a very difficult situation, and I worry that they were given very misleading information by a few members of the FTX US team when they joined. They are trying to manage multiple complex global entities and systems without support from many of the teams who used to run them. I believe it will be extremely hard, if not impossible, for the Chapter 11 team to move forward constructively without working cooperatively with the many foreign jurisdictions that have direct regulatory and operational control over FTX International and its subsidiaries.</p>\n<p>\\\nI have offered, many times, to help the Chapter 11 team. To cite just one example, I would have been able to easily collect some pieces of data they expressed an inability to find in their court filings. I have not received responses to those offers, or to any other messages I have sent them.</p>\n<p>\\\nI have reached out to Mr. Ray and the Chapter 11 team numerous times. Sometimes I’ve been requesting access to my own data, but other times I’ve been attempting to alert them to potentially important information for their jobs and duties to creditors and customers of FTX.</p>\n<p>\\\nI have sent five emails to Mr. Ray. Mr. Ray has never responded, nor has he reached out to me to communicate in any other ways.</p>\n<p>\\\nHe has not responded, for instance, to an email of mine that stated: “I have potentially pertinent information concerning future opportunities and financing for FTX and its creditors. I also believe that I have relevant financial information about FTX US, and further that I have potentially relevant regulatory information concerning FTX. I would love to talk to you, whether it's via email or phone, and to work constructively with you and the Chapter 11 team to do what's best for customers.”</p>\n<p>\\\nTo the best of my knowledge, FTX US has been and remains solvent, and could pay off all of its customers in full tomorrow. Unfortunately, the Chapter 11 team has frozen the FTX US exchange, blocking customers’ access to their account information and funds.</p>\n<p>\\\nThe customers who have lost assets are those who traded on the FTX International platforms, which do not accept US residents. My primary focus right now is to do right by the customers of FTX International who were hurt. I am fighting to make these customers as whole as I can, and I will keep doing so as long as I see any pathway forward, because that is my duty.</p>\n<p>\\\nI believe that there is a credible path forward to put together billions of dollars of additional funds for FTX International customers. That would involve significant external financing, which in turn I believe would require the FTX exchange to restart operations. Doing so would be significantly easier if the Chapter 11 team worked cooperatively with the foreign jurisdictions that have regulatory authority over FTX International and its subsidiaries.</p>\n<p>\\\nI have heard complaints that the Chapter 11 team is refusing to respond to regulatory inquiries from foreign regulators, sometimes at the risk of employees going to jail. I have also heard complaints of the Chapter 11 team freezing or otherwise interfering with funds duly belonging to various operating entities of FTX International. I hope that this is greatly exaggerated, or at least that it was a product of an initial unfamiliarity with the company and industry that has now passed. It has been a month since the Chapter 11 filing and the password to my LinkedIn account still hasn’t been returned, though, so I’m not overly optimistic.</p>\n<p>\\\nI have a duty towards the colleagues and supporters who fought for FTX day after day, and who were deeply hurt by a collapse they don’t bear any responsibility for.</p>\n<p>\\\n\\</p>\n<p>:::tip\nContinue reading <a href=\"https://hackernoon.com/preview/NUC9epa2cBtiSveVEVhs\">here</a></p>\n<p>:::</p>\n<p>\\\n\\</p>","content:encodedSnippet":":::tip\nSam Bankman-Fried’s Written Testimony Notes Dec 12, 2022, is part of HackerNoon’s Legal PDF Series. SBF was scheduled to testify before Congress a day before his arrest on Dec 12, 2022 in the Bahamas. So, these are the notes that he would have presented in front of Congress that we never actually got to hear. You can jump to any part here.\nThis is part 1 of 11.\n:::\n\\\n \\n I would like to start by formally stating, under oath:\n\\\nI fucked up.\n\\\nI know that it doesn’t mean much to say that I’m sorry. And so I’m dedicating as much of myself as I can to doing right by customers. When all is said and done, I’ll judge myself primarily by one metric: whether I have eventually been able to make customers whole. If I fail our customers in this regard, I have failed myself.\n\\\nLast year, my net worth was valued at $20b.\n\\\nToday, I would be wrong to say that I have nothing: I have a loving family, and food on my plate, and that’s more than life has given billions of people. But last I saw, I believe my bank account had about $100k in it. I don’t know for sure, because I have been denied access to many of my own personal passwords, data, documents, and accounts.\n\\\nAs of today, I and many other members of FTX International’s former management team are missing access to key data–data that could help inform customers, inform the Chapter 11 team’s decisions, and inform foreign regulators looking after FTX International. Nearly all of this data is held by the Chapter 11 team.\n\\\nIn fact, many of us are still missing access to our own personal data, which is being held hostage by the Chapter 11 team’s leadership. When we have asked for access to our own personal data and passwords, an example response reads “you should take steps, as we’ve suggested to others in the same position, to reset 2FA/passwords for any relevant personal accounts”.\n\\\nAs such, much of my testimony is less confident and detailed than I would want it to be, and I apologize if I am unable to confidently answer completely reasonable questions. I unfortunately cannot access most of FTX’s current or historical data right now in order to explore or confirm my understanding. I also cannot access most of my own notes, writings, spreadsheets, data, or email. Mr. Ray’s team has even refused to return to me my credentials for purely personal accounts. I deeply regret giving in to pressure to sign forms that precipitated the Chapter 11 filing just a few days after FTX International became potentially insolvent. Among other things, the Chapter 11 team was thrust into a very difficult situation, and I worry that they were given very misleading information by a few members of the FTX US team when they joined. They are trying to manage multiple complex global entities and systems without support from many of the teams who used to run them. I believe it will be extremely hard, if not impossible, for the Chapter 11 team to move forward constructively without working cooperatively with the many foreign jurisdictions that have direct regulatory and operational control over FTX International and its subsidiaries.\n\\\nI have offered, many times, to help the Chapter 11 team. To cite just one example, I would have been able to easily collect some pieces of data they expressed an inability to find in their court filings. I have not received responses to those offers, or to any other messages I have sent them.\n\\\nI have reached out to Mr. Ray and the Chapter 11 team numerous times. Sometimes I’ve been requesting access to my own data, but other times I’ve been attempting to alert them to potentially important information for their jobs and duties to creditors and customers of FTX.\n\\\nI have sent five emails to Mr. Ray. Mr. Ray has never responded, nor has he reached out to me to communicate in any other ways.\n\\\nHe has not responded, for instance, to an email of mine that stated: “I have potentially pertinent information concerning future opportunities and financing for FTX and its creditors. I also believe that I have relevant financial information about FTX US, and further that I have potentially relevant regulatory information concerning FTX. I would love to talk to you, whether it's via email or phone, and to work constructively with you and the Chapter 11 team to do what's best for customers.”\n\\\nTo the best of my knowledge, FTX US has been and remains solvent, and could pay off all of its customers in full tomorrow. Unfortunately, the Chapter 11 team has frozen the FTX US exchange, blocking customers’ access to their account information and funds.\n\\\nThe customers who have lost assets are those who traded on the FTX International platforms, which do not accept US residents. My primary focus right now is to do right by the customers of FTX International who were hurt. I am fighting to make these customers as whole as I can, and I will keep doing so as long as I see any pathway forward, because that is my duty.\n\\\nI believe that there is a credible path forward to put together billions of dollars of additional funds for FTX International customers. That would involve significant external financing, which in turn I believe would require the FTX exchange to restart operations. Doing so would be significantly easier if the Chapter 11 team worked cooperatively with the foreign jurisdictions that have regulatory authority over FTX International and its subsidiaries.\n\\\nI have heard complaints that the Chapter 11 team is refusing to respond to regulatory inquiries from foreign regulators, sometimes at the risk of employees going to jail. I have also heard complaints of the Chapter 11 team freezing or otherwise interfering with funds duly belonging to various operating entities of FTX International. I hope that this is greatly exaggerated, or at least that it was a product of an initial unfamiliarity with the company and industry that has now passed. It has been a month since the Chapter 11 filing and the password to my LinkedIn account still hasn’t been returned, though, so I’m not overly optimistic.\n\\\nI have a duty towards the colleagues and supporters who fought for FTX day after day, and who were deeply hurt by a collapse they don’t bear any responsibility for.\n\\\n\\\n:::tip\nContinue reading here\n:::\n\\\n\\","dc:creator":"Sam Bankman-Fried","content":"What SBF would have said had he testified before congress - Part 1 of 11. ","contentSnippet":"What SBF would have said had he testified before congress - Part 1 of 11.","guid":"https://hackernoon.com/i-would-like-to-start-by-formally-stating-under-oath-i-fucked-up?source=rss","categories":["sbf","ftx-bankruptcy","sam-bankman-fried","wunderkind","ftx","under-oath","ceo-apologies","i-fucked-up"],"isoDate":"2022-12-15T10:25:35.000Z","from":"https://hackernoon.com/feed","hashId":"7fcad875f919e9bb3f6659fdca21f90f"},{"creator":"Sam Bankman-Fried","title":"WTF happened, according to SBF","link":"https://hackernoon.com/wtf-happened-according-to-sbf?source=rss","pubDate":"Thu, 15 Dec 2022 10:37:48 GMT","content:encoded":"<p>:::tip\nSam Bankman-Fried’s Written Testimony Notes Dec 12, 2022, is part of&nbsp;<strong><a href=\"https://hackernoon.com/u/legalpdf?ref=hackernoon.com\">HackerNoon’s Legal PDF Series</a></strong>. SBF was scheduled to testify before Congress a day before his <a href=\"https://hackernoon.com/it-happened-sbf-arrested-in-the-bahamas-per-criminal-charges-and-extradition-request-by-the-us\">arrest</a> on Dec 12, 2022 in the Bahamas. So, these are the notes that he would have presented in front of Congress that we never actually got to hear. You can jump to any part <a href=\"https://hackernoon.com/what-sbf-would-have-testified-in-front-of-congress\">here</a>.</p>\n<p>This is part 2 of 11.</p>\n<p>:::</p>\n<p>\\</p>\n<h2 id=\"whathappened\">What Happened</h2>\n<p>\\\nThis reconstruction of events concerns FTX International, a non-US crypto exchange for non-Americans, run out of The Bahamas and not regulated in the US. To my knowledge, FTX US–a separate, US-based exchange that does accept Americans–is fully solvent, and thus all US customers could and should be made whole immediately.</p>\n<p>\\\nI wish that I could give a fuller account of what happened. Unfortunately I don’t have access to much of the relevant data right now. Here is a reconstruction of events to the best of my recollection.</p>\n<p>\\</p>\n<ol>\n<li><p>I started Alameda Research, a private crypto trading firm, in 2017.</p>\n<p>\\</p></li>\n<li><p>I started FTX International, a non-US crypto exchange for non-Americans, in 2019. I began transitioning away from an active role in Alameda Research then.</p>\n<p>\\</p></li>\n<li><p>I started FTX US, a US crypto exchange that does accept Americans, in 2020.</p>\n<p>\\</p></li>\n<li><p>In reconstructing the events of 2021-2022, I am relying on memory and extrapolations, as I was not fully aware of many of the critical events at the time they happened and don’t have access to the relevant data right now that would allow me to confirm or disconfirm my best guess at this point. In particular, I was not running Alameda Research this past year.</p>\n<p>\\</p></li>\n<li><p>FTX is a derivatives exchange. As is true for most financial exchanges, users are permitted to put on margined or leveraged positions. This means that users are allowed to put down less than the full cost of their positions, with their obligation to repay backed by posted collateral. A significant percentage of customers on FTX engaged in margin trading. Alameda Research was one such user.</p></li>\n<li><p>FTX was licensed and regulated to operate by regulators globally, including in The Bahamas, Switzerland, Japan, Australia, Cyprus, and Dubai.</p></li>\n<li><p>Over the past year, as markets crashed, Alameda’s assets fell substantially</p>\n<ol>\n<li><p>In late 2021, I believe that Alameda Research likely had a Net Asset Value (NAV) of substantially over $50b, marked to market.</p>\n<pre><code> (1) I believe that Alameda was likely leveraged long: perhaps about 1.1x leveraged.  That is, it had corresponding assets for roughly 90% percent of its position, borrowing the remaining 10%. That was roughly 1/20 of the maximum leverage FTX allowed, and roughly 1/3 of the leverage assumed by the average FTX margin trader.\n</code></pre></li>\n<li><p>In early November, 2022, over a three-day period, the market value of assets that Alameda Research held declined dramatically–I believe by more than 50%.</p></li>\n<li><p>After that crash, Alameda had, to my knowledge, roughly $11b of assets and roughly $11b of liabilities, marked to market, including its position on FTX. However, many of the assets were not very liquid, and could not be quickly sold. I believe that roughly $3b of the assets were highly liquid, leaving a liquidity shortfall of roughly $8b.</p></li>\n<li><p>This is a very rough approximation of Alameda Research’s net assets and liabilities over time, in billions. I do not have access to all of this data now, and did not know much of this at the time; thus these numbers may well be incorrect or incomplete.</p></li></ol></li>\n</ol>\n<p>|    | Assets | Liabilities | NAV | Liquid |\n|----|----|----|----|----|\n| Now | 11 | -11 | 0 | -8 |\n| October | 21 | -11 | 10 | -8 |\n| Pre Luna | 66 | -15 | 52 | -8 |\n| Late 2021 | 114 | -15 | 99 | -8 |</p>\n<ol start=\"4\">\n<li>At the same time, there was a ‘run on the bank’ on FTX. There were, I believe, roughly $4b of client withdrawals per day, starting shortly after Changpeng Zhao (CZ), Binance’s CEO, tweeted on November 6th that he would sell all of his company’s holdings in FTT, a token that Alameda Research had substantial holdings in.</li>\n<li>This put extreme pressure on FTX, and forced the exchange to margin call substantial customer positions. Alameda Research was not able to deliver sufficient liquid assets for its margin call, and defaulted against FTX International. Thus, FTX International was unable to meet customer withdrawal requirements.</li>\n</ol>\n<p>\\</p>\n<p>:::tip\nContinue Reading <a href=\"https://hackernoon.com/preview/2Ff6hLWcTzAibruFQHyE\">Here</a>.</p>\n<p>:::</p>\n<p>\\</p>","content:encodedSnippet":":::tip\nSam Bankman-Fried’s Written Testimony Notes Dec 12, 2022, is part of HackerNoon’s Legal PDF Series. SBF was scheduled to testify before Congress a day before his arrest on Dec 12, 2022 in the Bahamas. So, these are the notes that he would have presented in front of Congress that we never actually got to hear. You can jump to any part here.\nThis is part 2 of 11.\n:::\n\\\nWhat Happened\n\\\nThis reconstruction of events concerns FTX International, a non-US crypto exchange for non-Americans, run out of The Bahamas and not regulated in the US. To my knowledge, FTX US–a separate, US-based exchange that does accept Americans–is fully solvent, and thus all US customers could and should be made whole immediately.\n\\\nI wish that I could give a fuller account of what happened. Unfortunately I don’t have access to much of the relevant data right now. Here is a reconstruction of events to the best of my recollection.\n\\\n\n\nI started Alameda Research, a private crypto trading firm, in 2017.\n\\\nI started FTX International, a non-US crypto exchange for non-Americans, in 2019. I began transitioning away from an active role in Alameda Research then.\n\\\nI started FTX US, a US crypto exchange that does accept Americans, in 2020.\n\\\nIn reconstructing the events of 2021-2022, I am relying on memory and extrapolations, as I was not fully aware of many of the critical events at the time they happened and don’t have access to the relevant data right now that would allow me to confirm or disconfirm my best guess at this point. In particular, I was not running Alameda Research this past year.\n\\\nFTX is a derivatives exchange. As is true for most financial exchanges, users are permitted to put on margined or leveraged positions. This means that users are allowed to put down less than the full cost of their positions, with their obligation to repay backed by posted collateral. A significant percentage of customers on FTX engaged in margin trading. Alameda Research was one such user.\n\n\nFTX was licensed and regulated to operate by regulators globally, including in The Bahamas, Switzerland, Japan, Australia, Cyprus, and Dubai.\n\n\nOver the past year, as markets crashed, Alameda’s assets fell substantially\nIn late 2021, I believe that Alameda Research likely had a Net Asset Value (NAV) of substantially over $50b, marked to market.\n (1) I believe that Alameda was likely leveraged long: perhaps about 1.1x leveraged.  That is, it had corresponding assets for roughly 90% percent of its position, borrowing the remaining 10%. That was roughly 1/20 of the maximum leverage FTX allowed, and roughly 1/3 of the leverage assumed by the average FTX margin trader.\n\n\n\nIn early November, 2022, over a three-day period, the market value of assets that Alameda Research held declined dramatically–I believe by more than 50%.\n\n\nAfter that crash, Alameda had, to my knowledge, roughly $11b of assets and roughly $11b of liabilities, marked to market, including its position on FTX. However, many of the assets were not very liquid, and could not be quickly sold. I believe that roughly $3b of the assets were highly liquid, leaving a liquidity shortfall of roughly $8b.\n\n\nThis is a very rough approximation of Alameda Research’s net assets and liabilities over time, in billions. I do not have access to all of this data now, and did not know much of this at the time; thus these numbers may well be incorrect or incomplete.\n\n\n\n|    | Assets | Liabilities | NAV | Liquid |\n|----|----|----|----|----|\n| Now | 11 | -11 | 0 | -8 |\n| October | 21 | -11 | 10 | -8 |\n| Pre Luna | 66 | -15 | 52 | -8 |\n| Late 2021 | 114 | -15 | 99 | -8 |\nAt the same time, there was a ‘run on the bank’ on FTX. There were, I believe, roughly $4b of client withdrawals per day, starting shortly after Changpeng Zhao (CZ), Binance’s CEO, tweeted on November 6th that he would sell all of his company’s holdings in FTT, a token that Alameda Research had substantial holdings in.\nThis put extreme pressure on FTX, and forced the exchange to margin call substantial customer positions. Alameda Research was not able to deliver sufficient liquid assets for its margin call, and defaulted against FTX International. Thus, FTX International was unable to meet customer withdrawal requirements.\n\\\n:::tip\nContinue Reading Here.\n:::\n\\","dc:creator":"Sam Bankman-Fried","content":"What SBF would have testified in front of Congress - Part 2 of 11: What Happened. ","contentSnippet":"What SBF would have testified in front of Congress - Part 2 of 11: What Happened.","guid":"https://hackernoon.com/wtf-happened-according-to-sbf?source=rss","categories":["sbf","ftx","ftx-bankruptcy","sam-bankman-fried","alameda","margin-trading","binance","wtf-happened"],"isoDate":"2022-12-15T10:37:48.000Z","from":"https://hackernoon.com/feed","hashId":"dbee76e0a4d2c600b737c969e4de990d"},{"creator":"Sam Bankman-Fried","title":"SBF blamed market conditions for Alameda's insolvency ","link":"https://hackernoon.com/sbf-blamed-market-conditions-for-alamedas-insolvency?source=rss","pubDate":"Thu, 15 Dec 2022 10:47:48 GMT","content:encoded":"<p>:::tip\nSam Bankman-Fried’s Written Testimony Notes Dec 12, 2022, is part of&nbsp;<strong><a href=\"https://hackernoon.com/u/legalpdf?ref=hackernoon.com\">HackerNoon’s Legal PDF Series</a></strong>. SBF was scheduled to testify before Congress a day before his <a href=\"https://hackernoon.com/it-happened-sbf-arrested-in-the-bahamas-per-criminal-charges-and-extradition-request-by-the-us\">arrest</a> on Dec 12, 2022 in the Bahamas. So, these are the notes that he would have presented in front of Congress that we never actually got to hear. You can jump to any part&nbsp;<strong><a href=\"https://hackernoon.com/what-sbf-would-have-testified-in-front-of-congress?ref=hackernoon.com\">here</a></strong>.</p>\n<p>This is part 3 of 11.</p>\n<p>:::</p>\n<p><em>Feature Image: HackerNoon’s Stable Diffusion AI, prompt “classic hedge fund risks”</em></p>\n<p>\\</p>\n<h2 id=\"whatwentwrong\">What went wrong?</h2>\n<p>A large number of things had to go wrong for this to happen. Because I was not running\nAlameda, I was not aware of some of the critical events at the time. But I <em>was</em> running FTX, and\nthat means it was ultimately my responsibility to do right by FTX’s customers.</p>\n<p>\\</p>\n<ol>\n<li><p><strong>Alameda Research became insolvent when the economic environment changed.</strong></p></li>\n<li><p>Alameda put on a margin position that was sustainable in the economic environment of late 2021, with roughly 10% leverage. As tightening monetary policy, a war, and supply chain problems hit throughout 2022, asset prices crashed: I believe that Alameda’s assets fell by roughly 90% over the course of the year, and so even 10% leverage was too much.</p></li>\n<li><p>A run on the bank forced immediate liquid delivery from FTX. i) This meant that FTX had only a few days to margin call a substantial, fairly illiquid margin position.</p></li>\n<li><p>A failure of hedges.</p>\n<ol>\n<li>As best as I can reconstruct looking back, in late 2021, Alameda Research was not sufficiently hedged; I believe that it had a total margin position, much of which was not on FTX, that was roughly $8b in size, and likely had on roughly $2b of hedges.</li>\n<li>By the fall of 2022, I believe that Alameda Research had a margin position of roughly $8b, and likely had roughly $8b of hedges. However, the crash that occurred in November 2022 was not a broad market crash, or even a broad crypto market crash. From November 7th to November 9th, Bitcoin was down roughly 17% and equities markets were roughly flat, but many of Alameda’s assets were down more than 50%. And so Alameda’s hedges didn’t work.</li>\n<li>This is the classic ‘hedge fund risk’--that all of a firm’s positions can become highly correlated, even if some are thought to be hedges, as happened with e.g. Long-Term Capital Management and in the 2008 financial crisis.</li></ol></li>\n<li><p>Uses of capital:</p>\n<ol>\n<li><p>Piecing together what data I can, in retrospect, Alameda Research’s roughly $8 billion net short margin position in liquid assets lined up with the following approximate expenditures:</p>\n<p>(1) Interest payments to lenders: ~$1b</p>\n<p>(2)VC investments: ~$4b</p>\n<p>(3) Buying back Binance’s stake in FTX: ~$3b</p>\n<p>\\</p></li></ol></li>\n</ol>\n<p>:::tip\nContinue Reading <a href=\"https://hackernoon.com/preview/KbylEWjEGImxbztoddMy\">Here</a></p>\n<p>:::</p>\n<p>\\</p>","content:encodedSnippet":":::tip\nSam Bankman-Fried’s Written Testimony Notes Dec 12, 2022, is part of HackerNoon’s Legal PDF Series. SBF was scheduled to testify before Congress a day before his arrest on Dec 12, 2022 in the Bahamas. So, these are the notes that he would have presented in front of Congress that we never actually got to hear. You can jump to any part here.\nThis is part 3 of 11.\n:::\nFeature Image: HackerNoon’s Stable Diffusion AI, prompt “classic hedge fund risks”\n\\\nWhat went wrong?\nA large number of things had to go wrong for this to happen. Because I was not running\nAlameda, I was not aware of some of the critical events at the time. But I was running FTX, and\nthat means it was ultimately my responsibility to do right by FTX’s customers.\n\\\n\n\nAlameda Research became insolvent when the economic environment changed.\n\n\nAlameda put on a margin position that was sustainable in the economic environment of late 2021, with roughly 10% leverage. As tightening monetary policy, a war, and supply chain problems hit throughout 2022, asset prices crashed: I believe that Alameda’s assets fell by roughly 90% over the course of the year, and so even 10% leverage was too much.\n\n\nA run on the bank forced immediate liquid delivery from FTX. i) This meant that FTX had only a few days to margin call a substantial, fairly illiquid margin position.\n\n\nA failure of hedges.\nAs best as I can reconstruct looking back, in late 2021, Alameda Research was not sufficiently hedged; I believe that it had a total margin position, much of which was not on FTX, that was roughly $8b in size, and likely had on roughly $2b of hedges.\nBy the fall of 2022, I believe that Alameda Research had a margin position of roughly $8b, and likely had roughly $8b of hedges. However, the crash that occurred in November 2022 was not a broad market crash, or even a broad crypto market crash. From November 7th to November 9th, Bitcoin was down roughly 17% and equities markets were roughly flat, but many of Alameda’s assets were down more than 50%. And so Alameda’s hedges didn’t work.\nThis is the classic ‘hedge fund risk’--that all of a firm’s positions can become highly correlated, even if some are thought to be hedges, as happened with e.g. Long-Term Capital Management and in the 2008 financial crisis.\n\nUses of capital:\nPiecing together what data I can, in retrospect, Alameda Research’s roughly $8 billion net short margin position in liquid assets lined up with the following approximate expenditures:\n(1) Interest payments to lenders: ~$1b\n(2)VC investments: ~$4b\n(3) Buying back Binance’s stake in FTX: ~$3b\n\\\n\n:::tip\nContinue Reading Here\n:::\n\\","dc:creator":"Sam Bankman-Fried","content":"What SBF would have testified in front of Congress - part 3 of 11 - What Went Wrong with Alameda. ","contentSnippet":"What SBF would have testified in front of Congress - part 3 of 11 - What Went Wrong with Alameda.","guid":"https://hackernoon.com/sbf-blamed-market-conditions-for-alamedas-insolvency?source=rss","categories":["sbf","ftx","ftx-bankruptcy","hedge-fund","risk-management","alameda","insolvency","bank-run"],"isoDate":"2022-12-15T10:47:48.000Z","from":"https://hackernoon.com/feed","hashId":"4df5fc591a3f4dc5013e9dec9ecb7e16"},{"creator":"Sam Bankman-Fried","title":"SBF explained FTX's failure to display Alameda's positions on its dashboard as an 'accounting quirk'","link":"https://hackernoon.com/sbf-explained-ftxs-failure-to-display-alamedas-positions-on-its-dashboard-as-an-accounting-quirk?source=rss","pubDate":"Thu, 15 Dec 2022 10:59:09 GMT","content:encoded":"<p>:::tip\nSam Bankman-Fried’s Written Testimony Notes Dec 12, 2022, is part of&nbsp;<strong><a href=\"https://hackernoon.com/u/legalpdf?ref=hackernoon.com\">HackerNoon’s Legal PDF Series</a></strong>. SBF was scheduled to testify before Congress a day before his <a href=\"https://hackernoon.com/it-happened-sbf-arrested-in-the-bahamas-per-criminal-charges-and-extradition-request-by-the-us\">arrest</a> on Dec 12, 2022 in the Bahamas. So, these are the notes that he would have presented in front of Congress that we never actually got to hear. You can jump to any part&nbsp;<strong><a href=\"https://hackernoon.com/what-sbf-would-have-testified-in-front-of-congress?ref=hackernoon.com\">here</a></strong>.</p>\n<p>This is part 4 of 11.</p>\n<p>:::</p>\n<p><em>Feature Image: HackerNoon’s Midjourney AI, prompt “historical accounting quirks”</em></p>\n<h2 id=\"whatwentwrong\">What went wrong</h2>\n<ol>\n<li><p>Alameda Research became insolvent when the economic environment changed (see <a href=\"https://hackernoon.com/preview/2Ff6hLWcTzAibruFQHyE\">here</a>)</p>\n<p>\\</p></li>\n<li><p><strong>Failures of FTX’s internal controls</strong></p></li>\n<li><p>FTX’s Dashboard:</p>\n<ol>\n<li>FTX’s dashboard for user positions did not display Alameda’s full position size on the platform, because of a historical accounting quirk. I now believe that Alameda’s position was over twice as large as what was displayed. My periodic assessments of the riskiness of our positions were often based on the dashboard’s numbers.</li></ol></li>\n<li><p>Financials:</p>\n<ol>\n<li>FTX had annual audited GAAP financial statements, which to my knowledge were generally correct</li>\n<li>However, those were merely for FTX’s corporate financial state, not an audit of customer risk.</li></ol></li>\n<li><p>Risk management:</p>\n<ol>\n<li>While FTX International had a team dedicated to financials, and to many other areas of the business, it did not have a team dedicated to risk management, or to user position monitoring</li>\n<li>I, as CEO, did not put adequate effort into monitoring risk on FTX</li></ol></li>\n</ol>\n<p>\\\n\\</p>\n<p>:::tip\nContinue Reading <a href=\"https://hackernoon.com/preview/KxDGJ1Qq5SwjiCbClLt1\">Here</a></p>\n<p>:::</p>\n<p>\\\n\\</p>","content:encodedSnippet":":::tip\nSam Bankman-Fried’s Written Testimony Notes Dec 12, 2022, is part of HackerNoon’s Legal PDF Series. SBF was scheduled to testify before Congress a day before his arrest on Dec 12, 2022 in the Bahamas. So, these are the notes that he would have presented in front of Congress that we never actually got to hear. You can jump to any part here.\nThis is part 4 of 11.\n:::\nFeature Image: HackerNoon’s Midjourney AI, prompt “historical accounting quirks”\nWhat went wrong\nAlameda Research became insolvent when the economic environment changed (see here)\n\\\nFailures of FTX’s internal controls\n\n\nFTX’s Dashboard:\nFTX’s dashboard for user positions did not display Alameda’s full position size on the platform, because of a historical accounting quirk. I now believe that Alameda’s position was over twice as large as what was displayed. My periodic assessments of the riskiness of our positions were often based on the dashboard’s numbers.\n\nFinancials:\nFTX had annual audited GAAP financial statements, which to my knowledge were generally correct\nHowever, those were merely for FTX’s corporate financial state, not an audit of customer risk.\n\nRisk management:\nWhile FTX International had a team dedicated to financials, and to many other areas of the business, it did not have a team dedicated to risk management, or to user position monitoring\nI, as CEO, did not put adequate effort into monitoring risk on FTX\n\n\\\n\\\n:::tip\nContinue Reading Here\n:::\n\\\n\\","dc:creator":"Sam Bankman-Fried","content":"What SBF would have testified in front of congress, part 4 of 11: Failures of FTX's internal controls. ","contentSnippet":"What SBF would have testified in front of congress, part 4 of 11: Failures of FTX's internal controls.","guid":"https://hackernoon.com/sbf-explained-ftxs-failure-to-display-alamedas-positions-on-its-dashboard-as-an-accounting-quirk?source=rss","categories":["ftx","sbf","accounting-quirk","corporate-finance","risk-management","audit","ftx-bankruptcy","alameda"],"isoDate":"2022-12-15T10:59:09.000Z","from":"https://hackernoon.com/feed","hashId":"7a26d985eb726ebdf8642182db001f95"}]