[{"title":"State of Synthetix Governance","link":"https://messari.io/article/state-of-synthetix-governance","pubDate":"Tue, 13 Dec 2022 15:45:00 +0000","content:encoded":"<div><h2>Key Insights</h2><ul><li>The introduction of the V3 Governance Module (V3GM) marks another evolution of Synthetix’s governance structure and <span>on-chain voting</span> on the <span>Layer-2</span> (L2) Optimism.</li><li>Over the past year, many Synthetix governance proposals focused on building out the Synthetix suite of revenue-driven products, i.e., atomic swaps and perpetual futures.</li><li>Synthetix governance communications could be improved to potentially enhance the quality of decisions and accountability of council members.</li></ul><h2>Background</h2><p>In 2018, Synthetix elected to <a href=\"https://blog.synthetix.io/synthetix-foundation-decommissioned/\">decommission</a> the Synthetix Foundation, a not-for-profit foundation based in Australia, in favor of decentralizing its governance.</p><p>Synthetix’s goal in shifting to a decentralized governance model was to reduce the required trust in the core team and create a censorship-resistant <span>protocol</span> to exchange synthetic assets by building a <span>trustless</span>, <span>permissionless</span>, and immutable protocol. Synthetix Founder Kain Warwick’s initial governance vision did not include on-chain governance due to it being “<a href=\"https://blog.synthetix.io/transition-to-decentralised-governance/#:~:text=The%20second%20aspect,holders%20over%20time.\">fundamentally flawed.</a>” Warwick argued that on-chain governance created a greater project risk to Synthetix than the possibility of the Synthetix Foundation being captured by a bad actor.</p><p>In July 2020, Synthetix fully transitioned from a foundation to a DAO composed of three <span>subDAOs</span>:</p><ul><li>protocolDAO was responsible for protocol upgrades and variable configurations.</li><li>grantsDAO was responsible for funding public goods in the Synthetix ecosystem.</li><li>synthetixDAO was responsible for managing and deploying funds to contributors and other project needs.</li></ul><p></p><img src=\"https://cdn.sanity.io/images/2bt0j8lu/production/89916267e794b9937e25b047a48842904d35d7c5-1600x900.png?w=800\" alt=\"\"><h2>Governance Overview</h2><p>Synthetix governance has been through multiple iterations, including the formation of liquid democracy and the <a href=\"https://messari.io/governor/proposal/bdf13736-7533-4985-817f-858b814cfb51\">dilution</a> of voting power, before the V3 Governance Module (V3GM) introduction in June 2022. <a href=\"https://messari.io/governor/proposal/d38f47b7-2d25-433e-830e-b5fdb35ac34f\">SIP 207: V3GM</a> outlines Synthetix’s latest governance iteration and updating its council-based <a href=\"https://messari.io/dao/synthetix-governance\">governance structure</a> to four councils and one committee.</p><p>Council-based governance is an alternative to the primary governance models of token-weighted and delegated governance. It leans more towards traditional governance models, such as representative democracy and a board of directors. By depending on fewer people with an equal voting power to make decisions, council-based governance seeks to address the shortcomings of its counterparts. Token-weighted and delegated governance often result in voter apathy and a large voting power concentration. To elect council members within the DAO, Synthetix uses a quadratic voting model.</p><img src=\"https://cdn.sanity.io/images/2bt0j8lu/production/758dff8af714a978ecd6f84c6fc15ade9969f713-1280x720.jpg?w=800\" alt=\"\"><h2>V3GM</h2><p>With the V3GM model, all council <a href=\"https://messari.io/governor/proposal/1990e975-81a3-4b9b-b10c-44c6b4b97b04\">nominations</a> and <a href=\"https://messari.io/dao/synthetix-governance?tab=process#:~:text=Synthetix%20Council%20Election\">elections</a> move from an off-chain process on Snapshot to the on-chain Election Module on Optimism. Among many benefits, the transition to on-chain Council elections has increased Synthetix’s decentralization by mitigating the possibility of human interference. The protocolDAO is no longer required to execute off-chain election results and manually transfer the Council NFT to the elected members. Instead, elections will now be conducted on-chain.</p><p>The key considerations Synthetix made when designing V3GM was to optimize for low-cost elections and avoid having signers for the DAO’s multi-sig where tokenholders have no recourse to remove the signers. Thus, Synthetix Core Contributors chose Optimism as a Layer-2 (L2) network to optimize for low-cost <span>gas fees</span> and an inclusive on-chain elections voting process. Since there is a large pool of Synthetix voters on Ethereum <span>Layer-1</span> (L1), V3GM has an intermediary solution that uses a Merkle tree snapshot of L1 debt holders and uploads it into the Optimism L2 instance. This intermediary solution will be replaced once the V2.X debt migration happens.</p><p>The on-chain Election Module has brought a new voting strategy to Synthetix governance:</p><ul><li>The current epoch duration for an elected council member is three months but will change to four months in <a href=\"https://messari.io/governor/proposal/8510c8e4-d3e0-4ae4-8c8d-47a913e48f52\">2023</a>.</li><li>Eligible voters are debt unit tokenholders who have staked their SNX.</li><li>Nominations and elections happen concurrently during a two-week <a href=\"https://messari.io/governor/proposal/1990e975-81a3-4b9b-b10c-44c6b4b97b04\">period</a>.</li><li>Voting power is calculated by the debt share balance.</li><li>One candidate per vote, applying the associated voting power of one voter to the one candidate.</li><li>Voting weight is quadratic, 1 debt unit = sqrt(1) vote, except for the treasury council, which is linear.</li><li>Vote counting is a plurality voting strategy. The candidates with the most voting power will be elected as equal voting members on the respective council.</li><li>The number of elected members:<ul><li>Spartan Council: 8</li><li>Grants Council: 5</li><li>Ambassador Council: 5</li><li>Treasury Council: 4</li></ul></li></ul><h2>Governance Process</h2><p>Proposals fall into one of two categories, Synthetix Improvement Proposal (<a href=\"https://sips.synthetix.io/sips/sip-1/\">SIP</a>) or Synthetix Configuration Change Proposal (<a href=\"https://sips.synthetix.io/sccp/sccp-1/\">SCCP</a>). SIPs implement core changes to the Synthetix Ecosystem. SCCPs modify system configuration variables. SIPs and SCCPs are only voted on by the eight elected Spartan Council members of the current epoch and must follow the specified Synthetix <a href=\"https://messari.io/dao/synthetix-governance?tab=process\">governance process</a>.</p><p></p><img src=\"https://cdn.sanity.io/images/2bt0j8lu/production/d2defc9ffc64cba11682ab32c8df2e5808d6a9a2-1600x900.png?w=800\" alt=\"\"><img src=\"https://cdn.sanity.io/images/2bt0j8lu/production/a312968439be646a909464b9d08ff62fec39ac9c-1600x900.png?w=800\" alt=\"\"><p>In the Synthetix governance process, there are two types of proposals: governance and meta-governance. The proposal type can be found in the Synthetix Proposal Repository in the table at the top of each SIP and SCCP (i.e., <a href=\"https://sips.synthetix.io/sccp/sccp-300/\">SCCP 300</a>). Governance proposals do not need all eight Spartan Council members to vote for a proposal for it to succeed. Meta-governance proposals require all eight Spartan Council members to vote on the proposal for its success. Meta-governance proposals are for any changes in how governance operates, and governance proposals are for any changes affecting protocol updates.</p><h2>Governance Impact on SNX</h2><img src=\"https://cdn.sanity.io/images/2bt0j8lu/production/b2ad7c3a32041fb24a1056f2b8d3fffd813fe756-1600x900.png?w=800\" alt=\"\"><p>Since Jan. 1, 2022, Synthetix governance has had 168 proposals, making it the third most active DAO that Messari Governor monitors. Most proposals this year have been related to revenue generation, following Warwick’s anticipation of this driving the <a href=\"https://mirror.xyz/kain.eth/wstTdM5tz1LqdupcKwBCJBJ-tHNtP-CAITf-ewJqRd0#:~:text=Conclusion,yield%20farming%20wars.\">next DeFi narrative</a>.</p><h3>Staked SNX Percentage</h3><p>As discussed in an earlier <a href=\"https://messari.io/report/governor-note-synthetix-turning-off-the-money-printer?referrer=all-research\">Synthetix Governor Note</a>, multiple proposals throughout 2022 focused on incentivizing greater staked SNX by implementing unsustainable inflationary SNX rewards. The inflationary SNX rewards introduced in various proposals successfully bootstrapped and secured the network at the expense of creating constant SNX sell pressure. SNX stakers could hedge their exposure by continuously selling their newly unlocked SNX each week.</p><p><a href=\"https://messari.io/governor/proposal/b24346ce-2b47-4191-b652-8339995d29ee\">SIP 276: Turn Off The Money Printer</a> was proposed to cap the total supply of SNX at 300 million and stop the unsustainable inflationary SNX rewards. This effort would ensure that the sUSD fee yield per SNX would grow with the protocol’s revenue, since sUSD rewards are based on the trading fees accrued in the Synthetix ecosystem. However, SIP 276 has not yet moved to a Snapshot vote and is currently in limbo as the SIP 276 author (Warwick) decided not to present it publicly. In addition, the Spartan Council decided <a href=\"https://messari.io/governor/proposal/dd8d1a38-de36-4210-a7b4-918ad7d36d62\">SCCP 211</a> (the proposal to reduce SNX inflation by 5% each week) would be sufficient until new Synthetix products are launched. The discussion to terminate SNX inflationary rewards may be revived once the Spartan Council assesses the impact of the new Synthetix products. </p><p>Synthetix initially planned to <a href=\"https://blog.synthetix.io/synthetix-monetary-policy-changes/\">terminate</a> inflationary SNX rewards in March 2023, which would leave SNX with a total supply of ~250 million. However, the <a href=\"https://messari.io/asset/synthetix/historical\">SNX outstanding supply</a> is currently at ~310 million SNX at the time of writing. This effectively makes SIP 276 irrelevant, considering the 300 million SNX circulating has already been surpassed, and ~738,500<strong> </strong>inflationary SNX rewards will be distributed the week of Dec. 7, 2022. The number of rewards distributed will continue to decline by 5% each week<strong>.</strong></p><p>The four proposals that dictated the inflationary rewards were&nbsp; <a href=\"https://messari.io/governor/proposal/c41af42c-d6dd-48c1-9ecc-6d99741ebf00\">SCCP 196</a>, <a href=\"https://messari.io/governor/proposal/825478ee-4de1-4c16-87c4-2e40d4ce4cde\">SIP 202</a>, <a href=\"https://messari.io/governor/proposal/c0e9bfe4-beb1-450c-95db-e8f542f64d69\">SCCP 208</a>, and <a href=\"https://messari.io/governor/proposal/dd8d1a38-de36-4210-a7b4-918ad7d36d62\">SCCP 211</a>. The initial goal of SCCP 196 and SIP 202 were to hit a targeted staked SNX percentage of 85% to bootstrap and secure Synthetix by increasing the weekly SNX rewards to incentivize more SNX tokenholders to stake their SNX. However, these proposals did not <a href=\"https://sips.synthetix.io/sips/sip-276/#:~:text=Recently%20several%20inflation,eliminating%20inflation%20entirely.\">meaningfully impact</a> the staked SNX percentage, and the targeted staked SNX percentage was ultimately lowered to 65%.</p><img src=\"https://cdn.sanity.io/images/2bt0j8lu/production/34f1aa728c78ef1dd28b7d7b200239739716f423-1600x900.png?w=800\" alt=\"\"><p>If <a href=\"https://sips.synthetix.io/sips/sip-300/\">SIP 300</a> and the other V3-related proposals (<a href=\"https://sips.synthetix.io/sips/sip-302/\">SIP 302</a>, <a href=\"https://sips.synthetix.io/sips/sip-308/\">SIP 308</a>, and <a href=\"https://sips.synthetix.io/sips/sip-309/\">SIP 309</a>) are implemented, multi-collateral staking will be accepted as collateral for the Synthetix debt pool. As a result, the staked SNX percentage metric will be less important in V3. Rather than relying on one form of collateral, V3 will allow Synthetix to be more flexible accept various collateral and provide subsequent liquidity to various markets and financial instruments.</p><h3>Atomic Swaps</h3><p>The goal of <a href=\"https://blog.synthetix.io/atomic-exchanges-synthetixs-mainnet-volume/\">atomic swaps</a> is to allow decentralized exchange (DEX) aggregators to conduct&nbsp;Synthetix swaps on Ethereum mainnet in an atomic manner (i.e., that they happen in one trade). For example, an atomic swap could look like this ETH &lt;&gt; sETH &lt;&gt; sUSD &lt;&gt; BTC in one swap. The benefits of atomic swaps are less slippage and lower fees.</p><p>The <a href=\"https://blog.synthetix.io/the-mirarch-release/\">Mirarch release</a> implemented <a href=\"https://messari.io/governor/proposal/1df2304f-869c-4b4e-8394-d1cbdaa691f7\">SIP 198</a>’s atomic exchange functionality update and introduced latency attacks on the Synthetix protocol via atomic swaps on 1inch and Kwenta. This update led to increased Synthetix trade volume and sUSD trade fee rewards because these latency attacks were bots front-running trades to get the best prices. The results were more profitable trades and, ultimately, significant increases in Synthetix trade volume. These latency attacks only affected Synthetix on Ethereum Mainnet. Trades on Optimism are not subject to latency attacks as there is no 10-minute <a href=\"https://blog.synthetix.io/how-fee-reclamation-rebates-work/\">fee reclamation</a> period given its oracle latency.</p><img src=\"https://cdn.sanity.io/images/2bt0j8lu/production/2055c388684d98bb1b7116a56612b731c5206141-1600x900.png?w=800\" alt=\"\"><p>In response to these latency attacks, <a href=\"https://messari.io/governor/proposal/1a0ea134-5967-4248-aa96-1addfa34f5a6\">SIP 267</a> was introduced to allow the Spartan Council to approve protocols (contracts or externally owned addresses) that wanted to implement atomic swaps. By implementing atomic swaps, protocols were given the ability to interact with Synthetix’s core exchange functionalities and set customized parameters. SIP 267 successfully returned trade volumes and the sUSD trading fee rewards back to healthy levels, alleviating the sell pressure on SNX.</p><p>While SIP 267 was successful, the path to success was not so smooth. <a href=\"https://messari.io/governor/proposal/63112e73-daf6-417c-be72-208f4252aeb4\">SCCP 224</a> failed twice, after aiming to limit latency attacks by lowering the atomic volume per block from 5 to 0.5 million sUSD. This short-term fix was rejected by the Spartan Council, as only 4 votes were cast out of a possible 16 over the two votes, signaling SIP 267 and <a href=\"https://messari.io/governor/proposal/060f4321-2b9a-4a57-a03b-2920fa1ea355\">SIP 288</a> were the preferred solutions amongst the Spartan Council. The approval and implementation of SIP 267 and <a href=\"https://messari.io/governor/proposal/060f4321-2b9a-4a57-a03b-2920fa1ea355\">SIP 288</a> (1inch Direct Integration) allow 1inch to include Curve as a path for deep liquidity and less slippage, reducing the likelihood of latency attacks.</p><p>The Spartan Council and Synthetix community’s desire to solve the latency attacks demonstrates the sustainable long-term thinking in Synthetix Governance. The net outcome of solving the latency attacks was an improved trading experience (via lower fees and less slippage) in the Synthetix ecosystem. This long-term thinking has also led the Spartan Council to focus on improving another Synthetix product, perpetual futures.</p><h3>Perpetual Futures</h3><p>There are three perpetual futures proposals (<a href=\"https://sips.synthetix.io/sips/sip-279/\">SIP 279</a>, <a href=\"https://sips.synthetix.io/sips/sip-280/\">SIP 280</a>, and <a href=\"https://sips.synthetix.io/sips/sip-281/\">SIP 281</a>) in the draft status that aim to upgrade <a href=\"https://sips.synthetix.io/sips/sip-80/\">synthetic perpetual futures</a> [V1] to V2. Upgrading the perpetual futures contracts should improve the constrained scalability and efficiency due to the following limitations:</p><ul><li>Capital inefficiency — restrictive open interest limits.</li><li>Funding rate volatility.</li><li>High fees and wide spreads.</li></ul><p>These proposals demonstrate that Synthetix aims to be a market leader of perpetual futures on Optimism. If Synthetix continues to capture more perpetual futures market share on Optimism, perpetual futures could become a valuable revenue source for Synthetix.</p><h2>Communication</h2><p>The Spartan Council is arguably one of the most transparent DAOs in the space. The Spartan Council members are active in the Synthetix <a href=\"https://discord.com/invite/Synthetix\">Discord</a>, weekly Spartan Discussions, which are published as <a href=\"https://open.spotify.com/show/3ucEqjfVDzJ8wSyVxheTPA\">podcasts</a>, and SNXweave, a Synthetix grantee that provides weekly recaps of the activity from the four Synthetix Councils via <a href=\"https://snxweave.medium.com/\">blog</a> and <a href=\"https://www.youtube.com/@snxweave\">YouTube</a>.</p><p>This level of communication is rare within the DAO governance space. Despite Synthetix’s transparency, it is easy to miss new developments and properly gather community sentiment on all proposals due the governance decisions happening on multiple platforms. Without a traditional forum platform, such as Discourse or Commonwealth, it is difficult to research Synthetix governance and to filter for specific topics.</p><h3>Communication Recommendations</h3><p>Improving the searchability of Synthetix governance content would alleviate a major pain point for Synthetix community members and might even encourage new Synthetix users to participate in governance. There are several ways Synthetix could improve its content's searchability. </p><p>The recaps by SNXweave are valuable to the Synthetix community, but they sometimes lack the nuance of the detailed discussions between council members on the Spartan Discussion calls. Thus, transcribing the audio from the Spartan Discussions and posting the transcription as a blog would benefit the Synthetix community because it would allow for greater searchability of the Spartan Discussions. If this were implemented, community members could find and discover key governance information about specific proposals.</p><p>Discord’s major drawback is that it is difficult to search for historical topics, especially in a very active Discord like Synthetix’s. Using a forum platform like Discourse or Commonwealth to organize all the Synthetix governance-related topics would keep governance topics organized and searchable. While the <a href=\"https://sips.synthetix.io/\">repository</a> is a good resource, it does not include the community’s feedback on the proposals. </p><p>The Synthetix <a href=\"https://synthetix.io/governance\">governance documentation</a> is outdated. This is understandable, given Synthetix governance has undergone multiple iterations over the past three years. Nevertheless, it would be very valuable to allocate resources to maintain this documentation in order to minimize confusion for current and future Synthetix community members.</p><p>Improved searchability and updated documentation will provide a better user experience for Synthetix community members interested in governance, and it will eliminate the silos that exist today. Improving these two aspects could even increase the number of active governance participants since there will be historical context to help community members understand Synthetix properly. That said, Synthetix is not necessarily incentivized to encourage greater governance participation in Synthetix Governance from the broader Synthetix community, given that only its current council members cast votes. All things considered, when more voices participate in discussions, even if they aren’t voting, the quality of decisions and council members' accountability increase.</p><h2>Accountability Analysis</h2><h3>Spartan Council</h3><p>The Spartan Council has been entrusted by the Synthetix community to be actively involved in making decisions in Synthetix’s best interest. Currently, Synthetix is attempting to balance the protocol’s main objectives of increasing the number of active users and SNX stakers with the goal of creating a&nbsp; revenue-driven, sustainable protocol in a bear market. To do this, all elected council members, including Spartan Council members, are held accountable for providing value to Synthetix. The foundation of providing value to a DAO is showing up and participating. SNXweave has collected council participation data and conducted Team 360 Self Reviews to quantitatively measure council members' level of participation over the last two epochs.&nbsp; </p><p>The Spartan Council meeting and voting participation rates from the Spartan Council members are as follows:</p><img src=\"https://cdn.sanity.io/images/2bt0j8lu/production/1b7a404ebf35bebbf3b7feb95266120f9d4c75bd-1280x720.png?w=800\" alt=\"\"><img src=\"https://cdn.sanity.io/images/2bt0j8lu/production/02c8707b4dccc0f2371c2742a11ebbc463371edb-1280x720.png?w=800\" alt=\"\"><p>The Spartan Council voting data shows that there were a total of 101 SIPs and SCCPs that went to an off-chain vote during Q2 and Q3 2022. There were also 808 possible votes that could have been cast by the eight Spartan Council members during each epoch. Of these 808 possible votes, 112 votes (13.86%) Spartan Council votes were not cast.</p><p>The data collected from the Team 360 Self Review questionnaires is a valuable snapshot of accountability information. This effectively represents how the Spartan Council members felt their Spartan Council peers performed and participated on their behalf throughout the epoch. The Team 360 data displays the effectiveness of each Council member, distilled down to one number. Synthetix voters can use this number to reliably assess each Council member's commitment.</p><p>However, the Team 360 Self Reviews do not come without a few drawbacks, namely:</p><ul><li>The reviews lack context as to why a council member believes another council member has inadequately participated during the epoch without further investigation.</li><li>The reviews open a possible attack vector, allowing council members to provide inaccurate reviews in bad faith. However, there is no evidence or accusations of this happening to date.</li></ul><h3><strong>Grants Council</strong></h3><p>The Grants Council’s role in the Synthetix ecosystem is to review grant applications and fund developers who are mission-aligned and willing to grow the Synthetix ecosystem. All grant applications, details, and voting history are provided on the Grants Council’s <a href=\"https://grants.synthetix.io/grants\">website</a>. Since Sept. 23, 2021, only 7 of the 68 grant applications have been approved through this grant process.</p><p>As mentioned in the <a href=\"https://blog.synthetix.io/synthetix-quarterly-report-q3-2022/#:~:text=as%20they%20happen!-,Grants%20Council,-Q3%202022%20Grants\">Q3 2022 Quarterly Report</a> by SNXweave, grantees have delivered on the following:</p><ul><li>Fee Rebate Initiative — providing OP tokens for referrals and covering trading fees for whale traders to boost Kwenta’s synthetic futures product.</li><li>Explainer Synthetix videos by content creators.</li><li><a href=\"https://wrappers.synthetix.io/\">Wrapper UI</a>.</li><li>New SIP/SCCP submission <a href=\"https://pr.synthetix.io/\">website</a> with a better user experience so anyone can easily submit a proposal.</li><li>SNXweave—- attendance and participation report and weekly recaps of the Synthetix Councils.</li></ul><p>Some other projects that have received grant funding are the NFT Project, HERO stats page, and SNXweave. The HERO stats page would be a welcomed upgrade from the Synthetix community as it aims to address the accuracy issues of <a href=\"https://grafana.synthetix.io/d/pjPJZ6x7z/synthetix-system-stats?orgId=1&amp;kiosk=full\">Grafana</a>, Synthetix's current statistics dashboard. However, the subgraph complexities and lack of resources have deemed the HERO stats page no longer viable. The Grants Council has paused all efforts on system-wide statistics until Synthetix transitions to V3.</p><p>The goal of the NFT project is to raise funds for liquidity provisioning in the Synthetix ecosystem and for public goods funding to be distributed by the Grants Council. The proceeds raised by the NFT Project will be split 80% going to liquidity provisioning and 20% to public goods funding. Any secondary market royalties will be split with the same ratio.</p><p>The Grants Council meeting and voting participation rates from the Grants Council members are as follows:</p><img src=\"https://cdn.sanity.io/images/2bt0j8lu/production/e351c2ad397dfaa094f2018eca0820c0a3a4d880-1280x720.png?w=800\" alt=\"\"><img src=\"https://cdn.sanity.io/images/2bt0j8lu/production/e885f3ab15fdb7f83246cea9635c01999eff6fff-1280x720.png?w=800\" alt=\"\"><p>While the Grants Council has clear responsibilities outlined in <a href=\"https://sips.synthetix.io/sips/sip-141/\">SIP 141</a>, there are no key performance indicators (KPIs) provided for the community to measure the success of the Grants Council (grantsDAO). To further transparency and accountability, Grants Council members could propose SIPs with clearly listed Grants Council KPIs, which would enable the Synthetix community to objectively measure the success of the grant funding.</p><h3>Ambassador Council</h3><p>Unlike <a href=\"https://sips.synthetix.io/sips/sip-39/\">SIP 39</a> (to set up grantsDAO) or <a href=\"https://sips.synthetix.io/sips/sip-141/\">SIP 141</a> (to formalize the responsibilities and role of the grantsDAO), <a href=\"https://messari.io/governor/proposal/7626405c-8dc3-4562-958a-f2ec508be8e4\">SIP 241</a> (KPI-based Ambassador Mandate) provides a clear mandate and KPIs for the Ambassador Council. This mandate and KPIs set a good example of clarity for other councils to follow. All of the information needed to evaluate the success of the Ambassador Council is included in the proposal. The Ambassador Council’s KPIs to measure performance are quoted below:</p><ul><li>Total delegated voting power of all ecosystem governance tokens.</li><li>The number of social events and their audience/viewership count (Town Halls, DAO 2 DAO community calls, Twitter spaces).</li><li>Sum of protocol integrations, grants referrals, and contributor referrals.</li><li>The culmination of published material in the form of blog posts, wiki articles, explainer Twitter threads, and other informational content.</li><li>Various approved SIPs and proposals for ecosystem protocols were written by members of the Ambassador Council.</li></ul><p>SIP 241 was passed in June 2022, making the <a href=\"https://blog.synthetix.io/synthetix-quarterly-report-q3-2022/#:~:text=better%20and%20better!!-,Ambassador%20Council,-Q3%202022%20Ambassador\">KPI data</a> in the Q3 2022 Quarterly Report by SNXweave the first epoch that this data was tracked. Going forward, this data will serve as a good baseline to measure the performance of the Ambassador Council over each epoch.</p><p>The Ambassador Council’s activity in Q3 2022 consisted of the following:</p><ul><li>Hosted 10 Spartan Spaces.</li><li>Responsible for three successful integrations with other protocols.</li><li>Proposed and successfully passed one Synthetix proposal (SCCP 230).</li><li>Utilized Synthetix voting power in the following protocols’ governance: Uniswap, Hop Protocol, Gearbox, Aave, and Optimism.</li></ul><p>Participating in Optimism’s governance during the second half of Optimism’s Grant Funding Season 2 allowed the Ambassador Council to take advantage of being one of the largest Optimism delegates by building relationships with well-recognized protocols for potential partnerships. Some of these protocols include Alchemix, SushiSwap, Yearn, Bankless Academy, EthernautDAO, and Across Protocol.</p><p>The Ambassador Council meeting and voting participation rates from the Ambassador Council members are as follows:</p><img src=\"https://cdn.sanity.io/images/2bt0j8lu/production/2e9b671682682d8bdd7d81f73216f34e216879cb-1280x720.png?w=800\" alt=\"\"><h3>Treasury Council</h3><p>The partnerships initiated by the Treasury Council are not required through a governance process and be formally voted on, i.e., Jump Crypto providing liquidity and Gauntlet becoming Synthetix’s risk partner. As per <a href=\"https://messari.io/governor/proposal/80b9ef0b-d303-4c51-a59b-c232746faad8\">SIP 155</a>, the Treasury Council has a broad mandate to do what is in the best interest of the Synthetix Treasury. This includes what is in the best interest of SNX, asset management, and risk management. Warwick has stressed the importance of the Treasury Council having the autonomy to be agile and act in the best interest of Synthetix, especially during a crisis. Thus, the Treasury Council does not have the same checks and balances as the Spartan Council or the other councils.</p><p>While the Treasury Council’s activities are more opaque than the other councils, the plan is for the Treasury Council members to complete the same Team 360 Self Review questionnaires the other councils participated in.</p><h2><strong>Core Contributor Committee</strong></h2><p>The Core Contributor Committee plays an important role in Synthetix becoming more decentralized; however, all Core Contributor Committee communications, votes, and operations are currently private. The Synthetix community has to blindly trust this committee to act in good faith due to the little transparency and verifiability of the committee's actions. With the ethos of the DAO model being transparent in its communications, private communications feel like a step in the wrong direction.</p><h2>Synthetix Governance Looking Forward</h2><p>The announcement of <a href=\"https://twitter.com/synthetix_io/status/1549061444389330945?s=20&amp;t=mXo0sQ3nlqjpZuL04GzDcA\">Synthetix V3</a> created a buzz on Twitter in July 2022, sparking conversations regarding the future of the Synthetix protocol. Synthetix V3 outlines the long-term vision of permissionless asset creation, improved credit control, Liquidity-as-a-Service (LaaS), and a differentiated debt pool. At the time of writing, SIPs 300–312 are all currently in the draft phase, but these proposals aim to migrate Synthetix from V2.X to V3. The transition to V3 will likely be completed in early 2023. V3 will update many of the Synthetix smart contracts and improve Synthetix’s current technical and economic inefficiencies — thus improving the user experience across the Synthetix ecosystem.</p><h2>Conclusion</h2><p>Synthetix is one of the oldest DeFi protocols and is currently in a state of transition as it implements lessons from the DeFi sector into Synthetix V3. Synthetix’s overall focus is to survive and thrive in the long term. A clear example of this can be seen in the successful SIPs and SCCPs that balance user growth while also optimizing for increased revenue to build a sustainable protocol. </p><p>Although a few areas of Synthetix Governance could be improved, all the Synthetix Councils have been actively delivering value to the Synthetix protocol. They seem to be acting in good faith on behalf of the Synthetix community while actively trying to drive value back to the Synthetix ecosystem. The upcoming voting (and subsequent implementation) of all the Synthetix V3 SIPs (300–312) means the Synthetix Community should have a lot to look forward to in the new year.</p><h3>Appendix</h3><img src=\"https://cdn.sanity.io/images/2bt0j8lu/production/af3cdc9222a4efc64a22ea9edb41f00534d58121-1600x900.png?w=800\" alt=\"\"><p><br><em>Let us know what you loved about the report, what may be missing, or share any other feedback by</em>&nbsp;<em><a href=\"https://06jiny4c1wy.typeform.com/to/DsmsVsUp?typeform-source=www.google.com#research=state-of-synthetix-governance\">filling out this short form</a>. All responses are subject to our</em>&nbsp;<a href=\"https://messari.s3.amazonaws.com/privacy.html\"><em>Privacy Policy</em></a>&nbsp;<em>and</em>&nbsp;<em><a href=\"https://messari.s3.amazonaws.com/termsofuse.html\">Terms of Service</a>.</em></p></div>","content:encodedSnippet":"Key Insights\n\nThe introduction of the V3 Governance Module (V3GM) marks another evolution of Synthetix’s governance structure and on-chain voting on the Layer-2 (L2) Optimism.\nOver the past year, many Synthetix governance proposals focused on building out the Synthetix suite of revenue-driven products, i.e., atomic swaps and perpetual futures.\nSynthetix governance communications could be improved to potentially enhance the quality of decisions and accountability of council members.\n\nBackground\nIn 2018, Synthetix elected to decommission the Synthetix Foundation, a not-for-profit foundation based in Australia, in favor of decentralizing its governance.\nSynthetix’s goal in shifting to a decentralized governance model was to reduce the required trust in the core team and create a censorship-resistant protocol to exchange synthetic assets by building a trustless, permissionless, and immutable protocol. Synthetix Founder Kain Warwick’s initial governance vision did not include on-chain governance due to it being “fundamentally flawed.” Warwick argued that on-chain governance created a greater project risk to Synthetix than the possibility of the Synthetix Foundation being captured by a bad actor.\nIn July 2020, Synthetix fully transitioned from a foundation to a DAO composed of three subDAOs:\n\nprotocolDAO was responsible for protocol upgrades and variable configurations.\ngrantsDAO was responsible for funding public goods in the Synthetix ecosystem.\nsynthetixDAO was responsible for managing and deploying funds to contributors and other project needs.\n\n\nGovernance Overview\nSynthetix governance has been through multiple iterations, including the formation of liquid democracy and the dilution of voting power, before the V3 Governance Module (V3GM) introduction in June 2022. SIP 207: V3GM outlines Synthetix’s latest governance iteration and updating its council-based governance structure to four councils and one committee.\nCouncil-based governance is an alternative to the primary governance models of token-weighted and delegated governance. It leans more towards traditional governance models, such as representative democracy and a board of directors. By depending on fewer people with an equal voting power to make decisions, council-based governance seeks to address the shortcomings of its counterparts. Token-weighted and delegated governance often result in voter apathy and a large voting power concentration. To elect council members within the DAO, Synthetix uses a quadratic voting model.\n\nV3GM\nWith the V3GM model, all council nominations and elections move from an off-chain process on Snapshot to the on-chain Election Module on Optimism. Among many benefits, the transition to on-chain Council elections has increased Synthetix’s decentralization by mitigating the possibility of human interference. The protocolDAO is no longer required to execute off-chain election results and manually transfer the Council NFT to the elected members. Instead, elections will now be conducted on-chain.\nThe key considerations Synthetix made when designing V3GM was to optimize for low-cost elections and avoid having signers for the DAO’s multi-sig where tokenholders have no recourse to remove the signers. Thus, Synthetix Core Contributors chose Optimism as a Layer-2 (L2) network to optimize for low-cost gas fees and an inclusive on-chain elections voting process. Since there is a large pool of Synthetix voters on Ethereum Layer-1 (L1), V3GM has an intermediary solution that uses a Merkle tree snapshot of L1 debt holders and uploads it into the Optimism L2 instance. This intermediary solution will be replaced once the V2.X debt migration happens.\nThe on-chain Election Module has brought a new voting strategy to Synthetix governance:\n\nThe current epoch duration for an elected council member is three months but will change to four months in 2023.\nEligible voters are debt unit tokenholders who have staked their SNX.\nNominations and elections happen concurrently during a two-week period.\nVoting power is calculated by the debt share balance.\nOne candidate per vote, applying the associated voting power of one voter to the one candidate.\nVoting weight is quadratic, 1 debt unit = sqrt(1) vote, except for the treasury council, which is linear.\nVote counting is a plurality voting strategy. The candidates with the most voting power will be elected as equal voting members on the respective council.\nThe number of elected members:\nSpartan Council: 8\nGrants Council: 5\nAmbassador Council: 5\nTreasury Council: 4\n\n\nGovernance Process\nProposals fall into one of two categories, Synthetix Improvement Proposal (SIP) or Synthetix Configuration Change Proposal (SCCP). SIPs implement core changes to the Synthetix Ecosystem. SCCPs modify system configuration variables. SIPs and SCCPs are only voted on by the eight elected Spartan Council members of the current epoch and must follow the specified Synthetix governance process.\n\n\nIn the Synthetix governance process, there are two types of proposals: governance and meta-governance. The proposal type can be found in the Synthetix Proposal Repository in the table at the top of each SIP and SCCP (i.e., SCCP 300). Governance proposals do not need all eight Spartan Council members to vote for a proposal for it to succeed. Meta-governance proposals require all eight Spartan Council members to vote on the proposal for its success. Meta-governance proposals are for any changes in how governance operates, and governance proposals are for any changes affecting protocol updates.\nGovernance Impact on SNX\n\nSince Jan. 1, 2022, Synthetix governance has had 168 proposals, making it the third most active DAO that Messari Governor monitors. Most proposals this year have been related to revenue generation, following Warwick’s anticipation of this driving the next DeFi narrative.\nStaked SNX Percentage\nAs discussed in an earlier Synthetix Governor Note, multiple proposals throughout 2022 focused on incentivizing greater staked SNX by implementing unsustainable inflationary SNX rewards. The inflationary SNX rewards introduced in various proposals successfully bootstrapped and secured the network at the expense of creating constant SNX sell pressure. SNX stakers could hedge their exposure by continuously selling their newly unlocked SNX each week.\nSIP 276: Turn Off The Money Printer was proposed to cap the total supply of SNX at 300 million and stop the unsustainable inflationary SNX rewards. This effort would ensure that the sUSD fee yield per SNX would grow with the protocol’s revenue, since sUSD rewards are based on the trading fees accrued in the Synthetix ecosystem. However, SIP 276 has not yet moved to a Snapshot vote and is currently in limbo as the SIP 276 author (Warwick) decided not to present it publicly. In addition, the Spartan Council decided SCCP 211 (the proposal to reduce SNX inflation by 5% each week) would be sufficient until new Synthetix products are launched. The discussion to terminate SNX inflationary rewards may be revived once the Spartan Council assesses the impact of the new Synthetix products. \nSynthetix initially planned to terminate inflationary SNX rewards in March 2023, which would leave SNX with a total supply of ~250 million. However, the SNX outstanding supply is currently at ~310 million SNX at the time of writing. This effectively makes SIP 276 irrelevant, considering the 300 million SNX circulating has already been surpassed, and ~738,500 inflationary SNX rewards will be distributed the week of Dec. 7, 2022. The number of rewards distributed will continue to decline by 5% each week.\nThe four proposals that dictated the inflationary rewards were  SCCP 196, SIP 202, SCCP 208, and SCCP 211. The initial goal of SCCP 196 and SIP 202 were to hit a targeted staked SNX percentage of 85% to bootstrap and secure Synthetix by increasing the weekly SNX rewards to incentivize more SNX tokenholders to stake their SNX. However, these proposals did not meaningfully impact the staked SNX percentage, and the targeted staked SNX percentage was ultimately lowered to 65%.\n\nIf SIP 300 and the other V3-related proposals (SIP 302, SIP 308, and SIP 309) are implemented, multi-collateral staking will be accepted as collateral for the Synthetix debt pool. As a result, the staked SNX percentage metric will be less important in V3. Rather than relying on one form of collateral, V3 will allow Synthetix to be more flexible accept various collateral and provide subsequent liquidity to various markets and financial instruments.\nAtomic Swaps\nThe goal of atomic swaps is to allow decentralized exchange (DEX) aggregators to conduct Synthetix swaps on Ethereum mainnet in an atomic manner (i.e., that they happen in one trade). For example, an atomic swap could look like this ETH <> sETH <> sUSD <> BTC in one swap. The benefits of atomic swaps are less slippage and lower fees.\nThe Mirarch release implemented SIP 198’s atomic exchange functionality update and introduced latency attacks on the Synthetix protocol via atomic swaps on 1inch and Kwenta. This update led to increased Synthetix trade volume and sUSD trade fee rewards because these latency attacks were bots front-running trades to get the best prices. The results were more profitable trades and, ultimately, significant increases in Synthetix trade volume. These latency attacks only affected Synthetix on Ethereum Mainnet. Trades on Optimism are not subject to latency attacks as there is no 10-minute fee reclamation period given its oracle latency.\n\nIn response to these latency attacks, SIP 267 was introduced to allow the Spartan Council to approve protocols (contracts or externally owned addresses) that wanted to implement atomic swaps. By implementing atomic swaps, protocols were given the ability to interact with Synthetix’s core exchange functionalities and set customized parameters. SIP 267 successfully returned trade volumes and the sUSD trading fee rewards back to healthy levels, alleviating the sell pressure on SNX.\nWhile SIP 267 was successful, the path to success was not so smooth. SCCP 224 failed twice, after aiming to limit latency attacks by lowering the atomic volume per block from 5 to 0.5 million sUSD. This short-term fix was rejected by the Spartan Council, as only 4 votes were cast out of a possible 16 over the two votes, signaling SIP 267 and SIP 288 were the preferred solutions amongst the Spartan Council. The approval and implementation of SIP 267 and SIP 288 (1inch Direct Integration) allow 1inch to include Curve as a path for deep liquidity and less slippage, reducing the likelihood of latency attacks.\nThe Spartan Council and Synthetix community’s desire to solve the latency attacks demonstrates the sustainable long-term thinking in Synthetix Governance. The net outcome of solving the latency attacks was an improved trading experience (via lower fees and less slippage) in the Synthetix ecosystem. This long-term thinking has also led the Spartan Council to focus on improving another Synthetix product, perpetual futures.\nPerpetual Futures\nThere are three perpetual futures proposals (SIP 279, SIP 280, and SIP 281) in the draft status that aim to upgrade synthetic perpetual futures [V1] to V2. Upgrading the perpetual futures contracts should improve the constrained scalability and efficiency due to the following limitations:\n\nCapital inefficiency — restrictive open interest limits.\nFunding rate volatility.\nHigh fees and wide spreads.\n\nThese proposals demonstrate that Synthetix aims to be a market leader of perpetual futures on Optimism. If Synthetix continues to capture more perpetual futures market share on Optimism, perpetual futures could become a valuable revenue source for Synthetix.\nCommunication\nThe Spartan Council is arguably one of the most transparent DAOs in the space. The Spartan Council members are active in the Synthetix Discord, weekly Spartan Discussions, which are published as podcasts, and SNXweave, a Synthetix grantee that provides weekly recaps of the activity from the four Synthetix Councils via blog and YouTube.\nThis level of communication is rare within the DAO governance space. Despite Synthetix’s transparency, it is easy to miss new developments and properly gather community sentiment on all proposals due the governance decisions happening on multiple platforms. Without a traditional forum platform, such as Discourse or Commonwealth, it is difficult to research Synthetix governance and to filter for specific topics.\nCommunication Recommendations\nImproving the searchability of Synthetix governance content would alleviate a major pain point for Synthetix community members and might even encourage new Synthetix users to participate in governance. There are several ways Synthetix could improve its content's searchability. \nThe recaps by SNXweave are valuable to the Synthetix community, but they sometimes lack the nuance of the detailed discussions between council members on the Spartan Discussion calls. Thus, transcribing the audio from the Spartan Discussions and posting the transcription as a blog would benefit the Synthetix community because it would allow for greater searchability of the Spartan Discussions. If this were implemented, community members could find and discover key governance information about specific proposals.\nDiscord’s major drawback is that it is difficult to search for historical topics, especially in a very active Discord like Synthetix’s. Using a forum platform like Discourse or Commonwealth to organize all the Synthetix governance-related topics would keep governance topics organized and searchable. While the repository is a good resource, it does not include the community’s feedback on the proposals. \nThe Synthetix governance documentation is outdated. This is understandable, given Synthetix governance has undergone multiple iterations over the past three years. Nevertheless, it would be very valuable to allocate resources to maintain this documentation in order to minimize confusion for current and future Synthetix community members.\nImproved searchability and updated documentation will provide a better user experience for Synthetix community members interested in governance, and it will eliminate the silos that exist today. Improving these two aspects could even increase the number of active governance participants since there will be historical context to help community members understand Synthetix properly. That said, Synthetix is not necessarily incentivized to encourage greater governance participation in Synthetix Governance from the broader Synthetix community, given that only its current council members cast votes. All things considered, when more voices participate in discussions, even if they aren’t voting, the quality of decisions and council members' accountability increase.\nAccountability Analysis\nSpartan Council\nThe Spartan Council has been entrusted by the Synthetix community to be actively involved in making decisions in Synthetix’s best interest. Currently, Synthetix is attempting to balance the protocol’s main objectives of increasing the number of active users and SNX stakers with the goal of creating a  revenue-driven, sustainable protocol in a bear market. To do this, all elected council members, including Spartan Council members, are held accountable for providing value to Synthetix. The foundation of providing value to a DAO is showing up and participating. SNXweave has collected council participation data and conducted Team 360 Self Reviews to quantitatively measure council members' level of participation over the last two epochs.  \nThe Spartan Council meeting and voting participation rates from the Spartan Council members are as follows:\n\nThe Spartan Council voting data shows that there were a total of 101 SIPs and SCCPs that went to an off-chain vote during Q2 and Q3 2022. There were also 808 possible votes that could have been cast by the eight Spartan Council members during each epoch. Of these 808 possible votes, 112 votes (13.86%) Spartan Council votes were not cast.\nThe data collected from the Team 360 Self Review questionnaires is a valuable snapshot of accountability information. This effectively represents how the Spartan Council members felt their Spartan Council peers performed and participated on their behalf throughout the epoch. The Team 360 data displays the effectiveness of each Council member, distilled down to one number. Synthetix voters can use this number to reliably assess each Council member's commitment.\nHowever, the Team 360 Self Reviews do not come without a few drawbacks, namely:\n\nThe reviews lack context as to why a council member believes another council member has inadequately participated during the epoch without further investigation.\nThe reviews open a possible attack vector, allowing council members to provide inaccurate reviews in bad faith. However, there is no evidence or accusations of this happening to date.\n\nGrants Council\nThe Grants Council’s role in the Synthetix ecosystem is to review grant applications and fund developers who are mission-aligned and willing to grow the Synthetix ecosystem. All grant applications, details, and voting history are provided on the Grants Council’s website. Since Sept. 23, 2021, only 7 of the 68 grant applications have been approved through this grant process.\nAs mentioned in the Q3 2022 Quarterly Report by SNXweave, grantees have delivered on the following:\n\nFee Rebate Initiative — providing OP tokens for referrals and covering trading fees for whale traders to boost Kwenta’s synthetic futures product.\nExplainer Synthetix videos by content creators.\nWrapper UI.\nNew SIP/SCCP submission website with a better user experience so anyone can easily submit a proposal.\nSNXweave—- attendance and participation report and weekly recaps of the Synthetix Councils.\n\nSome other projects that have received grant funding are the NFT Project, HERO stats page, and SNXweave. The HERO stats page would be a welcomed upgrade from the Synthetix community as it aims to address the accuracy issues of Grafana, Synthetix's current statistics dashboard. However, the subgraph complexities and lack of resources have deemed the HERO stats page no longer viable. The Grants Council has paused all efforts on system-wide statistics until Synthetix transitions to V3.\nThe goal of the NFT project is to raise funds for liquidity provisioning in the Synthetix ecosystem and for public goods funding to be distributed by the Grants Council. The proceeds raised by the NFT Project will be split 80% going to liquidity provisioning and 20% to public goods funding. Any secondary market royalties will be split with the same ratio.\nThe Grants Council meeting and voting participation rates from the Grants Council members are as follows:\n\nWhile the Grants Council has clear responsibilities outlined in SIP 141, there are no key performance indicators (KPIs) provided for the community to measure the success of the Grants Council (grantsDAO). To further transparency and accountability, Grants Council members could propose SIPs with clearly listed Grants Council KPIs, which would enable the Synthetix community to objectively measure the success of the grant funding.\nAmbassador Council\nUnlike SIP 39 (to set up grantsDAO) or SIP 141 (to formalize the responsibilities and role of the grantsDAO), SIP 241 (KPI-based Ambassador Mandate) provides a clear mandate and KPIs for the Ambassador Council. This mandate and KPIs set a good example of clarity for other councils to follow. All of the information needed to evaluate the success of the Ambassador Council is included in the proposal. The Ambassador Council’s KPIs to measure performance are quoted below:\n\nTotal delegated voting power of all ecosystem governance tokens.\nThe number of social events and their audience/viewership count (Town Halls, DAO 2 DAO community calls, Twitter spaces).\nSum of protocol integrations, grants referrals, and contributor referrals.\nThe culmination of published material in the form of blog posts, wiki articles, explainer Twitter threads, and other informational content.\nVarious approved SIPs and proposals for ecosystem protocols were written by members of the Ambassador Council.\n\nSIP 241 was passed in June 2022, making the KPI data in the Q3 2022 Quarterly Report by SNXweave the first epoch that this data was tracked. Going forward, this data will serve as a good baseline to measure the performance of the Ambassador Council over each epoch.\nThe Ambassador Council’s activity in Q3 2022 consisted of the following:\n\nHosted 10 Spartan Spaces.\nResponsible for three successful integrations with other protocols.\nProposed and successfully passed one Synthetix proposal (SCCP 230).\nUtilized Synthetix voting power in the following protocols’ governance: Uniswap, Hop Protocol, Gearbox, Aave, and Optimism.\n\nParticipating in Optimism’s governance during the second half of Optimism’s Grant Funding Season 2 allowed the Ambassador Council to take advantage of being one of the largest Optimism delegates by building relationships with well-recognized protocols for potential partnerships. Some of these protocols include Alchemix, SushiSwap, Yearn, Bankless Academy, EthernautDAO, and Across Protocol.\nThe Ambassador Council meeting and voting participation rates from the Ambassador Council members are as follows:\n\nTreasury Council\nThe partnerships initiated by the Treasury Council are not required through a governance process and be formally voted on, i.e., Jump Crypto providing liquidity and Gauntlet becoming Synthetix’s risk partner. As per SIP 155, the Treasury Council has a broad mandate to do what is in the best interest of the Synthetix Treasury. This includes what is in the best interest of SNX, asset management, and risk management. Warwick has stressed the importance of the Treasury Council having the autonomy to be agile and act in the best interest of Synthetix, especially during a crisis. Thus, the Treasury Council does not have the same checks and balances as the Spartan Council or the other councils.\nWhile the Treasury Council’s activities are more opaque than the other councils, the plan is for the Treasury Council members to complete the same Team 360 Self Review questionnaires the other councils participated in.\nCore Contributor Committee\nThe Core Contributor Committee plays an important role in Synthetix becoming more decentralized; however, all Core Contributor Committee communications, votes, and operations are currently private. The Synthetix community has to blindly trust this committee to act in good faith due to the little transparency and verifiability of the committee's actions. With the ethos of the DAO model being transparent in its communications, private communications feel like a step in the wrong direction.\nSynthetix Governance Looking Forward\nThe announcement of Synthetix V3 created a buzz on Twitter in July 2022, sparking conversations regarding the future of the Synthetix protocol. Synthetix V3 outlines the long-term vision of permissionless asset creation, improved credit control, Liquidity-as-a-Service (LaaS), and a differentiated debt pool. At the time of writing, SIPs 300–312 are all currently in the draft phase, but these proposals aim to migrate Synthetix from V2.X to V3. The transition to V3 will likely be completed in early 2023. V3 will update many of the Synthetix smart contracts and improve Synthetix’s current technical and economic inefficiencies — thus improving the user experience across the Synthetix ecosystem.\nConclusion\nSynthetix is one of the oldest DeFi protocols and is currently in a state of transition as it implements lessons from the DeFi sector into Synthetix V3. Synthetix’s overall focus is to survive and thrive in the long term. A clear example of this can be seen in the successful SIPs and SCCPs that balance user growth while also optimizing for increased revenue to build a sustainable protocol. \nAlthough a few areas of Synthetix Governance could be improved, all the Synthetix Councils have been actively delivering value to the Synthetix protocol. They seem to be acting in good faith on behalf of the Synthetix community while actively trying to drive value back to the Synthetix ecosystem. The upcoming voting (and subsequent implementation) of all the Synthetix V3 SIPs (300–312) means the Synthetix Community should have a lot to look forward to in the new year.\nAppendix\n\nLet us know what you loved about the report, what may be missing, or share any other feedback by filling out this short form. All responses are subject to our Privacy Policy and Terms of Service.","enclosure":{"url":"https://cdn.sanity.io/images/2bt0j8lu/production/d9f89979b0d051784c513241c56dafe559e306d4-1600x900.png","length":"1265963","type":"image/image"},"content":"The Synthetix DAO has been one of the busiest DAO governances over the past year. Exciting new upgrades like the introduction of the V3 Governance Model (V3GM) with on-chain voting on Optimism are creating a more transparent and trustless DAO. Plenty of areas where Synthetix's governance can improve while Synthetix shifts focus on expanding its suite of revenue-driven products.","contentSnippet":"The Synthetix DAO has been one of the busiest DAO governances over the past year. Exciting new upgrades like the introduction of the V3 Governance Model (V3GM) with on-chain voting on Optimism are creating a more transparent and trustless DAO. Plenty of areas where Synthetix's governance can improve while Synthetix shifts focus on expanding its suite of revenue-driven products.","guid":"https://messari.io/article/state-of-synthetix-governance","categories":["summary"],"isoDate":"2022-12-13T15:45:00.000Z","from":"https://messari.io/rss","hashId":"bf91700d5ff1beace28fe3d8c023a870"},{"creator":"KrakenFX","title":"Trading for EUL and WAXL starts December 15 – deposit now!","link":"https://blog.kraken.com/post/16620/trading-for-eul-and-waxl-starts-december-15-deposit-now/","pubDate":"Tue, 13 Dec 2022 15:58:11 +0000","dc:creator":"KrakenFX","content":"<p>We’re thrilled to announce that Kraken now supports Euler (EUL) and Wrapped Axelar (WAXL)! Funding and Trading Funding is live, and trading will begin on December 15 at approximately 14:30 UTC. You can add these tokens to your Kraken account by navigating to Funding, selecting&#8230;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.kraken.com/post/16620/trading-for-eul-and-waxl-starts-december-15-deposit-now/\">Trading for EUL and WAXL starts December 15 &#8211; deposit now!</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.kraken.com\">Kraken Blog</a>.</p>\n","contentSnippet":"We’re thrilled to announce that Kraken now supports Euler (EUL) and Wrapped Axelar (WAXL)! Funding and Trading Funding is live, and trading will begin on December 15 at approximately 14:30 UTC. You can add these tokens to your Kraken account by navigating to Funding, selecting…\nThe post Trading for EUL and WAXL starts December 15 – deposit now! appeared first on Kraken Blog.","guid":"https://blog.kraken.com/?p=16620","categories":["Announcements","Products","Uncategorized","EUL","WAXL"],"isoDate":"2022-12-13T15:58:11.000Z","from":"https://blog.kraken.com/feed/","hashId":"a30c697f54c10f10f833f7a17d2b29d5"},{"title":"New FTX CEO blasts Bankman-Fried's leadership of crypto firm in House hearing","link":"https://seekingalpha.com/news/3916555-new-ftx-ceo-blasts-bankman-frieds-leadership-of-collapsed-crypto-firm?utm_source=feed_news_crypto&utm_medium=referral","pubDate":"Tue, 13 Dec 2022 11:05:30 -0500","guid":"https://seekingalpha.com/news/3916555-new-ftx-ceo-blasts-bankman-frieds-leadership-of-collapsed-crypto-firm?utm_source=feed_news_crypto&utm_medium=referral","categories":[{"_":"ftt-usd","$":{"domain":"https://seekingalpha.com/symbol/FTT-USD"}}],"isoDate":"2022-12-13T16:05:30.000Z","from":"https://seekingalpha.com/news/crypto/feed","hashId":"615b9c9ca68a877808c301194e12d249"},{"creator":"CZ 🔶 Binance","title":"Re @Beka_Zlemingov Might do in the future, but we don't want to be seen as trying to overly influence people on their actions. It's their money, their...","link":"https://twitter.com/cz_binance/status/1602696220648120320","pubDate":"Tue, 13 Dec 2022 16:05:30 GMT","author":"CZ 🔶 Binance","content":"Re @Beka_Zlemingov Might do in the future, but we don't want to be seen as trying to overly influence people on their actions. It's their money, their choice.<br><br>May try to think of a way to thank our holders after all this is in the past.","contentSnippet":"Re @Beka_Zlemingov Might do in the future, but we don't want to be seen as trying to overly influence people on their actions. It's their money, their choice.\nMay try to think of a way to thank our holders after all this is in the past.","guid":"https://twitter.com/cz_binance/status/1602696220648120320","isoDate":"2022-12-13T16:05:30.000Z","from":"http://rss.tokenhash.io/twitter/user/cz_binance","hashId":"85f5c028f99893d7acf239ad2c548fc0"},{"creator":"DeGate Team","title":"DeGate’s Order Book Approach","link":"https://medium.com/degate/degates-order-book-approach-c11b047e7f64?source=rss-a24c95fa993d------2","pubDate":"Tue, 13 Dec 2022 16:10:38 GMT","content:encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*bsY-OdfcBHoPC5XuX0SLpA.png\" /></figure><p>An exchange is a marketplace where assets, such as commodities, stocks, and cryptocurrencies, can be bought and sold. Traders use the exchange to buy or sell assets. Traditionally, the exchange works in an order-book manner. For example, buyers place an order on the exchange specifying the type and quantity of the asset they want to buy and the maximum price they are willing to pay — a limit order. Sellers do the same. The exchange then matches the buy orders and sell orders. When a match is found, the deal is done and completes the transaction. Among decentralized exchanges (DEX), interestingly, a new type of exchange is very prevalent, the Automated Market Maker, AMM.</p><p><strong>AMM</strong> is a DEX model that relies on liquidity pools, a container of crypto tokens, for exchanging tokens between A to B. The AMM model was invented to remove the need for a central entity to match orders and automate trading. It uses a mathematical formula to regulate the pool’s token reserve. Traders do not trade against a counterparty but a smart contract that executes the conditions of the mathematical formula. When people come to trade, the quantity of tokens in the pool changes, i.e trading token A for token B means adding A into and taking B out of the pool. A token’s price relative to the other token(s) in the pool is determined by the ratio of its quantity. That’s how the AMM quotes the price. As a trader, you can only be a taker who accepts the market price but cannot make a limit order. A pain point is that traders may suffer a front-running or sandwich attack from MEV bots, making the orders fail or result in an unfavourable price. The AMM model has gained popularity for its simplicity and efficiency in executing and settling trades in a blockchain network where there is limited capacity and high transaction costs.</p><p><strong>An order book exchange</strong> lists all open orders for any particular trading pair. It has a matching system to match the buy and sell orders. When a buy order is matched with a sell order, a successful trade is thus made. Generally, orders are considered compatible if the highest buy price matches or exceeds the lowest sell price. On a deeper level, different exchanges employ various methods to prioritize orders for matching.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*JyOy306Q0aMm1J8y\" /></figure><h3>Matching of orders in orderbook exchange</h3><p>In the DEX landscape, the order book model is slow to gain adoption because of several challenges.</p><p>First, high cost in handling on-chain limit orders. Every action and order occurs with gas fees. In the end, the resulting limit order might end up unprofitable for the taker, which makes on-chain limit orders unsuitable for high-frequency trading and smaller-size orders.</p><p>Second, low order matching efficiency arises from the limited network throughput, making it unable to fulfil the needs of a high-frequency trading platform such as a centralized exchange.</p><p>Third, on-chain limit orders may lead to front-running. When a taker wants to match the maker’s order, another can front-run him/her, resulting in a failed transaction.</p><p>An order book exchange in its traditional setup comes with many technical challenges for it to be suitable in the blockchain industry. However, as the Ethereum network upgrades and scales, it will be able to support significantly higher throughput and tremendously reduce gas fees. In light of this, “make DEX order book again” becomes doable.</p><h3><strong>DeGate’s order book solution</strong></h3><p>Built with Zero-Knowledge(ZK) technology, DeGate is a decentralized order book trading protocol that keeps the order book and order matching on Layer 2 and finalizing the settlement on Layer 1 via ZK rollup. The DeGate protocol should achieve the following:</p><ul><li>Ensuring ZK Rollup Data Availability</li><li>Handling large numbers of orders efficiently</li><li>Saving gas</li></ul><p>DeGate responds to the challenges by implementing a robust ZK rollup based on zkSNARKS. It generates a ZK proof through a circuit program after processing the requests off-chain, submits them on chain, and gets proof verification through immutable open source smart contracts on chain.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*Sy83EuHO7zkLSpAj\" /></figure><h3>DeGate’s ZK rollup overview</h3><p>A ZK-rollup order book DEX can function. However, handling a large, high-frequency order book still needs to be more efficient. Every action that requires a blockchain transaction consumes data storage. To further improve the efficiency of the matching model, DeGate has designed Batch Spot Trade, a mechanism able to intelligently bundle up and compress many transactions before adding into Layer 2 block. After which, a validity proof is generated through cryptographic means, which is then submitted to Ethereum Mainnet.</p><p>To ensure the system’s accuracy, Batch Spot Trade tracks the token balances amongst the transacted users and the matched transactions. This is elaborated in the diagram below, whereby the total sum of the 3 tokens (namely ETH, USDC, USDT) is calculated to ensure the token balance always = 0 between the total no. of users in each data bundle.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*qLqR8YWufuVQE0k8\" /></figure><h4>Validation check for matched transactions</h4><p>The Batch Spot Trade combines the number of users making transactions and the number of users’ aggregated orders. With this design combination, the data can thus be compressed and represented using only 83 bytes, potentially bundling up to 9x more transactions.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*VdYdefTh2hBl_p0u\" /></figure><h4>Inner workings of Batch Spot Trade mechanism</h4><p>Thanks to the design, DeGate protocol’s gas fee is significantly reduced. How low can it go? Here is an estimation.</p><p>Using the recent numbers, assuming the gas price is 15 gwei, ETH price is 1300$:</p><ul><li>Deposit 8,000–10,000 gas ( 0.156 ~ 0.195 USD)</li><li>Order matching 800–2,400 gas (0.015 ~ 0.047 USD)</li><li>Withdrawal 2,000–5,000 gas (0.039 ~ 0.098 USD)</li></ul><p>Making a swap on Uniswap v3 occurs 120,000–200,000 gas ( 2.34 ~ 3.9 USD)</p><p>Summing up DeGate’s gas fees for a series operation, deposit — trade — withdrawal, the total cost is still 10% of Uniswap.</p><p>The result of DeGate’s design is a CEX-like trading experience in a decentralized manner:</p><ul><li>Instant cancellation of pending orders which matches the cancellation speed of centralized exchanges</li><li>No cancellation fee for cancelling a pending order</li><li>No fees for maker orders — including trading and gas fees for blockchain settlement</li></ul><p>These attributes make DeGate suitable for retail users and professional market makers who need to handle a magnitude of orders instantly.</p><h3><strong>1inch also has limit order. How does DeGate differ from it?</strong></h3><p>Both 1inch and DeGate offer the limit order feature, but the mechanism behind it is different.</p><p><em>Order matching mechanism</em></p><p>DeGate is based on an order book logic where the order matching follows the priority of:</p><p>1. Price. Start matching from the highest buy price and lowest sell price.</p><p>2. Time. If different orders require the same price, the earlier the order is made the sooner it gets fulfilled.</p><p>DeGate’s order matching operates as a classic order book. Every order has an equal chance to get filled.</p><p>1inch’s limit order does not necessarily follow this logic. In 1inch, makers submit limit orders and wait for takers to take their orders. The takers don’t need to follow a fixed logic to fulfil the orders. Instead, which order is fulfilled first depends on the profit margin they could get by taking the order. The takers must consider the order’s size, gas fees and profitability before filling the order. Essentially, it is an arbitrage-driven order matching. If an order is too small or the gas cost is too high, it may not get filled due to a lack of profitability even when the price has matched the requested price. 1inch’s limit order is suitable for large orders, not for small orders.</p><p><em>Gas fee</em></p><p>On DeGate, you don’t need to pre-authorise the gas fee when you do a post-only limit order, meaning you require that the order can only be filled as a maker’s order. Remember, makers pay no fees. And cancelling a pending order occurs with no fees. If you want to change a limit order’s price, you can cancel the open order and make a new one. All these operations are gas-less.</p><p>On 1inch, you can place gas-less orders for a selection of tokens but not all tokens. And cancelling a pending order requires a gas fee. If you want to change a limit order’s price, you need to first cancel it which requires a gas fee. Frequently changing a limit order’s price is cost-consuming, making it unsuitable for trading purposes.</p><h3><strong>What to expect</strong></h3><p>In short, DeGate aims to provide an orderbook experience similar to traditional exchanges, at similar cost, but with much higher security and decentralisation. DeGate is currently on testnet. Expect the mainnet launch by Q1 2023.</p><h3><strong>LINKS</strong></h3><p><a href=\"https://degate.com/\">Website</a> | <a href=\"https://twitter.com/DeGateDex\">Twitter</a> | <a href=\"https://discord.com/invite/RFVDKGemJb\">Discord</a> | <a href=\"https://t.me/degate_public\">Telegram </a>| <a href=\"https://forum.degate.com/\">Forum</a> | <a href=\"https://www.youtube.com/channel/UCRAL9U4dtZHSfUOosHUyafg\">YouTube |</a> <a href=\"mailto:contact@degate.com\">Contact</a> | <a href=\"https://degate.breezy.hr/\">Join</a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=c11b047e7f64\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/degate/degates-order-book-approach-c11b047e7f64\">DeGate’s Order Book Approach</a> was originally published in <a href=\"https://medium.com/degate\">DeGate</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>","content:encodedSnippet":"An exchange is a marketplace where assets, such as commodities, stocks, and cryptocurrencies, can be bought and sold. Traders use the exchange to buy or sell assets. Traditionally, the exchange works in an order-book manner. For example, buyers place an order on the exchange specifying the type and quantity of the asset they want to buy and the maximum price they are willing to pay — a limit order. Sellers do the same. The exchange then matches the buy orders and sell orders. When a match is found, the deal is done and completes the transaction. Among decentralized exchanges (DEX), interestingly, a new type of exchange is very prevalent, the Automated Market Maker, AMM.\nAMM is a DEX model that relies on liquidity pools, a container of crypto tokens, for exchanging tokens between A to B. The AMM model was invented to remove the need for a central entity to match orders and automate trading. It uses a mathematical formula to regulate the pool’s token reserve. Traders do not trade against a counterparty but a smart contract that executes the conditions of the mathematical formula. When people come to trade, the quantity of tokens in the pool changes, i.e trading token A for token B means adding A into and taking B out of the pool. A token’s price relative to the other token(s) in the pool is determined by the ratio of its quantity. That’s how the AMM quotes the price. As a trader, you can only be a taker who accepts the market price but cannot make a limit order. A pain point is that traders may suffer a front-running or sandwich attack from MEV bots, making the orders fail or result in an unfavourable price. The AMM model has gained popularity for its simplicity and efficiency in executing and settling trades in a blockchain network where there is limited capacity and high transaction costs.\nAn order book exchange lists all open orders for any particular trading pair. It has a matching system to match the buy and sell orders. When a buy order is matched with a sell order, a successful trade is thus made. Generally, orders are considered compatible if the highest buy price matches or exceeds the lowest sell price. On a deeper level, different exchanges employ various methods to prioritize orders for matching.\n\nMatching of orders in orderbook exchange\nIn the DEX landscape, the order book model is slow to gain adoption because of several challenges.\nFirst, high cost in handling on-chain limit orders. Every action and order occurs with gas fees. In the end, the resulting limit order might end up unprofitable for the taker, which makes on-chain limit orders unsuitable for high-frequency trading and smaller-size orders.\nSecond, low order matching efficiency arises from the limited network throughput, making it unable to fulfil the needs of a high-frequency trading platform such as a centralized exchange.\nThird, on-chain limit orders may lead to front-running. When a taker wants to match the maker’s order, another can front-run him/her, resulting in a failed transaction.\nAn order book exchange in its traditional setup comes with many technical challenges for it to be suitable in the blockchain industry. However, as the Ethereum network upgrades and scales, it will be able to support significantly higher throughput and tremendously reduce gas fees. In light of this, “make DEX order book again” becomes doable.\nDeGate’s order book solution\nBuilt with Zero-Knowledge(ZK) technology, DeGate is a decentralized order book trading protocol that keeps the order book and order matching on Layer 2 and finalizing the settlement on Layer 1 via ZK rollup. The DeGate protocol should achieve the following:\n\nEnsuring ZK Rollup Data Availability\nHandling large numbers of orders efficiently\nSaving gas\n\nDeGate responds to the challenges by implementing a robust ZK rollup based on zkSNARKS. It generates a ZK proof through a circuit program after processing the requests off-chain, submits them on chain, and gets proof verification through immutable open source smart contracts on chain.\n\nDeGate’s ZK rollup overview\nA ZK-rollup order book DEX can function. However, handling a large, high-frequency order book still needs to be more efficient. Every action that requires a blockchain transaction consumes data storage. To further improve the efficiency of the matching model, DeGate has designed Batch Spot Trade, a mechanism able to intelligently bundle up and compress many transactions before adding into Layer 2 block. After which, a validity proof is generated through cryptographic means, which is then submitted to Ethereum Mainnet.\nTo ensure the system’s accuracy, Batch Spot Trade tracks the token balances amongst the transacted users and the matched transactions. This is elaborated in the diagram below, whereby the total sum of the 3 tokens (namely ETH, USDC, USDT) is calculated to ensure the token balance always = 0 between the total no. of users in each data bundle.\n\nValidation check for matched transactions\nThe Batch Spot Trade combines the number of users making transactions and the number of users’ aggregated orders. With this design combination, the data can thus be compressed and represented using only 83 bytes, potentially bundling up to 9x more transactions.\n\nInner workings of Batch Spot Trade mechanism\nThanks to the design, DeGate protocol’s gas fee is significantly reduced. How low can it go? Here is an estimation.\nUsing the recent numbers, assuming the gas price is 15 gwei, ETH price is 1300$:\n\nDeposit 8,000–10,000 gas ( 0.156 ~ 0.195 USD)\nOrder matching 800–2,400 gas (0.015 ~ 0.047 USD)\nWithdrawal 2,000–5,000 gas (0.039 ~ 0.098 USD)\n\nMaking a swap on Uniswap v3 occurs 120,000–200,000 gas ( 2.34 ~ 3.9 USD)\nSumming up DeGate’s gas fees for a series operation, deposit — trade — withdrawal, the total cost is still 10% of Uniswap.\nThe result of DeGate’s design is a CEX-like trading experience in a decentralized manner:\n\nInstant cancellation of pending orders which matches the cancellation speed of centralized exchanges\nNo cancellation fee for cancelling a pending order\nNo fees for maker orders — including trading and gas fees for blockchain settlement\n\nThese attributes make DeGate suitable for retail users and professional market makers who need to handle a magnitude of orders instantly.\n1inch also has limit order. How does DeGate differ from it?\nBoth 1inch and DeGate offer the limit order feature, but the mechanism behind it is different.\nOrder matching mechanism\nDeGate is based on an order book logic where the order matching follows the priority of:\n1. Price. Start matching from the highest buy price and lowest sell price.\n2. Time. If different orders require the same price, the earlier the order is made the sooner it gets fulfilled.\nDeGate’s order matching operates as a classic order book. Every order has an equal chance to get filled.\n1inch’s limit order does not necessarily follow this logic. In 1inch, makers submit limit orders and wait for takers to take their orders. The takers don’t need to follow a fixed logic to fulfil the orders. Instead, which order is fulfilled first depends on the profit margin they could get by taking the order. The takers must consider the order’s size, gas fees and profitability before filling the order. Essentially, it is an arbitrage-driven order matching. If an order is too small or the gas cost is too high, it may not get filled due to a lack of profitability even when the price has matched the requested price. 1inch’s limit order is suitable for large orders, not for small orders.\nGas fee\nOn DeGate, you don’t need to pre-authorise the gas fee when you do a post-only limit order, meaning you require that the order can only be filled as a maker’s order. Remember, makers pay no fees. And cancelling a pending order occurs with no fees. If you want to change a limit order’s price, you can cancel the open order and make a new one. All these operations are gas-less.\nOn 1inch, you can place gas-less orders for a selection of tokens but not all tokens. And cancelling a pending order requires a gas fee. If you want to change a limit order’s price, you need to first cancel it which requires a gas fee. Frequently changing a limit order’s price is cost-consuming, making it unsuitable for trading purposes.\nWhat to expect\nIn short, DeGate aims to provide an orderbook experience similar to traditional exchanges, at similar cost, but with much higher security and decentralisation. DeGate is currently on testnet. Expect the mainnet launch by Q1 2023.\nLINKS\nWebsite | Twitter | Discord | Telegram | Forum | YouTube | Contact | Join\n\nDeGate’s Order Book Approach was originally published in DeGate on Medium, where people are continuing the conversation by highlighting and responding to this story.","dc:creator":"DeGate Team","guid":"https://medium.com/p/c11b047e7f64","categories":["blog","ethereum","trading","crypto","dex"],"isoDate":"2022-12-13T16:10:38.000Z","from":"https://medium.com/feed/@degate","hashId":"f3e8c320650b479baf00d964b1432883"},{"creator":"Stacy Elliott","title":"FTX Did Invoicing, Expenses Over Slack and QuickBooks: CEO John Ray","link":"https://decrypt.co/117121/ftx-slack-quickbooks-ceo-john-ray","pubDate":"Tue, 13 Dec 2022 16:12:32 +0000","enclosure":{"url":"https://img.decrypt.co/insecure/rs:fill:1024:512:1:0/plain/https://cdn.decrypt.co/wp-content/uploads/2022/12/john-ray-ftx-gID_4.jpg@png","length":"1000000","type":"image/png"},"dc:creator":"Stacy Elliott","content":"\"Nothing against QuickBooks. Very nice tool,\" Ray said. \"It's not for a multibillion dollar company.\"","contentSnippet":"\"Nothing against QuickBooks. Very nice tool,\" Ray said. \"It's not for a multibillion dollar company.\"","guid":"https://decrypt.co/?p=117121","categories":["Coins"],"isoDate":"2022-12-13T16:12:32.000Z","from":"https://decryptmedia.com/feed/","hashId":"35410aed3d1e619f67f94e1fdb92383a"},{"creator":"Cointelegraph By  Kyle White ","title":"Why is Bitcoin price up today?","link":"https://cointelegraph.com/news/why-is-bitcoin-price-up-today","pubDate":"Tue, 13 Dec 2022 16:25:29 +0000","enclosure":{"url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTAvMjk3NTY5OWMtYWJkZC00ZjdiLWJkMzUtNzQyNjdhNTcwMTE3LmpwZw==.jpg","length":"840","type":"image/jpg"},"dc:creator":"Cointelegraph By  Kyle White ","content":"\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTAvMjk3NTY5OWMtYWJkZC00ZjdiLWJkMzUtNzQyNjdhNTcwMTE3LmpwZw==.jpg\"></p><p>Bitcoin price is up, alongside the prices of stocks and altcoins, thanks to a “positive” CPI report.</p>\n            ","contentSnippet":"Bitcoin price is up, alongside the prices of stocks and altcoins, thanks to a “positive” CPI report.","guid":"https://cointelegraph.com/news/why-is-bitcoin-price-up-today","categories":["Why is Bitcoin price up","what is Bitcoin price","why is Bitcoin rallying","is the Bitcoin bear market over","what is Bitcoin price today","why are crypto prices up","Bitcoin price rally"],"isoDate":"2022-12-13T16:25:29.000Z","from":"https://cointelegraph.com/rss","hashId":"3ee301b7606f5e450c8a32430a0600d8"},{"creator":"Cyrill Leutwiler, Lucas Steuernagel, Sean Young","title":"Hyperledger Solang Release v0.2.0 and what’s to come","link":"https://www.hyperledger.org/hyperledger-solang/2022/12/13/hyperledger-solang-release-v0-2-0-and-whats-to-come","pubDate":"Tue, 13 Dec 2022 16:30:00 +0000","content:encoded":"\n<p>With great pleasure we announce our most recent Hyperledger Solang Release: v0.2.0 “Berlin.” This release marks an important milestone towards maturing and stabilizing our Substrate compilation target: we are leaving ink! version 3 behind us in favor of introducing compatibility with the recent ink! 4 beta release!&nbsp;</p>\n\n\n\n<h2>Status update for our Substrate target</h2>\n\n\n\n<p>With the “Berlin” release, Hyperledger Solang substantially improved its compatibility with many existing Ethereum Dapps and concepts within the Polkadot and Kusama ecosystem. Porting from Ethereum to a Substrate Parachain is now easier since the compiler supports almost all language constructs as Ethereum Solidity 0.8. This release represents just the beginning of a series of upcoming achievements yet to unlock for the Substrate compilation target.</p>\n\n\n\n<h2>Getting started with Hyperledger Solang on Substrate</h2>\n\n\n\n<p>Running your first Solidity contract on Substrate Parachains should be a matter of minutes. In this section we walk you through the few steps, showcasing how to use a classic Solidity example on Substrate. Namely, we are going to deploy an unmodified version of the <a href=\"https://docs.soliditylang.org/en/v0.8.17/solidity-by-example.html#voting\">“Voting” example contract</a>, directly out of the Solidity documentation itself. According to Solidity documentation, the “Voting” contract example showcases a lot of Solidity’s features.</p>\n\n\n\n<h3>Prerequisites</h3>\n\n\n\n<p>To follow along, you&#8217;ll need to install Solang version &#8220;0.2.0&#8221; on your system. We offer plenty of quick installation options, including Homebrew as well as pre-built binaries for all common platforms. Please consult our <a href=\"https://solang.readthedocs.io/en/latest/installing.html\">documentation</a> for instructions specific to your platform. Impatient readers may as well just use our docker option, which doesn’t require installing anything, instead.</p>\n\n\n\n<p>If you want to test contracts on a local node, you&#8217;ll need to run version &#8220;0.22.1&#8221; of &#8220;substrate-contracts-node&#8221; on your local machine. Installation instructions can be found <a href=\"https://github.com/paritytech/substrate-contracts-node#installation\">here</a>. Again, our impatient readers may use the &#8220;paritytech/contracts-ci-linux&#8221; Docker image instead as this image contains a compatible substrate node as well (at the time of writing).</p>\n\n\n\n<h3>Compiling the “Voting” Solidity contract to WASM</h3>\n\n\n\n<p>We start with saving the source code of the “Voting” example contract into a file called “ballot.sol.”. There is no need to make any modification to the code, unless you want to tinker around a bit on your own. Now we use “solang” to compile the contract as follows:</p>\n\n\n\n<pre class=\"wp-block-code\"><code>bash\nsolang compile --target substrate ballot.sol</code></pre>\n\n\n\n<p>The contract should compile without any warnings. If you prefer docker, you can use the following command instead:</p>\n\n\n\n<pre class=\"wp-block-code\"><code>bash\ndocker run --rm -it -v $(pwd):/sources ghcr.io/hyperledger/solang:v0.2.0 compile -o /sources --target substrate /sources/ballot.sol</code></pre>\n\n\n\n<p>Now, inside your current working directory, a new file called &#8220;Ballot.contract&#8221; should appear, containing the web assembly BLOB together with the metadata of the contract.</p>\n\n\n\n<h3>Testing on a local development node</h3>\n\n\n\n<p>Before deploying the compiled contract to a testnet, let&#8217;s try it out on a local node. If you are in a hurry, you may as well skip this section and proceed directly with a deployment to a testnet. Start a local node on your machine using the following command:</p>\n\n\n\n<pre class=\"wp-block-code\"><code>bash\nsubstrate-contracts-node --tmp --ws-external -lerror,runtime::contracts=debug</code></pre>\n\n\n\n<p>Alternatively, the equivalent command for our docker users is as follows:</p>\n\n\n\n<pre class=\"wp-block-code\"><code>bash\ndocker run --rm -it -p9944:9944 paritytech/contracts-ci-linux substrate-contracts-node --tmp --ws-external -lerror,runtime::contracts=debug</code></pre>\n\n\n\n<p>The odd looking “-lerror,runtime::contracts=debug” CLI option will instruct the node to use the debugging log level for the “contracts” pallet. This might come in handy as it effectively enables using the debug buffer, which allows the contract to communicate with the developer at runtime.</p>\n\n\n\n<h3>Deploy the contract using the contracts UI</h3>\n\n\n\n<p>Now head over to the <a href=\"https://contracts-ui.substrate.io/\">contracts-UI</a> and make sure to select ”Local Node” in the top-left corner. Then click on “Add New Contract” just below, and choose “Upload New Contract Code.” As the Contract Bundle, choose the ”Ballot.contract” file from the previous section. The node we are using comes with some special built-in accounts, which come in very handy for development purposes. The “alice” account is one of them and it is fine to use that for contract instantiation.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/mTcPBYYmJIyvG4SG413FZenRGMZBd1Shl44FmW1vBjGGAYCDECs_R3DZhFSlpHV6I0Wch7RQbdnrd9wyYnA-w0f3KkHqfUPIAPaEiuYLQ59XNgT9gCoi9BFSN9O4AQkHb2cgzoeg1kLLW3W4vNJDwyTNn-p01O2CUrYLI6SC4gXS61R9aaujiKEMIzFa-A\" alt=\"\"/><figcaption><em>Image 1: Choosing the compiled contract bundle in contracts-UI</em></figcaption></figure>\n\n\n\n<p>In the next section, you&#8217;ll be presented with some options for contract instantiation. Primarily, you might want to add some more &#8220;proposalName&#8221;s to our voting Ballot by clicking the big &#8220;+&#8221; button on the right side, so that we can actually choose between different voting options later. The actual values for the ”proposalName” won&#8217;t matter at this point.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh3.googleusercontent.com/Ra38b5pR_O6m85EeRcr3Rg97jeBUyrdjQ1eJWqpMrc2HqN9T6HvjoVoXxVvn5PfZoZGxTWaWt-80cGEqaBH-aLsri77PwjIlRatUjNzcGuZy2geskJFj_FWKO51ypakh-vHCvX1RUZbNBTDyYk7AMdLy90Kw3VgsiBBI3gzYMGxK_tyiySgjDSdbH-Jd9g\" alt=\"\"/><figcaption><em>Image 2: Configuring constructor arguments for contract instantiation in contracts UI</em></figcaption></figure>\n\n\n\n<p>When you are satisfied with your deployment options, scroll to the bottom of the page to click on “Next” and then “Upload and Instantiate.” Under the hood, this will call the intrinsic to instantiate the contract. As the node we are using is configured to have instant block finality, the operation should succeed immediately. You&#8217;ll find your freshly deployed contract on the left side and it will look like this:</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh5.googleusercontent.com/2CNm92gUIz-8srqZzlCxGgCC9vBrKnUcbe874NNkuk1woETpotTr2YnWtQQiu0VcRu4LLw8pgG0GtJAVWo8fhtn0o3l9y7IKvN7ss4sLHhKKlFM0pPF1rdZXaS1mLM6i0OYu8r18VQ0WGLGWyQcjBviuQd_HBxYTiedhKdsG3Ute5V_bccBKP02QmWH6Yg\" alt=\"\"/><figcaption><em>Image 3: The solidity contract deployed to a local node</em></figcaption></figure>\n\n\n\n<h3>Interacting with the contract</h3>\n\n\n\n<p>Now we can start playing with the contract by calling some of its functions. For example, try calling the “giveRightToVote()” function using the “alice” account, to entitle “bob,” “dave” and “eve” with the rights to submit a vote. You&#8217;ll notice that, if you are trying to call the ”vote()” function using an account that was not given voting rights priorly, the contract will trap and the transaction reverts as a consequence. If you did set the log level for the contracts runtime to “debug” in the previous step, you will be able to observe failed “require” statements in your local nodes terminal output. You will find a message like this when trying to submit a “vote()” using a non-entitled account as the caller:</p>\n\n\n\n<pre class=\"wp-block-code\"><code>2022-12-07 18:45:46.496 DEBUG tokio-runtime-worker runtime::contracts: Execution finished with debug buffer: Has no right to vote\n</code></pre>\n\n\n\n<h3>Deploying to a testnet</h3>\n\n\n\n<p>Finally, let&#8217;s see how we can deploy our ballot contract to the “Rococo” live testnet, turning it into a usable Dapp. For this we are going to use the <a href=\"https://polkadot.js.org/extension/\">polkadot JS browser extension</a> to create some accounts. So make sure to install that in your browser if you don&#8217;t already have it.</p>\n\n\n\n<h3>Creating test accounts</h3>\n\n\n\n<p>While our local node conveniently provided us with accounts charged up with balance out of the box, this won&#8217;t be the case on any &#8220;real&#8221; network. Instead we will create dedicated accounts. Even though you could reuse any pre-existing value-bearing Accounts from polkadot.js for this experiment, it is considered best practice to always use dedicated throw-away accounts for any development purposes. In your browser, open the polkadot JS extensions and use “Create new Account,” accessible by clicking on the big&nbsp; &#8220;+&#8221; button on the top right side.</p>\n\n\n\n<p>Once you successfully created a new account, in the polkadot JS extension, click on the ”gear” sign on the top-right corner and choose “Substrate” under “DISPLAY ADDRESS FORMAT FOR.” This will make polkadot JS to represent your Account ID in the correct address format used on “Rococo.” Naturally, deploying and calling any contract on-chain will cost some value, which is “ROC” tokens in the case of Rococo specifically. You can get some &#8220;ROC&#8221; tokens for free as follows:</p>\n\n\n\n<p>1. Visit the Rococo faucet channel on matrix <a href=\"https://matrix.to/#/#rococo-faucet:matrix.org\">here</a>.<br>2. Copy your Account ID in the “Substrate” address format and send the following command inside the Rococo faucet channel: &#8220;!drip YOUR_WALLET_ADDRESS:1002&#8221; (the &#8220;:1002&#8221; appended to your address is important).<br>3. A bot will respond to you shortly, confirming your balance. After a short while, you should also be able to confirm your balance by visiting the polkadot JS apps using this <a href=\"https://polkadot.js.org/apps/?rpc=wss%3A%2F%2Frococo-contracts-rpc.polkadot.io#/accounts\">link</a>.</p>\n\n\n\n<p>If something does not work out, you can find more detailed instructions related to the Rococo faucet <a href=\"https://github.com/paritytech/cumulus/blob/master/parachains/runtimes/contracts/contracts-rococo/README.md#rococo-deployment\">here</a>.</p>\n\n\n\n<h3>Deploying the contract to rococo</h3>\n\n\n\n<p>We are almost there! Back inside the contracts UI, you can switch to the “Contracts (Rococo)” network using the dropdown menu in the top left corner. Once connected, you are good to use your freshly created account, loaded up with some “ROC” tokens, to deploy the contract. From now on, instantiating your contract and interacting with it works in exactly the same way as on the local node.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/wWTlXcG-WJiP-rwTCkE0nCgh96UbetpzH0TLzaesvdKI-5MqlfRhPyRjwu7zBVZPYuSbCbXXwbpo2S5YoyDnq_-cB2Peo8w1cC0VN2QImA99k9_sD7b5UZs9cfHnNu8GNkpK4aYFsPx3SXt7uCR0MUaKyJ4s8XW4UQTjQU2j38NwsI82TX4wkg-1LC7rmA\" alt=\"\"/><figcaption><em>Image Image 4: The solidity contract deployed to the contracts parachain on Rococo</em></figcaption></figure>\n\n\n\n<p>Many congratulations! You have just successfully deployed your first Solidity Dapp to a substrate parachain <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/2728.png\" alt=\"✨\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n\n\n\n<h2>What’s next for Substrate</h2>\n\n\n\n<p>Primarily, we aim to fully support cross-call support between contracts written in ink! and Solidity. At the time of writing, it is only possible to call Solidity contracts from the ink! side in a rather bare-bones way. By implementing all missing primitives and supporting interfaces for bidirectional calls between ink! and Solidity, interacting with both worlds eventually will become a natural thing to do for smart contract authors targeting Substrate-based parachains.</p>\n\n\n\n<p>A future goal will be to provide Solidity contracts direct access to <a href=\"https://use.ink/macros-attributes/chain-extension\">chain extensions</a>. This will open up a variety of immense benefits. For example, it is the building block for accessing randomness through verifiable random functions without calling into an oracle contract. Ultimately, support for chain extensions will enable using <a href=\"https://polkadot.network/cross-chain-communication/\">XCM</a> within Solidity contracts. So stay tuned for the future!</p>\n\n\n\n<h3>Hyperledger Solang brings Solidity to many blockchains</h3>\n\n\n\n<p>Hyperledger Solang is designed to bring Solidity support to many blockchains. In addition to introducing compatibility with ink! v4, this release contains many small fixes and improvements.</p>\n\n\n\n<h3>A brief Solana update</h3>\n\n\n\n<p>On the Solana side, we are focusing on Anchor integration. Our goal is to have this finished by the next Solana Foundation hackathon so that participants can build their projects using Solidity. We still need to generate Anchor IDLs from Solidity contracts and integrate Anchor discriminators with Solang so that Rust contracts can call Solidity and vice versa. Recent breaking changes made the compiler incompatible with previous versions, but we are progressively updating the existing tooling until we switch to Anchor client side libraries.</p>\n\n\n\n<h3>We are looking forward to hearing from you!</h3>\n\n\n\n<p>If any blockchain would like to add Solidity to its list of supported smart contract languages, please do not hesitate to get in touch with us. We are excited to help anyone interested in integrating with Hyperledger Solang. As we mature our existing compilation targets, any form of feedback is highly appreciated. Try out Solang now and let us know how you get on!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/hyperledger-solang/2022/12/13/hyperledger-solang-release-v0-2-0-and-whats-to-come\">Hyperledger Solang Release v0.2.0 and what’s to come</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"With great pleasure we announce our most recent Hyperledger Solang Release: v0.2.0 “Berlin.” This release marks an important milestone towards maturing and stabilizing our Substrate compilation target: we are leaving ink! version 3 behind us in favor of introducing compatibility with the recent ink! 4 beta release! \nStatus update for our Substrate target\nWith the “Berlin” release, Hyperledger Solang substantially improved its compatibility with many existing Ethereum Dapps and concepts within the Polkadot and Kusama ecosystem. Porting from Ethereum to a Substrate Parachain is now easier since the compiler supports almost all language constructs as Ethereum Solidity 0.8. This release represents just the beginning of a series of upcoming achievements yet to unlock for the Substrate compilation target.\nGetting started with Hyperledger Solang on Substrate\nRunning your first Solidity contract on Substrate Parachains should be a matter of minutes. In this section we walk you through the few steps, showcasing how to use a classic Solidity example on Substrate. Namely, we are going to deploy an unmodified version of the “Voting” example contract, directly out of the Solidity documentation itself. According to Solidity documentation, the “Voting” contract example showcases a lot of Solidity’s features.\nPrerequisites\nTo follow along, you’ll need to install Solang version “0.2.0” on your system. We offer plenty of quick installation options, including Homebrew as well as pre-built binaries for all common platforms. Please consult our documentation for instructions specific to your platform. Impatient readers may as well just use our docker option, which doesn’t require installing anything, instead.\nIf you want to test contracts on a local node, you’ll need to run version “0.22.1” of “substrate-contracts-node” on your local machine. Installation instructions can be found here. Again, our impatient readers may use the “paritytech/contracts-ci-linux” Docker image instead as this image contains a compatible substrate node as well (at the time of writing).\nCompiling the “Voting” Solidity contract to WASM\nWe start with saving the source code of the “Voting” example contract into a file called “ballot.sol.”. There is no need to make any modification to the code, unless you want to tinker around a bit on your own. Now we use “solang” to compile the contract as follows:\nbash\nsolang compile --target substrate ballot.sol\nThe contract should compile without any warnings. If you prefer docker, you can use the following command instead:\nbash\ndocker run --rm -it -v $(pwd):/sources ghcr.io/hyperledger/solang:v0.2.0 compile -o /sources --target substrate /sources/ballot.sol\nNow, inside your current working directory, a new file called “Ballot.contract” should appear, containing the web assembly BLOB together with the metadata of the contract.\nTesting on a local development node\nBefore deploying the compiled contract to a testnet, let’s try it out on a local node. If you are in a hurry, you may as well skip this section and proceed directly with a deployment to a testnet. Start a local node on your machine using the following command:\nbash\nsubstrate-contracts-node --tmp --ws-external -lerror,runtime::contracts=debug\nAlternatively, the equivalent command for our docker users is as follows:\nbash\ndocker run --rm -it -p9944:9944 paritytech/contracts-ci-linux substrate-contracts-node --tmp --ws-external -lerror,runtime::contracts=debug\nThe odd looking “-lerror,runtime::contracts=debug” CLI option will instruct the node to use the debugging log level for the “contracts” pallet. This might come in handy as it effectively enables using the debug buffer, which allows the contract to communicate with the developer at runtime.\nDeploy the contract using the contracts UI\nNow head over to the contracts-UI and make sure to select ”Local Node” in the top-left corner. Then click on “Add New Contract” just below, and choose “Upload New Contract Code.” As the Contract Bundle, choose the ”Ballot.contract” file from the previous section. The node we are using comes with some special built-in accounts, which come in very handy for development purposes. The “alice” account is one of them and it is fine to use that for contract instantiation.\nImage 1: Choosing the compiled contract bundle in contracts-UI\n\n\n\nIn the next section, you’ll be presented with some options for contract instantiation. Primarily, you might want to add some more “proposalName”s to our voting Ballot by clicking the big “+” button on the right side, so that we can actually choose between different voting options later. The actual values for the ”proposalName” won’t matter at this point.\nImage 2: Configuring constructor arguments for contract instantiation in contracts UI\n\n\n\nWhen you are satisfied with your deployment options, scroll to the bottom of the page to click on “Next” and then “Upload and Instantiate.” Under the hood, this will call the intrinsic to instantiate the contract. As the node we are using is configured to have instant block finality, the operation should succeed immediately. You’ll find your freshly deployed contract on the left side and it will look like this:\nImage 3: The solidity contract deployed to a local node\n\n\n\nInteracting with the contract\nNow we can start playing with the contract by calling some of its functions. For example, try calling the “giveRightToVote()” function using the “alice” account, to entitle “bob,” “dave” and “eve” with the rights to submit a vote. You’ll notice that, if you are trying to call the ”vote()” function using an account that was not given voting rights priorly, the contract will trap and the transaction reverts as a consequence. If you did set the log level for the contracts runtime to “debug” in the previous step, you will be able to observe failed “require” statements in your local nodes terminal output. You will find a message like this when trying to submit a “vote()” using a non-entitled account as the caller:\n2022-12-07 18:45:46.496 DEBUG tokio-runtime-worker runtime::contracts: Execution finished with debug buffer: Has no right to vote\n\nDeploying to a testnet\nFinally, let’s see how we can deploy our ballot contract to the “Rococo” live testnet, turning it into a usable Dapp. For this we are going to use the polkadot JS browser extension to create some accounts. So make sure to install that in your browser if you don’t already have it.\nCreating test accounts\nWhile our local node conveniently provided us with accounts charged up with balance out of the box, this won’t be the case on any “real” network. Instead we will create dedicated accounts. Even though you could reuse any pre-existing value-bearing Accounts from polkadot.js for this experiment, it is considered best practice to always use dedicated throw-away accounts for any development purposes. In your browser, open the polkadot JS extensions and use “Create new Account,” accessible by clicking on the big  “+” button on the top right side.\nOnce you successfully created a new account, in the polkadot JS extension, click on the ”gear” sign on the top-right corner and choose “Substrate” under “DISPLAY ADDRESS FORMAT FOR.” This will make polkadot JS to represent your Account ID in the correct address format used on “Rococo.” Naturally, deploying and calling any contract on-chain will cost some value, which is “ROC” tokens in the case of Rococo specifically. You can get some “ROC” tokens for free as follows:\n1. Visit the Rococo faucet channel on matrix here.\n2. Copy your Account ID in the “Substrate” address format and send the following command inside the Rococo faucet channel: “!drip YOUR_WALLET_ADDRESS:1002” (the “:1002” appended to your address is important).\n3. A bot will respond to you shortly, confirming your balance. After a short while, you should also be able to confirm your balance by visiting the polkadot JS apps using this link.\nIf something does not work out, you can find more detailed instructions related to the Rococo faucet here.\nDeploying the contract to rococo\nWe are almost there! Back inside the contracts UI, you can switch to the “Contracts (Rococo)” network using the dropdown menu in the top left corner. Once connected, you are good to use your freshly created account, loaded up with some “ROC” tokens, to deploy the contract. From now on, instantiating your contract and interacting with it works in exactly the same way as on the local node.\nImage Image 4: The solidity contract deployed to the contracts parachain on Rococo\n\n\n\nMany congratulations! You have just successfully deployed your first Solidity Dapp to a substrate parachain \nWhat’s next for Substrate\nPrimarily, we aim to fully support cross-call support between contracts written in ink! and Solidity. At the time of writing, it is only possible to call Solidity contracts from the ink! side in a rather bare-bones way. By implementing all missing primitives and supporting interfaces for bidirectional calls between ink! and Solidity, interacting with both worlds eventually will become a natural thing to do for smart contract authors targeting Substrate-based parachains.\nA future goal will be to provide Solidity contracts direct access to chain extensions. This will open up a variety of immense benefits. For example, it is the building block for accessing randomness through verifiable random functions without calling into an oracle contract. Ultimately, support for chain extensions will enable using XCM within Solidity contracts. So stay tuned for the future!\nHyperledger Solang brings Solidity to many blockchains\nHyperledger Solang is designed to bring Solidity support to many blockchains. In addition to introducing compatibility with ink! v4, this release contains many small fixes and improvements.\nA brief Solana update\nOn the Solana side, we are focusing on Anchor integration. Our goal is to have this finished by the next Solana Foundation hackathon so that participants can build their projects using Solidity. We still need to generate Anchor IDLs from Solidity contracts and integrate Anchor discriminators with Solang so that Rust contracts can call Solidity and vice versa. Recent breaking changes made the compiler incompatible with previous versions, but we are progressively updating the existing tooling until we switch to Anchor client side libraries.\nWe are looking forward to hearing from you!\nIf any blockchain would like to add Solidity to its list of supported smart contract languages, please do not hesitate to get in touch with us. We are excited to help anyone interested in integrating with Hyperledger Solang. As we mature our existing compilation targets, any form of feedback is highly appreciated. Try out Solang now and let us know how you get on!\nThe post Hyperledger Solang Release v0.2.0 and what’s to come appeared first on Hyperledger Foundation.","dc:creator":"Cyrill Leutwiler, Lucas Steuernagel, Sean Young","content":"<p>With great pleasure we announce our most recent Hyperledger Solang Release: v0.2.0 “Berlin.” This release marks an important milestone towards maturing and stabilizing our Substrate compilation target: we are leaving...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/hyperledger-solang/2022/12/13/hyperledger-solang-release-v0-2-0-and-whats-to-come\">Hyperledger Solang Release v0.2.0 and what’s to come</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"With great pleasure we announce our most recent Hyperledger Solang Release: v0.2.0 “Berlin.” This release marks an important milestone towards maturing and stabilizing our Substrate compilation target: we are leaving...\nThe post Hyperledger Solang Release v0.2.0 and what’s to come appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=235145","categories":["Hyperledger Solang","smart contracts","software release","Solana","Solidarity","substrate"],"isoDate":"2022-12-13T16:30:00.000Z","from":"https://www.hyperledger.org/feed","hashId":"de26851b6c96785b69deb1aa45e584c6"},{"creator":"Milan Orban","title":"For US-Based Users: Swap Your Crypto With CIC Through Ledger Live","link":"https://www.ledger.com/blog/for-us-based-users-swap-your-crypto-with-cic-through-ledger-live","pubDate":"Tue, 13 Dec 2022 16:31:19 +0000","content:encoded":"\n<p></p>\n\n\n\n<figure class=\"wp-block-table cover-text\"><table class=\"has-background\" style=\"background-color:#e7f5fe\"><tbody><tr><td class=\"has-text-align-left\" data-align=\"left\"><br>Things to know:<em><br></em></td></tr><tr><td class=\"has-text-align-left\" data-align=\"left\"><br>&#8211; For US-based users: <a href=\"https://criptointercambio.com/en\" target=\"_blank\" rel=\"noreferrer noopener\">Crypto Intercambio</a> (CIC) is our new swap partner available on your Ledger Live desktop and mobile app Swap tab. With CIC, you can securely swap a wide range of coins and tokens including BTC,ETH, BNB and ERC-20&nbsp; tokens like USDT and USDC.<br><br>&#8211; The Ledger swap is the most secure swap you can make. It enables you to exchange your digital assets from the security of your <a href=\"https://shop.ledger.com/pages/hardware-wallets-comparison\" target=\"_blank\" rel=\"noreferrer noopener\">Ledger Nano</a>.<br><br>&#8211; Whether you want to <a href=\"https://www.ledger.com/buy\" target=\"_blank\" rel=\"noreferrer noopener\">buy</a>, <a href=\"https://www.ledger.com/academy/selling-crypto-how-and-why-does-one-do-it\" target=\"_blank\" rel=\"noreferrer noopener\">sell</a>, <a href=\"https://www.ledger.com/swap\" target=\"_blank\" rel=\"noreferrer noopener\">swap</a>, <a href=\"https://www.ledger.com/lend\" target=\"_blank\" rel=\"noreferrer noopener\">lend</a> or <a href=\"https://www.ledger.com/staking\" target=\"_blank\" rel=\"noreferrer noopener\">stake</a> your digital assets, Ledger is your secure gateway to the world of crypto and NFTs.&nbsp;<br></td></tr></tbody></table></figure>\n\n\n\n<p></p>\n\n\n\n<h3><strong>CIC Joins Ledger Live For A Secure &amp; Seamless Swap Experience</strong></h3>\n\n\n\n<p>With CIC now available in your Ledger Live app, you can securely swap a wide range of coins and tokens.</p>\n\n\n\n<p><a href=\"https://criptointercambio.com/en\" target=\"_blank\" rel=\"noreferrer noopener\">CIC</a> is a LATAM exchange that offers swapping service for major coins and tokens. The exchange will appear as one of the service providers. You can choose between fixed or floating rates, and no registration is required to use the service.&nbsp;</p>\n\n\n\n<p>The swapping process is very easy. In Ledger Live, navigate to the left sidebar menu and click Swap, select the coins you want to swap and the accounts for the assets you want to exchange, enter the amount you want to exchange before reviewing the transaction details. Then, all you need is to confirm the transaction by connecting and unlocking your Ledger Nano device.&nbsp;</p>\n\n\n\n<p>Learn more about swapping with CIC by reading our <a href=\"https://support.ledger.com/hc/en-us/articles/8225199865757?docs=true\" target=\"_blank\" rel=\"noreferrer noopener\">Customer Support</a> article.&nbsp;</p>\n\n\n\n<h3><strong>Why Swap Through the Ledger ecosystem?</strong></h3>\n\n\n\n<p>Swap refers to exchanging one crypto asset for another, like swapping your BTC into ETH. Swapping crypto can be interesting for a number of reasons, including making a profit, or diversifying your portfolio.&nbsp;</p>\n\n\n\n<p>The most common method of swapping crypto is using exchanges, though you wouldn’t be in full control of your crypto. Ledger’s Swap option allows you to exchange crypto while retaining security over your digital belongings.&nbsp;</p>\n\n\n\n<p>Learn more about swapping with the <a href=\"https://www.ledger.com/academy/what-is-swap\" target=\"_blank\" rel=\"noreferrer noopener\">Ledger Academy</a>.</p>\n","content:encodedSnippet":"Things to know:\n\n\n– For US-based users: Crypto Intercambio (CIC) is our new swap partner available on your Ledger Live desktop and mobile app Swap tab. With CIC, you can securely swap a wide range of coins and tokens including BTC,ETH, BNB and ERC-20  tokens like USDT and USDC.\n– The Ledger swap is the most secure swap you can make. It enables you to exchange your digital assets from the security of your Ledger Nano.\n– Whether you want to buy, sell, swap, lend or stake your digital assets, Ledger is your secure gateway to the world of crypto and NFTs. \n\n\n\n\n\n\n\nCIC Joins Ledger Live For A Secure & Seamless Swap Experience\nWith CIC now available in your Ledger Live app, you can securely swap a wide range of coins and tokens.\nCIC is a LATAM exchange that offers swapping service for major coins and tokens. The exchange will appear as one of the service providers. You can choose between fixed or floating rates, and no registration is required to use the service. \nThe swapping process is very easy. In Ledger Live, navigate to the left sidebar menu and click Swap, select the coins you want to swap and the accounts for the assets you want to exchange, enter the amount you want to exchange before reviewing the transaction details. Then, all you need is to confirm the transaction by connecting and unlocking your Ledger Nano device. \nLearn more about swapping with CIC by reading our Customer Support article. \nWhy Swap Through the Ledger ecosystem?\nSwap refers to exchanging one crypto asset for another, like swapping your BTC into ETH. Swapping crypto can be interesting for a number of reasons, including making a profit, or diversifying your portfolio. \nThe most common method of swapping crypto is using exchanges, though you wouldn’t be in full control of your crypto. Ledger’s Swap option allows you to exchange crypto while retaining security over your digital belongings. \nLearn more about swapping with the Ledger Academy.","dc:creator":"Milan Orban","content":"Things to know: &#8211; For US-based users: Crypto Intercambio (CIC) is our new swap partner available on your Ledger Live desktop and mobile app Swap tab. With CIC, you can securely swap a wide range of coins and tokens including BTC,ETH, BNB and ERC-20&#160; tokens like USDT and USDC. &#8211; The Ledger swap is the [&#8230;]","contentSnippet":"Things to know: – For US-based users: Crypto Intercambio (CIC) is our new swap partner available on your Ledger Live desktop and mobile app Swap tab. With CIC, you can securely swap a wide range of coins and tokens including BTC,ETH, BNB and ERC-20  tokens like USDT and USDC. – The Ledger swap is the […]","guid":"https://www.ledger.com/?p=257074","categories":["Blog posts","Product"],"isoDate":"2022-12-13T16:31:19.000Z","from":"https://www.ledger.com/category/blog-posts/feed/","hashId":"a3999f5d654dfe75e98db32718a03b0b"}]