[{"title":"Layer3 has partnered with Looks Rare","link":"https://mirror.xyz/0x7B0befc5B043148Cd7bD5cFeEEf7BC63D28edEC0/6AAce_T7VzSsmJ2BhvX16q6Gwho32cyMsgEx7EjAg5U","pubDate":"Thu, 15 Dec 2022 18:44:53 GMT","content:encoded":"<h2 id=\"community-first-nft-marketplace-with-plenty-of-rewards-for-users\">Community-first NFT Marketplace with plenty of rewards for users.</h2>\n<p>Layer3 is excited to announce our newest partnership with LooksRare.</p>\n<p>Part of being community-first means that LooksRare rewards, empowers, and gives back to the platform&#39;s users and creators.</p>\n<p>In other words, LooksRare is built to reward <strong>you</strong>!</p>\n<p>By buying or selling on their marketplace, you&#39;ll earn $LOOKS tokens, and 100% of trading fees earned in the platform are distributed to $LOOKS stakers.</p>\n<ul>\n<li><p>Use the platform = Earn $LOOKS = Stake $LOOKS</p>\n</li>\n<li><p>Others using the platform = Trading fees shared with you ($LOOKS Staker)</p>\n</li>\n<li><p>Learn everything about <a href=\"https://docs.looksrare.org/about/looks-tokenomics\">$LOOKS Tokenomics here</a></p>\n</li>\n</ul>\n<p>Our <strong>first</strong> Quest with LooksRare will help you to understand their marketplace functionally better and to start earning $LOOKS from the start.</p>\n<h2 id=\"ready-to-go-try-the-quest-out-here\">Ready to go? Try the Quest out here:</h2>\n<ol>\n<li><p>Answer a <a href=\"https://beta.layer3.xyz/quests/gm-looksrare\">Short Quiz</a></p>\n</li>\n<li><p>Buy, List, Offer</p>\n</li>\n<li><p>Earn &amp; Stake $LOOKs</p>\n</li>\n</ol>\n<h2 id=\"why-looksrare\">Why LooksRare?</h2>\n<p>LooksRare is the community-first NFT marketplace that rewards active users on their platform. Their custom built smart-contracts (and not a) prove the high quality of the team and developers involved in creating something unique without compromising security.</p>\n<p>Their technology has been designed from the floor up for <strong>scalability</strong>, <strong>speed</strong> and <strong>security</strong> using the latest and greatest tech.</p>\n<p>Another essential trait, in terms of security, LooksRare contracts are audited, where you can <a href=\"https://docs.looksrare.org/about/audits\">have access &amp; check here</a>.</p>\n<p>We&#39;re excited to continue working with <strong>LooksRare</strong> to expose you to the most innovative products being launched in the <strong>NFT Marketplace ecosystem</strong>.</p>\n<h2 id=\"learn-more\">Learn More</h2>\n<p>For more about Layer3 <a href=\"https://beta.layer3.xyz/intro\">Quests</a>, please take a look at our blog post</p>\n<p>For more about LooksRare, follow them on <a href=\"https://twitter.com/LooksRare\">Twitter</a> and join their <a href=\"https://discord.com/invite/looksrare\">Discord</a></p>\n<h2 id=\"for-more-layer3-quest-follow-layer3-on-twitter-and-join-our-discord\">For more <a href=\"https://alpha.layer3.xyz/\">Layer3</a> Quest, follow Layer3 on <a href=\"https://twitter.com/layer3xyz\">Twitter</a> and join our <a href=\"https://discord.com/invite/GHZceZhbZU\">Discord</a></h2>\n<p><em>If you find submirror valuable, please consider donate to wong2.eth to help cover server cost.</em></p>\n","content:encodedSnippet":"Community-first NFT Marketplace with plenty of rewards for users.\nLayer3 is excited to announce our newest partnership with LooksRare.\nPart of being community-first means that LooksRare rewards, empowers, and gives back to the platform's users and creators.\nIn other words, LooksRare is built to reward you!\nBy buying or selling on their marketplace, you'll earn $LOOKS tokens, and 100% of trading fees earned in the platform are distributed to $LOOKS stakers.\nUse the platform = Earn $LOOKS = Stake $LOOKS\nOthers using the platform = Trading fees shared with you ($LOOKS Staker)\nLearn everything about $LOOKS Tokenomics here\nOur first Quest with LooksRare will help you to understand their marketplace functionally better and to start earning $LOOKS from the start.\nReady to go? Try the Quest out here:\nAnswer a Short Quiz\nBuy, List, Offer\nEarn & Stake $LOOKs\nWhy LooksRare?\nLooksRare is the community-first NFT marketplace that rewards active users on their platform. Their custom built smart-contracts (and not a) prove the high quality of the team and developers involved in creating something unique without compromising security.\nTheir technology has been designed from the floor up for scalability, speed and security using the latest and greatest tech.\nAnother essential trait, in terms of security, LooksRare contracts are audited, where you can have access & check here.\nWe're excited to continue working with LooksRare to expose you to the most innovative products being launched in the NFT Marketplace ecosystem.\nLearn More\nFor more about Layer3 Quests, please take a look at our blog post\nFor more about LooksRare, follow them on Twitter and join their Discord\nFor more Layer3 Quest, follow Layer3 on Twitter and join our Discord\nIf you find submirror valuable, please consider donate to wong2.eth to help cover server cost.","guid":"https://mirror.xyz/0x7B0befc5B043148Cd7bD5cFeEEf7BC63D28edEC0/6AAce_T7VzSsmJ2BhvX16q6Gwho32cyMsgEx7EjAg5U","isoDate":"2022-12-15T18:44:53.000Z","from":"https://submirror.xyz/0x7B0befc5B043148Cd7bD5cFeEEf7BC63D28edEC0","hashId":"333edb87c229bfd3ff8522a54d7e51e6"},{"title":"Applying Balancer’s Managed Pool Controllers to Manage Liquidity in Bonding Curves\n","link":"https://mirror.xyz/0x829Ceb00fC74bD087b1e50d31ec628a90894cD52/YPI5RbKi9CyIEgpnrFtmnyACHMtTHM9FBsMJFjdwLXI","pubDate":"Thu, 15 Dec 2022 19:00:05 GMT","content:encoded":"<pre><code>Table of Contents:\n  Intro\n  Managed Pools (MP)\n  MP Controller Design\n    Valory’s Smart Managed Pool Off-Chain Controller (SMP)\n    Orb’s Managed Pool On-Chain Controller (MPC)\n  Canonical Bonding Curves\n  MP Controllers for Bonding Curve Liquidity Management\n  Optimizing Bonding Curve Liquidity with MP Controllers\n    Circuit Breakers\n    Add/Remove Tokens\n    Dynamic Token Weight and Fee Management\n  Conclusion\n</code></pre>\n<h1 id=\"intro\">Intro</h1>\n<p>Managed pool (MP) controllers can manage liquidity across multiple sources. Managed pools (MPs) are a new type of liquidity pool introduced by Balancer. MP controllers extend the functionality of the MP through automated liquidity management. MP controllers follow a set of predefined rules and conditions and can be built both off-chain or on-chain. Controllers can also manage other sources of liquidity by taking inputs from those sources of liquidity such as a bonding curve. </p>\n<h1 id=\"managed-pools-mp\">Managed Pools (MP)</h1>\n<p>Balancer&#39;s managed pools (MPs) allow users to construct and manage multi-asset liquidity pools with flexibility. MP functionality includes LP whitelists, the ability to include up to 50 tokens in a pool, and the ability to toggle variable fees. The composition of token weights can be changed dynamically and circuit breaker mechanics can protect against malicious/compromised tokens. However, the flexibility of MPs can also be overwhelming, and additional infrastructure is required for automated liquidity management.</p>\n<h1 id=\"mp-controller-design\">MP Controller Design</h1>\n<p>To access the full capabilities of MPs, controllers are being built that extend their functionality. On Ethereum, Valory is building a smart managed pool (SMP) based on their off-chain autonomous agent bot infrastructure, while Orb is building a managed pool controller (MPC) to manage MP state parameters directly on the chain. On Celo, GoodDollar and Symmetric are building an MP controller for bonding curves. These controller designs reflect the flexibility of MPs, and can offer a lot of flexibility for liquidity management, such as implementing trading strategies and managing bonding curves.</p>\n<h3 id=\"valorys-smart-managed-pool-off-chain-controller-smp\">Valory’s Smart Managed Pool Off-Chain Controller (SMP)</h3>\n<p>Valory is a team that focuses on building open source autonomous applications on distributed ledger technology. Their <a href=\"https://www.autonolas.network/\">Autonolas</a> application uses the Open Autonomy framework to manage multi-agent services off-chain, extending smart contract functionality and allowing complex operations to be executed in a decentralized, trust-minimized, and transparent way. Autonomous sources can pull data from a variety of sources, such as AWS storage buckets and cryp-native data sources like IPFS, Ceramic, or The Graph. Agents that run services must agree on servicer terms similar to service level agreements (SLAs) and achieve consensus using the tendermint library, which is the same consensus method used by the Cosmos ecosystem. Valory <a href=\"https://medium.com/@BalancerGrants/valory-is-building-smart-managed-pools-on-balancer-1b03a2f4cc89\">recently received a Balancer grant</a> to extend the current MP structure to include automation via smart managed pools (SMPs), which use autonomous agent software to create robotic MP managers.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/i5yB3vZLSbsrHP-YzUYvk.png?height=352&width=704\" alt=\"Source for diagram \"></p>\n<h3 id=\"orbs-managed-pool-on-chain-controller-mpc\">Orb’s Managed Pool On-Chain Controller (MPC)</h3>\n<p>Orb Collective, a team spun out from Balancer Labs, is <a href=\"https://forum.balancer.fi/t/orb-collective-november-2022-update/4102\">leading the development and adoption of managed pools and has developed the MP controller V1</a> with features including the ability to add/remove tokens, an emergency stop, token trading and reweighting, adjusting the MP management fee, transferring manager rights, and updating circuit breakers. The MP state is managed by state parameters under the direction of a controller smart contract. Since the smart contract is the controller, the MP is managed entirely on-chain.</p>\n<p>One complex feature that the MP controller V1 provides is the ability to add or remove tokens from an MP without providing initial seed capital. This mechanism relies on arbitrageurs to fill or drain the pool&#39;s token balance and restore the MP to its desired composition. While this mechanism usually works, there are some unforeseen negative consequences around token joins and exits. A potential fix has been identified, but it is not yet clear whether it offers a permanent solution to the problem.</p>\n<p>When initial token liquidity is being added or removed from an MP, the MP controller has to consider two distinct states. The first state occurs when a token&#39;s liquidity weight is going from 0% to the minimum 1% weight. The current mechanism enables trading by using the MP controller to set a virtual balance to get around the initial 0 liquidity weight. A swap fee is then used to incentivize further rebalancing and smooth arbitrage opportunities as the new token is added or removed. The second state occurs when the token is going from the 1% minimum weight to the desired weight. Arbitrageurs are incentivized by a gradual weight shift until the desired weight is reached.</p>\n<p>The flexibility of MPs allows for multiple techniques for adding and removing tokens. For example, token replacement could involve trading all of Token A for Token B. Another technique, which involves trust and custody assumptions for the manager, is for the MPC to add Token A, then provide the minimum Token A liquidity denominated in Token A as seed liquidity.</p>\n<h1 id=\"canonical-bonding-curves\">Canonical Bonding Curves</h1>\n<p>A canonical bonding curve is a trading function that determines the swap rate between ratios of two different assets, setting the price between the ratio of the assets being traded. The concept was popularized initially <a href=\"https://drive.google.com/file/d/0B3HPNP-GDn7aLXFWOFpTZEgyaEk/view?resourcekey=0-4Ig-YpDMIC0W2rLmTtWeDA\">by Bancor</a>. Bancor&#39;s bonding curve uses a constant reserve ratio (CRR) to calculate the price of a bonding curve swap. A higher CRR means there is more supply in liquidity to absorb volatility, while a lower CRR means there is less liquidity and less in circulation, which can be considered as a &quot;credit&quot; compared to the original amount. However, this bonding curve design is <a href=\"https://arxiv.org/pdf/2203.10644.pdf\">susceptible to sandwich attacks and encourages speculation</a>.</p>\n<p>An <a href=\"https://arxiv.org/pdf/2203.10644.pdf\">allocation curve</a> design is a more general bonding curve that improves on the canonical bonding curve sandwich attack flaw. Allocation curves introduce harbinger-like taxes to make token allocation between investors and speculators. The investment efficiency becomes more efficient for investors as opposed to speculators and aims to make token allocation more equitable.</p>\n<h1 id=\"mp-controllers-for-bonding-curve-liquidity-management\">MP Controllers for Bonding Curve Liquidity Management</h1>\n<p>Recently, there has been interest in providing controllers for bonding curves to extend DeFi composability and liquidity depth around bonding curve token liquidity. <a href=\"https://resources.carbondefi.xyz/pages/CarbonLitepaper.pdf\">Carbon</a>, created by the Bancor team, manages bonding curve liquidity across multiple bonding curves on-chain using an asymmetric liquidity design. Instead of providing liquidity to a single curve that trades symmetrically in both directions, users provide liquidity to two curves that each trade in one direction. This design gives users greater control to express their trading preferences.</p>\n<p>Asymmetric liquidity allows for the creation of individual user strategies composed of two bonding curves, where each curve executes irreversible trades. This gives users the ability to create automated trading strategies composed of one or two on-chain limit or range orders for any given token pair, with each order represented by a unique, adjustable bonding curve.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/Q7NVCEQCWE8LAZAOg9Tjn.png?height=458&width=648\" alt=\"\"></p>\n<p>The specifics of Carbon require Bancor DAO governance approval and are subject to change, with voting occurring via Carbon&#39;s proposed governance token, vBNT. Although Bancor governance might make Carbon adoption difficult outside of Bancor, the ideas of asymmetric liquidity are similar to MP liquidity, where the token weight composition is mapped to a range of buying and selling price ranges for tokens within the pool.</p>\n<h1 id=\"optimizing-bonding-curve-liquidity-with-mp-controllers\">Optimizing Bonding Curve Liquidity with MP Controllers</h1>\n<p>Unlike Carbon, which only manages multiple bonding curves, the balancer MP controller can be used to work between a bonding curve and a MP. If the MP provides the majority of liquidity for the bonding curve token assets, then controlling the MP directly impacts the liquidity of the bonding curve. The MP acts as a gateway to the bonding curve by increasing the bonding curve liquidity depth and offering more control over the tokens within the bonding curve.</p>\n<p>This section examines the connection between MP controllers and bonding curves. We explore design considerations and tradeoffs to adapt a MP controller to incorporate bonding curve state parameters, such as circuit breakers, the ability to add and remove tokens, token weights and fees, and constant reserve ratios.</p>\n<h4 id=\"circuit-breakers\">Circuit Breakers</h4>\n<p>The circuit breaker should only be used in emergency situations, such as highly volatile market movements. The circuit breaker is designed to freeze the system state if it becomes very volatile, such as in the event of a hack that drains a token in the pool or some other catastrophic event. If the CRR between two tokens in a bonding curve reaches an unstable level, the circuit breaker in the MP can be triggered to stop trading. If the MP is the main source of liquidity, enabling the circuit breaker would cause liquidity to freeze and prevent the reserve ratio from deteriorating further. Although the circuit breaker does not solve the issue directly, it provides time to develop a solution to restore the reserve ratio to a more stable level.</p>\n<h4 id=\"addremove-tokens\">Add/Remove Tokens</h4>\n<p>There are many cases where the MP token index needs to be changed, such as when new partner tokens need to be added to the MP or when liquidity migration occurs and old tokens need to be removed. Currently, Orb is researching and developing best practices for adding and removing tokens through the on-chain MPC. For example, a large amount of tokens may need to be transferred from the MP to the bonding curve to adjust the reserve ratio. Depending on the blockchain, if there is not sufficient MEV protection, this type of token transaction between the MP and bonding curve reserve may be vulnerable to sandwich attacks. Sandwich attacks can frontrun these transactions if there is information leakage that MEV bots can exploit.</p>\n<h4 id=\"dynamic-token-weight-and-fee-management\">Dynamic Token Weight and Fee Management</h4>\n<p>Finally, the dynamic token weight management is a more general controller feature that enforces on the monetary policy set by the controller. There is flexibility to automate token weight management around desired reserve ratios or other economic conditions that a DAO sees fit by modifying the controller. </p>\n<p>Although the canonical bonding curve usually has fee mechanisms in place, if the MP holds the majority of liquid tokens from the bonding curve, the MP swap fees could act as a fee collector for the bonding curve if they are added to the bonding curve periodically over time.</p>\n<p>By creating a dynamic fee policy for the MP controller, this also creates a dynamic fee policy for the bonding curve.</p>\n<h1 id=\"conclusion\">Conclusion</h1>\n<h2 id=\"in-conclusion-managed-pool-mp-controllers-are-an-essential-extension-of-mp-functionality-that-enables-automated-liquidity-management-balancer-mp-controllers-provide-a-new-framework-to-manage-liquidity-across-multiple-sources-the-mp-controller-framework-can-be-used-to-manage-liquidity-within-bonding-curves-leveraging-balancer-mps-offers-more-granular-control-over-the-bonding-curve-and-increases-liquidity-depth-for-the-bonding-curve-tokens\">In conclusion, managed pool (MP) controllers are an essential extension of MP functionality that enables automated liquidity management. Balancer MP controllers provide a new framework to manage liquidity across multiple sources. The MP controller framework can be used to manage liquidity within bonding curves. Leveraging Balancer MPs offers more granular control over the bonding curve and increases liquidity depth for the bonding curve tokens.</h2>\n<p><em>If you find submirror valuable, please consider donate to wong2.eth to help cover server cost.</em></p>\n","content:encodedSnippet":"Table of Contents:\n  Intro\n  Managed Pools (MP)\n  MP Controller Design\n    Valory’s Smart Managed Pool Off-Chain Controller (SMP)\n    Orb’s Managed Pool On-Chain Controller (MPC)\n  Canonical Bonding Curves\n  MP Controllers for Bonding Curve Liquidity Management\n  Optimizing Bonding Curve Liquidity with MP Controllers\n    Circuit Breakers\n    Add/Remove Tokens\n    Dynamic Token Weight and Fee Management\n  Conclusion\n\nIntro\nManaged pool (MP) controllers can manage liquidity across multiple sources. Managed pools (MPs) are a new type of liquidity pool introduced by Balancer. MP controllers extend the functionality of the MP through automated liquidity management. MP controllers follow a set of predefined rules and conditions and can be built both off-chain or on-chain. Controllers can also manage other sources of liquidity by taking inputs from those sources of liquidity such as a bonding curve. \nManaged Pools (MP)\nBalancer's managed pools (MPs) allow users to construct and manage multi-asset liquidity pools with flexibility. MP functionality includes LP whitelists, the ability to include up to 50 tokens in a pool, and the ability to toggle variable fees. The composition of token weights can be changed dynamically and circuit breaker mechanics can protect against malicious/compromised tokens. However, the flexibility of MPs can also be overwhelming, and additional infrastructure is required for automated liquidity management.\nMP Controller Design\nTo access the full capabilities of MPs, controllers are being built that extend their functionality. On Ethereum, Valory is building a smart managed pool (SMP) based on their off-chain autonomous agent bot infrastructure, while Orb is building a managed pool controller (MPC) to manage MP state parameters directly on the chain. On Celo, GoodDollar and Symmetric are building an MP controller for bonding curves. These controller designs reflect the flexibility of MPs, and can offer a lot of flexibility for liquidity management, such as implementing trading strategies and managing bonding curves.\nValory’s Smart Managed Pool Off-Chain Controller (SMP)\nValory is a team that focuses on building open source autonomous applications on distributed ledger technology. Their Autonolas application uses the Open Autonomy framework to manage multi-agent services off-chain, extending smart contract functionality and allowing complex operations to be executed in a decentralized, trust-minimized, and transparent way. Autonomous sources can pull data from a variety of sources, such as AWS storage buckets and cryp-native data sources like IPFS, Ceramic, or The Graph. Agents that run services must agree on servicer terms similar to service level agreements (SLAs) and achieve consensus using the tendermint library, which is the same consensus method used by the Cosmos ecosystem. Valory recently received a Balancer grant to extend the current MP structure to include automation via smart managed pools (SMPs), which use autonomous agent software to create robotic MP managers.\n\nOrb’s Managed Pool On-Chain Controller (MPC)\nOrb Collective, a team spun out from Balancer Labs, is leading the development and adoption of managed pools and has developed the MP controller V1 with features including the ability to add/remove tokens, an emergency stop, token trading and reweighting, adjusting the MP management fee, transferring manager rights, and updating circuit breakers. The MP state is managed by state parameters under the direction of a controller smart contract. Since the smart contract is the controller, the MP is managed entirely on-chain.\nOne complex feature that the MP controller V1 provides is the ability to add or remove tokens from an MP without providing initial seed capital. This mechanism relies on arbitrageurs to fill or drain the pool's token balance and restore the MP to its desired composition. While this mechanism usually works, there are some unforeseen negative consequences around token joins and exits. A potential fix has been identified, but it is not yet clear whether it offers a permanent solution to the problem.\nWhen initial token liquidity is being added or removed from an MP, the MP controller has to consider two distinct states. The first state occurs when a token's liquidity weight is going from 0% to the minimum 1% weight. The current mechanism enables trading by using the MP controller to set a virtual balance to get around the initial 0 liquidity weight. A swap fee is then used to incentivize further rebalancing and smooth arbitrage opportunities as the new token is added or removed. The second state occurs when the token is going from the 1% minimum weight to the desired weight. Arbitrageurs are incentivized by a gradual weight shift until the desired weight is reached.\nThe flexibility of MPs allows for multiple techniques for adding and removing tokens. For example, token replacement could involve trading all of Token A for Token B. Another technique, which involves trust and custody assumptions for the manager, is for the MPC to add Token A, then provide the minimum Token A liquidity denominated in Token A as seed liquidity.\nCanonical Bonding Curves\nA canonical bonding curve is a trading function that determines the swap rate between ratios of two different assets, setting the price between the ratio of the assets being traded. The concept was popularized initially by Bancor. Bancor's bonding curve uses a constant reserve ratio (CRR) to calculate the price of a bonding curve swap. A higher CRR means there is more supply in liquidity to absorb volatility, while a lower CRR means there is less liquidity and less in circulation, which can be considered as a \"credit\" compared to the original amount. However, this bonding curve design is susceptible to sandwich attacks and encourages speculation.\nAn allocation curve design is a more general bonding curve that improves on the canonical bonding curve sandwich attack flaw. Allocation curves introduce harbinger-like taxes to make token allocation between investors and speculators. The investment efficiency becomes more efficient for investors as opposed to speculators and aims to make token allocation more equitable.\nMP Controllers for Bonding Curve Liquidity Management\nRecently, there has been interest in providing controllers for bonding curves to extend DeFi composability and liquidity depth around bonding curve token liquidity. Carbon, created by the Bancor team, manages bonding curve liquidity across multiple bonding curves on-chain using an asymmetric liquidity design. Instead of providing liquidity to a single curve that trades symmetrically in both directions, users provide liquidity to two curves that each trade in one direction. This design gives users greater control to express their trading preferences.\nAsymmetric liquidity allows for the creation of individual user strategies composed of two bonding curves, where each curve executes irreversible trades. This gives users the ability to create automated trading strategies composed of one or two on-chain limit or range orders for any given token pair, with each order represented by a unique, adjustable bonding curve.\n\nThe specifics of Carbon require Bancor DAO governance approval and are subject to change, with voting occurring via Carbon's proposed governance token, vBNT. Although Bancor governance might make Carbon adoption difficult outside of Bancor, the ideas of asymmetric liquidity are similar to MP liquidity, where the token weight composition is mapped to a range of buying and selling price ranges for tokens within the pool.\nOptimizing Bonding Curve Liquidity with MP Controllers\nUnlike Carbon, which only manages multiple bonding curves, the balancer MP controller can be used to work between a bonding curve and a MP. If the MP provides the majority of liquidity for the bonding curve token assets, then controlling the MP directly impacts the liquidity of the bonding curve. The MP acts as a gateway to the bonding curve by increasing the bonding curve liquidity depth and offering more control over the tokens within the bonding curve.\nThis section examines the connection between MP controllers and bonding curves. We explore design considerations and tradeoffs to adapt a MP controller to incorporate bonding curve state parameters, such as circuit breakers, the ability to add and remove tokens, token weights and fees, and constant reserve ratios.\nCircuit Breakers\nThe circuit breaker should only be used in emergency situations, such as highly volatile market movements. The circuit breaker is designed to freeze the system state if it becomes very volatile, such as in the event of a hack that drains a token in the pool or some other catastrophic event. If the CRR between two tokens in a bonding curve reaches an unstable level, the circuit breaker in the MP can be triggered to stop trading. If the MP is the main source of liquidity, enabling the circuit breaker would cause liquidity to freeze and prevent the reserve ratio from deteriorating further. Although the circuit breaker does not solve the issue directly, it provides time to develop a solution to restore the reserve ratio to a more stable level.\nAdd/Remove Tokens\nThere are many cases where the MP token index needs to be changed, such as when new partner tokens need to be added to the MP or when liquidity migration occurs and old tokens need to be removed. Currently, Orb is researching and developing best practices for adding and removing tokens through the on-chain MPC. For example, a large amount of tokens may need to be transferred from the MP to the bonding curve to adjust the reserve ratio. Depending on the blockchain, if there is not sufficient MEV protection, this type of token transaction between the MP and bonding curve reserve may be vulnerable to sandwich attacks. Sandwich attacks can frontrun these transactions if there is information leakage that MEV bots can exploit.\nDynamic Token Weight and Fee Management\nFinally, the dynamic token weight management is a more general controller feature that enforces on the monetary policy set by the controller. There is flexibility to automate token weight management around desired reserve ratios or other economic conditions that a DAO sees fit by modifying the controller. \nAlthough the canonical bonding curve usually has fee mechanisms in place, if the MP holds the majority of liquid tokens from the bonding curve, the MP swap fees could act as a fee collector for the bonding curve if they are added to the bonding curve periodically over time.\nBy creating a dynamic fee policy for the MP controller, this also creates a dynamic fee policy for the bonding curve.\nConclusion\nIn conclusion, managed pool (MP) controllers are an essential extension of MP functionality that enables automated liquidity management. Balancer MP controllers provide a new framework to manage liquidity across multiple sources. The MP controller framework can be used to manage liquidity within bonding curves. Leveraging Balancer MPs offers more granular control over the bonding curve and increases liquidity depth for the bonding curve tokens.\nIf you find submirror valuable, please consider donate to wong2.eth to help cover server cost.","guid":"https://mirror.xyz/0x829Ceb00fC74bD087b1e50d31ec628a90894cD52/YPI5RbKi9CyIEgpnrFtmnyACHMtTHM9FBsMJFjdwLXI","isoDate":"2022-12-15T19:00:05.000Z","from":"https://submirror.xyz/0x829Ceb00fC74bD087b1e50d31ec628a90894cD52","hashId":"778c87ea28513b0c3459127417cb80be"}]