[{"creator":"Web3 Bites","title":"37xDubai Raises $5 Million from Morningstar Ventures to Build NFT Art Gallery for the Future ","link":"https://hackernoon.com/37xdubai-raises-dollar5-million-from-morningstar-ventures-to-build-nft-art-gallery-for-the-future?source=rss","pubDate":"Tue, 13 Dec 2022 07:30:20 GMT","content:encoded":"<h2 id=\"understandingwhyartgalleriesmatter\">Understanding Why Art Galleries Matter</h2>\n<p>Art gallery spaces are critical for the development of art and for promoting and selling an artist's work to interested people. People who work at museums and art galleries do more than just stand around and look at paintings and sculptures. I think that an art gallery is a place where artists, collectors, and art lovers can talk about art, try new things, and work together. My opinion is that art galleries give people an experience that helps them connect with the art on a deeper level.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/7rEmNIeHNFOBfZZtUMQerOZIGGH3-0p93o0r.jpeg\" alt=\"\" /></p>\n<p>From an artist's point of view, how something looks has a big impact on how it is judged since how something looks defines what art is. The way art galleries look is mostly meant to highlight the feelings and ideas that each piece of art shows. In an ideal world, a gallery or show would tell the story of how the work was done. This would <a href=\"https://www.artworkarchive.com/blog/what-is-the-artist-s-role-in-society\">encourage</a> aspiring artists to try new things and develop their own styles and techniques. Even though art galleries have become commonplace in today's world, that doesn't make them less important to society or to a person's present and future.</p>\n<h2 id=\"whynftartgalleriesmatterforthedigitalartindustry\">Why NFT Art Galleries Matter for the Digital Art Industry</h2>\n<p>In my opinion, as people learn more about NFTs art and how they might be used, their ideas about NFTs change for the better. NFT artists are brought to the attention of more potential patrons, which could lead to more money for them. By bridging the gap between the digital and real worlds, NFT galleries may give artists and investors new ways to make money. Many people who know a lot about art think that a digital piece of art is not as valuable as a physical one. A digital art gallery could help bridge the gap between people who like NFT and people who like traditional art.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/7rEmNIeHNFOBfZZtUMQerOZIGGH3-ffa3o3g.jpeg\" alt=\"\" /></p>\n<p>These galleries are your best bet if you're a new artist who wants to break into the art world. The media might pay attention to a gallery show of NFTs because they are so different from traditional art. By doing this, you might make it easier for possible investors to find you.</p>\n<h2 id=\"37xdubairaisesd5milliontocreatenftartgalleryindubai\">37x Dubai Raises $5 Million to Create NFT Art Gallery in Dubai</h2>\n<p>The new future art gallery 37xDubai in the heart of Dubai received $5 Million in funding from Morningstar Ventures. The Burj Daman Tower (DIFC area) is home to '37xDubai,' right in the heart of Dubai's commercial and social hub. By highlighting web3 education, traditional art, digital art, entertainment, and community, 37xDubai hopes to create a connection between the artistic and technological worlds.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/7rEmNIeHNFOBfZZtUMQerOZIGGH3-zmc3oi7.jpeg\" alt=\"\" /></p>\n<p>37xDubai will be much more than simply a gallery thanks to its meticulously chosen collection of art and interactive experiences. The goal of 37xDubai is to foster a worldwide network of people interested in digital art by means of workshops, exclusive events, and regular meetups.</p>\n<p>:::info\n<strong>Vested Interest Disclosure</strong>:&nbsp;<em>The author is an independent contributor publishing via our&nbsp;<strong><a href=\"https://sponsor.hackernoon.com/brand-as-author?ref=hackernoon.com\">brand-as-author program</a></strong>. Be it through direct compensation, media partnerships, or networking. The author has a vested interest in the company/ies mentioned in this story. HackerNoon has reviewed the report for quality, but the claims herein belong to the author. #DYOR</em></p>\n<p>:::</p>\n<p>As a result of the efforts of Morningstar Ventures and 37x, the featured artists will be able to connect with a large audience of people interested in web3. The 37xDubai gallery is able to accommodate a wide range of ideas because of its modular design, which allows for frequent modifications in the displayed collections.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/7rEmNIeHNFOBfZZtUMQerOZIGGH3-3ya3onm.jpeg\" alt=\"\" /></p>\n<h2 id=\"whatis37xdubai\">What is 37x Dubai?</h2>\n<p>Incorporating NFTs, web3 education, traditional art, digital art, entertainment, and community development, 37xDubai is an immersive and interactive art exhibition. With the goal of bridging the gap between the art world and the IT world, 37xDubai is an art a gallery, displaying a variety of artworks that are also digital experiences. Clemence Cazeau, the company's chief executive officer, came up with the novel idea, and Morningstar Ventures, an investment firm located in Dubai that specialises in web 3, has supported the venture financially.</p>\n<p>\\\nDon’t forget to like and share the story!</p>\n<p>Image credits: <a href=\"https://unsplash.com/@joshtw\">Josh Liu</a>, <a href=\"https://unsplash.com/@robconcam\">Roberto Contreras</a> and <a href=\"https://unsplash.com/@christoph\">Christoph Schulz</a>.</p>\n<p>\\\n\\\n\\</p>","content:encodedSnippet":"Understanding Why Art Galleries Matter\nArt gallery spaces are critical for the development of art and for promoting and selling an artist's work to interested people. People who work at museums and art galleries do more than just stand around and look at paintings and sculptures. I think that an art gallery is a place where artists, collectors, and art lovers can talk about art, try new things, and work together. My opinion is that art galleries give people an experience that helps them connect with the art on a deeper level.\n\\\n \nFrom an artist's point of view, how something looks has a big impact on how it is judged since how something looks defines what art is. The way art galleries look is mostly meant to highlight the feelings and ideas that each piece of art shows. In an ideal world, a gallery or show would tell the story of how the work was done. This would encourage aspiring artists to try new things and develop their own styles and techniques. Even though art galleries have become commonplace in today's world, that doesn't make them less important to society or to a person's present and future.\nWhy NFT Art Galleries Matter for the Digital Art Industry\nIn my opinion, as people learn more about NFTs art and how they might be used, their ideas about NFTs change for the better. NFT artists are brought to the attention of more potential patrons, which could lead to more money for them. By bridging the gap between the digital and real worlds, NFT galleries may give artists and investors new ways to make money. Many people who know a lot about art think that a digital piece of art is not as valuable as a physical one. A digital art gallery could help bridge the gap between people who like NFT and people who like traditional art.\n\\\n \nThese galleries are your best bet if you're a new artist who wants to break into the art world. The media might pay attention to a gallery show of NFTs because they are so different from traditional art. By doing this, you might make it easier for possible investors to find you.\n37x Dubai Raises $5 Million to Create NFT Art Gallery in Dubai\nThe new future art gallery 37xDubai in the heart of Dubai received $5 Million in funding from Morningstar Ventures. The Burj Daman Tower (DIFC area) is home to '37xDubai,' right in the heart of Dubai's commercial and social hub. By highlighting web3 education, traditional art, digital art, entertainment, and community, 37xDubai hopes to create a connection between the artistic and technological worlds.\n\\\n \n37xDubai will be much more than simply a gallery thanks to its meticulously chosen collection of art and interactive experiences. The goal of 37xDubai is to foster a worldwide network of people interested in digital art by means of workshops, exclusive events, and regular meetups.\n:::info\nVested Interest Disclosure: The author is an independent contributor publishing via our brand-as-author program. Be it through direct compensation, media partnerships, or networking. The author has a vested interest in the company/ies mentioned in this story. HackerNoon has reviewed the report for quality, but the claims herein belong to the author. #DYOR\n:::\nAs a result of the efforts of Morningstar Ventures and 37x, the featured artists will be able to connect with a large audience of people interested in web3. The 37xDubai gallery is able to accommodate a wide range of ideas because of its modular design, which allows for frequent modifications in the displayed collections.\n\\\n \nWhat is 37x Dubai?\nIncorporating NFTs, web3 education, traditional art, digital art, entertainment, and community development, 37xDubai is an immersive and interactive art exhibition. With the goal of bridging the gap between the art world and the IT world, 37xDubai is an art a gallery, displaying a variety of artworks that are also digital experiences. Clemence Cazeau, the company's chief executive officer, came up with the novel idea, and Morningstar Ventures, an investment firm located in Dubai that specialises in web 3, has supported the venture financially.\n\\\nDon’t forget to like and share the story!\nImage credits: Josh Liu, Roberto Contreras and Christoph Schulz.\n\\\n\\\n\\","dc:creator":"Web3 Bites","content":"Art gallery spaces are critical for the development of art and for promoting and selling an artist's work to interested people. Art galleries give people an experience that helps them connect with the art on a deeper level. NFT artists are brought to the attention of more potential patrons, which could lead to more money for them. 37x Dubai Raises $5 Million to Create NFT Art Gallery in Dubai. The goal of 37xDubai is to foster a worldwide network of people interested in digital art by means of workshops and exclusive events.","contentSnippet":"Art gallery spaces are critical for the development of art and for promoting and selling an artist's work to interested people. Art galleries give people an experience that helps them connect with the art on a deeper level. NFT artists are brought to the attention of more potential patrons, which could lead to more money for them. 37x Dubai Raises $5 Million to Create NFT Art Gallery in Dubai. The goal of 37xDubai is to foster a worldwide network of people interested in digital art by means of workshops and exclusive events.","guid":"https://hackernoon.com/37xdubai-raises-dollar5-million-from-morningstar-ventures-to-build-nft-art-gallery-for-the-future?source=rss","categories":["art","non-fungible-tokens","web3","nft-art","artist","nft-gallery","good-company","nft-artist"],"isoDate":"2022-12-13T07:30:20.000Z","from":"https://hackernoon.com/feed","hashId":"f003a07a0bf4b18c9fb6ed83443bedfc"},{"creator":"Perch","title":"How I Built a Successful Digital Mortgage Startup in Canada","link":"https://hackernoon.com/how-i-built-a-successful-digital-mortgage-startup-in-canada?source=rss","pubDate":"Tue, 13 Dec 2022 12:26:39 GMT","content:encoded":"<p>:::tip\n<strong><em>Alex Leduc, CEO of Perch, on building and running a fintech startup in the mortgage industry.</em></strong></p>\n<p>:::</p>\n<p>\\\nHi readers, I’m Alex, and I’ve built my company <strong><a href=\"https://myperch.io/home/\">Perch</a></strong> from the ground up over the past 4 years, and we just finished our latest <strong><a href=\"https://hackernoon.com/perch-a-mortgage-fintech-raises-$4m-in-series-a-funding\">Series A funding round of $4 million</a></strong>. Perch is a digital mortgage company. We make money helping people get their mortgage quickly, simply, and at the best rates they qualify for, while providing insights and tools for them to make the best decisions.</p>\n<p>\\\nFor homeowners, Perch will <a href=\"https://myperch.io/tools/pathfinder/\">automatically monitor the </a><strong><a href=\"https://myperch.io/tools/pathfinder/\">mortgage market</a></strong> and let you know when there’s an opportunity to save money by switching mortgages. You’ll also be able to view your monthly property value and mortgage balance updates. Best of all, we can show you exactly how much home equity you could unlock by refinancing and see your property returns as easily as you’d track your stock portfolio.</p>\n<h2 id=\"thefintechstartupplaybook\">The Fintech Startup Playbook</h2>\n<p>I’ll break down what the costs to get to the launch date looked like. Note since we’re a Canadian company, the dollar amounts are listed in Canadian dollars.</p>\n<h3 id=\"1gettingincorporatedd2500\">1. Getting incorporated ($2,500)</h3>\n<p>Setting up the corporation is simple, but you need legal counsel to get things like your bylaws, shareholder agreement, etc., in place. This is extremely important! To raise capital later on, things like the IP belonging to the business and the right shares being issued must be handled correctly the first time. </p>\n<p>\\\nWith that being said, you also don’t want to go into overkill by hiring a $900/hour lawyer and spending $10,000+ on doing this. I used a service called Clausehound, which gave me free access to templates and enabled me to draft rough copies of all legal agreements. I then had to legally validate what I wrote and did one round of edits to minimize my legal costs to around $1,500 for all required documents.</p>\n<p>\\</p>\n<p>:::info\nNote: You need to do this as early as possible. Most accelerators or grant programs require you to be incorporated to qualify, and later on, when you want larger grants, they look for at least 2 years incorporated.</p>\n<p>:::</p>\n<h3 id=\"2trademarktheapplicationd2000\">2. Trademark the Application ($2,000)</h3>\n<p>I can tell you now that it was a complete waste of money/time. I filed my trademark in early 2018 and didn’t get a response until late 2020, and by that time, we were already gearing up to rebrand. You don’t need to worry about this upfront.</p>\n<h3 id=\"3productmvpd50000\">3. Product MVP ($50,000):</h3>\n<p>As described above, this was about 5 months of development and 3 months of design work.</p>\n<p>\\\nI’ve learned that the equity you retain in your business is commensurate to the pain/risk you can take on.</p>\n<p>:::tip\nSo overall, my total costs from starting up a business to launching were around $55,000.</p>\n<p>:::</p>\n<h2 id=\"howdidifinanceallofthis\">How Did I Finance All of This?</h2>\n<p>Credits: By joining MaRS and Communitech (we’re based in Canada, and these are research innovation centers specific to my area), I was able to leverage a lot of services to help me reduce costs. Discounted legal/accounting advice, $30,000 in AWS credits, 90% off HubSpot, free-market research, etc. In the first year, 80% of my opex was strictly contractors.</p>\n<h3 id=\"1loans\">1. Loans</h3>\n<p>Futurpreneur provides a $15,000 loan that is fairly easy to qualify for. I had a great credit score and no other debts since I was previously working full-time, so that helped me get favorable terms.</p>\n<h3 id=\"2capital\">2. Capital</h3>\n<p>I was able to fund the initial startup capital with my savings. The biggest cost that isn’t accounted for here is the “opportunity cost” in the sense that I made $0 for the work I put in, even if I was working 80+ hours a week. Sweat equity was by far the biggest contribution I made, and you should expect it to also be yours.</p>\n<h3 id=\"3grants\">3. Grants</h3>\n<p>I was able to get $10,000 from the Ontario Centre of Innovation (OCI) for my designer hire.</p>\n<h2 id=\"thestartuplessons\">The Startup Lessons</h2>\n<p>We went live to the public in September 2018, and I wanted to use paid channels as the first channel to get my initial customers, I aggressively priced my product to entice someone to try it with no brand recognition.</p>\n<p>\\</p>\n<blockquote>\n  <p>The first thing I learned is that a low price will never trump a bad user experience. If I solely relied on the site to convert, I would’ve had zero clients. </p>\n</blockquote>\n<p>\\\nThe one thing that made a massive difference was making sure my phone number was easily visible and that I got their info as early as possible so I could reach out. Getting people on the phone and getting feedback on the product was fundamental in helping me rapidly iterate on the product and keep improving.</p>\n<p>\\\nMy goal was never to flood the site with traffic but rather to keep a steady stream of people coming in so that I could keep testing my product and getting feedback in a measured and controlled way. If anything, my worst nightmare was having my site go viral and then having tons of people access the site when we couldn't support them all, which could lead to damaging the brand.</p>\n<p>\\\nThe team was 3 people (me, an intermediate engineer, and a junior designer), so we had to pick wisely on where we spent our efforts. My product also requires consultation as a mortgage broker, so I wasn’t in a position where I could handle 100 clients at a time.</p>\n<h3 id=\"howtoattractandretaincustomers\">How to Attract and Retain Customers</h3>\n<p>For anyone who’s thinking about starting a business, I always recommend expanding your network beyond just your immediate role. For example, attend networking events where not everyone has a similar background to you. My background is in finance, so I had the ‘fin’ but none of the ‘tech.’ To overcome part of this knowledge gap, I signed up for online courses and dedicated myself to reading as much as I could so I could “speak the language” during the hiring process and when working with my entire team.</p>\n<p>\\\nSince launching our free analytics platform to home buyers and homeowners, we’ve enjoyed a 174% customer referral rate. Many of our new customers first hear of Perch through word of mouth. Early on, we realized it just didn’t make sense to spend a lot of advertising dollars if we didn’t have a good product that people wanted to use. What’s worked for us are our strong referral partnerships, which translate into higher-quality leads than any ad campaign ever could.</p>\n<p>\\\nFor example, we enable satisfied customers to earn through our referral program: If they refer a friend who signs up to Perch and gets a mortgage through us, we offer them 10% of our gross commission as a referral bonus. Similarly, we offer real estate agents a referral bonus when they refer home buyers who get a mortgage through our platform.</p>\n<p>\\\nWhen it comes to retaining and re-engaging our users, we invested a lot of time into ensuring our drip campaigns were delivering relevant and timely messages to customers.</p>\n<p>\\</p>\n<blockquote>\n  <p>To be successful, you need to have a unique product.</p>\n</blockquote>\n<p>\\\nIn addition, we reiterate our service commitment to them by focusing on quick response times with our base (in other words, no long hold times or spending days waiting for an email reply). </p>\n<p>\\</p>\n<blockquote>\n  <p>As much as we rely on our analytics platform to guide users through shopping for rates and the mortgage application process, we know there are times they just want to speak to a human. </p>\n</blockquote>\n<p>\\\nBecause we don’t want to compromise on our customer service, we constantly think about how to maximize operational efficiency and sustainably grow our business.</p>\n<p>\\\nFinally, we consider ourselves very fortunate to have a vocal customer base. They have left us 5-star reviews on Google, provided us testimonials to use in our marketing, and are quick to let our advisors know when they need help or if something is going awry.</p>","content:encodedSnippet":":::tip\nAlex Leduc, CEO of Perch, on building and running a fintech startup in the mortgage industry.\n:::\n\\\nHi readers, I’m Alex, and I’ve built my company Perch from the ground up over the past 4 years, and we just finished our latest Series A funding round of $4 million. Perch is a digital mortgage company. We make money helping people get their mortgage quickly, simply, and at the best rates they qualify for, while providing insights and tools for them to make the best decisions.\n\\\nFor homeowners, Perch will automatically monitor the mortgage market and let you know when there’s an opportunity to save money by switching mortgages. You’ll also be able to view your monthly property value and mortgage balance updates. Best of all, we can show you exactly how much home equity you could unlock by refinancing and see your property returns as easily as you’d track your stock portfolio.\nThe Fintech Startup Playbook\nI’ll break down what the costs to get to the launch date looked like. Note since we’re a Canadian company, the dollar amounts are listed in Canadian dollars.\n1. Getting incorporated ($2,500)\nSetting up the corporation is simple, but you need legal counsel to get things like your bylaws, shareholder agreement, etc., in place. This is extremely important! To raise capital later on, things like the IP belonging to the business and the right shares being issued must be handled correctly the first time. \n\\\nWith that being said, you also don’t want to go into overkill by hiring a $900/hour lawyer and spending $10,000+ on doing this. I used a service called Clausehound, which gave me free access to templates and enabled me to draft rough copies of all legal agreements. I then had to legally validate what I wrote and did one round of edits to minimize my legal costs to around $1,500 for all required documents.\n\\\n:::info\nNote: You need to do this as early as possible. Most accelerators or grant programs require you to be incorporated to qualify, and later on, when you want larger grants, they look for at least 2 years incorporated.\n:::\n2. Trademark the Application ($2,000)\nI can tell you now that it was a complete waste of money/time. I filed my trademark in early 2018 and didn’t get a response until late 2020, and by that time, we were already gearing up to rebrand. You don’t need to worry about this upfront.\n3. Product MVP ($50,000):\nAs described above, this was about 5 months of development and 3 months of design work.\n\\\nI’ve learned that the equity you retain in your business is commensurate to the pain/risk you can take on.\n:::tip\nSo overall, my total costs from starting up a business to launching were around $55,000.\n:::\nHow Did I Finance All of This?\nCredits: By joining MaRS and Communitech (we’re based in Canada, and these are research innovation centers specific to my area), I was able to leverage a lot of services to help me reduce costs. Discounted legal/accounting advice, $30,000 in AWS credits, 90% off HubSpot, free-market research, etc. In the first year, 80% of my opex was strictly contractors.\n1. Loans\nFuturpreneur provides a $15,000 loan that is fairly easy to qualify for. I had a great credit score and no other debts since I was previously working full-time, so that helped me get favorable terms.\n2. Capital\nI was able to fund the initial startup capital with my savings. The biggest cost that isn’t accounted for here is the “opportunity cost” in the sense that I made $0 for the work I put in, even if I was working 80+ hours a week. Sweat equity was by far the biggest contribution I made, and you should expect it to also be yours.\n3. Grants\nI was able to get $10,000 from the Ontario Centre of Innovation (OCI) for my designer hire.\nThe Startup Lessons\nWe went live to the public in September 2018, and I wanted to use paid channels as the first channel to get my initial customers, I aggressively priced my product to entice someone to try it with no brand recognition.\n\\\n\n  \nThe first thing I learned is that a low price will never trump a bad user experience. If I solely relied on the site to convert, I would’ve had zero clients. \n\\\nThe one thing that made a massive difference was making sure my phone number was easily visible and that I got their info as early as possible so I could reach out. Getting people on the phone and getting feedback on the product was fundamental in helping me rapidly iterate on the product and keep improving.\n\\\nMy goal was never to flood the site with traffic but rather to keep a steady stream of people coming in so that I could keep testing my product and getting feedback in a measured and controlled way. If anything, my worst nightmare was having my site go viral and then having tons of people access the site when we couldn't support them all, which could lead to damaging the brand.\n\\\nThe team was 3 people (me, an intermediate engineer, and a junior designer), so we had to pick wisely on where we spent our efforts. My product also requires consultation as a mortgage broker, so I wasn’t in a position where I could handle 100 clients at a time.\nHow to Attract and Retain Customers\nFor anyone who’s thinking about starting a business, I always recommend expanding your network beyond just your immediate role. For example, attend networking events where not everyone has a similar background to you. My background is in finance, so I had the ‘fin’ but none of the ‘tech.’ To overcome part of this knowledge gap, I signed up for online courses and dedicated myself to reading as much as I could so I could “speak the language” during the hiring process and when working with my entire team.\n\\\nSince launching our free analytics platform to home buyers and homeowners, we’ve enjoyed a 174% customer referral rate. Many of our new customers first hear of Perch through word of mouth. Early on, we realized it just didn’t make sense to spend a lot of advertising dollars if we didn’t have a good product that people wanted to use. What’s worked for us are our strong referral partnerships, which translate into higher-quality leads than any ad campaign ever could.\n\\\nFor example, we enable satisfied customers to earn through our referral program: If they refer a friend who signs up to Perch and gets a mortgage through us, we offer them 10% of our gross commission as a referral bonus. Similarly, we offer real estate agents a referral bonus when they refer home buyers who get a mortgage through our platform.\n\\\nWhen it comes to retaining and re-engaging our users, we invested a lot of time into ensuring our drip campaigns were delivering relevant and timely messages to customers.\n\\\n\n  \nTo be successful, you need to have a unique product.\n\\\nIn addition, we reiterate our service commitment to them by focusing on quick response times with our base (in other words, no long hold times or spending days waiting for an email reply). \n\\\n\n  \nAs much as we rely on our analytics platform to guide users through shopping for rates and the mortgage application process, we know there are times they just want to speak to a human. \n\\\nBecause we don’t want to compromise on our customer service, we constantly think about how to maximize operational efficiency and sustainably grow our business.\n\\\nFinally, we consider ourselves very fortunate to have a vocal customer base. They have left us 5-star reviews on Google, provided us testimonials to use in our marketing, and are quick to let our advisors know when they need help or if something is going awry.","dc:creator":"Perch","content":"How Alex, the CEO of a digital mortgage company, built and financed his startup in four years. He shares how he got all the legal work done, managed finances, and gained+retained customers!","contentSnippet":"How Alex, the CEO of a digital mortgage company, built and financed his startup in four years. He shares how he got all the legal work done, managed finances, and gained+retained customers!","guid":"https://hackernoon.com/how-i-built-a-successful-digital-mortgage-startup-in-canada?source=rss","categories":["startup","startups","startup-advice","good-company","fintech-startups","real-estate-technology","real-estate-tech","startup-playbook"],"isoDate":"2022-12-13T12:26:39.000Z","from":"https://hackernoon.com/feed","hashId":"35ca6d5765cc18251f8d74919c785da4"},{"creator":"Daria Leshchenko","title":"Founders, Do You Have a Plan for the End of the World?","link":"https://hackernoon.com/founders-do-you-have-a-plan-for-the-end-of-the-word?source=rss","pubDate":"Tue, 13 Dec 2022 13:06:04 GMT","content:encoded":"<p>\\\nFounders and CEOs have a lot of tasks and responsibilities. Coaching the team, becoming a mentor for newcomers, and preparing for the end of the world. Yes, one of them is not like the other, but preparing for a crisis of any nature is one of the key responsibilities of any leader.</p>\n<p>\\\n<strong>So, founders, do you have a plan for the future?</strong></p>\n<p>\\\n<strong>Do you know what steps you will take in any scenario?</strong></p>\n<p>\\\nHaving gone through several serious crises in the last 10 years, I have come up with 3 main steps to take when it seems that the world is collapsing around you.</p>\n<p>\\</p>\n<ol>\n<li><strong>Do not panic</strong></li>\n</ol>\n<p>Through the years, I have found panic is never worth the trouble. Your head becomes misty, you do not know what to do, and you end up having to calm yourself instead of making the right decisions.</p>\n<p>\\\nIn a crisis situation, put your <strong><a href=\"https://hackernoon.com/do-leaders-really-need-emotional-intelligence\">emotional intelligence</a></strong> to work. Specifically self-regulation. Keep your head cool and remain in control of the situation, no matter what is thrown at you.</p>\n<p>\\\nWhen it comes to founders, CEOs, and senior business partners, panic should be at the very end of your “Things To Do In Case Of The End Of The World” list. It is better to connect with your team, make sure everyone knows what to do, conduct <a href=\"https://en.wikipedia.org/wiki/Damage_control\">damage control</a>, and look for the best and fastest ways to resolve the situation.</p>\n<p>\\\nEasier said than done, I know. But keeping yourself in check and remaining calm will pay off much better than pulling your hair and thinking there is nothing you can do to control or even fix the situation.</p>\n<p>\\</p>\n<ol start=\"2\">\n<li><strong>Trust your team</strong></li>\n</ol>\n<p>You know that moment in a movie when a hero is asked “What’s the plan?”. They always have an answer to that question, don’t they? Well, with a good team by your side, there is no need for anyone to ask this question. Everyone already knows what to do and what steps to take. Where does that certainty come from?</p>\n<p>\\\nFirst, from well-formed and up-to-date contingency plans. These need to be regulated and updated on a regular basis. At SupportYourApp, we involve every department in developing contingency plans. This ensures continuity of processes and services no matter what.</p>\n<p>\\\nSecond, it comes from total trust between you as a founder or top-level executive and your team. Letting other people make decisions that can reflect on you and your business is not the easiest of things. But, as a founder, I understood — I simply couldn’t do everything myself. I needed real pros who I would trust and who would be as responsible as I am. And, with time, I did find people like that. I keep finding them to this day and all around the globe.</p>\n<p>\\\nBut good things rarely come easy, so be ready to put as much time into building trust as possible. Let your team know you personally and not only as a manager. Remember — personal connections will have a much stronger effect than strictly business relationships.</p>\n<p>\\</p>\n<ol start=\"3\">\n<li><strong>Build things that will last</strong></li>\n</ol>\n<p>There is no way to predict whether your company will endure unavoidable crises (try to count how many issues the business world overcame in the last decade, and you’ll see what I mean by “unavoidable”), but you can always build things to last. I, of course, talk about a team and the way it operates.</p>\n<p>\\\nBuilding a team that can withstand anything comes from constant work to build lasting relationships based on trust, communication, and support. There are many ways to ensure even the most international team, like the one I have, is a solid foundation you can rely on. From simple regular calls and syncs to corporate team events and trips — the list goes on and on.</p>\n<p>\\\nThe most important thing to remember here — when it comes to teamwork and team building, the process is never complete. It is an ongoing task for every founder and every manager. And when you have a base as strong as a unified family-like team, there is nothing you, as a company, cannot withstand.</p>\n<p>\\\n\\\nFounders, are you ready for the end of the world? Preparing for it may seem impossible. In reality, nearly every step we take in our journey as leaders prepares us for handling and overcoming challenges. From self-development to building a trustworthy relationship with your team — every little thing matters when building a sturdy foundation for your business.</p>","content:encodedSnippet":"\\\nFounders and CEOs have a lot of tasks and responsibilities. Coaching the team, becoming a mentor for newcomers, and preparing for the end of the world. Yes, one of them is not like the other, but preparing for a crisis of any nature is one of the key responsibilities of any leader.\n\\\nSo, founders, do you have a plan for the future?\n\\\nDo you know what steps you will take in any scenario?\n\\\nHaving gone through several serious crises in the last 10 years, I have come up with 3 main steps to take when it seems that the world is collapsing around you.\n\\\n\nDo not panic\nThrough the years, I have found panic is never worth the trouble. Your head becomes misty, you do not know what to do, and you end up having to calm yourself instead of making the right decisions.\n\\\nIn a crisis situation, put your emotional intelligence to work. Specifically self-regulation. Keep your head cool and remain in control of the situation, no matter what is thrown at you.\n\\\nWhen it comes to founders, CEOs, and senior business partners, panic should be at the very end of your “Things To Do In Case Of The End Of The World” list. It is better to connect with your team, make sure everyone knows what to do, conduct damage control, and look for the best and fastest ways to resolve the situation.\n\\\nEasier said than done, I know. But keeping yourself in check and remaining calm will pay off much better than pulling your hair and thinking there is nothing you can do to control or even fix the situation.\n\\\n\nTrust your team\nYou know that moment in a movie when a hero is asked “What’s the plan?”. They always have an answer to that question, don’t they? Well, with a good team by your side, there is no need for anyone to ask this question. Everyone already knows what to do and what steps to take. Where does that certainty come from?\n\\\nFirst, from well-formed and up-to-date contingency plans. These need to be regulated and updated on a regular basis. At SupportYourApp, we involve every department in developing contingency plans. This ensures continuity of processes and services no matter what.\n\\\nSecond, it comes from total trust between you as a founder or top-level executive and your team. Letting other people make decisions that can reflect on you and your business is not the easiest of things. But, as a founder, I understood — I simply couldn’t do everything myself. I needed real pros who I would trust and who would be as responsible as I am. And, with time, I did find people like that. I keep finding them to this day and all around the globe.\n\\\nBut good things rarely come easy, so be ready to put as much time into building trust as possible. Let your team know you personally and not only as a manager. Remember — personal connections will have a much stronger effect than strictly business relationships.\n\\\n\nBuild things that will last\nThere is no way to predict whether your company will endure unavoidable crises (try to count how many issues the business world overcame in the last decade, and you’ll see what I mean by “unavoidable”), but you can always build things to last. I, of course, talk about a team and the way it operates.\n\\\nBuilding a team that can withstand anything comes from constant work to build lasting relationships based on trust, communication, and support. There are many ways to ensure even the most international team, like the one I have, is a solid foundation you can rely on. From simple regular calls and syncs to corporate team events and trips — the list goes on and on.\n\\\nThe most important thing to remember here — when it comes to teamwork and team building, the process is never complete. It is an ongoing task for every founder and every manager. And when you have a base as strong as a unified family-like team, there is nothing you, as a company, cannot withstand.\n\\\n\\\nFounders, are you ready for the end of the world? Preparing for it may seem impossible. In reality, nearly every step we take in our journey as leaders prepares us for handling and overcoming challenges. From self-development to building a trustworthy relationship with your team — every little thing matters when building a sturdy foundation for your business.","dc:creator":"Daria Leshchenko","content":"Founder and CEOs have a lot of tasks and responsibilities including coaching the team and preparing for the end of the world. Preparing for a crisis of any nature is one of the key responsibilities of any leader. At SupportYourApp, we involve every department in developing contingency plans. Building a team that can withstand anything comes from constant work to build lasting relationships based on trust, communication, and support. There are many ways to ensure even the most international team, like the one I have, is a solid foundation you can rely on.","contentSnippet":"Founder and CEOs have a lot of tasks and responsibilities including coaching the team and preparing for the end of the world. Preparing for a crisis of any nature is one of the key responsibilities of any leader. At SupportYourApp, we involve every department in developing contingency plans. Building a team that can withstand anything comes from constant work to build lasting relationships based on trust, communication, and support. There are many ways to ensure even the most international team, like the one I have, is a solid foundation you can rely on.","guid":"https://hackernoon.com/founders-do-you-have-a-plan-for-the-end-of-the-word?source=rss","categories":["founders","founder-advice","startup","startup-lessons","startups","leadership","management-and-leadership","team-management"],"isoDate":"2022-12-13T13:06:04.000Z","from":"https://hackernoon.com/feed","hashId":"7b89da4aa9e9f614d30c1a682d91b4af"},{"creator":"Daniele Marinelli","title":"Web3 Gaming Is More Mainstream Than You Think","link":"https://hackernoon.com/web3-gaming-is-more-mainstream-than-you-think?source=rss","pubDate":"Tue, 13 Dec 2022 13:15:53 GMT","content:encoded":"<div class=\"paragraph\">Designing a game that people actually want to play is tough. Adding a token economy on top of it that enhances the gameplay is a challenge few have mastered. And lastly, competition between publishers and game developers is fierce, so designing an ecosystem where digital collectibles are transferable between games requires the politicking of Frank Underwood from “House of Cards.”</div><div class=\"paragraph\">With all of this in mind, it’s shocking that the P2E-gaming world is thriving. <a href=\"https://www.gamespot.com/articles/segas-first-blockchain-game-is-on-the-way/1100-6507907/\">Sega announced</a> its first blockchain game is coming, <a href=\"https://www.fifa.com/fifaplus/en/articles/fifa-unveils-range-of-new-web-3-0-games-ahead-of-fifa-world-cup-qatar-2022\">Fifa unveiled</a> it will be releasing four new blockchain games, and even <a href=\"https://www.complex.com/sneakers/nike-dot-swoosh-metaverse-nft\">Nike joined</a> the Metaverse craze with a new virtual footwear platform. </div><div class=\"paragraph\">There is clearly something brewing.</div><div class=\"paragraph\">Blockchain doesn’t equal cryptocurrencies. The technology itself is home to many new advancements other than digital currencies, and even though Meta is struggling, to say the least, the Metaverse is still poised to become the norm for online gaming.</div><div class=\"paragraph\">While the world heads into recession, VC investors invested more than $4.5 billion in the development of Metaverse games and other Metaverse projects in 2022, <a href=\"https://www.blog.udonis.co/blockchain/blockchain-statistics\">DappRadar statistics</a> show. And this is only the beginning.</div><div class=\"paragraph\">Early blockchain-gaming pioneer <strong>Spielworks</strong> recently reached an impressive three million sign-ups, with more than 65,000 active daily users. These kinds of statistics belie the glum stats about famous but ultimately <a href=\"https://www.coindesk.com/web3/2022/10/07/its-lonely-in-the-metaverse-decentralands-38-daily-active-users-in-a-13b-ecosystem/\">unpopular Metaverses</a>.</div><div class=\"paragraph\">It’s true that some games try to distance themselves from NFTs as much as possible—even “Grand Theft Auto” <a href=\"https://kotaku.com/nft-crypto-gta-online-grand-theft-auto-online-banned-1849810293\">banned crypto and NFTs</a> from its online servers. And it’s also true that with FTX’s collapse, Justin Bieber’s Bored Ape Yacht Club NFT <a href=\"https://www.businessinsider.com/justin-bieber-bored-ape-nft-value-dropped-after-ftx-collapsed-2022-11\">shed nearly 95%</a> of its value. </div><div class=\"paragraph\">Companies like <strong>Gala Games</strong>, on the other hand, deployed $150 million to acquire AAA-quality games for the platforms, on the heels of unlocking $2.2 billion in P2E revenue in 2021 for its players. Jason “BitBender” Brink, the president of blockchain at Gala, was quoted saying, “I think we are the first company in history that has given away more money than we made.” With numbers like these, it’s easy to understand why P2E and NFT gaming are unstoppable forces.</div><div class=\"paragraph\">Yes, the current economy is hitting crypto even harder because it’s newer, riskier, and more volatile—but it’s hitting everyone, and it’s not going away anytime soon. So instead of wallowing in despair from the constant stream of bad economic news, we can keep an eye out for news that shows where this inevitable future of tech is going.</div><div class=\"paragraph\"><strong>GN3RA</strong>, The world&#x27;s first fashion Metaverse for creators, partnered with the Royal College of Art (RCA), the world&#x27;s most influential postgraduate institution of art and design. Through the partnership, platform users will be able to use and co-create digital fashion designed by RCA alumni, helping steer the fashion industry online.</div><div class=\"paragraph\">On the digital vehicle front, software giant <strong>NVIDIA</strong> is working with Volvo to <a href=\"https://www.topgear.com/car-news/future-tech/could-cars-future-be-designed-metaverse\">fully test cars in the Metaverse</a>. Of course, Volvo is already running computer simulations, but the Metaverse takes this to the next level using “Digital Twins,” exact replicas of real-world cars.</div><div class=\"paragraph\">While the naysayers nay, innovators can look around at their peers, and see some incredible projects in the works. As President Theodore Roosevelt said, “it’s not the critic that counts, the credit belongs to the man in the arena.” Nowhere is that more true than in the innovation space. </div><div class=\"paragraph\">Like Schrodinger&#x27;s cat, the Metaverse is simultaneously here, and it’s coming. There is no telling where it will end up—all we know is that it’s going at tremendous speeds.</div><div class=\"paragraph\"><br/></div>","content:encodedSnippet":"Designing a game that people actually want to play is tough. Adding a token economy on top of it that enhances the gameplay is a challenge few have mastered. And lastly, competition between publishers and game developers is fierce, so designing an ecosystem where digital collectibles are transferable between games requires the politicking of Frank Underwood from “House of Cards.”\nWith all of this in mind, it’s shocking that the P2E-gaming world is thriving. Sega announced its first blockchain game is coming, Fifa unveiled it will be releasing four new blockchain games, and even Nike joined the Metaverse craze with a new virtual footwear platform. \nThere is clearly something brewing.\nBlockchain doesn’t equal cryptocurrencies. The technology itself is home to many new advancements other than digital currencies, and even though Meta is struggling, to say the least, the Metaverse is still poised to become the norm for online gaming.\nWhile the world heads into recession, VC investors invested more than $4.5 billion in the development of Metaverse games and other Metaverse projects in 2022, DappRadar statistics show. And this is only the beginning.\nEarly blockchain-gaming pioneer Spielworks recently reached an impressive three million sign-ups, with more than 65,000 active daily users. These kinds of statistics belie the glum stats about famous but ultimately unpopular Metaverses.\nIt’s true that some games try to distance themselves from NFTs as much as possible—even “Grand Theft Auto” banned crypto and NFTs from its online servers. And it’s also true that with FTX’s collapse, Justin Bieber’s Bored Ape Yacht Club NFT shed nearly 95% of its value. \nCompanies like Gala Games, on the other hand, deployed $150 million to acquire AAA-quality games for the platforms, on the heels of unlocking $2.2 billion in P2E revenue in 2021 for its players. Jason “BitBender” Brink, the president of blockchain at Gala, was quoted saying, “I think we are the first company in history that has given away more money than we made.” With numbers like these, it’s easy to understand why P2E and NFT gaming are unstoppable forces.\nYes, the current economy is hitting crypto even harder because it’s newer, riskier, and more volatile—but it’s hitting everyone, and it’s not going away anytime soon. So instead of wallowing in despair from the constant stream of bad economic news, we can keep an eye out for news that shows where this inevitable future of tech is going.\nGN3RA, The world's first fashion Metaverse for creators, partnered with the Royal College of Art (RCA), the world's most influential postgraduate institution of art and design. Through the partnership, platform users will be able to use and co-create digital fashion designed by RCA alumni, helping steer the fashion industry online.\nOn the digital vehicle front, software giant NVIDIA is working with Volvo to fully test cars in the Metaverse. Of course, Volvo is already running computer simulations, but the Metaverse takes this to the next level using “Digital Twins,” exact replicas of real-world cars.\nWhile the naysayers nay, innovators can look around at their peers, and see some incredible projects in the works. As President Theodore Roosevelt said, “it’s not the critic that counts, the credit belongs to the man in the arena.” Nowhere is that more true than in the innovation space. \nLike Schrodinger's cat, the Metaverse is simultaneously here, and it’s coming. There is no telling where it will end up—all we know is that it’s going at tremendous speeds.","dc:creator":"Daniele Marinelli","content":"Designing a game that people actually want to play is tough. Adding a token economy on top of it that enhances the gameplay is a challenge few have mastered. And lastly, competition between publishers and game developers is fierce, so designing an ecosystem where digital collectibles are transferable between games requires the politicking of Frank Underwood from “House of Cards.”\nWith all of this in mind, it’s shocking that the P2E-gaming world is thriving. ","contentSnippet":"Designing a game that people actually want to play is tough. Adding a token economy on top of it that enhances the gameplay is a challenge few have mastered. And lastly, competition between publishers and game developers is fierce, so designing an ecosystem where digital collectibles are transferable between games requires the politicking of Frank Underwood from “House of Cards.”\nWith all of this in mind, it’s shocking that the P2E-gaming world is thriving.","guid":"https://hackernoon.com/web3-gaming-is-more-mainstream-than-you-think?source=rss","categories":["web3","blockchain-gaming","p2e","gaming","blockchain","web3-gaming","blockchain-technology","p2e-gaming"],"isoDate":"2022-12-13T13:15:53.000Z","from":"https://hackernoon.com/feed","hashId":"7590c473ef86b7f1556e24ee80870cee"},{"creator":"Michael Akuchie","title":"Three Best Practices for Tackling AI Bias in Recruitment","link":"https://hackernoon.com/three-best-practices-for-tackling-ai-bias-in-recruitment?source=rss","pubDate":"Tue, 13 Dec 2022 13:35:07 GMT","content:encoded":"<div class=\"paragraph\">It&#x27;s not wrong to infer that we&#x27;re yet to experience the full range of artificial intelligence (AI) and its capabilities. After all, its impact, fears, and prospects still dominate research endeavors; as scientists are keen on finding new use cases for this innovation. We&#x27;re likely to have encountered the application of AI in various situations. This is because many companies whom we patronize have increased their adoption of the technology. </div><div class=\"paragraph\">Consider the interactive personal assistant Siri which enables <a href=\"https://hackernoon.com/company/apple\">Apple </a>customers to access relevant information from various apps, dictate emails, and perform many other tasks from their iOS-enabled phones, smartwatches, computers, and televisions. </div><div class=\"paragraph\">Brands are also leveraging chatbots to deliver impeccable customer experience in a manner that not only boosts sales but eliminates the need for repetitive tasks, thereby increasing human employees’ engagement. </div><div class=\"paragraph\">Just as the adoption of AI-led tools rose, so did investments in the enterprise soar. According to McKinsey’s “<a href=\"https://www.mckinsey.com/capabilities/quantumblack/our-insights/the-state-of-ai-in-2022-and-a-half-decade-in-review\">The State of AI in 2022</a>” report, 52% of respondents confirmed that over 5% of their digital budget was channeled to AI. In 2018, the percentage stood at 40. </div><div class=\"paragraph\"><strong>This is a striking improvement. </strong></div><div class=\"paragraph\">In human resources, AI plays a critical role in helping corporations enhance employees’ satisfaction with their current roles and rapidly complete tasks, thus saving the indispensable duo of time and money. Aside from this, companies can refine recruitment by using AI-powered software to sift through thousands of applications and shortlist a handful of experienced candidates. </div><div class=\"paragraph\">However, there have been situations when the system favors a specific group or gender over others. This is a risky trend that, if unchecked, could greatly tarnish a firm’s image and negate the good this technology symbolizes. To help you effectively handle AI-sponsored prejudice, this article provides some pointers.  </div><h2>AI in Recruitment: What You Need To Know </h2><div class=\"image-container\"><img src=\"https://cdn.hackernoon.com/images/k4oa3fIFvVYzUaPgdNWrpIyp8bz2-e9a3osu.jpeg\" alt=\"\" loading=\"auto\"/></div><div class=\"paragraph\">Previously, individuals found job postings in the classifieds portion of newspapers and responded via handwritten letters. Nowadays, anyone can access job postings on the internet across a plethora of channels. </div><div class=\"paragraph\">Recruitment is a delicate task that companies prioritize. It explains the growing use of talent acquisition agencies. Using AI not only simplifies the process but broadens the possibilities of automation in other areas. From <a href=\"https://www.tidio.com/blog/ai-recruitment/\">Tidio&#x27;s inquisition</a> into the impact of AI on HR, it&#x27;s discovered that nearly 67% of HR professionals admit that the innovation has positively impacted the recruitment phase. </div><div class=\"paragraph\"><strong>But then, how does bias enter the scene? </strong></div><div class=\"paragraph\">In 2014, e-commerce giant <a href=\"https://hackernoon.com/company/amazon\">Amazon</a> opted to integrate AI into its hiring system. And while this was largely celebrated as a step in the right direction since Amazon is a staunch automation advocate, the effort was discontinued following an awful discovery. The system preferred male candidates to their female counterparts. </div><div class=\"paragraph\">Why did this happen? A <a href=\"https://www.reuters.com/article/us-amazon-com-jobs-automation-insight-idUSKCN1MK08G\">Reuters</a> report revealed that... </div><blockquote><em>“...Amazon’s computer models were trained to vet applicants by observing patterns in resumes submitted to the company over a 10-year period. Most came from men, a reflection of male dominance across the tech industry.”</em></blockquote><div class=\"paragraph\">AI bias can manifest in several ways, with certain genders, groups, religions, and other affiliations always being the victim. <a href=\"https://www.theverge.com/2016/3/24/11297050/tay-microsoft-chatbot-racist\">Microsoft’s Tay</a> — which spewed many hateful messages before earning a Twitter account suspension — is another instance of how anomalies in the machine-learning process can yield great consequences. </div><h2>Three Best Practices for Mitigating AI Bias in Recruitment</h2><div class=\"paragraph\">Although it may not be possible to completely eradicate bias in AI models, there are strategies capable of reducing the odds of a future incident. </div><div class=\"paragraph\">Below are three must-have methods. </div><div class=\"paragraph\"><strong>1. Always Keep Humans in the Know </strong></div><div class=\"paragraph\">While there&#x27;s a growing fear that smart tools will replace human workers, we should see this as more of a partnership and less of a dystopian takeover. And also, the notion that AI-led tools should function without human supervision because they exhibit considerably more efficiency needs to be modified. </div><div class=\"paragraph\">Interestingly, human-machine collaborations have been proven to be more rewarding. A <a href=\"https://hbr.org/2018/07/collaborative-intelligence-humans-and-ai-are-joining-forces\">Harvard Business Review study</a> discovered that 1,075 companies across 12 industries recorded increased speed, cost savings, and profit. </div><div class=\"paragraph\">Given this undeniable fact, firms should ensure that a human team consistently oversees the software used in recruitment. Together, they can reduce the risk of favoritism. Also, the employees should be drawn from a diverse pool so that every group is represented in the responsibility of reducing discrimination. </div><div class=\"paragraph\"><strong>2. Conduct Regular Audits on the AI Models </strong></div><div class=\"paragraph\">When AI algorithms aren&#x27;t frequently checked for the probability of delivering partial outcomes, this could deal a company’s anti-bias effort a serious blow. By organizing periodic checks on the algorithms, corporations can find problems that may hinder the model from conveying fair results. Incomplete or inaccurate data should be rectified immediately upon discovery to protect ethics. </div><div class=\"paragraph\"><strong>3. Patronize AI Recruitment Software Vendors with an Aversion to Bias </strong></div><div class=\"paragraph\">Just like a car dealership, you will find various recruitment software options. To make the right decision, endeavor to learn more about how the mechanisms set by vendors to tackle the various kinds of bias. </div><div class=\"paragraph\">You should request to see the system get tested in various situations and see how it performs. Aside from bias, check the software for scalability, pricing, and cost savings.  The one that ticks all or most of the boxes is the winner. </div><h2>A Candid Take on AI’s Future</h2><div class=\"image-container\"><img src=\"https://cdn.hackernoon.com/images/k4oa3fIFvVYzUaPgdNWrpIyp8bz2-vjb3of6.jpeg\" alt=\"\" loading=\"auto\"/></div><div class=\"paragraph\">The advancement of AI and its subsets is a good thing for all of us. From enabling cars to steer and park themselves (with active driver supervision) to sourcing and hiring qualified candidates in lesser time, AI offers several benefits that transcend recruitment. But then, we should purposefully manage this technology to avert the blunders associated with manual effort. </div><div class=\"paragraph\">Dr. Lisa Palmer shares in a thoughtful <a href=\"https://www.oklahoman.com/story/opinion/2022/11/27/guest-ai-regulations-should-protect-people-without-stifling-innovation/69667065007/\">article</a> that the American state of Oklahoma should throw its weight behind the enactment of <em>“legislative and regulatory action that both support innovation and ensure that this critical technology serves humanity well.”  </em>Perhaps, we can learn from that and as she recommends <em>“do more&quot; </em>to navigate this technological revolution toward the good side.  </div><div class=\"paragraph\"><br/><br/><br/></div>","content:encodedSnippet":"It's not wrong to infer that we're yet to experience the full range of artificial intelligence (AI) and its capabilities. After all, its impact, fears, and prospects still dominate research endeavors; as scientists are keen on finding new use cases for this innovation. We're likely to have encountered the application of AI in various situations. This is because many companies whom we patronize have increased their adoption of the technology. \nConsider the interactive personal assistant Siri which enables Apple customers to access relevant information from various apps, dictate emails, and perform many other tasks from their iOS-enabled phones, smartwatches, computers, and televisions. \nBrands are also leveraging chatbots to deliver impeccable customer experience in a manner that not only boosts sales but eliminates the need for repetitive tasks, thereby increasing human employees’ engagement. \nJust as the adoption of AI-led tools rose, so did investments in the enterprise soar. According to McKinsey’s “The State of AI in 2022” report, 52% of respondents confirmed that over 5% of their digital budget was channeled to AI. In 2018, the percentage stood at 40. \nThis is a striking improvement. \nIn human resources, AI plays a critical role in helping corporations enhance employees’ satisfaction with their current roles and rapidly complete tasks, thus saving the indispensable duo of time and money. Aside from this, companies can refine recruitment by using AI-powered software to sift through thousands of applications and shortlist a handful of experienced candidates. \nHowever, there have been situations when the system favors a specific group or gender over others. This is a risky trend that, if unchecked, could greatly tarnish a firm’s image and negate the good this technology symbolizes. To help you effectively handle AI-sponsored prejudice, this article provides some pointers.  \nAI in Recruitment: What You Need To Know \n\nPreviously, individuals found job postings in the classifieds portion of newspapers and responded via handwritten letters. Nowadays, anyone can access job postings on the internet across a plethora of channels. \nRecruitment is a delicate task that companies prioritize. It explains the growing use of talent acquisition agencies. Using AI not only simplifies the process but broadens the possibilities of automation in other areas. From Tidio's inquisition into the impact of AI on HR, it's discovered that nearly 67% of HR professionals admit that the innovation has positively impacted the recruitment phase. \nBut then, how does bias enter the scene? \nIn 2014, e-commerce giant Amazon opted to integrate AI into its hiring system. And while this was largely celebrated as a step in the right direction since Amazon is a staunch automation advocate, the effort was discontinued following an awful discovery. The system preferred male candidates to their female counterparts. \nWhy did this happen? A Reuters report revealed that... \n“...Amazon’s computer models were trained to vet applicants by observing patterns in resumes submitted to the company over a 10-year period. Most came from men, a reflection of male dominance across the tech industry.”\nAI bias can manifest in several ways, with certain genders, groups, religions, and other affiliations always being the victim. Microsoft’s Tay — which spewed many hateful messages before earning a Twitter account suspension — is another instance of how anomalies in the machine-learning process can yield great consequences. \nThree Best Practices for Mitigating AI Bias in Recruitment\nAlthough it may not be possible to completely eradicate bias in AI models, there are strategies capable of reducing the odds of a future incident. \nBelow are three must-have methods. \n1. Always Keep Humans in the Know \nWhile there's a growing fear that smart tools will replace human workers, we should see this as more of a partnership and less of a dystopian takeover. And also, the notion that AI-led tools should function without human supervision because they exhibit considerably more efficiency needs to be modified. \nInterestingly, human-machine collaborations have been proven to be more rewarding. A Harvard Business Review study discovered that 1,075 companies across 12 industries recorded increased speed, cost savings, and profit. \nGiven this undeniable fact, firms should ensure that a human team consistently oversees the software used in recruitment. Together, they can reduce the risk of favoritism. Also, the employees should be drawn from a diverse pool so that every group is represented in the responsibility of reducing discrimination. \n2. Conduct Regular Audits on the AI Models \nWhen AI algorithms aren't frequently checked for the probability of delivering partial outcomes, this could deal a company’s anti-bias effort a serious blow. By organizing periodic checks on the algorithms, corporations can find problems that may hinder the model from conveying fair results. Incomplete or inaccurate data should be rectified immediately upon discovery to protect ethics. \n3. Patronize AI Recruitment Software Vendors with an Aversion to Bias \nJust like a car dealership, you will find various recruitment software options. To make the right decision, endeavor to learn more about how the mechanisms set by vendors to tackle the various kinds of bias. \nYou should request to see the system get tested in various situations and see how it performs. Aside from bias, check the software for scalability, pricing, and cost savings.  The one that ticks all or most of the boxes is the winner. \nA Candid Take on AI’s Future\n\nThe advancement of AI and its subsets is a good thing for all of us. From enabling cars to steer and park themselves (with active driver supervision) to sourcing and hiring qualified candidates in lesser time, AI offers several benefits that transcend recruitment. But then, we should purposefully manage this technology to avert the blunders associated with manual effort. \nDr. Lisa Palmer shares in a thoughtful article that the American state of Oklahoma should throw its weight behind the enactment of “legislative and regulatory action that both support innovation and ensure that this critical technology serves humanity well.”  Perhaps, we can learn from that and as she recommends “do more\" to navigate this technological revolution toward the good side.","dc:creator":"Michael Akuchie","content":"In 2014, Amazon's AI system preferred male candidates to their female counterparts. Amazon’s computer models were trained to vet applicants by observing patterns in resumes submitted to the company over a 10-year period. Most came from men, a reflection of male dominance across the tech industry. This is a risky trend that, if unchecked, could greatly tarnish a firm's image and negate the good this technology symbolizes. To help you effectively handle AI-sponsored prejudice in recruitment, this article provides some pointers.","contentSnippet":"In 2014, Amazon's AI system preferred male candidates to their female counterparts. Amazon’s computer models were trained to vet applicants by observing patterns in resumes submitted to the company over a 10-year period. Most came from men, a reflection of male dominance across the tech industry. This is a risky trend that, if unchecked, could greatly tarnish a firm's image and negate the good this technology symbolizes. To help you effectively handle AI-sponsored prejudice in recruitment, this article provides some pointers.","guid":"https://hackernoon.com/three-best-practices-for-tackling-ai-bias-in-recruitment?source=rss","categories":["ai","artificial-intelligence","ai-trends","future-of-ai","future-of-work","work","recruiting","ai-top-story"],"isoDate":"2022-12-13T13:35:07.000Z","from":"https://hackernoon.com/feed","hashId":"f314b09972e15925b14185dfe15fbb44"},{"creator":"Daniel","title":"25 Questions Candidates Should Ask in an Interview for Remote Work","link":"https://hackernoon.com/25-questions-candidates-should-ask-in-an-interview-for-remote-work?source=rss","pubDate":"Tue, 13 Dec 2022 14:01:04 GMT","content:encoded":"<p>Remote interviews are becoming a more popular way of interviewing candidates. Remote companies save time and money on travel expenses and determine if the candidate is a good fit for your team.</p>\n<p>\\\nRemote interviews are usually done by video conferencing, over the phone, or via Zoom, with the interviewer sitting at their desk and the candidate sitting in their living room or office.</p>\n<p>Remote interviews have many benefits for both employers and employees. Employers get to evaluate candidates based on who they are and what they look like without worrying about geographical location.</p>\n<h2 id=\"whatisaremoteinterview\"><strong>What is a Remote Interview?</strong></h2>\n<p>A remote interview is a type of interview where the candidate and interviewer are not in the same location. Remote interviews can be done using various communication technologies, including Skype, Google Hangouts, Zoom, or phone.</p>\n<p>\\\nRemote interviews are becoming more common because they offer employers several benefits. They allow companies to hire candidates who live in areas where there is a lack of qualified candidates. They also enable companies to hire candidates from all over the world.</p>\n<h3 id=\"tipstoacearemotejobinterview\"><strong>Tips to Ace A Remote Job Interview</strong></h3>\n<p>In a remote interview, the interviewer and the interviewee are not in the same physical location; thus, you can succeed only if you possess the required skills to land a remote job.</p>\n<p>\\\nThe following are some tips for remote workers to nail the remote job interview:</p>\n<p>\\</p>\n<ul>\n<li>Be sure to have a <strong>good internet connection</strong> to communicate with your interviewer without any issues.</li>\n<li>Make sure that you're <strong>comfortable with your surroundings</strong> - if it's too noisy or bright where you are, it'll affect how you sound on the phone.</li>\n<li>Prepare before the interview so that you know what to expect. <strong>Dress appropriately</strong> and be ready to answer questions about yourself and your work experience.</li>\n<li>Do your <strong>research on the company</strong>, its culture, and its values beforehand to understand its company culture and values better when you speak with them.</li>\n<li>Make sure to have <strong>your resume or CV handy</strong> during the interview so they can see it before deciding whether or not to hire you.</li>\n<li><strong>Answer questions about yourself upfront</strong> before they ask them because this will help them understand who you are.</li>\n</ul>\n<h2 id=\"topquestionscandidatesshouldaskduringaremoteinterview\"><strong>Top Questions Candidates Should Ask During A Remote Interview</strong></h2>\n<p>Remote interviews are becoming more popular as companies look for ways to reduce costs and hire people who live in remote areas or time zones and don't want to relocate.</p>\n<p>\\\nIf you're a candidate, it's important that you ask the right questions during your next remote interview, as it is an important part of <a href=\"https://hackernoon.com/how-to-find-remote-jobs-in-2021-16-websites-to-help-you-work-from-home-online\">finding the right remote job</a>. Here are some questions that all candidates should ask during their next remote interview:</p>\n<h3 id=\"1whatistheinterviewprocesslike\"><strong>1. What is the interview process like?</strong></h3>\n<p>It's a good idea to ask first what the interview process is, especially if there are multiple stages of interviews before getting hired. This will help you become more prepared through the process, <a href=\"https://dailyremote.com/remote-work-blog/mistakes-avoid-apply-remote-job/\">avoid any mistakes while applying for the remote job</a>, and indicate to your interviewer how ready you are for those stages if any.</p>\n<h3 id=\"2howdoyouworkremotely\"><strong>2. How do you work remotely?</strong></h3>\n<p>The nature of your work, the applications used to monitor workflow, and many other systems might be different for your work when in the office versus when working remotely. Make sure to ask about the nature of your work when working remotely and what systems you need to adapt to.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/dekqFKbCjYP7GoUnRP2jptMYXsC3-2022-12-13T14:01:04.306Z-clbmakl6c000h0as66k7caaml\" alt=\"\" /></p>\n<h3 id=\"3howmanyleavesdoyougrantperyearwhileworkingremotely\"><strong>3. How many leaves do you grant per year while working remotely?</strong></h3>\n<p>Company policy might change the amount of leave you can have when working remotely versus when reporting on-site. Clear this up with your employer, noting the different kinds of leave and whether working remotely can affect their policy.</p>\n<h3 id=\"4whatwouldbethetimelineoftheinterviewprocess\"><strong>4. What would be the timeline of the interview process?</strong></h3>\n<p>This question ties in with the first question about the interview process. Ask what the dates would be between the process and when you would be informed if you passed the next stage so that you can schedule accordingly and prepare accordingly for the process.</p>\n<h3 id=\"5whatistheexpectedtimezoneyourteamworksin\"><strong>5. What is the expected time zone your team works in?</strong></h3>\n<p>Depending on the company, you might have to interact with a team that lives worldwide and in different time zones. Ask the timezone that the team you would potentially be working with works on, and make sure that you can meet with them and work with them in that timezone.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/dekqFKbCjYP7GoUnRP2jptMYXsC3-2022-12-13T14:01:04.312Z-clbmakl6g000i0as60wlb9bfe\" alt=\"\" /></p>\n<h3 id=\"6howdothisjobsfirst3060and90dayslooklike\"><strong>6. How do this job's first 30, 60, and 90 days look like?</strong></h3>\n<p>This question gives you a rough idea of how you would progress and adjust within your work role. Would you be given training for your work? Will the company have an upcoming big project, and are you more likely to work overtime in the next 30, 60, and 90 days? This question would answer those supplemental questions and help you succeed in the remote role.</p>\n<h3 id=\"7isthisroleremotehybridorinperson\"><strong>7. Is this role remote, hybrid or in-person?</strong></h3>\n<p>Clarify if remote work means you can stay remote forever or if there are plans for employees to return to the office in the next few months. Depending on the answer, consider if the job is something you would want and could adjust to. It is essential to understand if the role is fully remote or hybrid.</p>\n<h3 id=\"8whatgrowthoptionsareavailableinthisroleafterayearortwo\"><strong>8. What growth options are available in this role after a year or two?</strong></h3>\n<p>This question relates more to training and, more importantly, promotions. Does the company frequently promote employees? Are you given enough training for this promotion and your subsequent role expansion? Ensure that the company provides enough opportunities to its employees for growth.</p>\n<h3 id=\"9howwouldyoudescribetheremoteworkculture\"><strong>9. How would you describe the remote work culture?</strong></h3>\n<p>A dramatic change in work dynamics would be in the office work culture versus remote work. You won't be able to see or access your coworkers as often, and this would result in a culture change. Ask about the current culture in the company and how remote work has affected it. Then decide if that culture is the right fit for you.</p>\n<h3 id=\"10howdoestheteamcommunicateremotely\"><strong>10. How does the team communicate remotely?</strong></h3>\n<p>Remote work communication can either be email or message-heavy (or <a href=\"https://en.wikipedia.org/wiki/Asynchronous_communication\">asynchronous</a>), or meetings-heavy (or synchronous). Whichever you prefer, make sure to ask about it, then prepare to adapt to that communication system to be more effective in your work and talking to your team.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/dekqFKbCjYP7GoUnRP2jptMYXsC3-2022-12-13T14:01:04.313Z-clbmakl6i000j0as65jf9hoqw\" alt=\"\" /></p>\n<h3 id=\"11whatarethedaytodayresponsibilitiesoftherole\"><strong>11. What are the day-to-day responsibilities of the role?</strong></h3>\n<p>This basic question should be asked for any role, not just a remote job. You should understand at least what to expect in working for a remote company daily.</p>\n<h3 id=\"12whatremotetoolsdoyouusetocollaborate\"><strong>12. What remote tools do you use to collaborate?</strong></h3>\n<p>From communication channels like <a href=\"https://hackernoon.com/company/slack\">Slack</a> to scheduling apps like GanttPro, and collaboration apps like Miro, there are many applications that you can use for remote work to make it easier to collaborate and communicate with the team. Ask the interviewer what remote working tools are being used so that you can more easily adjust to the role by learning more about these applications and how they work.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/dekqFKbCjYP7GoUnRP2jptMYXsC3-2022-12-13T14:01:04.314Z-clbmakl6i000k0as6ammn8l6v\" alt=\"\" /></p>\n<h3 id=\"13howdoyouprovidefeedbacktoremoteemployees\"><strong>13. How do you provide feedback to remote employees?</strong></h3>\n<p>Feedback is critical to a company as it can gauge employee performance and determine who is underperforming. Ask how this feedback is obtained and provided, so you won't be unprepared for your job.</p>\n<h3 id=\"14whatarethebenefitsprovidedtoremoteemployees\"><strong>14. What are the benefits provided to remote employees?</strong></h3>\n<p>Again, this is another question that should be asked in any job. However, there might be some changes to the benefits that remote workers receive depending on the company you are working for. Clear this up as soon as possible with your remote company.</p>\n<h3 id=\"15doesthecompanyholdteammeetups\"><strong>15. Does the company hold team meetups?</strong></h3>\n<p>Due to the remote work policy, as said before, the culture and dynamic of the company and the team might be different than with in-office teams. The company might hold separate team meetups to ensure that teams can still interact with each other, even if it's not regularly.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/dekqFKbCjYP7GoUnRP2jptMYXsC3-2022-12-13T14:01:04.350Z-clbmakl7i000m0as655ar5ut0\" alt=\"\" /></p>\n<h3 id=\"16whatisyourremoteworkpolicy\"><strong>16. What is your remote work policy?</strong></h3>\n<p>Make sure to clear up the specifics of the company's remote work policy so that you know what your setup would be and if it's a permanent or temporary arrangement.</p>\n<h3 id=\"17howdoyouhelpyourteamworkfromhome\"><strong>17. How do you help your team work from home?</strong></h3>\n<p>Companies usually give remote workers adequate work-from-home tools and devices to help them work remotely. There might be some other benefits the company provides; ask about them with your interviewer.</p>\n<h3 id=\"18howdoesthecompanyfocusonremoteteambuilding\"><strong>18. How does the company focus on remote team-building?</strong></h3>\n<p>Remote companies alleviate team dynamics and culture problems through various activities, including virtual remote team-building. Ask the company about these activities and how they help the team work together more effectively.</p>\n<h3 id=\"19whatarethecompanystopgoalsforthefuture\"><strong>19. What are the company's top goals for the future?</strong></h3>\n<p>Understanding the company's projects and plans and where they're headed might give you more information about how you want to proceed with your future and whether or not you see yourself staying with the company for a long time.</p>\n<h3 id=\"20howdoyouovercomechallengesregardingremotework\"><strong>20. How do you overcome challenges regarding remote work?</strong></h3>\n<p>As said before, there are many challenges that remote work brings to the table, from collaboration and communication problems to different timezones to struggles with devices and more. Ask the company how they plan to overcome these challenges.</p>\n<h3 id=\"21whatcaniexpectthedaytodaytolooklikeinthisrole\"><strong>21. What can I expect the day-to-day to look like in this role?</strong></h3>\n<p>Make sure to ask about the day-to-day responsibilities of your role so you have an understanding of the job at hand and so that you are always prepared for everything thrown at you.</p>\n<h3 id=\"22whatarethemostchallengingaspectsofthisremotejob\"><strong>22. What are the most challenging aspects of this remote job?</strong></h3>\n<p>Asking about the most challenging part of the job can help you prepare for the role you will take in the company. You can start planning how to work around that challenge and be a more effective remote worker.</p>\n<h3 id=\"23howwouldyoudescribetheremoteworkenvironmentinthecompany\"><strong>23. How would you describe the remote work environment in the company?</strong></h3>\n<p>Again, this question has more to do with worker culture, dynamics, and how they integrate and collaborate. It's an important question to ask so that you can start adapting to that environment, too.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/dekqFKbCjYP7GoUnRP2jptMYXsC3-2022-12-13T14:01:04.323Z-clbmakl6r000l0as6hcpo7hjd\" alt=\"\" /></p>\n<h3 id=\"24howmuchoftheteamworksremotely\"><strong>24. How much of the team works remotely?</strong></h3>\n<p>Ask this question to schedule around and collaborate better with those who work remotely and those who don't.</p>\n<h3 id=\"25doesthecompanyprovideremoteemployeeswitharemoteworksetup\"><strong>25. Does the company provide remote employees with a remote work setup?</strong></h3>\n<p>Depending on the company, they might offer remote employees a setup (laptop, mouse, etc.) to work remotely. Make sure to take this benefit if they provide it so that you can fully utilize the company's benefits.</p>\n<h2 id=\"howtonailaremotejobinterview\"><strong>How to Nail A Remote Job Interview</strong></h2>\n<p>Asking these questions will ensure that you are adequately prepared for the remote interview, and the role you're about to take and that you will be able to integrate well with the team you're going to work with (whether they work remotely or on-site).</p>\n<p>\\\nRemember to be fully informed about the company and its plans so that you can plan your future as a company member. When it comes to a remote job interview, preparation is vital. Prepping for a remote job interview can often feel overwhelming, but it is worth it.</p>\n<p>\\</p>\n<hr />\n<p>Also published <a href=\"https://dailyremote.com/remote-work-blog/questions-to-ask-during-a-remote-interview/\">here.</a> </p>","content:encodedSnippet":"Remote interviews are becoming a more popular way of interviewing candidates. Remote companies save time and money on travel expenses and determine if the candidate is a good fit for your team.\n\\\nRemote interviews are usually done by video conferencing, over the phone, or via Zoom, with the interviewer sitting at their desk and the candidate sitting in their living room or office.\nRemote interviews have many benefits for both employers and employees. Employers get to evaluate candidates based on who they are and what they look like without worrying about geographical location.\nWhat is a Remote Interview?\nA remote interview is a type of interview where the candidate and interviewer are not in the same location. Remote interviews can be done using various communication technologies, including Skype, Google Hangouts, Zoom, or phone.\n\\\nRemote interviews are becoming more common because they offer employers several benefits. They allow companies to hire candidates who live in areas where there is a lack of qualified candidates. They also enable companies to hire candidates from all over the world.\nTips to Ace A Remote Job Interview\nIn a remote interview, the interviewer and the interviewee are not in the same physical location; thus, you can succeed only if you possess the required skills to land a remote job.\n\\\nThe following are some tips for remote workers to nail the remote job interview:\n\\\n\nBe sure to have a good internet connection to communicate with your interviewer without any issues.\nMake sure that you're comfortable with your surroundings - if it's too noisy or bright where you are, it'll affect how you sound on the phone.\nPrepare before the interview so that you know what to expect. Dress appropriately and be ready to answer questions about yourself and your work experience.\nDo your research on the company, its culture, and its values beforehand to understand its company culture and values better when you speak with them.\nMake sure to have your resume or CV handy during the interview so they can see it before deciding whether or not to hire you.\nAnswer questions about yourself upfront before they ask them because this will help them understand who you are.\nTop Questions Candidates Should Ask During A Remote Interview\nRemote interviews are becoming more popular as companies look for ways to reduce costs and hire people who live in remote areas or time zones and don't want to relocate.\n\\\nIf you're a candidate, it's important that you ask the right questions during your next remote interview, as it is an important part of finding the right remote job. Here are some questions that all candidates should ask during their next remote interview:\n1. What is the interview process like?\nIt's a good idea to ask first what the interview process is, especially if there are multiple stages of interviews before getting hired. This will help you become more prepared through the process, avoid any mistakes while applying for the remote job, and indicate to your interviewer how ready you are for those stages if any.\n2. How do you work remotely?\nThe nature of your work, the applications used to monitor workflow, and many other systems might be different for your work when in the office versus when working remotely. Make sure to ask about the nature of your work when working remotely and what systems you need to adapt to.\n\\\n \n3. How many leaves do you grant per year while working remotely?\nCompany policy might change the amount of leave you can have when working remotely versus when reporting on-site. Clear this up with your employer, noting the different kinds of leave and whether working remotely can affect their policy.\n4. What would be the timeline of the interview process?\nThis question ties in with the first question about the interview process. Ask what the dates would be between the process and when you would be informed if you passed the next stage so that you can schedule accordingly and prepare accordingly for the process.\n5. What is the expected time zone your team works in?\nDepending on the company, you might have to interact with a team that lives worldwide and in different time zones. Ask the timezone that the team you would potentially be working with works on, and make sure that you can meet with them and work with them in that timezone.\n\\\n \n6. How do this job's first 30, 60, and 90 days look like?\nThis question gives you a rough idea of how you would progress and adjust within your work role. Would you be given training for your work? Will the company have an upcoming big project, and are you more likely to work overtime in the next 30, 60, and 90 days? This question would answer those supplemental questions and help you succeed in the remote role.\n7. Is this role remote, hybrid or in-person?\nClarify if remote work means you can stay remote forever or if there are plans for employees to return to the office in the next few months. Depending on the answer, consider if the job is something you would want and could adjust to. It is essential to understand if the role is fully remote or hybrid.\n8. What growth options are available in this role after a year or two?\nThis question relates more to training and, more importantly, promotions. Does the company frequently promote employees? Are you given enough training for this promotion and your subsequent role expansion? Ensure that the company provides enough opportunities to its employees for growth.\n9. How would you describe the remote work culture?\nA dramatic change in work dynamics would be in the office work culture versus remote work. You won't be able to see or access your coworkers as often, and this would result in a culture change. Ask about the current culture in the company and how remote work has affected it. Then decide if that culture is the right fit for you.\n10. How does the team communicate remotely?\nRemote work communication can either be email or message-heavy (or asynchronous), or meetings-heavy (or synchronous). Whichever you prefer, make sure to ask about it, then prepare to adapt to that communication system to be more effective in your work and talking to your team.\n\\\n \n11. What are the day-to-day responsibilities of the role?\nThis basic question should be asked for any role, not just a remote job. You should understand at least what to expect in working for a remote company daily.\n12. What remote tools do you use to collaborate?\nFrom communication channels like Slack to scheduling apps like GanttPro, and collaboration apps like Miro, there are many applications that you can use for remote work to make it easier to collaborate and communicate with the team. Ask the interviewer what remote working tools are being used so that you can more easily adjust to the role by learning more about these applications and how they work.\n\\\n \n13. How do you provide feedback to remote employees?\nFeedback is critical to a company as it can gauge employee performance and determine who is underperforming. Ask how this feedback is obtained and provided, so you won't be unprepared for your job.\n14. What are the benefits provided to remote employees?\nAgain, this is another question that should be asked in any job. However, there might be some changes to the benefits that remote workers receive depending on the company you are working for. Clear this up as soon as possible with your remote company.\n15. Does the company hold team meetups?\nDue to the remote work policy, as said before, the culture and dynamic of the company and the team might be different than with in-office teams. The company might hold separate team meetups to ensure that teams can still interact with each other, even if it's not regularly.\n\\\n \n16. What is your remote work policy?\nMake sure to clear up the specifics of the company's remote work policy so that you know what your setup would be and if it's a permanent or temporary arrangement.\n17. How do you help your team work from home?\nCompanies usually give remote workers adequate work-from-home tools and devices to help them work remotely. There might be some other benefits the company provides; ask about them with your interviewer.\n18. How does the company focus on remote team-building?\nRemote companies alleviate team dynamics and culture problems through various activities, including virtual remote team-building. Ask the company about these activities and how they help the team work together more effectively.\n19. What are the company's top goals for the future?\nUnderstanding the company's projects and plans and where they're headed might give you more information about how you want to proceed with your future and whether or not you see yourself staying with the company for a long time.\n20. How do you overcome challenges regarding remote work?\nAs said before, there are many challenges that remote work brings to the table, from collaboration and communication problems to different timezones to struggles with devices and more. Ask the company how they plan to overcome these challenges.\n21. What can I expect the day-to-day to look like in this role?\nMake sure to ask about the day-to-day responsibilities of your role so you have an understanding of the job at hand and so that you are always prepared for everything thrown at you.\n22. What are the most challenging aspects of this remote job?\nAsking about the most challenging part of the job can help you prepare for the role you will take in the company. You can start planning how to work around that challenge and be a more effective remote worker.\n23. How would you describe the remote work environment in the company?\nAgain, this question has more to do with worker culture, dynamics, and how they integrate and collaborate. It's an important question to ask so that you can start adapting to that environment, too.\n\\\n \n24. How much of the team works remotely?\nAsk this question to schedule around and collaborate better with those who work remotely and those who don't.\n25. Does the company provide remote employees with a remote work setup?\nDepending on the company, they might offer remote employees a setup (laptop, mouse, etc.) to work remotely. Make sure to take this benefit if they provide it so that you can fully utilize the company's benefits.\nHow to Nail A Remote Job Interview\nAsking these questions will ensure that you are adequately prepared for the remote interview, and the role you're about to take and that you will be able to integrate well with the team you're going to work with (whether they work remotely or on-site).\n\\\nRemember to be fully informed about the company and its plans so that you can plan your future as a company member. When it comes to a remote job interview, preparation is vital. Prepping for a remote job interview can often feel overwhelming, but it is worth it.\n\\\n\nAlso published here.","dc:creator":"Daniel","content":"Remote interviews are becoming a more popular way of interviewing candidates. Remote companies save time and money on travel expenses and determine if the candidate is a good fit for your team.\n\nRemote interviews are usually done by video conferencing, over the phone, or via Zoom, with the interviewer sitting at their desk and the candidate sitting in their living room or office.\n\nRemote interviews have many benefits for both employers and employees. Employers get to evaluate candidates based on who they are and what they look like without worrying about geographical location.","contentSnippet":"Remote interviews are becoming a more popular way of interviewing candidates. Remote companies save time and money on travel expenses and determine if the candidate is a good fit for your team.\n\nRemote interviews are usually done by video conferencing, over the phone, or via Zoom, with the interviewer sitting at their desk and the candidate sitting in their living room or office.\n\nRemote interviews have many benefits for both employers and employees. Employers get to evaluate candidates based on who they are and what they look like without worrying about geographical location.","guid":"https://hackernoon.com/25-questions-candidates-should-ask-in-an-interview-for-remote-work?source=rss","categories":["work","remote-work","future-of-work","remote-jobs","job-interview","tech-interviews","career-advice","tips"],"isoDate":"2022-12-13T14:01:04.000Z","from":"https://hackernoon.com/feed","hashId":"ee24251253a12b60246f2d64ad334aec"},{"creator":"Dotan Horovits","title":"Why Your Monitoring Dashboard May Be Feeding You Phantom Metrics","link":"https://hackernoon.com/why-your-monitoring-dashboard-may-be-feeding-you-phantom-metrics?source=rss","pubDate":"Tue, 13 Dec 2022 14:14:57 GMT","content:encoded":"<p>\\\nWhether you’re a DevOps, SRE, or just a data-driven individual, you’re probably addicted to dashboards and metrics. We look at our metrics to see how our system is doing, whether on the infrastructure, the application, or the business level. We trust our metrics to show us the status of our system and where it misbehaves. But do our metrics show us what really happened? You’d be surprised how often it’s not the case.</p>\n<p>\\\nIn this post I will look into the math and mechanics behind metrics, some common misconceptions, what it takes to have accurate metrics, and if there even is such a thing.</p>\n<h1 id=\"metricsessentials\">Metrics essentials</h1>\n<p>Metrics are essentially roll-ups of raw events. During this roll-up process, the events are translated into numerical data points. A simple example is errors occurring in the system, with a simple metric to count the errors. Metrics can also involve multiple variables, such as a count of requests with a response time higher than 1 second. When measured over time, these data points form a <em>time series</em>.</p>\n<p>\\\nMetrics can be of various types, such as Counters, Gauges, and Histograms. <em>Counters</em> are used for the cumulative counting of events, as we saw in the above examples. <em>Gauges</em> typically represent the latest value of measurement. And then there are more elaborate types such as <em>Histograms</em> that can sample the <em>distribution</em> of metric values, by counting events in configurable “buckets” or “bins”. For example, you may want to understand the memory usage percent segmented by pods across your cluster in given points in time.</p>\n<h1 id=\"themechanicsofmetrics\">The mechanics of metrics</h1>\n<p>In an ideal world, we would ingest and store all the raw events, and then calculate the metrics on query time. This would allow us to slice and dice the events in any way we need, and ask any ad-hoc questions we desire.</p>\n<p>\\\nIn the real world, however, keeping all the raw events for extended periods of time can be prohibitively expensive, due to the high volumes of data. To overcome this, events are frequently rolled up into metrics in the collection pipeline, while discarding the raw events or retaining them for short periods only. This is oftentimes a matter of a simple configuration in your metrics collector agent.</p>\n<p>\\\nIn addition to reducing cost, aggregation upon collection can improve the performance of real-time analytics with higher metric transmission and ingestion rates at a higher frequency, and by avoiding heavy aggregations and calculations on query time.</p>\n<h1 id=\"themathofmetricsinanutshell\">The math of metrics in a nutshell</h1>\n<p>This rolling-up process involves some math. We might want to calculate the mean or median of the response times, or maybe a percentile, or an aggregation over a time window. We might also want to roll up multiple events into one composite metric. For example, I may want to calculate the 95th percentile (commonly known as P95) of all the pods of a specific service across my cluster.</p>\n<p>\\\nEven if you don’t like math, you cannot avoid it with metrics. You need to understand the different aggregation functions, and the relation between the question you wish to ask and the metric and aggregate you need in order to answer it. Let’s look at the Average function as an example, as many tend to start there. Averages, by definition, smoothen things up and will be less suitable for flushing out anomalous behavior and outliers. When investigating latency problems, for example, it will be quite useless to look at average metric values, and you’d be better off looking at percentiles.</p>\n<h1 id=\"determineyourquestionsdesignyourmetricsaccordingly\">Determine your questions, design your metrics accordingly</h1>\n<p>In a way, you can think about these metrics as a lossy compression, during which we lose data and context from the raw events. If we don’t keep the raw events, then we need to determine upfront what’s important for us. For example, if I only calculate the average value over the data, I will not be able to ask about the P95 (95th percentile) later over the pre-aggregated data.</p>\n<p>\\\nYou need to determine what questions you want to answer, what’s important for you, and design your metrics and aggregations accordingly. A common mistake is that people avoid this design phase, and just use the preset metrics and default values provided out of the box with their metrics collector of choice. While you may think these defaults represent some industry standard, these are oftentimes quite legacy, and in most cases won’t be in tune with your specific needs.</p>\n<p><a href=\"https://youtu.be/t9hpWv7fVSk?t=555?embedable=true\">https://youtu.be/t9hpWv7fVSk?t=555?embedable=true</a></p>\n<h1 id=\"themeasurementproblem\">The measurement problem</h1>\n<p>Just like in physics, the measurement problem occurs when we measure a (seemingly) continuous property at discrete intervals, often called the <em>sampling interval</em>, which determines the <em>sampling rate.</em> This creates a distorted representation, where the metric may not actually reflect the originally measured property. For example, if we measure the CPU utilization every 60 seconds, then any CPU outlier happening between these sampling points will be invisible to us. </p>\n<p>\\\nMoreover, in order to draw a consecutive line, visualization tools oftentimes average over consecutive data points, which gives the misleading appearance of a smooth line. On some occasions the opposite can occur, where you can get artifacts in your metrics that aren’t real, like peaks in your metrics that don’t really exist. This can happen when running aggregations within the storage backend, due to the in which the calculation is being made.</p>\n<h1 id=\"meantimetodetection\">Mean time to detection</h1>\n<p>The sampling period also influences how fast a change in the system will be visible in the metrics. Most algorithms require five data points to detect a trend. If the sampling interval is 60 sec, then the simple math determines that it will take five minutes (that is, 60 sec X 5 data points) before we see something is wrong. Could you afford to wait 5 minutes to know that your system crashed? Using shorter sampling intervals (i.e. higher sampling rates) will shorten this period and enable us to detect and react faster. Of course, higher sampling rates incur overhead in CPU and storage, so we need to find the configuration that strikes the right balance for our needs.</p>\n<h1 id=\"varyingresolutionanddownscaling\">Varying resolution and downscaling</h1>\n<p>A common practice is to save metrics in different resolutions in a tiered approach, to reduce cost. For example, you may want to save the metric every 10 seconds for the first day, but then every 5 minutes for the next week, and perhaps every 1 hour for the month or more ahead. This practice assumes that we need the finest granularity for the near real-time period, which we may need it if there’s an issue in the system, while investigations over longer periods require larger-scale trends.</p>\n<p>\\\nThe different granularities can be achieved by downscaling the metrics, namely calculating the less granular metric off of the higher granularity one. While this sounds perfectly reasonable, math can interfere here, as some aggregation functions are not compatible with certain computations, and can therefore not be aggregated later. For example, percentiles are not additive and cannot be summed up. So, following the above example, if you have a P99 percentile sampled with 10 seconds resolution, you can’t roll them up to a 5-minute resolution. It’s important to be cognizant of the compatibility of the aggregation functions, and when using non-compatible functions such as percentiles, to make design decisions about which resolutions we require, and calculate these time series upfront.</p>\n<p>\\\nThe varying resolution is not limited only to the time factor. Another example is saving per-pod data, and then wishing to “group by” nodes or clusters. The same constraint applies here, meaning that if we expect to be interested in slicing and dicing a percentile-based metric per node, per region, per namespace, or across the entire cluster, we need to pre-aggregate accordingly.</p>\n<p>\\\nAnother approach is to give up the accuracy of measurements to gain compatibility in computation, by using histograms. You can take histograms of a few servers and sum them up, or histograms of several time windows and sum them up, and then to downscale. The problem is that in this case, percentiles will be estimates rather than accurate. It’s also important to note that histograms are more time-consuming in storage and throughput, as every sample is not just a single number but a few samples (one per bucket).</p>\n<h1 id=\"summary\">Summary</h1>\n<p>Metrics are a powerful way to monitor our applications. But they are not necessarily representative of the actual system’s state. It requires an understanding of the math and nature of metrics, as well as careful design, to make sure our metrics are indeed useful to answer the questions we need. Having access to the raw data in addition to the metrics is always good, as this is ultimately the source of truth.</p>\n<p>\\\nWant to learn more? Check out the OpenObservability Talks episode: <em>All Metrics Are Wrong, Some Are Useful</em> on <a href=\"https://open.spotify.com/episode/0ZPx0dMcBzdEC5iJVEVg1e?si=SXJoIkvkSR-sAUIR5EBPWQ\">Spotify</a>, <a href=\"https://podcasts.apple.com/gb/podcast/all-metrics-are-wrong-some-are-useful-openobservability/id1521240652?i=1000500718482\">Apple Podcasts</a> or <a href=\"https://anchor.fm/openobservability/episodes/All-Metrics-Are-Wrong--Some-Are-Useful---OpenObservability-Talks-S1E6-en4bfv\">other podcast apps</a>.</p>\n<hr />\n<p><em>This article was originally&nbsp;<a href=\"https://horovits.medium.com/phantom-metrics-why-your-monitoring-dashboard-may-be-lying-to-you-ca477e80589e\">here</a>.</em> \\n </p>","content:encodedSnippet":"\\\nWhether you’re a DevOps, SRE, or just a data-driven individual, you’re probably addicted to dashboards and metrics. We look at our metrics to see how our system is doing, whether on the infrastructure, the application, or the business level. We trust our metrics to show us the status of our system and where it misbehaves. But do our metrics show us what really happened? You’d be surprised how often it’s not the case.\n\\\nIn this post I will look into the math and mechanics behind metrics, some common misconceptions, what it takes to have accurate metrics, and if there even is such a thing.\nMetrics essentials\nMetrics are essentially roll-ups of raw events. During this roll-up process, the events are translated into numerical data points. A simple example is errors occurring in the system, with a simple metric to count the errors. Metrics can also involve multiple variables, such as a count of requests with a response time higher than 1 second. When measured over time, these data points form a time series.\n\\\nMetrics can be of various types, such as Counters, Gauges, and Histograms. Counters are used for the cumulative counting of events, as we saw in the above examples. Gauges typically represent the latest value of measurement. And then there are more elaborate types such as Histograms that can sample the distribution of metric values, by counting events in configurable “buckets” or “bins”. For example, you may want to understand the memory usage percent segmented by pods across your cluster in given points in time.\nThe mechanics of metrics\nIn an ideal world, we would ingest and store all the raw events, and then calculate the metrics on query time. This would allow us to slice and dice the events in any way we need, and ask any ad-hoc questions we desire.\n\\\nIn the real world, however, keeping all the raw events for extended periods of time can be prohibitively expensive, due to the high volumes of data. To overcome this, events are frequently rolled up into metrics in the collection pipeline, while discarding the raw events or retaining them for short periods only. This is oftentimes a matter of a simple configuration in your metrics collector agent.\n\\\nIn addition to reducing cost, aggregation upon collection can improve the performance of real-time analytics with higher metric transmission and ingestion rates at a higher frequency, and by avoiding heavy aggregations and calculations on query time.\nThe math of metrics in a nutshell\nThis rolling-up process involves some math. We might want to calculate the mean or median of the response times, or maybe a percentile, or an aggregation over a time window. We might also want to roll up multiple events into one composite metric. For example, I may want to calculate the 95th percentile (commonly known as P95) of all the pods of a specific service across my cluster.\n\\\nEven if you don’t like math, you cannot avoid it with metrics. You need to understand the different aggregation functions, and the relation between the question you wish to ask and the metric and aggregate you need in order to answer it. Let’s look at the Average function as an example, as many tend to start there. Averages, by definition, smoothen things up and will be less suitable for flushing out anomalous behavior and outliers. When investigating latency problems, for example, it will be quite useless to look at average metric values, and you’d be better off looking at percentiles.\nDetermine your questions, design your metrics accordingly\nIn a way, you can think about these metrics as a lossy compression, during which we lose data and context from the raw events. If we don’t keep the raw events, then we need to determine upfront what’s important for us. For example, if I only calculate the average value over the data, I will not be able to ask about the P95 (95th percentile) later over the pre-aggregated data.\n\\\nYou need to determine what questions you want to answer, what’s important for you, and design your metrics and aggregations accordingly. A common mistake is that people avoid this design phase, and just use the preset metrics and default values provided out of the box with their metrics collector of choice. While you may think these defaults represent some industry standard, these are oftentimes quite legacy, and in most cases won’t be in tune with your specific needs.\nhttps://youtu.be/t9hpWv7fVSk?t=555?embedable=true\nThe measurement problem\nJust like in physics, the measurement problem occurs when we measure a (seemingly) continuous property at discrete intervals, often called the sampling interval, which determines the sampling rate. This creates a distorted representation, where the metric may not actually reflect the originally measured property. For example, if we measure the CPU utilization every 60 seconds, then any CPU outlier happening between these sampling points will be invisible to us. \n\\\nMoreover, in order to draw a consecutive line, visualization tools oftentimes average over consecutive data points, which gives the misleading appearance of a smooth line. On some occasions the opposite can occur, where you can get artifacts in your metrics that aren’t real, like peaks in your metrics that don’t really exist. This can happen when running aggregations within the storage backend, due to the in which the calculation is being made.\nMean time to detection\nThe sampling period also influences how fast a change in the system will be visible in the metrics. Most algorithms require five data points to detect a trend. If the sampling interval is 60 sec, then the simple math determines that it will take five minutes (that is, 60 sec X 5 data points) before we see something is wrong. Could you afford to wait 5 minutes to know that your system crashed? Using shorter sampling intervals (i.e. higher sampling rates) will shorten this period and enable us to detect and react faster. Of course, higher sampling rates incur overhead in CPU and storage, so we need to find the configuration that strikes the right balance for our needs.\nVarying resolution and downscaling\nA common practice is to save metrics in different resolutions in a tiered approach, to reduce cost. For example, you may want to save the metric every 10 seconds for the first day, but then every 5 minutes for the next week, and perhaps every 1 hour for the month or more ahead. This practice assumes that we need the finest granularity for the near real-time period, which we may need it if there’s an issue in the system, while investigations over longer periods require larger-scale trends.\n\\\nThe different granularities can be achieved by downscaling the metrics, namely calculating the less granular metric off of the higher granularity one. While this sounds perfectly reasonable, math can interfere here, as some aggregation functions are not compatible with certain computations, and can therefore not be aggregated later. For example, percentiles are not additive and cannot be summed up. So, following the above example, if you have a P99 percentile sampled with 10 seconds resolution, you can’t roll them up to a 5-minute resolution. It’s important to be cognizant of the compatibility of the aggregation functions, and when using non-compatible functions such as percentiles, to make design decisions about which resolutions we require, and calculate these time series upfront.\n\\\nThe varying resolution is not limited only to the time factor. Another example is saving per-pod data, and then wishing to “group by” nodes or clusters. The same constraint applies here, meaning that if we expect to be interested in slicing and dicing a percentile-based metric per node, per region, per namespace, or across the entire cluster, we need to pre-aggregate accordingly.\n\\\nAnother approach is to give up the accuracy of measurements to gain compatibility in computation, by using histograms. You can take histograms of a few servers and sum them up, or histograms of several time windows and sum them up, and then to downscale. The problem is that in this case, percentiles will be estimates rather than accurate. It’s also important to note that histograms are more time-consuming in storage and throughput, as every sample is not just a single number but a few samples (one per bucket).\nSummary\nMetrics are a powerful way to monitor our applications. But they are not necessarily representative of the actual system’s state. It requires an understanding of the math and nature of metrics, as well as careful design, to make sure our metrics are indeed useful to answer the questions we need. Having access to the raw data in addition to the metrics is always good, as this is ultimately the source of truth.\n\\\nWant to learn more? Check out the OpenObservability Talks episode: All Metrics Are Wrong, Some Are Useful on Spotify, Apple Podcasts or other podcast apps.\nThis article was originally here. \\n","dc:creator":"Dotan Horovits","content":"Metrics are a powerful way to monitor our applications. But they are not necessarily representative of the actual system’s state. It requires understanding of the math and nature of metrics, as well as careful design, to make sure our metrics are indeed useful to answer the questions we need. Having access to the raw data in addition to the metrics is always good, as this is ultimately the source of truth. \nDetermine your questions, design your metrics accordingly. Understand the different aggregation functions and their characteristic, set up the sampling interval that gives you the right granularity and balance between detection latency and storage volumes. Use varying resolution for different periods of time to balance observability and cost, and consider downscaling where possible (note that not all aggregation functions are compatible with such calculations ","contentSnippet":"Metrics are a powerful way to monitor our applications. But they are not necessarily representative of the actual system’s state. It requires understanding of the math and nature of metrics, as well as careful design, to make sure our metrics are indeed useful to answer the questions we need. Having access to the raw data in addition to the metrics is always good, as this is ultimately the source of truth. \nDetermine your questions, design your metrics accordingly. Understand the different aggregation functions and their characteristic, set up the sampling interval that gives you the right granularity and balance between detection latency and storage volumes. Use varying resolution for different periods of time to balance observability and cost, and consider downscaling where possible (note that not all aggregation functions are compatible with such calculations","guid":"https://hackernoon.com/why-your-monitoring-dashboard-may-be-feeding-you-phantom-metrics?source=rss","categories":["devops","monitoring","sre","observability","devops-tools","debugging","optimization","hackernoon-top-story"],"isoDate":"2022-12-13T14:14:57.000Z","from":"https://hackernoon.com/feed","hashId":"c7d6e9854b76e3b44e10b4ebe94b9917"},{"creator":"Legal PDF","title":"It Happened: SBF Arrested in the Bahamas per Criminal Charges & Extradition Request by the US","link":"https://hackernoon.com/it-happened-sbf-arrested-in-the-bahamas-per-criminal-charges-and-extradition-request-by-the-us?source=rss","pubDate":"Tue, 13 Dec 2022 14:23:26 GMT","content:encoded":"<p>:::tip\nStatement From The Attorney General Of The Bahamas Sen. Ryan Pinder KC On The Arrest Of Sam Bankman-Fried, Dec 12, 2022, is part of&nbsp;<strong><a href=\"https://hackernoon.com/u/legalpdf?ref=hackernoon.com\">HackerNoon’s Legal PDF Series</a></strong>.</p>\n<p>:::</p>\n<p>\\\n<em>Office of the</em></p>\n<p><em>Attorney General &</em></p>\n<p><em>Ministry of Legal Affairs</em></p>\n<p>\\</p>\n<h2 id=\"statementfromtheattorneygeneralofthebahamassenryanpinderkconthearrestofsambankmanfried\">Statement From The Attorney General Of The Bahamas Sen. Ryan Pinder KC On The Arrest Of Sam Bankman-Fried</h2>\n<p>\\\nOn 12 December 2022, the Office of the Attorney General of The Bahamas is announcing the arrest by The Royal Bahamas Police Force of Sam Bankman-Fried (“SBF”), former CEO of FTX. SBF’s arrest followed receipt of formal notification from the United States that it has filed criminal charges against SBF and is likely to request his extradition.</p>\n<p>\\\nAs a result of the notification received and the material provided therewith, it was deemed appropriate for the Attorney General to seek SBF’s arrest and hold him in custody pursuant to our nation’s Extradition Act.</p>\n<p>\\\nAt such time as a formal request for extradition is made, The Bahamas intends to process it promptly, pursuant to Bahamian law and its treaty obligations with the United States.</p>\n<p>\\\nResponding to SBF’s arrest, Prime Minister Davis stated, “The Bahamas and the United States have a shared interest in holding accountable all individuals associated with FTX who may have betrayed the public trust and broken the law. While the United States is pursuing criminal charges against SBF individually, The Bahamas will continue its own regulatory and criminal investigations into the collapse of FTX, with the continued cooperation of its law enforcement and regulatory partners in the United States and elsewhere.\"</p>\n<p>\\\nDecember 12, 2022</p>\n<p><em>Office of the</em></p>\n<p><em>Attorney General &</em></p>\n<p><em>Ministry of Legal Affairs</em></p>\n<p><em>Commonwealth of the Bahamas</em></p>\n<p>\\\n \\n </p>","content:encodedSnippet":":::tip\nStatement From The Attorney General Of The Bahamas Sen. Ryan Pinder KC On The Arrest Of Sam Bankman-Fried, Dec 12, 2022, is part of HackerNoon’s Legal PDF Series.\n:::\n\\\nOffice of the\nAttorney General &\nMinistry of Legal Affairs\n\\\nStatement From The Attorney General Of The Bahamas Sen. Ryan Pinder KC On The Arrest Of Sam Bankman-Fried\n\\\nOn 12 December 2022, the Office of the Attorney General of The Bahamas is announcing the arrest by The Royal Bahamas Police Force of Sam Bankman-Fried (“SBF”), former CEO of FTX. SBF’s arrest followed receipt of formal notification from the United States that it has filed criminal charges against SBF and is likely to request his extradition.\n\\\nAs a result of the notification received and the material provided therewith, it was deemed appropriate for the Attorney General to seek SBF’s arrest and hold him in custody pursuant to our nation’s Extradition Act.\n\\\nAt such time as a formal request for extradition is made, The Bahamas intends to process it promptly, pursuant to Bahamian law and its treaty obligations with the United States.\n\\\nResponding to SBF’s arrest, Prime Minister Davis stated, “The Bahamas and the United States have a shared interest in holding accountable all individuals associated with FTX who may have betrayed the public trust and broken the law. While the United States is pursuing criminal charges against SBF individually, The Bahamas will continue its own regulatory and criminal investigations into the collapse of FTX, with the continued cooperation of its law enforcement and regulatory partners in the United States and elsewhere.\"\n\\\nDecember 12, 2022\nOffice of the\nAttorney General &\nMinistry of Legal Affairs\nCommonwealth of the Bahamas\n\\\n \\n","dc:creator":"Legal PDF","content":"Nuff Said. ","contentSnippet":"Nuff Said.","guid":"https://hackernoon.com/it-happened-sbf-arrested-in-the-bahamas-per-criminal-charges-and-extradition-request-by-the-us?source=rss","categories":["it-happened","sam-bankman-fried","scam-bankman-fraud","ftx","arrested","criminal-charges","extradition-request","hackernoon-top-story"],"isoDate":"2022-12-13T14:23:26.000Z","from":"https://hackernoon.com/feed","hashId":"eec50bfa8d3d99d0065e5c1efe45847c"},{"creator":"Noonification","title":"The Noonification: Treat Your Cybersecurity Drills Like Fire Drills (12/13/2022)","link":"https://hackernoon.com/12-13-2022-noonification?source=rss","pubDate":"Tue, 13 Dec 2022 16:02:07 GMT","content:encoded":"<p>How are you, hacker? \n 🪐<strong>What's happening in tech this week:</strong>\n <a href=\"https://hackernoon.com/noonification-your-daily-dose-of-electrifying-tech-content-at-noon-by-hacker-noon\">The Noonification by HackerNoon </a> has got you covered with fresh content from our top 5 stories of the day, every day at noon your local time! Set email preference <a href=\"https://app.hackernoon.com/profile/email-settings\">here</a>.\n ## <strong><a href=\"https://hackernoon.com/it-happened-sbf-arrested-in-the-bahamas-per-criminal-charges-and-extradition-request-by-the-us\">It Happened: SBF Arrested in the Bahamas per Criminal Charges  Extradition Request by the US</a></strong> <img src=\"https://cdn.hackernoon.com/images/hYnD3aGcZIgKnjRGl8QfkZDGyBF2-zo93okf.gif.webp\" alt=\"\" />\n By <a href=\"https://hackernoon.com/u/legalpdf\">@legalpdf</a> [ 2 Min read ] \n Nuff said.  <a href=\"https://hackernoon.com/it-happened-sbf-arrested-in-the-bahamas-per-criminal-charges-and-extradition-request-by-the-us\">Read More.</a></p>\n<h2 id=\"whyyourmonitoringdashboardmaybefeedingyouphantommetricshttpshackernooncomwhyyourmonitoringdashboardmaybefeedingyouphantommetricshttpscdnhackernooncomimagesjxed9vf1pqwwqc2favernooqaxy20z93pafjpeg\"><strong><a href=\"https://hackernoon.com/why-your-monitoring-dashboard-may-be-feeding-you-phantom-metrics\">Why Your Monitoring Dashboard May Be Feeding You Phantom Metrics</a></strong> <img src=\"https://cdn.hackernoon.com/images/jXed9vf1PqWWqc2FaVerNOOqaXy2-0z93paf.jpeg\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/horovits\">@horovits</a> [ 6 Min read ] \n We trust our metrics to show us the status of our system and where it misbehaves. But do our metrics show us what really happened?  <a href=\"https://hackernoon.com/why-your-monitoring-dashboard-may-be-feeding-you-phantom-metrics\">Read More.</a></p>\n<h2 id=\"blockchainastheultimatetruthmachineforgptbasedaichatgpthttpshackernooncomblockchainastheultimatetruthmachineforgptbasedaichatgpthttpscdnhackernooncomimages9vtrqxpyjxc1lrcxvtelc59myu63f5f3nzujpeg\"><strong><a href=\"https://hackernoon.com/blockchain-as-the-ultimate-truth-machine-for-gpt-based-ai-chatgpt\">Blockchain as the Ultimate Truth Machine for GPT-based AI (ChatGPT)</a></strong> <img src=\"https://cdn.hackernoon.com/images/9vtRqXPYjXc1LRCXVTELc59Myu63-f5f3nzu.jpeg\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/anormaljourney\">@anormaljourney</a> [ 6 Min read ] \n While this tech has existed for some years now, ChatGPT was able to obtain 1 mill users in 6 days. <a href=\"https://hackernoon.com/blockchain-as-the-ultimate-truth-machine-for-gpt-based-ai-chatgpt\">Read More.</a></p>\n<h2 id=\"qtforembeddeddevelopmentthemanyprosandthefewconshttpshackernooncomqtforembeddeddevelopmentthemanyprosandthefewconshttpscdnhackernooncomimagesleymvvrtvurihwscxgtfiyzjjrf2roj3nnljpeg\"><strong><a href=\"https://hackernoon.com/qt-for-embedded-development-the-many-pros-and-the-few-cons\">Qt for Embedded Development: The Many Pros and the Few Cons</a></strong> <img src=\"https://cdn.hackernoon.com/images/LEymvvrtvURIHWScxGtFiYzJjRf2-roj3nnl.jpeg\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/andreysolovev\">@andreysolovev</a> [ 2 Min read ] \n In this article, we look at solutions for embedded systems running on Linux/Unix, Windows, and Android. <a href=\"https://hackernoon.com/qt-for-embedded-development-the-many-pros-and-the-few-cons\">Read More.</a></p>\n<h2 id=\"treatyourcybersecuritydrillslikefiredrillshttpshackernooncomtreatyourcybersecuritydrillslikefiredrillshttpscdnhackernooncomimagesbf5mduzkm2xa5ajgviztmbkqlbz23393oovjpeg\"><strong><a href=\"https://hackernoon.com/treat-your-cybersecurity-drills-like-fire-drills\">Treat Your Cybersecurity Drills Like Fire Drills</a></strong> <img src=\"https://cdn.hackernoon.com/images/bf5MdUZkm2XA5ajgVIztMBkqLBz2-3393oov.jpeg\" alt=\"\" /></h2>\n<p>By <a href=\"https://hackernoon.com/u/zacamos\">@zacamos</a> [ 5 Min read ] \n Employees know exactly how to act during a fire emergency, but what about a cybersecurity emergency? Heres how and why you should run cybersecurity drills. <a href=\"https://hackernoon.com/treat-your-cybersecurity-drills-like-fire-drills\">Read More.</a> \n 🧑‍💻 What happened in your world this week?It's been said that <a href=\"https://hackernoon.com/developers-the-why-and-how-to-writing-technical-articles-54e824789ef6\">writing can help consolidate technical knowledge</a>, <a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\">establish credibility</a>,<a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\"> and contribute to emerging community standards</a>. Feeling stuck? We got you covered ⬇️⬇️⬇️\n <a href=\"https://app.hackernoon.com/mobile/lZx3fmlPdlPJpVBIdble\">ANSWER THESE GREATEST INTERVIEW QUESTIONS OF ALL TIME</a>\n We hope you enjoy this worth of free reading material. Feel free to forward this email to a nerdy friend who'll love you for it.See you on Planet Internet! With love, \n The Hacker Noon Team ✌️ <img src=\"https://cdn.hackernoon.com/images/-6sb2rty.png\" alt=\"\" /></p>","content:encodedSnippet":"How are you, hacker? \n 🪐What's happening in tech this week:\n The Noonification by HackerNoon  has got you covered with fresh content from our top 5 stories of the day, every day at noon your local time! Set email preference here.\n ## It Happened: SBF Arrested in the Bahamas per Criminal Charges  Extradition Request by the US \n By @legalpdf [ 2 Min read ] \n Nuff said.  Read More.\nWhy Your Monitoring Dashboard May Be Feeding You Phantom Metrics \nBy @horovits [ 6 Min read ] \n We trust our metrics to show us the status of our system and where it misbehaves. But do our metrics show us what really happened?  Read More.\nBlockchain as the Ultimate Truth Machine for GPT-based AI (ChatGPT) \nBy @anormaljourney [ 6 Min read ] \n While this tech has existed for some years now, ChatGPT was able to obtain 1 mill users in 6 days. Read More.\nQt for Embedded Development: The Many Pros and the Few Cons \nBy @andreysolovev [ 2 Min read ] \n In this article, we look at solutions for embedded systems running on Linux/Unix, Windows, and Android. Read More.\nTreat Your Cybersecurity Drills Like Fire Drills \nBy @zacamos [ 5 Min read ] \n Employees know exactly how to act during a fire emergency, but what about a cybersecurity emergency? Heres how and why you should run cybersecurity drills. Read More. \n 🧑‍💻 What happened in your world this week?It's been said that writing can help consolidate technical knowledge, establish credibility, and contribute to emerging community standards. Feeling stuck? We got you covered ⬇️⬇️⬇️\n ANSWER THESE GREATEST INTERVIEW QUESTIONS OF ALL TIME\n We hope you enjoy this worth of free reading material. Feel free to forward this email to a nerdy friend who'll love you for it.See you on Planet Internet! With love, \n The Hacker Noon Team ✌️","dc:creator":"Noonification","guid":"https://hackernoon.com/12-13-2022-noonification?source=rss","categories":["noonification","hackernoon-newsletter","latest-tect-stories","it-happened","devops","ai","qt","cybersecurity"],"isoDate":"2022-12-13T16:02:07.000Z","from":"https://hackernoon.com/feed","hashId":"3fdbfa364a7ab4a3cd105354eab7bd0f"},{"creator":"Mehran Muslimi","title":"7 Events That May Shape the Global Economy in 2023","link":"https://hackernoon.com/7-events-that-may-shape-the-global-economy-in-2023?source=rss","pubDate":"Tue, 13 Dec 2022 16:56:03 GMT","content:encoded":"<div class=\"paragraph\">As we head into 2023, there are lots of uncertainties. One of which is whether the world&#x27;s largest economy, the US, will sink into a recession, and thereby drag the whole world down with it. While speculation is rife that a recession is not far away, economists point out that the next market cycle may be initiated by Black swan events - events that may be unforeseen but have a significant impact on society. </div><div class=\"paragraph\"><strong>The following black swan events, if they occur, may have far-reaching effects on the state of the global economy in 2023:</strong></div><div class=\"paragraph\"><strong>A Rise in the Price of Gold ﻿</strong></div><div class=\"paragraph\">The price of Gold may rise to a new high as investors scramble for it as safe haven following uncertainty in their local economies. As the realization sinks in that inflation is here to stay, markets and central banks scramble to adjust. In response, the price of gold skyrockets, reaching an all-time high of $3,000. This marks a major shift in the global economy and signals a new era of economic uncertainty.</div><div class=\"paragraph\"><strong>The EU Creates its own military</strong> ﻿</div><div class=\"paragraph\">The EU learning from the recent events in the Russia- Ukraine war and opt to create its own military, With the challenges facing the region and the lack of support from the U.S. military, the European Union decides it was time to take matters into its own hands. They agree to create their own armed forces to protect against potential threats, such as the Russia-Ukraine conflict. It&#x27;s a big step, but one that&#x27;s necessary for this day and age.</div><div class=\"paragraph\"><strong>France&#x27;s Macron Resigning ﻿</strong></div><div class=\"paragraph\">Macron caves in to mounting pressure and resigns, throwing France into an uncertain political future. This marks a significant shift in the country&#x27;s political landscape and puts it in a difficult position in the EU.</div><div class=\"paragraph\"><strong>The UK Tries to Rejoin the EU﻿</strong></div><div class=\"paragraph\">The UK runs out of ideas on how to bolster its economy, and out of desperation coupled with widespread protests hold a referendum to rejoin the EU. This results in political turmoil and economic uncertainty as the country are split are in the middle on whether to continue with Brexit or rejoin the EU.</div><div class=\"paragraph\"><strong>Global Price Control on Basic Products ﻿</strong></div><div class=\"paragraph\">The government-imposed price controls and subsidy programs spiral out of Control. Economies across the world start imposing price controls on basic products in an effort to shield their populations from increasing commodity prices that are getting out of control. Superficially, they look ideal and sensible. However, they ultimately lead to unintended consequences that spiral out of control.</div><div class=\"paragraph\"><strong>Further US Sanctions on Russia ﻿</strong></div><div class=\"paragraph\">The USA imposes more sanctions on Russia and issues alerts to countries that trade with Russia. This causes tensions in countries across the world that may want to side with Russia. Determined to break away from the US monopoly in global finance and its dictatorial tendencies in world trade, Russia, China, and a host of other countries opt to create their own reserve asset.</div><div class=\"paragraph\"><strong>New Energy Projects ﻿</strong></div><div class=\"paragraph\">Tired of being held hostage by OPEC, the richest nations in the world come together to launch an energy project that will shake the world to its core. Get ready for a revolution in energy.</div><div class=\"paragraph\"><strong>Conclusion</strong></div><div class=\"paragraph\">While some of these events look plausible and may come to pass, it is worth noting that the scale of their impact may not be as widespread as foreseen. Black swan events are usually analyzed with hindsight. However, one thing is for sure, as we move into 2023, economies across the world are steadily moving from globalization and embracing a self-preservation model where sovereign interests triumph over global cooperation.<br/></div>","content:encodedSnippet":"As we head into 2023, there are lots of uncertainties. One of which is whether the world's largest economy, the US, will sink into a recession, and thereby drag the whole world down with it. While speculation is rife that a recession is not far away, economists point out that the next market cycle may be initiated by Black swan events - events that may be unforeseen but have a significant impact on society. \nThe following black swan events, if they occur, may have far-reaching effects on the state of the global economy in 2023:\nA Rise in the Price of Gold ﻿\nThe price of Gold may rise to a new high as investors scramble for it as safe haven following uncertainty in their local economies. As the realization sinks in that inflation is here to stay, markets and central banks scramble to adjust. In response, the price of gold skyrockets, reaching an all-time high of $3,000. This marks a major shift in the global economy and signals a new era of economic uncertainty.\nThe EU Creates its own military ﻿\nThe EU learning from the recent events in the Russia- Ukraine war and opt to create its own military, With the challenges facing the region and the lack of support from the U.S. military, the European Union decides it was time to take matters into its own hands. They agree to create their own armed forces to protect against potential threats, such as the Russia-Ukraine conflict. It's a big step, but one that's necessary for this day and age.\nFrance's Macron Resigning ﻿\nMacron caves in to mounting pressure and resigns, throwing France into an uncertain political future. This marks a significant shift in the country's political landscape and puts it in a difficult position in the EU.\nThe UK Tries to Rejoin the EU﻿\nThe UK runs out of ideas on how to bolster its economy, and out of desperation coupled with widespread protests hold a referendum to rejoin the EU. This results in political turmoil and economic uncertainty as the country are split are in the middle on whether to continue with Brexit or rejoin the EU.\nGlobal Price Control on Basic Products ﻿\nThe government-imposed price controls and subsidy programs spiral out of Control. Economies across the world start imposing price controls on basic products in an effort to shield their populations from increasing commodity prices that are getting out of control. Superficially, they look ideal and sensible. However, they ultimately lead to unintended consequences that spiral out of control.\nFurther US Sanctions on Russia ﻿\nThe USA imposes more sanctions on Russia and issues alerts to countries that trade with Russia. This causes tensions in countries across the world that may want to side with Russia. Determined to break away from the US monopoly in global finance and its dictatorial tendencies in world trade, Russia, China, and a host of other countries opt to create their own reserve asset.\nNew Energy Projects ﻿\nTired of being held hostage by OPEC, the richest nations in the world come together to launch an energy project that will shake the world to its core. Get ready for a revolution in energy.\nConclusion\nWhile some of these events look plausible and may come to pass, it is worth noting that the scale of their impact may not be as widespread as foreseen. Black swan events are usually analyzed with hindsight. However, one thing is for sure, as we move into 2023, economies across the world are steadily moving from globalization and embracing a self-preservation model where sovereign interests triumph over global cooperation.","dc:creator":"Mehran Muslimi","content":"As we head into 2023, there are lots of uncertainties. One of which is whether the world's largest economy, the US, will sink into a recession, and thereby drag the whole world down with it. While speculation is rife that a recession is not far away, economists point out that the next market cycle may be initiated by Black swan events - events that may be unforeseen but have a significant impact on society. \n\nThe following black swan events, if they occur, may have far-reaching effects on the state of the global economy in 2023.","contentSnippet":"As we head into 2023, there are lots of uncertainties. One of which is whether the world's largest economy, the US, will sink into a recession, and thereby drag the whole world down with it. While speculation is rife that a recession is not far away, economists point out that the next market cycle may be initiated by Black swan events - events that may be unforeseen but have a significant impact on society. \n\nThe following black swan events, if they occur, may have far-reaching effects on the state of the global economy in 2023.","guid":"https://hackernoon.com/7-events-that-may-shape-the-global-economy-in-2023?source=rss","categories":["economics","global-finance","government","politics","predictions","speculation","global-economy","governance"],"isoDate":"2022-12-13T16:56:03.000Z","from":"https://hackernoon.com/feed","hashId":"ef7887ac9a0b13fe6c18fc21d413faf9"},{"title":"FTX Managed Critical Accounting Via Slack, New CEO Testifies","link":"https://blockworks.co/news/ftx-managed-critical-accounting-via-slack-new-ceo-testifies","pubDate":"Tue, 13 Dec 2022 16:57:21 GMT","content:encoded":"\n<p>Now-bankrupt FTX may have experienced financial trouble for years before the public became aware, the exchange’s new CEO testified Tuesday.&nbsp;</p>\n\n\n\n<p>John Ray, who <a href=\"https://blockworks.co/news/new-ftx-ceo-says-exchange-commingled-assets\" target=\"_blank\" rel=\"noreferrer noopener\">took over</a> to handle the exchange’s restructuring, appeared before lawmakers for the first of several expected hearings to discuss the fraud and what’s next for customers. </p>\n\n\n\n<p>“What was first disclosed to the public happened around Nov. 2, But when this began was months, if not earlier, years,” Ray <a href=\"https://www.youtube.com/watch?v=rWAnrigAO3I\" target=\"_blank\" rel=\"noreferrer noopener\">said</a>. “Investigation is continuing…but this is not something that happened overnight.” </p>\n\n\n\n<p>Bankman-Fried, who was expected to appear virtually before he was <a href=\"https://blockworks.co/news/bankman-fried-arrest-day-before-congress-testimony-raises-eyebrows\" target=\"_blank\" rel=\"noreferrer noopener\">arrested</a> in the Bahamas Monday evening, likely knew far more than he has let on in recent interviews, Ray added. </p>\n\n\n\n<p>The 30-year-old founder faces several <a href=\"https://blockworks.co/news/sec-charges-sam-bankman-fried-with-defrauding-investors\" target=\"_blank\" rel=\"noreferrer noopener\">charges</a> in the US, including wire fraud, conspiracy, securities fraud conspiracy and money laundering. </p>\n\n\n\n<p>FTX’s restructuring team has secured more than $1 billion in assets so far, Ray said, which are now being held in cold storage for security. The team anticipates it will take additional “weeks, if not months” to recover additional assets.</p>\n\n\n\n<p>The majority of FTX’s creditors were clients of FTX.com — Bankman-Fried’s flagship global exchange headquartered in the Bahamas — and not based in the US, Ray added.&nbsp;</p>\n\n\n\n<p>FTX’s collapse and associated fraud is “worse than Enron,” the veteran insolvency expert said, primarily because FTX’s management system was so inappropriately structured. Ray oversaw liquidation of the commodity and services giant in 2007.</p>\n\n\n\n<p>“This one is unusual and unusual in the sense that literally, there&#8217;s no record keeping whatsoever,” Ray said of FTX.&nbsp;</p>\n\n\n\n<p>“In the absence of record keeping, employees would communicate invoicing and expenses on Slack, which is essentially a way of communicating in chat rooms.”&nbsp;</p>\n\n\n\n<p>The exchange also used online accounting platform QuickBooks, a product more appropriate for mid-sized companies than multibillion-dollar corporations, Ray said. </p>\n\n\n\n<p>“There was no sophistication whatsoever,” Ray said. “There was an absence of any.”&nbsp;</p>\n\n\n\n<h3>Sam Bankman-Fried crypto bill still in play</h3>\n\n\n\n<p>In Tuesday’s Congressional session, lawmakers were primarily concerned with getting to the bottom of exactly how FTX ended up in this situation.</p>\n\n\n\n<p>Still, some used the opportunity to express greater concerns about the digital asset industry as a whole.&nbsp;</p>\n\n\n\n<p>“For five years I&#8217;ve been trying to ban American investments in crypto,” Rep. Brad Sherman, D-Cali., said. “I&#8217;m the only member of the House to get an F from the only crypto promoting organization that rates members of Congress.”&nbsp;</p>\n\n\n\n<p>Members of Congress and the Securities and Exchange Commission failed to protect investors by neglecting to investigate the exchange and its founder, Sherman said.&nbsp;</p>\n\n\n\n<p>“Don&#8217;t trash Sam Bankman-Fried and then pass his bill,” Rep. Sherman urged, referring to the <a href=\"https://blockworks.co/news/crypto-regulation-cftc-sec-tag-team\" target=\"_blank\" rel=\"noreferrer noopener\">Digital Commodities Consumer Protection Act</a>, which <a href=\"https://blockworks.co/news/sbf-cftc-crypto-bill\" target=\"_blank\" rel=\"noreferrer noopener\">Bankman-Fried</a> advocated for prior to the exchange’s public collapse. </p>\n\n\n\n<p>As of Tuesday morning, Bankman-Fried is the only person associated with FTX who faces criminal charges.&nbsp;</p>\n\n\n\n<p>When asked if Bankman-Fried’s right-hand associates, namely Ryan Salame, co-CEO of FTX, and Caroline Ellison, Alameda Research’s CEO, would face prosecution, Ray only said his team would turn over any relevant information found.</p>\n\n\n\n<hr class=\"wp-block-separator\">\n<p><strong>Get the day’s top crypto news and insights delivered to your inbox every evening.&nbsp;<a href=\"https://cms.blockworks.co/newsletter/?source=end\" target=\"_blank\" rel=\"noreferrer noopener\">Subscribe to Blockworks’ free newsletter</a>&nbsp;now.</strong></p>\n<br>\n<p><strong>Can&#8217;t wait? Get our news the fastest way possible.&nbsp;<a href=\"https://t.me/blockworks_news\" target=\"_blank\" rel=\"noreferrer noopener\">Join us on Telegram</a>.</strong></p>\n<hr class=\"wp-block-separator\">\n","content:encodedSnippet":"Now-bankrupt FTX may have experienced financial trouble for years before the public became aware, the exchange’s new CEO testified Tuesday. \nJohn Ray, who took over to handle the exchange’s restructuring, appeared before lawmakers for the first of several expected hearings to discuss the fraud and what’s next for customers. \n“What was first disclosed to the public happened around Nov. 2, But when this began was months, if not earlier, years,” Ray said. “Investigation is continuing…but this is not something that happened overnight.” \nBankman-Fried, who was expected to appear virtually before he was arrested in the Bahamas Monday evening, likely knew far more than he has let on in recent interviews, Ray added. \nThe 30-year-old founder faces several charges in the US, including wire fraud, conspiracy, securities fraud conspiracy and money laundering. \nFTX’s restructuring team has secured more than $1 billion in assets so far, Ray said, which are now being held in cold storage for security. The team anticipates it will take additional “weeks, if not months” to recover additional assets.\nThe majority of FTX’s creditors were clients of FTX.com — Bankman-Fried’s flagship global exchange headquartered in the Bahamas — and not based in the US, Ray added. \nFTX’s collapse and associated fraud is “worse than Enron,” the veteran insolvency expert said, primarily because FTX’s management system was so inappropriately structured. Ray oversaw liquidation of the commodity and services giant in 2007.\n“This one is unusual and unusual in the sense that literally, there’s no record keeping whatsoever,” Ray said of FTX. \n“In the absence of record keeping, employees would communicate invoicing and expenses on Slack, which is essentially a way of communicating in chat rooms.” \nThe exchange also used online accounting platform QuickBooks, a product more appropriate for mid-sized companies than multibillion-dollar corporations, Ray said. \n“There was no sophistication whatsoever,” Ray said. “There was an absence of any.” \nSam Bankman-Fried crypto bill still in play\nIn Tuesday’s Congressional session, lawmakers were primarily concerned with getting to the bottom of exactly how FTX ended up in this situation.\nStill, some used the opportunity to express greater concerns about the digital asset industry as a whole. \n“For five years I’ve been trying to ban American investments in crypto,” Rep. Brad Sherman, D-Cali., said. “I’m the only member of the House to get an F from the only crypto promoting organization that rates members of Congress.” \nMembers of Congress and the Securities and Exchange Commission failed to protect investors by neglecting to investigate the exchange and its founder, Sherman said. \n“Don’t trash Sam Bankman-Fried and then pass his bill,” Rep. Sherman urged, referring to the Digital Commodities Consumer Protection Act, which Bankman-Fried advocated for prior to the exchange’s public collapse. \nAs of Tuesday morning, Bankman-Fried is the only person associated with FTX who faces criminal charges. \nWhen asked if Bankman-Fried’s right-hand associates, namely Ryan Salame, co-CEO of FTX, and Caroline Ellison, Alameda Research’s CEO, would face prosecution, Ray only said his team would turn over any relevant information found.\nGet the day’s top crypto news and insights delivered to your inbox every evening. Subscribe to Blockworks’ free newsletter now.\nCan’t wait? Get our news the fastest way possible. Join us on Telegram.","content":"The collapse and fraud associated with FTX is “worse than Enron,” Ray said, who oversaw the liquidation of the commodity and services company in 2007","contentSnippet":"The collapse and fraud associated with FTX is “worse than Enron,” Ray said, who oversaw the liquidation of the commodity and services company in 2007","guid":"https://blockworks.co/news/ftx-managed-critical-accounting-via-slack-new-ceo-testifies","categories":["Regulation","bankruptcy","FTX","John Jay Ray III"],"isoDate":"2022-12-13T16:57:21.000Z","from":"https://blockworks.co/feed/","hashId":"204bbe2599bc7af7714c434a493b09fc"},{"creator":"Avalanche","title":"Ava Labs Launches Core Mobile Wallet, The Last Crypto Wallet You’ll Ever Need","link":"https://medium.com/avalancheavax/ava-labs-launches-core-mobile-wallet-the-last-crypto-wallet-youll-ever-need-2596c9b66be9?source=rss-f7c9f4ea738f------2","pubDate":"Tue, 13 Dec 2022 17:18:47 GMT","content:encoded":"<p><em>Core gives users simple and secure mobile access to their assets across Avalanche, Bitcoin, Ethereum, and EVM-compatible chains.</em></p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*FzlJRWR9ruvAcd6r\" /></figure><p>Ava Labs has released <em>Core mobile</em>, a free, multichain mobile wallet jam-packed with features for both experts and those new to crypto, while keeping crypto assets and digital collectibles safe under self-custody. Launching first on Android with support for iOS planned for 2023, Core mobile aims to be the fastest and most intuitive wallet for connecting to the rapidly-growing DeFi, NFT, and gaming ecosystems across Avalanche. Core mobile also includes support for Bitcoin, Ethereum, and EVM-compatible blockchains.</p><p>Crypto is notoriously difficult to navigate. Most wallets lack compatibility for multiple blockchains, require custom configurations, and don’t have many features that crypto traders and dApp users need.</p><p>Core mobile fixes common problems with wallet apps and provides the fastest, most intuitive user experience to connect to Avalanche, with compatibility with other EVM-compatible chains.</p><p><em>Core extension</em> revolutionized wallets with game-changing innovations like native Bitcoin transfers to Avalanche, quick cash on-ramps, and nearly-instant swaps — features that set Core apart from the pack.</p><p>These powerful features, and more, are now on Android devices with Core mobile, giving digital asset traders and collectors the ability to:</p><ul><li>Self-custody assets for greater security- the way it should be</li><li>Transfer native Bitcoin and Ethereum assets to use on Avalanche DeFi dApps</li><li>Effortlessly manage Avalanche and Ethereum assets, Bitcoin, NFTs, and more</li><li>Easily swap hundreds of Avalanche assets</li><li>Buy AVAX with a debit or credit card in just a few clicks</li><li>Track real-time asset price movements in one convenient Watchlist</li><li>Pay anyone by scanning a QR code</li><li>Connect to high-performance DeFi dApps, NFT marketplaces, and games on Avalanche</li><li>Explore preloaded Subnets in the Avalanche ecosystem</li><li>Quickly add any EVM-compatible Layer 1 and Layer 2</li></ul><p>Excited about all these amazing features packed into Core mobile? Get a first look here!</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*DV1A9kHYr4Z_-YLU\" /></figure><blockquote>“Core mobile is designed to give people maximum control over their crypto, while ensuring the product is intuitive enough for anyone to use,” said Nick Mussallem, SVP, Head of Product at Ava Labs. “Mass adoption is coming, and Core will be the gateway for people who want a single platform that can do it all without the hassle of multiple wallets.”</blockquote><p>Download Core mobile for free on <a href=\"https://play.google.com/store/apps/details?id=com.avaxwallet&amp;pli=1\">Google Play</a>, and never download another wallet again.</p><p>Stay tuned for Core mobile on iOS coming soon on the Apple App Store, pending review by Apple.</p><p><em>For further questions, please visit the Avalanche</em><a href=\"http://support.avax.network/\"><em> knowledge base</em></a><em> or contact a support team member via the chat button at </em><a href=\"http://support.avax.network/\"><em>support.avax.network</em></a><em>.</em></p><p><em>We’d also love to hear your feedback on Core. Please </em><a href=\"https://support.avax.network/en/articles/6323380-how-to-share-product-feedback-report-bugs-and-request-features-in-core\"><em>share it here</em></a><em>!</em></p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fupscri.be%2Ff%2Fxnitey%3Fas_embed%3Dtrue&amp;dntp=1&amp;display_name=Upscribe&amp;url=https%3A%2F%2Fupscri.be%2Fxnitey&amp;key=d04bfffea46d4aeda930ec88cc64b87c&amp;type=text%2Fhtml&amp;schema=upscri\" width=\"800\" height=\"400\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/b8a596544f943e3618682869c7e2f97a/href\">https://medium.com/media/b8a596544f943e3618682869c7e2f97a/href</a></iframe><h3><strong>About Ava Labs</strong></h3><p>Ava Labs makes it simple to launch decentralized applications on Avalanche, the fastest smart contracts platform in the blockchain industry. We are empowering people to easily and freely digitize all the world’s assets on one open, programmable blockchain platform.</p><p>Ava Labs was founded by Cornell computer scientists who brought on talent from Wall Street to execute their vision. The company has received funding from Andreessen Horowitz, Initialized Capital, and Polychain Capital, with angel investments from Balaji Srinivasan and Naval Ravikant.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=2596c9b66be9\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/avalancheavax/ava-labs-launches-core-mobile-wallet-the-last-crypto-wallet-youll-ever-need-2596c9b66be9\">Ava Labs Launches Core Mobile Wallet, The Last Crypto Wallet You’ll Ever Need</a> was originally published in <a href=\"https://medium.com/avalancheavax\">Avalanche</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>","content:encodedSnippet":"Core gives users simple and secure mobile access to their assets across Avalanche, Bitcoin, Ethereum, and EVM-compatible chains.\n\nAva Labs has released Core mobile, a free, multichain mobile wallet jam-packed with features for both experts and those new to crypto, while keeping crypto assets and digital collectibles safe under self-custody. Launching first on Android with support for iOS planned for 2023, Core mobile aims to be the fastest and most intuitive wallet for connecting to the rapidly-growing DeFi, NFT, and gaming ecosystems across Avalanche. Core mobile also includes support for Bitcoin, Ethereum, and EVM-compatible blockchains.\nCrypto is notoriously difficult to navigate. Most wallets lack compatibility for multiple blockchains, require custom configurations, and don’t have many features that crypto traders and dApp users need.\nCore mobile fixes common problems with wallet apps and provides the fastest, most intuitive user experience to connect to Avalanche, with compatibility with other EVM-compatible chains.\nCore extension revolutionized wallets with game-changing innovations like native Bitcoin transfers to Avalanche, quick cash on-ramps, and nearly-instant swaps — features that set Core apart from the pack.\nThese powerful features, and more, are now on Android devices with Core mobile, giving digital asset traders and collectors the ability to:\n\nSelf-custody assets for greater security- the way it should be\nTransfer native Bitcoin and Ethereum assets to use on Avalanche DeFi dApps\nEffortlessly manage Avalanche and Ethereum assets, Bitcoin, NFTs, and more\nEasily swap hundreds of Avalanche assets\nBuy AVAX with a debit or credit card in just a few clicks\nTrack real-time asset price movements in one convenient Watchlist\nPay anyone by scanning a QR code\nConnect to high-performance DeFi dApps, NFT marketplaces, and games on Avalanche\nExplore preloaded Subnets in the Avalanche ecosystem\nQuickly add any EVM-compatible Layer 1 and Layer 2\n\nExcited about all these amazing features packed into Core mobile? Get a first look here!\n\n“Core mobile is designed to give people maximum control over their crypto, while ensuring the product is intuitive enough for anyone to use,” said Nick Mussallem, SVP, Head of Product at Ava Labs. “Mass adoption is coming, and Core will be the gateway for people who want a single platform that can do it all without the hassle of multiple wallets.”\nDownload Core mobile for free on Google Play, and never download another wallet again.\nStay tuned for Core mobile on iOS coming soon on the Apple App Store, pending review by Apple.\nFor further questions, please visit the Avalanche knowledge base or contact a support team member via the chat button at support.avax.network.\nWe’d also love to hear your feedback on Core. Please share it here!\nhttps://medium.com/media/b8a596544f943e3618682869c7e2f97a/href\nAbout Ava Labs\nAva Labs makes it simple to launch decentralized applications on Avalanche, the fastest smart contracts platform in the blockchain industry. We are empowering people to easily and freely digitize all the world’s assets on one open, programmable blockchain platform.\nAva Labs was founded by Cornell computer scientists who brought on talent from Wall Street to execute their vision. The company has received funding from Andreessen Horowitz, Initialized Capital, and Polychain Capital, with angel investments from Balaji Srinivasan and Naval Ravikant.\n\nAva Labs Launches Core Mobile Wallet, The Last Crypto Wallet You’ll Ever Need was originally published in Avalanche on Medium, where people are continuing the conversation by highlighting and responding to this story.","dc:creator":"Avalanche","guid":"https://medium.com/p/2596c9b66be9","categories":["mobile-apps","avalanche","core-wallet","cryptocurrency","crypto-wallet"],"isoDate":"2022-12-13T17:18:47.000Z","from":"https://medium.com/feed/@avalancheavax","hashId":"9dd85bc002104a4d3d22448a189a36b3"},{"creator":"mike","title":"Top 5 Must-Haves For Modernizing OT Remote Access","link":"https://xage.com/blog/top-5-must-haves-for-modernizing-ot-remote-access/","pubDate":"Tue, 13 Dec 2022 17:21:42 +0000","content:encoded":"\n\t\t<div id=\"fws_6398b7143e7f5\"  data-column-margin=\"default\" data-midnight=\"dark\"  data-bg-mobile-hidden=\"\" class=\"wpb_row vc_row-fluid vc_row top-level standard_section \"  style=\"padding-top: 0px; padding-bottom: 0px; \"><div class=\"row-bg-wrap\" data-bg-animation=\"none\" data-bg-overlay=\"false\"><div class=\"inner-wrap\"><div class=\"row-bg\"  style=\"\"></div></div><div class=\"row-bg-overlay\" ></div></div><div class=\"col span_12 dark left\">\n\t<div  class=\"vc_col-sm-12 wpb_column column_container vc_column_container col no-extra-padding\"  data-t-w-inherits=\"default\" data-border-radius=\"none\" data-shadow=\"none\" data-border-animation=\"\" data-border-animation-delay=\"\" data-border-width=\"none\" data-border-style=\"solid\" data-border-color=\"\" data-bg-cover=\"\" data-padding-pos=\"all\" data-has-bg-color=\"false\" data-bg-color=\"\" data-bg-opacity=\"1\" data-hover-bg=\"\" data-hover-bg-opacity=\"1\" data-animation=\"\" data-delay=\"0\" >\n\t\t<div class=\"vc_column-inner\" ><div class=\"column-bg-overlay-wrap\" data-bg-animation=\"none\"><div class=\"column-bg-overlay\"></div></div>\n\t\t\t<div class=\"wpb_wrapper\">\n\t\t\t\t\r\n<div class=\"wpb_text_column wpb_content_element \" >\r\n\t<div class=\"wpb_wrapper\">\r\n\t\t<p style=\"text-align: center;\"><em>By Kip Gering, VP GTM Strategy</em></p>\n<p><span style=\"font-weight: 400;\">Enabling reliable, secure remote access to Operational Technology (OT) networks is increasingly a top priority for operational leaders. Yet, regardless of the drivers, many industrial organizations were left with no choice but to turn to IT-centric tools to meet remote access demands.</span></p>\n<p><span style=\"font-weight: 400;\">Unfortunately, IT-centric tools – such as </span><a href=\"https://xage.com/solutions/alternatives-to-it-centric-remote-access/\"><span style=\"font-weight: 400;\">traditional VPNs and jump servers</span></a><span style=\"font-weight: 400;\"> – lack native support or understanding of OT environments. As a result, instead of a fluid access experience, remote users suffer through a patchwork of point solutions to compensate for these shortcomings. </span></p>\n<p><span style=\"font-weight: 400;\">With operational productivity and safety on the line, not to mention the growing risk of cyber threats, </span><b>the time is now to modernize your OT remote access.</b></p>\n<h2><span style=\"font-weight: 400;\">Modernizing Remote Access for Operational Environments</span></h2>\n<p><span style=\"font-weight: 400;\">As you evaluate alternatives to your existing remote access approach, keeping the following five considerations in mind is essential. Each of these “must-haves” is a crucial success criterion for modernizing your secure remote access without compromising user experience or the cybersecurity posture of your OT infrastructure. </span></p>\n<h5>1. Enforces least-privilege access control</h5>\n<p><span style=\"font-weight: 400;\">Cyberattackers often compromise privileged accounts to expand their access in a target environment. Enforcing the principle of least privilege is a crucial cybersecurity control for your remote access strategy. IT-centric access tools are only partially applicable to OT/ICS environments. While IT-centric remote access tools can integrate with privileged access management (PAM) to enforce least privilege, they usually require agents on the assets. This makes them inapplicable to many OT asset types, such as Programmable Logic Controllers (PLCs) and remote terminal units (RTUs). This is an unacceptable compromise for critical infrastructure.</span></p>\n<p><span style=\"font-weight: 400;\">Look for a remote access solution that shifts from a traditional network-centric to an identity-centric security model while accounting for OT’s unique access control challenges. To achieve this, your secure remote access solution must create an individual identity for every asset regardless of native device controls. Only when each identity forms its own perimeter can you consistently enact and enforce granular access policies across your OT, IT, and cloud networks.   </span></p>\n<h5>2. Takes an asset-centric approach</h5>\n<p><span style=\"font-weight: 400;\">At the heart of every industrial organization are the mission-critical OT/ICS assets (devices such as PLCs, RTUs, sensors, actuators, etc.) that comprise your operations. These assets should be the central focus of your secure remote access strategy. Any remote access solution must be able to provide the appropriate level of access, for the required amount of time, to individual OT assets. Any solution offering less granular control, such as a VPN that default-allows access to an entire network segment, is insufficient for OT/ICS environments.</span></p>\n<p><span style=\"font-weight: 400;\">Consider secure remote access solutions that are </span><a href=\"https://xage.com/blog/asset-centric-protection-for-cyber-physical-systems/\"><span style=\"font-weight: 400;\">purpose-built for OT</span></a><span style=\"font-weight: 400;\">. You’ll benefit from a solution that overlays and augments the different native security capabilities of your operational systems. </span></p>\n<p><span style=\"font-weight: 400;\">Your remote access solution must have a deep understanding of the unique relationships and behaviors of different OT assets to effectively safeguard all digital interactions and data transfers between devices, applications, and users.</span></p>\n<p><span style=\"font-weight: 400;\">Absent this awareness, your OT security teams will struggle to create and enforce granular remote access policies. One misconfiguration could impede productivity, threaten operational safety, or leave your environment vulnerable to cyberattack.</span></p>\n<h5>3. Preserves security layers across OT, IT, and cloud interconnectivity</h5>\n<p><span style=\"font-weight: 400;\">The benefits of remote connectivity are undeniable. However, you need to be wary of any remote access solution that exposes vulnerable protocols and at-risk OT devices directly to the internet.  </span></p>\n<p><span style=\"font-weight: 400;\">For years, operations security relied on physical separation between OT systems and IT environments. The “airgap” provided a sense of security that is rapidly dissipating as digital transformation projects drive the need for interconnectivity between OT, IT, and Cloud assets. </span></p>\n<p><span style=\"font-weight: 400;\">Today, your remote access solution must preserve logical segmentation while enabling secure traversal of multiple network layers. This includes utilizing a multi-hop architecture that provides session and protocol termination at each layer without added complexity or friction for the remote user. </span></p>\n<p><span style=\"font-weight: 400;\">You’ll also want to look for a secure remote access solution that eliminates the need to open multiple firewall ports to provide remote connectivity via common protocols (e.g., SSH, VNC, PROFINET). </span></p>\n<p><span style=\"font-weight: 400;\">Finally, your remote access solution must achieve these outcomes without disrupting your existing operations infrastructure. Instead, aim to implement an approach that overlays your environment, OT-IT DMZ, and the cloud. Avoid any solution that requires you to rip and replace any part of your architecture.</span></p>\n<h5>4. Delivers complete visibility of remote access activity</h5>\n<p><span style=\"font-weight: 400;\">A lot can happen during a remote session into your OT infrastructure that affects operational productivity and your cyber-physical systems security posture. Remote access tools that “black box” activities at the network edge limit early detection and cause slow cyber-incident remediation.</span></p>\n<p><span style=\"font-weight: 400;\">Be sure to adopt a secure remote access solution that provides full visibility into all remote session activity. Your solution must take an identity-aware approach to activity logging, auditing, and session tracing, even if the participating devices lack unique user accounts. Anything less leaves operations teams with more questions than answers when every minute a production process is impacted can lead to thousands (if not millions) in lost revenue. </span></p>\n<p><span style=\"font-weight: 400;\">Identity-enriched visibility into OT remote access speeds forensics for incident response, even offering proactive protection against anomalous behaviors. This level of comprehensive visibility also makes demonstrating regulatory compliance much easier.</span></p>\n<h5>5. Modernizes user experience without limiting cyber-hardening</h5>\n<p><span style=\"font-weight: 400;\">The flexibility offered by remote access must not come at the expense of cyber-hardening your OT environment. Whether your cyber-hardening priorities are driven by regulatory mandates, reduced insurance premiums, or intellectual property protection, it’s vital that your remote access solution gives you a way to set a high bar cyber-protection across all of your OT assets.</span></p>\n<p><span style=\"font-weight: 400;\">Make sure your solution can seamlessly add new layers of security controls, regardless of the maturity of native device capabilities. This includes enabling multi-factor authentication (MFA), single sign-on (SSO), advanced secrets management, and other cybersecurity best practices.</span></p>\n<p><span style=\"font-weight: 400;\">Most importantly, it’s crucial these added defense-in-depth controls don’t lead to a kludgy user experience.</span></p>\n<h2><span style=\"font-weight: 400;\">Avoid the Shortcomings of IT-centric Remote Access</span></h2>\n<p><span style=\"font-weight: 400;\">By now it should be evident that you can’t afford to settle for a disjointed remote access solution for the operational technology that drives your business. Fortunately, you can use the five considerations outlined in this article to avoid going down the wrong path.</span></p>\n<p><span style=\"font-weight: 400;\">See for yourself how leading industrial organizations, </span><a href=\"https://xage.com/steel-manufacturer-selects-xage-zero-trust-remote-access/\"><span style=\"font-weight: 400;\">like one of the world’s largest steel manufacturers</span></a><span style=\"font-weight: 400;\">, have applied these principles to their operations using </span><a href=\"https://xage.com/solutions/zero-trust-remote-access-solution/\"><span style=\"font-weight: 400;\">Xage Zero Trust Remote Access</span></a><span style=\"font-weight: 400;\">. </span></p>\n<p><span style=\"font-weight: 400;\">The time is now to modernize your secure remote access, and </span><a href=\"https://info.xage.com/freeaccess\"><span style=\"font-weight: 400;\">Xage is here to help you accelerate your shift to a proactive, zero trust-based approach</span></a><span style=\"font-weight: 400;\">.</span></p>\n\t</div>\r\n</div>\r\n\r\n\r\n\r\n<a class=\"nectar-button large regular accent-color has-icon  regular-button\"  style=\"margin-top: 24px; \" target=\"_blank\" href=\"https://xage.com/steel-manufacturer-selects-xage-zero-trust-remote-access/\" data-color-override=\"false\" data-hover-color-override=\"false\" data-hover-text-color-override=\"#fff\"><span>View Case Study</span><i  class=\"icon-button-arrow\"></i></a>\n\t\t\t</div> \n\t\t</div>\n\t</div> \n</div></div>\n<p>The post <a rel=\"nofollow\" href=\"https://xage.com/blog/top-5-must-haves-for-modernizing-ot-remote-access/\">Top 5 Must-Haves For Modernizing OT Remote Access</a> appeared first on <a rel=\"nofollow\" href=\"https://xage.com\">Xage Security</a>.</p>\n","content:encodedSnippet":"By Kip Gering, VP GTM Strategy\nEnabling reliable, secure remote access to Operational Technology (OT) networks is increasingly a top priority for operational leaders. Yet, regardless of the drivers, many industrial organizations were left with no choice but to turn to IT-centric tools to meet remote access demands.\nUnfortunately, IT-centric tools – such as traditional VPNs and jump servers – lack native support or understanding of OT environments. As a result, instead of a fluid access experience, remote users suffer through a patchwork of point solutions to compensate for these shortcomings. \nWith operational productivity and safety on the line, not to mention the growing risk of cyber threats, the time is now to modernize your OT remote access.\nModernizing Remote Access for Operational Environments\nAs you evaluate alternatives to your existing remote access approach, keeping the following five considerations in mind is essential. Each of these “must-haves” is a crucial success criterion for modernizing your secure remote access without compromising user experience or the cybersecurity posture of your OT infrastructure. \n1. Enforces least-privilege access control\nCyberattackers often compromise privileged accounts to expand their access in a target environment. Enforcing the principle of least privilege is a crucial cybersecurity control for your remote access strategy. IT-centric access tools are only partially applicable to OT/ICS environments. While IT-centric remote access tools can integrate with privileged access management (PAM) to enforce least privilege, they usually require agents on the assets. This makes them inapplicable to many OT asset types, such as Programmable Logic Controllers (PLCs) and remote terminal units (RTUs). This is an unacceptable compromise for critical infrastructure.\nLook for a remote access solution that shifts from a traditional network-centric to an identity-centric security model while accounting for OT’s unique access control challenges. To achieve this, your secure remote access solution must create an individual identity for every asset regardless of native device controls. Only when each identity forms its own perimeter can you consistently enact and enforce granular access policies across your OT, IT, and cloud networks.   \n2. Takes an asset-centric approach\nAt the heart of every industrial organization are the mission-critical OT/ICS assets (devices such as PLCs, RTUs, sensors, actuators, etc.) that comprise your operations. These assets should be the central focus of your secure remote access strategy. Any remote access solution must be able to provide the appropriate level of access, for the required amount of time, to individual OT assets. Any solution offering less granular control, such as a VPN that default-allows access to an entire network segment, is insufficient for OT/ICS environments.\nConsider secure remote access solutions that are purpose-built for OT. You’ll benefit from a solution that overlays and augments the different native security capabilities of your operational systems. \nYour remote access solution must have a deep understanding of the unique relationships and behaviors of different OT assets to effectively safeguard all digital interactions and data transfers between devices, applications, and users.\nAbsent this awareness, your OT security teams will struggle to create and enforce granular remote access policies. One misconfiguration could impede productivity, threaten operational safety, or leave your environment vulnerable to cyberattack.\n3. Preserves security layers across OT, IT, and cloud interconnectivity\nThe benefits of remote connectivity are undeniable. However, you need to be wary of any remote access solution that exposes vulnerable protocols and at-risk OT devices directly to the internet.  \nFor years, operations security relied on physical separation between OT systems and IT environments. The “airgap” provided a sense of security that is rapidly dissipating as digital transformation projects drive the need for interconnectivity between OT, IT, and Cloud assets. \nToday, your remote access solution must preserve logical segmentation while enabling secure traversal of multiple network layers. This includes utilizing a multi-hop architecture that provides session and protocol termination at each layer without added complexity or friction for the remote user. \nYou’ll also want to look for a secure remote access solution that eliminates the need to open multiple firewall ports to provide remote connectivity via common protocols (e.g., SSH, VNC, PROFINET). \nFinally, your remote access solution must achieve these outcomes without disrupting your existing operations infrastructure. Instead, aim to implement an approach that overlays your environment, OT-IT DMZ, and the cloud. Avoid any solution that requires you to rip and replace any part of your architecture.\n4. Delivers complete visibility of remote access activity\nA lot can happen during a remote session into your OT infrastructure that affects operational productivity and your cyber-physical systems security posture. Remote access tools that “black box” activities at the network edge limit early detection and cause slow cyber-incident remediation.\nBe sure to adopt a secure remote access solution that provides full visibility into all remote session activity. Your solution must take an identity-aware approach to activity logging, auditing, and session tracing, even if the participating devices lack unique user accounts. Anything less leaves operations teams with more questions than answers when every minute a production process is impacted can lead to thousands (if not millions) in lost revenue. \nIdentity-enriched visibility into OT remote access speeds forensics for incident response, even offering proactive protection against anomalous behaviors. This level of comprehensive visibility also makes demonstrating regulatory compliance much easier.\n5. Modernizes user experience without limiting cyber-hardening\nThe flexibility offered by remote access must not come at the expense of cyber-hardening your OT environment. Whether your cyber-hardening priorities are driven by regulatory mandates, reduced insurance premiums, or intellectual property protection, it’s vital that your remote access solution gives you a way to set a high bar cyber-protection across all of your OT assets.\nMake sure your solution can seamlessly add new layers of security controls, regardless of the maturity of native device capabilities. This includes enabling multi-factor authentication (MFA), single sign-on (SSO), advanced secrets management, and other cybersecurity best practices.\nMost importantly, it’s crucial these added defense-in-depth controls don’t lead to a kludgy user experience.\nAvoid the Shortcomings of IT-centric Remote Access\nBy now it should be evident that you can’t afford to settle for a disjointed remote access solution for the operational technology that drives your business. Fortunately, you can use the five considerations outlined in this article to avoid going down the wrong path.\nSee for yourself how leading industrial organizations, like one of the world’s largest steel manufacturers, have applied these principles to their operations using Xage Zero Trust Remote Access. \nThe time is now to modernize your secure remote access, and Xage is here to help you accelerate your shift to a proactive, zero trust-based approach.\n\r\n\r\n\r\n\r\n\r\nView Case Study\n\t\t\t\n \n\t\t\n \n\nThe post Top 5 Must-Haves For Modernizing OT Remote Access appeared first on Xage Security.","dc:creator":"mike","content":"<p>The post <a rel=\"nofollow\" href=\"https://xage.com/blog/top-5-must-haves-for-modernizing-ot-remote-access/\">Top 5 Must-Haves For Modernizing OT Remote Access</a> appeared first on <a rel=\"nofollow\" href=\"https://xage.com\">Xage Security</a>.</p>\n","contentSnippet":"The post Top 5 Must-Haves For Modernizing OT Remote Access appeared first on Xage Security.","guid":"https://xage.com/?p=7593","categories":["Blog"],"isoDate":"2022-12-13T17:21:42.000Z","from":"https://xage.com/feed/","hashId":"97d923da5b933d978e4aacdc0698ca6a"},{"creator":"DefiLlama.com","title":"Lido is now the largest DeFi protocol by TVL, with $6.45b deposited","link":"https://twitter.com/DefiLlama/status/1602715765873991683","pubDate":"Tue, 13 Dec 2022 17:23:10 GMT","author":"DefiLlama.com","content":"Lido is now the largest DeFi protocol by TVL, with $6.45b deposited<br><img style=\"\" src=\"https://pbs.twimg.com/media/Fj3751qXgAEnwnM?format=jpg&amp;name=orig\" referrerpolicy=\"no-referrer\">","contentSnippet":"Lido is now the largest DeFi protocol by TVL, with $6.45b deposited","guid":"https://twitter.com/DefiLlama/status/1602715765873991683","isoDate":"2022-12-13T17:23:10.000Z","from":"http://rss.tokenhash.io/twitter/user/DefiLlama","hashId":"20e8a9e5bf5d62d59c6a8f8ee295c14d"},{"creator":"DefiLlama.com","title":"Binance Cex Netflow in the last 24 hours. Around $-5.74b","link":"https://twitter.com/DefiLlama/status/1602718103242153987","pubDate":"Tue, 13 Dec 2022 17:32:27 GMT","author":"DefiLlama.com","content":"Binance Cex Netflow in the last 24 hours. Around $-5.74b <a href=\"https://defillama.com/protocol/binance-cex\" target=\"_blank\" rel=\"noopener noreferrer\">https://defillama.com/protocol/binance-cex</a><br><img style=\"\" src=\"https://pbs.twimg.com/media/Fj3-8nzX0AEqpT8?format=png&amp;name=orig\" referrerpolicy=\"no-referrer\">","contentSnippet":"Binance Cex Netflow in the last 24 hours. Around $-5.74b https://defillama.com/protocol/binance-cex","guid":"https://twitter.com/DefiLlama/status/1602718103242153987","isoDate":"2022-12-13T17:32:27.000Z","from":"http://rss.tokenhash.io/twitter/user/DefiLlama","hashId":"384fcb16179854939cdc6679d440d40b"}]