[{"creator":"\n                     Beau Carnes \n                ","title":"\n                     Learn Next.js for Scalable Web Apps \n                ","link":"https://www.freecodecamp.org/news/learn-next-js-tutorial/","pubDate":"Wed, 14 Dec 2022 13:35:12 -0500","content:encoded":"\n                     Next.js is a popular framework for building server-rendered JavaScript applications. We just published a full course on the freeCodeCamp.org YouTube channel that will help you learn how to use Next.js. Next.js is built on top of React, which is a popular JavaScript library for building user interfaces. Next.js makes it \n                ","content:encodedSnippet":"Next.js is a popular framework for building server-rendered JavaScript applications. We just published a full course on the freeCodeCamp.org YouTube channel that will help you learn how to use Next.js. Next.js is built on top of React, which is a popular JavaScript library for building user interfaces. Next.js makes it","dc:creator":"\n                     Beau Carnes \n                ","content":"\n                     Next.js is a popular framework for building server-rendered JavaScript applications. We just published a full course on the freeCodeCamp.org YouTube channel that will help you learn how to use Next.js. Next.js is built on top of React, which is a popular JavaScript library for building user interfaces. Next.js makes it \n                ","contentSnippet":"Next.js is a popular framework for building server-rendered JavaScript applications. We just published a full course on the freeCodeCamp.org YouTube channel that will help you learn how to use Next.js. Next.js is built on top of React, which is a popular JavaScript library for building user interfaces. Next.js makes it","guid":{"$":{"isPermaLink":"false"}},"categories":["\n                    \n                     Nextjs \n                "],"isoDate":"2022-12-14T18:35:12.000Z","from":"https://medium.freecodecamp.org/feed","hashId":"3d077b0d7cf65ba3f143ae7019aeedc2"},{"creator":"\n                     Beau Carnes \n                ","title":"\n                     Improve Your JavaScript Skills by Coding a Card Game \n                ","link":"https://www.freecodecamp.org/news/improve-your-javascript-skills-by-coding-a-card-game/","pubDate":"Wed, 14 Dec 2022 13:56:08 -0500","content:encoded":"\n                     Building projects is a great way to improve your programming skills. We just published a course on the freeCodeCamp.org YouTube channel that will teach you how to create a digital card game with JavaScirpt, HTML, and CSS. This tutorial not only covers creating a basic card game using JavaScript but \n                ","content:encodedSnippet":"Building projects is a great way to improve your programming skills. We just published a course on the freeCodeCamp.org YouTube channel that will teach you how to create a digital card game with JavaScirpt, HTML, and CSS. This tutorial not only covers creating a basic card game using JavaScript but","dc:creator":"\n                     Beau Carnes \n                ","content":"\n                     Building projects is a great way to improve your programming skills. We just published a course on the freeCodeCamp.org YouTube channel that will teach you how to create a digital card game with JavaScirpt, HTML, and CSS. This tutorial not only covers creating a basic card game using JavaScript but \n                ","contentSnippet":"Building projects is a great way to improve your programming skills. We just published a course on the freeCodeCamp.org YouTube channel that will teach you how to create a digital card game with JavaScirpt, HTML, and CSS. This tutorial not only covers creating a basic card game using JavaScript but","guid":{"$":{"isPermaLink":"false"}},"categories":["\n                    \n                     JavaScript \n                "],"isoDate":"2022-12-14T18:56:08.000Z","from":"https://medium.freecodecamp.org/feed","hashId":"9996dc2cf6abfc272ef43566d17b0754"},{"title":"Why I don’t buy your NFT\n","link":"https://mirror.xyz/shinjurou.eth/yTB5r8TOE8PfAGCflxNmV2jkzjXceqGKzM8fmAlbvZQ","pubDate":"Wed, 14 Dec 2022 20:00:53 GMT","content:encoded":"<blockquote>\n<p>Original: <a href=\"https://mirror.xyz/nishiyama.eth/I7zlaTr65iJmg34f-Bnbn_93AzPwR4D-mMRdqNh8WkE\">あなたのNFTを買わない理由</a></p>\n</blockquote>\n<h2 id=\"firstly\">Firstly,</h2>\n<p>Hello!</p>\n<p>Recently, there has been an increase in the number of people writing articles on the topics of &quot;Why do I buy NFT&quot; and &quot;If you do this then your art will sell&quot;.</p>\n<p>It might be a rehash, but I sometimes buy NFTs as a hobby, so I want to write about the thoughts I usually have.</p>\n<p>Since it would be boring to write about the same theme as everyone else, I have decided to write about &quot;Reasons not to buy NFT”.</p>\n<p><strong>I wrote a lot, but the most important points I wanted to convey are in paragraphs 9 and 10. It&#39;s okay if you skip the rest.</strong></p>\n<p>Since the title is negative, I tried to be careful not to make the content too negative.</p>\n<p>I am assuming that creators will read this, but please do not take it too seriously since I am not a collector.</p>\n<p>This is mainly about 1/1 artworks by individual anime creators that I have bought.</p>\n<h3 id=\"reasons-why-i-buy-nft\">Reasons why I buy NFT</h3>\n<p>But let&#39;s first discuss the reasons for buying. If a work does not meet these conditions, then it would not be something that I want to buy!</p>\n<p><strong>&quot;Why would you pay so much for a simple JPG image?&quot;</strong></p>\n<p>This is a question that has been asked many times, and the answer will vary depending on the person.</p>\n<p><strong>What I am looking for is a “Contributor certificate” type of token.</strong></p>\n<p>I think of it as a fan club membership card.</p>\n<ul>\n<li><p>Proof of my consistent support for the people I want to support.</p>\n</li>\n<li><p>I would be happy if the design on the certificate is to my liking.</p>\n</li>\n<li><p>It would be even better if the value of the tokens I own increases in the future if the artist gets recognition by others.</p>\n</li>\n</ul>\n<p>It&#39;s not exactly the same, but I think the interpretation of &quot;tipping my favorite artist&quot; is close.</p>\n<p>The work should reflect the emotions and experiences that the creator has accumulated up until now.</p>\n<p><strong>What I am purchasing is not just a simple JPG image, but a part of the creator&#39;s life. I cannot become a fan of a person unless I understand their characteristics, thoughts, and background.</strong></p>\n<ul>\n<li><p>I support people who I want to become a fan of.</p>\n</li>\n<li><p>I enjoy watching the creator’s growth.</p>\n</li>\n<li><p>I want to gain some profit when the value of the work increases.</p>\n</li>\n</ul>\n<p><strong>I need to consider whether I can continue to support them over the long term. Isn&#39;t this an important point not only for me but also for many buyers?</strong></p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/KHFVbuntdkdBumOZx17xf.png?height=332&width=523\" alt=\"I want to keep in touch for a long time\"></p>\n<p>I have discussed the reasons for buying, so let&#39;s move on to the main topic of the reasons for not buying.</p>\n<h3 id=\"reasons-why-i-dont-buy-an-nft\">Reasons why I don&#39;t buy an NFT</h3>\n<h3 id=\"1-i-do-not-like-the-design-art-style-or-idea\">1. I do not like the design, art style, or idea</h3>\n<p>I&#39;m sorry for suddenly saying this, but there&#39;s really nothing I can do about it. It&#39;s just an example.</p>\n<p>I&#39;m an otaku, so I primarily buy NFTs of girl illustrations.</p>\n<p>&quot;Hey! Look at my work!&quot;</p>\n<p>If I suddenly receive a DM like this for a modern art-style abstract painting that looks like paint splattered on the wall, I will not even try to understand the artist&#39;s character because I am simply not interested in that art style, no matter how good it is.</p>\n<p><strong>The contents within a wallet reflect a person&#39;s ideology. Naturally, you wouldn&#39;t want to purchase something designed with incompatible ideas.</strong></p>\n<p>My wallet only has girls&#39; illustrations, POAP and OAT achievement badges, and FND bid stamps.</p>\n<p>Just by looking at it, you can tell that I am an otaku with a hobby of collecting achievements.</p>\n<p><strong>There is no need to flatter the buyer, but you need to consider what kind of audience you want your work to reach.</strong></p>\n<p>Even if there’s other reasons not to buy the work, I will still buy or bid on it if I like the illustration.</p>\n<p><strong>In the end, I think the biggest factor is whether an artwork fits my taste or not.</strong></p>\n<h3 id=\"2-lack-of-social-media-skills\">2. Lack of social media skills</h3>\n<p>I mainly look for artworks to buy on Twitter. While doing that, I often see accounts that have high-quality artworks listed but do not tweet about them at all. Meanwhile, some Twitter accounts only RT and never tweeted at all.</p>\n<p><strong>I don&#39;t know what the person is like, and it seems difficult for them to attract fans. Moreover, they might be AI generated or plagiarized.</strong></p>\n<p><strong>In that case, even if the painting is to my liking, it is difficult for me to buy.</strong></p>\n<p><strong>As I mentioned earlier, it is important for me whether the person is someone I want to support. That is why I want to see words from the person themselves to convey their personality and ideas.</strong></p>\n<p>If you think &quot;I really want to retweet other people&#39;s wonderful works no matter what!&quot;, then just adding a single comment will improve your impression.</p>\n<p>Furthermore, there are scammers who steal artwork from others and sell it as NFTs. If you don&#39;t tweet at all, I might be wary that you could be one of them.</p>\n<p>I&#39;m not saying that you need to tweet about everything all the time. I understand the feeling of those who would say &quot;I want to get better at drawing so I don&#39;t want to be on Twitter all the time.&quot; I also don&#39;t tweet at all because I don&#39;t have anything to talk about, and I don&#39;t want to become influential.</p>\n<p><strong>You don&#39;t have to push yourself to do things you&#39;re not comfortable with or don&#39;t want to do.</strong></p>\n<p>One of the great things about NFT is that it allows for freedom of self-expression. If the activity becomes unpleasant because you have to both create artworks and engage in social networking, then it would be a shame.</p>\n<p><strong>Although, it&#39;s important to remember that people are looking at more than just the quality of your works.</strong></p>\n<p>If using Twitter doesn&#39;t cause you any discomfort, then I recommend being active on the platform. You can share a variety of content, even if it doesn&#39;t relate to your artwork or NFT.</p>\n<p>People who are well-liked tend to have more opportunities for their work to be seen and recognized.</p>\n<h3 id=\"3-incorrect-business-practices\">3. Incorrect business practices</h3>\n<p>I only bid on FND when I feel like it, and I don&#39;t have many followers or financial power. Even so, I frequently receive promotional DMs from people I haven&#39;t interacted with at all.</p>\n<p>&quot;Hey brother, look at my work&quot;</p>\n<p>&quot;I&#39;m struggling because I can&#39;t sell it, please buy it!&quot;</p>\n<p>&quot;I saw your collection, you will definitely like my work!&quot; (← Why!?)</p>\n<p><strong>&quot;Link has been sent&quot; &quot;Link has been sent&quot; &quot;Link has been sent&quot;</strong></p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/NZoPkn4ytX0haKGkzue3q.png?height=492&width=294\" alt=\"Link has been sent\"></p>\n<p>I&#39;m sure that big collectors receive a staggering number of spam emails that far surpasses the amount I receive. Promotional DM and replies to tweets saying &quot;I will buy NFT&quot; do not leave a good impression. </p>\n<p>(Of course, there may be some collectors who interpret this as “you are doing your best to promote yourself.”)</p>\n<p><strong>However, I enjoy searching for works that match my taste, so I would be happy if you could let me find them myself. I think there are other people who also enjoy serendipitous discovery like me.</strong></p>\n<p>Most promotional DMs are from overseas, but it is impossible to distinguish between them and scams, so I have decided not to open promotional DMs in general.</p>\n<p>While there are some people who do purchase works from &quot;Shill your NFT, I will buy&quot; tweets, the vast majority don&#39;t. These tweets are mainly used as an engagement farm to get more followers and tweet engagement.</p>\n<p><strong>It feels like you&#39;re bringing down the value of your own brand when you engage in this kind of behavior.</strong></p>\n<p>(It would be nice if you can identify people who would actually buy your work,  but it will probably be difficult.)</p>\n<p><strong>These methods do not result in purchases despite the effort, so I suggest considering other approaches.</strong></p>\n<p>I often see creators becoming friends with each other. I think it’s wonderful to see them sharing their works and supporting each other. I have seen opinions that dislike the culture of forced praise, so it&#39;s okay if you only praise the works or creators that you truly think are good.</p>\n<p>Humans are creatures that are attracted to things that other people desire.</p>\n<p>Pushing or begging for sales gives the impression that no one wants this person&#39;s work.</p>\n<h3 id=\"4-unorganized-collections\">4. Unorganized collections</h3>\n<p>I enjoy NFT as a game that nurtures individual creators (I apologize for the pompous expression). I enjoy watching the people I support gaining popularity and recognition from many others.</p>\n<p><strong>So, what kind of game is NFT for creators? It&#39;s a game to nurture your collections. While that might not be the truth, that is how I see it.</strong></p>\n<p>It is not just about minting and increasing the number of works. It is also about cultivating the collection by building up the floor price, the number of owners, and sales volume. If you do well, it shows that you are working hard in areas other than illustration.</p>\n<ul>\n<li><p>Giveaway or bidding stamps are in the same collection as works for sale.</p>\n</li>\n<li><p>Works with completely different styles are mixed together.</p>\n</li>\n<li><p>Works on different chains like Polygon and ETH, or works with different primary sale prices are randomly mixed together.</p>\n</li>\n</ul>\n<p>In these situations, giveaways and low-priced works will drag down the floor price and have a negative impact on the future of the collection. You should create another collection and move those pieces there!</p>\n<p>The floor price itself is an illusion, but it never hurts to look good.</p>\n<p><strong>If you lined up two products side by side, everyone would prefer to buy a product with a good appearance over one with a bad appearance, even if both products are of the same quality.</strong></p>\n<h3 id=\"5-low-literacy\">5. Low literacy</h3>\n<p>There may be some people who have been actively investing for a long time. But NFT is most likely the first exposure to virtual currency and crypto assets for many creators. It is impossible to have a high level of education or familiarity with these concepts right from the start, so there is no need to feel ashamed.</p>\n<p>However, if you are hacked or your seed phrase is leaked, <strong>not only will your ETH be stolen, but your carefully nurtured collection will also lose value. This can cause harm to the people who have purchased your works.</strong></p>\n<p>In fact, I myself have experienced the case where the creator&#39;s wallet was hacked immediately after purchase. The person tweeted “I was hacked” and that was the end of it.</p>\n<p>There is no doubt that the person who got hacked is the one who suffered the most financially and mentally.</p>\n<p><strong>However, I think it is irresponsible to sell a work and not care about what happens afterwards. Of course, it is essential to take precautions to avoid being hacked, but it&#39;s also important to have a plan in place if you do become a victim.</strong></p>\n<p>(I am not saying that you should return the money, but I think you should announce that you will remint the same work on a new wallet for the holders, or that you will not resell the same work again, etc.)</p>\n<ul>\n<li><p>Be cautious of DMs from strangers</p>\n</li>\n<li><p>Don&#39;t click on suspicious links</p>\n</li>\n<li><p>Don&#39;t open file attachments</p>\n</li>\n<li><p>Don&#39;t share your seed phrase or input it anywhere</p>\n</li>\n<li><p>Double-check to make sure that a site is not a scam before connecting your wallet and signing or approving transactions.</p>\n</li>\n</ul>\n<p>It&#39;s essential to be vigilant about these things. If people think &quot;This person seems likely to be scammed one day,&quot; it will be difficult for them to buy your work.</p>\n<p>It may be inconvenient, but if you are unsure and feel even slightly suspicious, I recommend consulting with someone who is more familiar with the market.</p>\n<h3 id=\"6-missing-description\">6. Missing description</h3>\n<p>This happens quite often.</p>\n<p><strong>The description is not just an explanation, it is a part of the work.</strong></p>\n<p>On Foundation, it is displayed to the left of the Provenance section, a position that is easy to see.</p>\n<p>Please do not leave the description blank. If you think that &quot;I am confident that the appeal of my artwork is sufficient.&quot; then it is fine to not write anything…but It is still preferable to write, and write it in English so that it can be understood overseas. If you absolutely want to write it in your local language, it is okay to include it alongside the English version.</p>\n<p>I am not saying you should write a long essay.</p>\n<p><strong>Even just a single sentence or word can captivate the audience if it allows them to feel your work.</strong></p>\n<p>Among the descriptions I have seen recently, the one by binzoko (<a href=\"https://twitter.com/Binzoko_NFT\">https://twitter.com/Binzoko_NFT</a>) was really great, so I would like to show it to you.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/rF_U_WjURTiw8zQmG8vC4.png?height=881&width=843\" alt=\"Nice sense\"></p>\n<p><a href=\"https://foundation.app/@binzoko_paroma/suisai/2\">https://foundation.app/@binzoko_paroma/suisai/2</a></p>\n<h3 id=\"7-reserve-price-is-too-high\">7. Reserve price is too high</h3>\n<p>This is very common among professional illustrators.</p>\n<p>I won&#39;t mention their name because this is a negative topic, but there is an illustrator I have loved since before they started NFT. The person has a reserve price of more than 2 ETH for their works.</p>\n<p>It may be a fair price considering their fame and ability, but honestly I can&#39;t afford it at all. In reality, they have not received any bids for months. Unfortunately, I don&#39;t think I will have the opportunity to obtain this person&#39;s works...</p>\n<p>In a world where there are many wealthy individuals and the currency unit appears to be small, it&#39;s easy to lose your sense of scale. <strong>But, 1 ETH is actually quite a large sum of money (even now).</strong></p>\n<p>You don&#39;t have to undervalue yourself too much, but before you worry about not receiving bids, you need to consider whether you have set the price too high.</p>\n<h3 id=\"8-i-dont-have-enough-money\">8. I don&#39;t have enough money</h3>\n<p><strong>This is the reason why I don’t (can’t) buy NFT anymore!!!</strong></p>\n<p>If your work doesn&#39;t sell, it doesn&#39;t necessarily mean that it&#39;s your fault. \n <strong>Even if it&#39;s a low-priced and attractive work, it is not possible to buy it if I don’t have the means to afford it.</strong> </p>\n<p>In addition, I have the tendency to avoid popular people or famous artists.</p>\n<p>&quot;The price is too high&quot; and &quot;I can&#39;t afford it&quot; overlap a little bit, but when I can&#39;t obtain a desired work, I start to think &quot;I am not meant to own this person&#39;s work.&quot; and give up on chasing after it.</p>\n<p>When your favorite artist enters the NFT market, their works might immediately surpass 1 ETH as soon as they debut on FND and continue to stay that way. It is common to not even have the chance to get a bidding stamp.</p>\n<p>At such times, since so many people already highly value and support them, even if I don&#39;t support them, they will surely be alright in the future. I rationalize it in that way. \n (Through fate, I was able to obtain Saito Naoki sensei&#39;s work on Opensea.)</p>\n<p>It is also frustrating to lose in giveaways, so I don’t even take part in them lately.</p>\n<p>(I was so frustrated)</p>\n<p><strong>I don&#39;t want you to misunderstand, because giveaways and bidding stamps are still very effective ways to get recognition for your works and motivate bids.</strong></p>\n<p>I don’t think others would be a frustrated weirdo like me, so please don’t restrict yourself because of what I said and actively try things out freely!</p>\n<p><strong>(2022/12/12 Update) \n Recently, Manifold’s low-cost multiple editions have become popular. I don’t know how long this trend will last, but I think that by reducing the price and making it more accessible to a wider audience, it is possible for those who cannot afford the works previously to have the opportunity to collect and help you gain new fans.</strong> </p>\n<h3 id=\"9-fundamentals-of-that-particularly-nft-is-not-good\">9. Fundamentals of that particularly NFT is not good</h3>\n<p>This is where the main topic begins. I will mainly talk about the shared contract on Opensea.</p>\n<p>Some people may have this mindset about NFT “I don&#39;t really understand it, but if I draw a picture and put it up for sale, it will sell for a high price.” In fact, many also tried the approach of consistently increasing the price of their illustrations (laddering).</p>\n<p>However, as mentioned before, I also think that some values of the token comes from the technicals of the token itself.</p>\n<p><strong>In crypto, good contracts and decentralization are highly valued. \n I would prefer if you would also consider the properties of the token themselves, in addition to improving the quality of your illustrations.</strong></p>\n<p><strong>If you sell digital illustrations, it doesn&#39;t have to be an NFT. \n If you are participating in NFT, I want you to be aware that you are selling NFT, not just pictures.</strong></p>\n<p>I am not demanding you to do something advanced like using your own contract &amp; IPFS. But you should consider doing something simple like <strong>freezing the metadata</strong> when selling on OpenSea.</p>\n<p>In addition to paying the gas fee, I imagine that most people are like &quot;I have never frozen the metadata because I don&#39;t understand what it means.&quot; If you have not made much sales yet, you don&#39;t have to worry about it. There are ways to add value to the collection or to the people who buy it, if you are selling enough and don’t have to worry about the gas fee.</p>\n<p>There are possibilities where a marketplace will go bankrupt or the metadata and image got changed. That is why I feel safe to know that the metadata has been frozen.</p>\n<p><strong>I am happy to know that you are willing to go out of your way to pay the cost and think about the buyer.</strong></p>\n<p>In fact, many of the people I support long-term have already moved to their own contract without being told, and always freeze the metadata when selling.</p>\n<p><strong>(2022/12/12 Update) \n Recently, it has become possible to easily create your own contract using services like Manifold. I don&#39;t think there is much advantage to using Opensea&#39;s shared contract and freezing its metadata anymore.</strong></p>\n<h3 id=\"1-it-seems-unlikely-that-the-creator-will-continue-their-activities-for-a-long-time\">1. It seems unlikely that the creator will continue their activities for a long time.</h3>\n<p>In the past, Foundation was by invitation only. \n When I invite creators to Foundation, there is always a question that I must ask.</p>\n<ul>\n<li><p>Why did you decide to start doing NFT?</p>\n</li>\n<li><p>Please tell me about your goals and final objectives.</p>\n</li>\n</ul>\n<p>&quot;Motivation&quot;, &quot;How much of your life are you betting on NFTs?&quot;, &quot;What do you want to accomplish?&quot;</p>\n<p>It&#39;s like a job interview, but I ask these questions to determine whether they will be able to maintain their activities.</p>\n<p><strong>If they don&#39;t have a lot of enthusiasm and are likely to give up soon, it is difficult for me to support them.</strong></p>\n<p>I have mentioned several times about the importance of nurturing a collection.</p>\n<p><strong>If you stop your activities, your collection will die. \n What most buyers hate the most is when the creator who made the work they bought leaves.</strong></p>\n<p><strong>To keep your collection alive, the thing you can do is to continue creating works. \n It may put pressure on you, but I think this is the responsibility of an NFT creator.</strong></p>\n<p>This will be mentioned again later, there are artists who are determined to fulfill their roadmaps until they die. \n I feel that when I can feel this kind of determination, I can buy with confidence.</p>\n<p>There may be people who read this and think “Does this means NFT is a curse where you must continue to keep creating until you die?” The answer is “No”.</p>\n<p><strong>We cannot curse others, we can only curse ourselves.</strong></p>\n<p>NFT is simply a way to publish your work. \n You can stop at any time, and you can always pick it up again if you want to.</p>\n<p>Even if you decide to give up halfway, you should do what you can to take responsibility within your capabilities. \n By doing so, no one will blame you.</p>\n<p><strong>Creating art that you truly enjoy and coming from the heart is essential for staying active and continuing to produce work over the long term.</strong></p>\n<p>It is hard to manage social media. It is difficult to fit in with the community. If I create art to match trends and demand then I won&#39;t be able to draw what I want to draw. Even though other creators around me are successful, my works don&#39;t sell… \n Some creators left for these reasons and gradually became forgotten.</p>\n<p>There may be a survival bias that makes everyone feel like they will become successful, but not everyone who works hard will be rewarded.</p>\n<p><strong>It may sound harsh, but even if it&#39;s tough, I hope that creators will continue to keep running forward for themselves, and for the people who have supported them. This is the message I wanted to convey the most.</strong></p>\n<blockquote>\n<p><strong>&quot;Now, here, you see, \n it takes all the running you can do, to keep in the same place.&quot; \n Carroll, Lewis. 1872. Through the Looking Glass and What Alice Found There.</strong></p>\n</blockquote>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>Packed with “reasons to buy”, I will introduce a few Japanese creators that I have been supporting for a long time.</p>\n<p><strong>sashimi</strong>👾㌠ (<a href=\"https://twitter.com/ssm_a_u\">https://twitter.com/ssm_a_u</a>)</p>\n<p><a href=\"https://foundation.app/@sashimi_a_u/foundation/104929\">https://foundation.app/@sashimi_a_u/foundation/104929</a></p>\n<p>She is my number one favorite creator. We met when she only had about 700 Twitter followers. It seems she started NFTs after quitting her job and was feeling anxious about the future. At the time, she was struggling to get sales on OpenSea even though her works were priced at 0.03 ETH. She is so popular now that this may seem hard to believe.</p>\n<p><strong>I still remember how she often used to say “I’m so glad to be alive” whenever her works sold.</strong></p>\n<p>Even though I&#39;ve been supporting her since the beginning, I don&#39;t actually have many of sashimi&#39;s works. \n I don’t have the ability to help much, but if I could give a young talented person some hope for living then I am happy about it.</p>\n<ul>\n<li><p><code>High artistic ability</code></p>\n</li>\n<li><p><code>High literacy</code></p>\n</li>\n<li><p><code>Wonderful small details in background</code></p>\n</li>\n<li><p><code>A ghost with the ability to reply to all tweets on Twitter</code></p>\n</li>\n<li><p><code>A unique and excellent sense of color that allows her to be distinguished from others</code></p>\n</li>\n<li><p><code>Works incorporate the aesthetic of Japan that is popular abroad</code></p>\n</li>\n<li><p><code>Growing into the top class among Japanese creators</code></p>\n</li>\n<li><p><code>She seems likely to continue running at the forefront into the future</code></p>\n</li>\n</ul>\n<p><strong>There was no reason not to buy. \n Although she has become out of reach for me now, I still support her.</strong></p>\n<p><strong>Goro Ishihata</strong> (<a href=\"https://twitter.com/goroishihata\">https://twitter.com/goroishihata</a>)</p>\n<p><a href=\"https://opensea.io/assets/matic/0x6c621364993e5cd4c6468930d287ba76ef64f366/178\">https://opensea.io/assets/matic/0x6c621364993e5cd4c6468930d287ba76ef64f366/178</a></p>\n<p>It’s uncle Goro. I knew about him early on, but he wrote on his profile that he borrowed money from a loan shark when he started NFT, <strong>so I thought &#39;Oh, this guy is suspicious...&#39; and ignored him.</strong></p>\n<p>At the time, a large number of items in the main collection were being sold for less than 0.1 ETH, and you could buy as many as you liked. I regret not buying more.</p>\n<p><strong>If I had paid more attention to what he was talking about, I would have realized that he is a real artist.</strong></p>\n<ul>\n<li><p><code>Overflowing intelligence</code></p>\n</li>\n<li><p><code>High literacy</code></p>\n</li>\n<li><p><code>Vibrant community</code></p>\n</li>\n<li><p><code>High-quality pixel art</code></p>\n</li>\n<li><p><code>The speed and consistency of completing one piece of work every day</code></p>\n</li>\n<li><p><code>Motivated by his anger at the world for not recognizing his art</code></p>\n</li>\n<li><p><code>A powerful roadmap where he wants to leave behind the evidence of his existence for the next 2000 days until his death</code></p>\n</li>\n<li><p><code>Has plans to increase the value of his collection, such as weekly airdrops to holders</code></p>\n</li>\n</ul>\n<p>If I were asked to name a person who would be a great loss to mankind by not being recognized in the world of art, first would be a bearded man who dropped out of art school, and the other would be GORO.</p>\n<p><strong>As someone who is the same as GORO, I want to witness GORO&#39;s existence. \n SELL BTC BUY GORO!! \n POW!!!!!</strong></p>\n<p><strong>FuChiMi/ふちみ</strong>🍊(<a href=\"https://twitter.com/FuChiMi27\">https://twitter.com/FuChiMi27</a>)</p>\n<p><a href=\"https://foundation.app/@FuChiMi27/SchemeAlias/3\">https://foundation.app/@FuChiMi27/SchemeAlias/3</a></p>\n<p>A person who is developing multiple collections with completely different art styles, such as cute pixel arts, surrealistic SD characters, illustration of tall figures with a dark and Gothic atmosphere.</p>\n<p>What is surprising is that the works in all of those collections have very high quality. \n Perhaps because of their slow pace of production, their number of followers is small and their works are overwhelmingly undervalued.</p>\n<ul>\n<li><p><code>Has both cuteness and coolness types of art styles</code></p>\n</li>\n<li><p><code>High literacy</code></p>\n</li>\n<li><p><code>Seems to be popular with women</code></p>\n</li>\n<li><p><code>Thoroughly researching and incorporating new things</code></p>\n</li>\n<li><p><code>Currently undervalued and available at an affordable price</code></p>\n</li>\n<li><p><code>Enjoy creating works so much that they declared &quot;NFT is a hobby&quot;</code></p>\n</li>\n<li><p><code>Their wishlist is “NFT”. They don’t just sell, but also actively purchasing other creators&#39; works</code></p>\n</li>\n</ul>\n<p><strong>Because FuChiMi thinks about their buyers and enjoys their activities, I am confident that they will continue for the long term so I bought their works. \n Because the price is low relative to the quality, I always end up buying whenever there is a new release.</strong></p>\n<hr>\n<p><em>If you find submirror valuable, please consider donate to wong2.eth to help cover server cost.</em></p>\n","content:encodedSnippet":"Original: あなたのNFTを買わない理由\nFirstly,\nHello!\nRecently, there has been an increase in the number of people writing articles on the topics of \"Why do I buy NFT\" and \"If you do this then your art will sell\".\nIt might be a rehash, but I sometimes buy NFTs as a hobby, so I want to write about the thoughts I usually have.\nSince it would be boring to write about the same theme as everyone else, I have decided to write about \"Reasons not to buy NFT”.\nI wrote a lot, but the most important points I wanted to convey are in paragraphs 9 and 10. It's okay if you skip the rest.\nSince the title is negative, I tried to be careful not to make the content too negative.\nI am assuming that creators will read this, but please do not take it too seriously since I am not a collector.\nThis is mainly about 1/1 artworks by individual anime creators that I have bought.\nReasons why I buy NFT\nBut let's first discuss the reasons for buying. If a work does not meet these conditions, then it would not be something that I want to buy!\n\"Why would you pay so much for a simple JPG image?\"\nThis is a question that has been asked many times, and the answer will vary depending on the person.\nWhat I am looking for is a “Contributor certificate” type of token.\nI think of it as a fan club membership card.\nProof of my consistent support for the people I want to support.\nI would be happy if the design on the certificate is to my liking.\nIt would be even better if the value of the tokens I own increases in the future if the artist gets recognition by others.\nIt's not exactly the same, but I think the interpretation of \"tipping my favorite artist\" is close.\nThe work should reflect the emotions and experiences that the creator has accumulated up until now.\nWhat I am purchasing is not just a simple JPG image, but a part of the creator's life. I cannot become a fan of a person unless I understand their characteristics, thoughts, and background.\nI support people who I want to become a fan of.\nI enjoy watching the creator’s growth.\nI want to gain some profit when the value of the work increases.\nI need to consider whether I can continue to support them over the long term. Isn't this an important point not only for me but also for many buyers?\n\nI have discussed the reasons for buying, so let's move on to the main topic of the reasons for not buying.\nReasons why I don't buy an NFT\n1. I do not like the design, art style, or idea\nI'm sorry for suddenly saying this, but there's really nothing I can do about it. It's just an example.\nI'm an otaku, so I primarily buy NFTs of girl illustrations.\n\"Hey! Look at my work!\"\nIf I suddenly receive a DM like this for a modern art-style abstract painting that looks like paint splattered on the wall, I will not even try to understand the artist's character because I am simply not interested in that art style, no matter how good it is.\nThe contents within a wallet reflect a person's ideology. Naturally, you wouldn't want to purchase something designed with incompatible ideas.\nMy wallet only has girls' illustrations, POAP and OAT achievement badges, and FND bid stamps.\nJust by looking at it, you can tell that I am an otaku with a hobby of collecting achievements.\nThere is no need to flatter the buyer, but you need to consider what kind of audience you want your work to reach.\nEven if there’s other reasons not to buy the work, I will still buy or bid on it if I like the illustration.\nIn the end, I think the biggest factor is whether an artwork fits my taste or not.\n2. Lack of social media skills\nI mainly look for artworks to buy on Twitter. While doing that, I often see accounts that have high-quality artworks listed but do not tweet about them at all. Meanwhile, some Twitter accounts only RT and never tweeted at all.\nI don't know what the person is like, and it seems difficult for them to attract fans. Moreover, they might be AI generated or plagiarized.\nIn that case, even if the painting is to my liking, it is difficult for me to buy.\nAs I mentioned earlier, it is important for me whether the person is someone I want to support. That is why I want to see words from the person themselves to convey their personality and ideas.\nIf you think \"I really want to retweet other people's wonderful works no matter what!\", then just adding a single comment will improve your impression.\nFurthermore, there are scammers who steal artwork from others and sell it as NFTs. If you don't tweet at all, I might be wary that you could be one of them.\nI'm not saying that you need to tweet about everything all the time. I understand the feeling of those who would say \"I want to get better at drawing so I don't want to be on Twitter all the time.\" I also don't tweet at all because I don't have anything to talk about, and I don't want to become influential.\nYou don't have to push yourself to do things you're not comfortable with or don't want to do.\nOne of the great things about NFT is that it allows for freedom of self-expression. If the activity becomes unpleasant because you have to both create artworks and engage in social networking, then it would be a shame.\nAlthough, it's important to remember that people are looking at more than just the quality of your works.\nIf using Twitter doesn't cause you any discomfort, then I recommend being active on the platform. You can share a variety of content, even if it doesn't relate to your artwork or NFT.\nPeople who are well-liked tend to have more opportunities for their work to be seen and recognized.\n3. Incorrect business practices\nI only bid on FND when I feel like it, and I don't have many followers or financial power. Even so, I frequently receive promotional DMs from people I haven't interacted with at all.\n\"Hey brother, look at my work\"\n\"I'm struggling because I can't sell it, please buy it!\"\n\"I saw your collection, you will definitely like my work!\" (← Why!?)\n\"Link has been sent\" \"Link has been sent\" \"Link has been sent\"\n\nI'm sure that big collectors receive a staggering number of spam emails that far surpasses the amount I receive. Promotional DM and replies to tweets saying \"I will buy NFT\" do not leave a good impression. \n(Of course, there may be some collectors who interpret this as “you are doing your best to promote yourself.”)\nHowever, I enjoy searching for works that match my taste, so I would be happy if you could let me find them myself. I think there are other people who also enjoy serendipitous discovery like me.\nMost promotional DMs are from overseas, but it is impossible to distinguish between them and scams, so I have decided not to open promotional DMs in general.\nWhile there are some people who do purchase works from \"Shill your NFT, I will buy\" tweets, the vast majority don't. These tweets are mainly used as an engagement farm to get more followers and tweet engagement.\nIt feels like you're bringing down the value of your own brand when you engage in this kind of behavior.\n(It would be nice if you can identify people who would actually buy your work,  but it will probably be difficult.)\nThese methods do not result in purchases despite the effort, so I suggest considering other approaches.\nI often see creators becoming friends with each other. I think it’s wonderful to see them sharing their works and supporting each other. I have seen opinions that dislike the culture of forced praise, so it's okay if you only praise the works or creators that you truly think are good.\nHumans are creatures that are attracted to things that other people desire.\nPushing or begging for sales gives the impression that no one wants this person's work.\n4. Unorganized collections\nI enjoy NFT as a game that nurtures individual creators (I apologize for the pompous expression). I enjoy watching the people I support gaining popularity and recognition from many others.\nSo, what kind of game is NFT for creators? It's a game to nurture your collections. While that might not be the truth, that is how I see it.\nIt is not just about minting and increasing the number of works. It is also about cultivating the collection by building up the floor price, the number of owners, and sales volume. If you do well, it shows that you are working hard in areas other than illustration.\nGiveaway or bidding stamps are in the same collection as works for sale.\nWorks with completely different styles are mixed together.\nWorks on different chains like Polygon and ETH, or works with different primary sale prices are randomly mixed together.\nIn these situations, giveaways and low-priced works will drag down the floor price and have a negative impact on the future of the collection. You should create another collection and move those pieces there!\nThe floor price itself is an illusion, but it never hurts to look good.\nIf you lined up two products side by side, everyone would prefer to buy a product with a good appearance over one with a bad appearance, even if both products are of the same quality.\n5. Low literacy\nThere may be some people who have been actively investing for a long time. But NFT is most likely the first exposure to virtual currency and crypto assets for many creators. It is impossible to have a high level of education or familiarity with these concepts right from the start, so there is no need to feel ashamed.\nHowever, if you are hacked or your seed phrase is leaked, not only will your ETH be stolen, but your carefully nurtured collection will also lose value. This can cause harm to the people who have purchased your works.\nIn fact, I myself have experienced the case where the creator's wallet was hacked immediately after purchase. The person tweeted “I was hacked” and that was the end of it.\nThere is no doubt that the person who got hacked is the one who suffered the most financially and mentally.\nHowever, I think it is irresponsible to sell a work and not care about what happens afterwards. Of course, it is essential to take precautions to avoid being hacked, but it's also important to have a plan in place if you do become a victim.\n(I am not saying that you should return the money, but I think you should announce that you will remint the same work on a new wallet for the holders, or that you will not resell the same work again, etc.)\nBe cautious of DMs from strangers\nDon't click on suspicious links\nDon't open file attachments\nDon't share your seed phrase or input it anywhere\nDouble-check to make sure that a site is not a scam before connecting your wallet and signing or approving transactions.\nIt's essential to be vigilant about these things. If people think \"This person seems likely to be scammed one day,\" it will be difficult for them to buy your work.\nIt may be inconvenient, but if you are unsure and feel even slightly suspicious, I recommend consulting with someone who is more familiar with the market.\n6. Missing description\nThis happens quite often.\nThe description is not just an explanation, it is a part of the work.\nOn Foundation, it is displayed to the left of the Provenance section, a position that is easy to see.\nPlease do not leave the description blank. If you think that \"I am confident that the appeal of my artwork is sufficient.\" then it is fine to not write anything…but It is still preferable to write, and write it in English so that it can be understood overseas. If you absolutely want to write it in your local language, it is okay to include it alongside the English version.\nI am not saying you should write a long essay.\nEven just a single sentence or word can captivate the audience if it allows them to feel your work.\nAmong the descriptions I have seen recently, the one by binzoko (https://twitter.com/Binzoko_NFT) was really great, so I would like to show it to you.\n\nhttps://foundation.app/@binzoko_paroma/suisai/2\n7. Reserve price is too high\nThis is very common among professional illustrators.\nI won't mention their name because this is a negative topic, but there is an illustrator I have loved since before they started NFT. The person has a reserve price of more than 2 ETH for their works.\nIt may be a fair price considering their fame and ability, but honestly I can't afford it at all. In reality, they have not received any bids for months. Unfortunately, I don't think I will have the opportunity to obtain this person's works...\nIn a world where there are many wealthy individuals and the currency unit appears to be small, it's easy to lose your sense of scale. But, 1 ETH is actually quite a large sum of money (even now).\nYou don't have to undervalue yourself too much, but before you worry about not receiving bids, you need to consider whether you have set the price too high.\n8. I don't have enough money\nThis is the reason why I don’t (can’t) buy NFT anymore!!!\nIf your work doesn't sell, it doesn't necessarily mean that it's your fault. \n Even if it's a low-priced and attractive work, it is not possible to buy it if I don’t have the means to afford it. \nIn addition, I have the tendency to avoid popular people or famous artists.\n\"The price is too high\" and \"I can't afford it\" overlap a little bit, but when I can't obtain a desired work, I start to think \"I am not meant to own this person's work.\" and give up on chasing after it.\nWhen your favorite artist enters the NFT market, their works might immediately surpass 1 ETH as soon as they debut on FND and continue to stay that way. It is common to not even have the chance to get a bidding stamp.\nAt such times, since so many people already highly value and support them, even if I don't support them, they will surely be alright in the future. I rationalize it in that way. \n (Through fate, I was able to obtain Saito Naoki sensei's work on Opensea.)\nIt is also frustrating to lose in giveaways, so I don’t even take part in them lately.\n(I was so frustrated)\nI don't want you to misunderstand, because giveaways and bidding stamps are still very effective ways to get recognition for your works and motivate bids.\nI don’t think others would be a frustrated weirdo like me, so please don’t restrict yourself because of what I said and actively try things out freely!\n(2022/12/12 Update) \n Recently, Manifold’s low-cost multiple editions have become popular. I don’t know how long this trend will last, but I think that by reducing the price and making it more accessible to a wider audience, it is possible for those who cannot afford the works previously to have the opportunity to collect and help you gain new fans. \n9. Fundamentals of that particularly NFT is not good\nThis is where the main topic begins. I will mainly talk about the shared contract on Opensea.\nSome people may have this mindset about NFT “I don't really understand it, but if I draw a picture and put it up for sale, it will sell for a high price.” In fact, many also tried the approach of consistently increasing the price of their illustrations (laddering).\nHowever, as mentioned before, I also think that some values of the token comes from the technicals of the token itself.\nIn crypto, good contracts and decentralization are highly valued. \n I would prefer if you would also consider the properties of the token themselves, in addition to improving the quality of your illustrations.\nIf you sell digital illustrations, it doesn't have to be an NFT. \n If you are participating in NFT, I want you to be aware that you are selling NFT, not just pictures.\nI am not demanding you to do something advanced like using your own contract & IPFS. But you should consider doing something simple like freezing the metadata when selling on OpenSea.\nIn addition to paying the gas fee, I imagine that most people are like \"I have never frozen the metadata because I don't understand what it means.\" If you have not made much sales yet, you don't have to worry about it. There are ways to add value to the collection or to the people who buy it, if you are selling enough and don’t have to worry about the gas fee.\nThere are possibilities where a marketplace will go bankrupt or the metadata and image got changed. That is why I feel safe to know that the metadata has been frozen.\nI am happy to know that you are willing to go out of your way to pay the cost and think about the buyer.\nIn fact, many of the people I support long-term have already moved to their own contract without being told, and always freeze the metadata when selling.\n(2022/12/12 Update) \n Recently, it has become possible to easily create your own contract using services like Manifold. I don't think there is much advantage to using Opensea's shared contract and freezing its metadata anymore.\n1. It seems unlikely that the creator will continue their activities for a long time.\nIn the past, Foundation was by invitation only. \n When I invite creators to Foundation, there is always a question that I must ask.\nWhy did you decide to start doing NFT?\nPlease tell me about your goals and final objectives.\n\"Motivation\", \"How much of your life are you betting on NFTs?\", \"What do you want to accomplish?\"\nIt's like a job interview, but I ask these questions to determine whether they will be able to maintain their activities.\nIf they don't have a lot of enthusiasm and are likely to give up soon, it is difficult for me to support them.\nI have mentioned several times about the importance of nurturing a collection.\nIf you stop your activities, your collection will die. \n What most buyers hate the most is when the creator who made the work they bought leaves.\nTo keep your collection alive, the thing you can do is to continue creating works. \n It may put pressure on you, but I think this is the responsibility of an NFT creator.\nThis will be mentioned again later, there are artists who are determined to fulfill their roadmaps until they die. \n I feel that when I can feel this kind of determination, I can buy with confidence.\nThere may be people who read this and think “Does this means NFT is a curse where you must continue to keep creating until you die?” The answer is “No”.\nWe cannot curse others, we can only curse ourselves.\nNFT is simply a way to publish your work. \n You can stop at any time, and you can always pick it up again if you want to.\nEven if you decide to give up halfway, you should do what you can to take responsibility within your capabilities. \n By doing so, no one will blame you.\nCreating art that you truly enjoy and coming from the heart is essential for staying active and continuing to produce work over the long term.\nIt is hard to manage social media. It is difficult to fit in with the community. If I create art to match trends and demand then I won't be able to draw what I want to draw. Even though other creators around me are successful, my works don't sell… \n Some creators left for these reasons and gradually became forgotten.\nThere may be a survival bias that makes everyone feel like they will become successful, but not everyone who works hard will be rewarded.\nIt may sound harsh, but even if it's tough, I hope that creators will continue to keep running forward for themselves, and for the people who have supported them. This is the message I wanted to convey the most.\n\"Now, here, you see, \n it takes all the running you can do, to keep in the same place.\" \n Carroll, Lewis. 1872. Through the Looking Glass and What Alice Found There.\nConclusion\nPacked with “reasons to buy”, I will introduce a few Japanese creators that I have been supporting for a long time.\nsashimi👾㌠ (https://twitter.com/ssm_a_u)\nhttps://foundation.app/@sashimi_a_u/foundation/104929\nShe is my number one favorite creator. We met when she only had about 700 Twitter followers. It seems she started NFTs after quitting her job and was feeling anxious about the future. At the time, she was struggling to get sales on OpenSea even though her works were priced at 0.03 ETH. She is so popular now that this may seem hard to believe.\nI still remember how she often used to say “I’m so glad to be alive” whenever her works sold.\nEven though I've been supporting her since the beginning, I don't actually have many of sashimi's works. \n I don’t have the ability to help much, but if I could give a young talented person some hope for living then I am happy about it.\nHigh artistic ability\nHigh literacy\nWonderful small details in background\nA ghost with the ability to reply to all tweets on Twitter\nA unique and excellent sense of color that allows her to be distinguished from others\nWorks incorporate the aesthetic of Japan that is popular abroad\nGrowing into the top class among Japanese creators\nShe seems likely to continue running at the forefront into the future\nThere was no reason not to buy. \n Although she has become out of reach for me now, I still support her.\nGoro Ishihata (https://twitter.com/goroishihata)\nhttps://opensea.io/assets/matic/0x6c621364993e5cd4c6468930d287ba76ef64f366/178\nIt’s uncle Goro. I knew about him early on, but he wrote on his profile that he borrowed money from a loan shark when he started NFT, so I thought 'Oh, this guy is suspicious...' and ignored him.\nAt the time, a large number of items in the main collection were being sold for less than 0.1 ETH, and you could buy as many as you liked. I regret not buying more.\nIf I had paid more attention to what he was talking about, I would have realized that he is a real artist.\nOverflowing intelligence\nHigh literacy\nVibrant community\nHigh-quality pixel art\nThe speed and consistency of completing one piece of work every day\nMotivated by his anger at the world for not recognizing his art\nA powerful roadmap where he wants to leave behind the evidence of his existence for the next 2000 days until his death\nHas plans to increase the value of his collection, such as weekly airdrops to holders\nIf I were asked to name a person who would be a great loss to mankind by not being recognized in the world of art, first would be a bearded man who dropped out of art school, and the other would be GORO.\nAs someone who is the same as GORO, I want to witness GORO's existence. \n SELL BTC BUY GORO!! \n POW!!!!!\nFuChiMi/ふちみ🍊(https://twitter.com/FuChiMi27)\nhttps://foundation.app/@FuChiMi27/SchemeAlias/3\nA person who is developing multiple collections with completely different art styles, such as cute pixel arts, surrealistic SD characters, illustration of tall figures with a dark and Gothic atmosphere.\nWhat is surprising is that the works in all of those collections have very high quality. \n Perhaps because of their slow pace of production, their number of followers is small and their works are overwhelmingly undervalued.\nHas both cuteness and coolness types of art styles\nHigh literacy\nSeems to be popular with women\nThoroughly researching and incorporating new things\nCurrently undervalued and available at an affordable price\nEnjoy creating works so much that they declared \"NFT is a hobby\"\nTheir wishlist is “NFT”. They don’t just sell, but also actively purchasing other creators' works\nBecause FuChiMi thinks about their buyers and enjoys their activities, I am confident that they will continue for the long term so I bought their works. \n Because the price is low relative to the quality, I always end up buying whenever there is a new release.\nIf you find submirror valuable, please consider donate to wong2.eth to help cover server cost.","guid":"https://mirror.xyz/shinjurou.eth/yTB5r8TOE8PfAGCflxNmV2jkzjXceqGKzM8fmAlbvZQ","isoDate":"2022-12-14T20:00:53.000Z","from":"http://submirror.xyz/shinjurou.eth","hashId":"7e448dbaf93b89bc41282dd5f65b6596"}]