[{"title":"\n先知DEFI交互作业12.16【干货/空投】第325天","link":"https://mirror.xyz/seerlabs.eth/wFzrzbaSv7OgFdHrhHXaqxw_VlMtY3AC8ypUQxrhMDs","pubDate":"Fri, 16 Dec 2022 14:57:33 GMT","content:encoded":"<p>先知每日作业 12.16 \n 进群添加微信号：blockhz 审核 \n 加入先知电报组获取更多信息：<a href=\"https://t.me/seerlabs666\">https://t.me/seerlabs666</a> \n Discord链接：<a href=\"http://discord.gg/Rv2vn3nn7j\">discord.gg/Rv2vn3nn7j</a></p>\n<p>1、White Whale开源的套利机器人，刚看了下是前端代码\n<a href=\"https://twitter.com/WhiteWhaleDefi/status/1603048957839491073\">https://twitter.com/WhiteWhaleDefi/status/1603048957839491073</a></p>\n<p>2、蓝精灵的nft，需要lens，推和dc;   <a href=\"https://app.thesmurfssociety.com/\">https://app.thesmurfssociety.com/</a></p>\n<p>3、a16z 对2023年行业的几点看法 推荐阅读\n<a href=\"https://www.chaincatcher.com/article/2084678\">https://www.chaincatcher.com/article/2084678</a></p>\n<p>4、OP的NFT  只有在RetropGF第二轮投票的人才有资格mint  1月份开放mint  SBT形式   未来权重可想而知      <a href=\"https://twitter.com/optimismFND/status/1603437456547790848?s=19\">https://twitter.com/optimismFND/status/1603437456547790848?s=19</a></p>\n<p>5、op 又有个新投票\n<a href=\"https://snapshot.org/#/opcollective.eth/proposal/0x22d4c3ab56832de58c1774d1a0aeb61ba6dde8b16c0f8382f85d8935f3ee1f11\">https://snapshot.org/#/opcollective.eth/proposal/0x22d4c3ab56832de58c1774d1a0aeb61ba6dde8b16c0f8382f85d8935f3ee1f11</a></p>\n<p>6、领取护照  <a href=\"https://galxe.com/EthSign/campaign/GCXThUw42T\">https://galxe.com/EthSign/campaign/GCXThUw42T</a></p>\n<p>7、【撸币养家】一鱼多吃  | 最新版本教程 | Aztec隐私公链获得A16领投1 亿美元B 轮融资 ，zkmoney 是Aztec隐私公链的Defi 聚合器\n<a href=\"https://twitter.com/lubi1666/status/1603647598824300545?s=46&amp;t=fFQlC3zUzjUHjbtienIhGw\">https://twitter.com/lubi1666/status/1603647598824300545?s=46&amp;t=fFQlC3zUzjUHjbtienIhGw</a></p>\n<p>8、<a href=\"https://science.flipsidecrypto.xyz/optimist/\">https://science.flipsidecrypto.xyz/optimist/</a></p>\n<p>9、<a href=\"https://mobile.twitter.com/ufo__club/status/1603681023115395072\">https://mobile.twitter.com/ufo__club/status/1603681023115395072</a></p>\n<p>10、<a href=\"https://galxe.com/Galxe/campaign/GCCa9UwEVW\">https://galxe.com/Galxe/campaign/GCCa9UwEVW</a></p>\n<h2 id=\"11、cc今晚的zklink会议-httpsdiscordcominviteeryhg9pkna\">11、cc今晚的zklink会议 <a href=\"https://discord.com/invite/erYHG9PKna\">https://discord.com/invite/erYHG9PKna</a></h2>\n<p><em>If you find submirror valuable, please consider donate to wong2.eth to help cover server cost.</em></p>\n","content:encodedSnippet":"先知每日作业 12.16 \n 进群添加微信号：blockhz 审核 \n 加入先知电报组获取更多信息：https://t.me/seerlabs666 \n Discord链接：discord.gg/Rv2vn3nn7j\n1、White Whale开源的套利机器人，刚看了下是前端代码\nhttps://twitter.com/WhiteWhaleDefi/status/1603048957839491073\n2、蓝精灵的nft，需要lens，推和dc;   https://app.thesmurfssociety.com/\n3、a16z 对2023年行业的几点看法 推荐阅读\nhttps://www.chaincatcher.com/article/2084678\n4、OP的NFT  只有在RetropGF第二轮投票的人才有资格mint  1月份开放mint  SBT形式   未来权重可想而知      https://twitter.com/optimismFND/status/1603437456547790848?s=19\n5、op 又有个新投票\nhttps://snapshot.org/#/opcollective.eth/proposal/0x22d4c3ab56832de58c1774d1a0aeb61ba6dde8b16c0f8382f85d8935f3ee1f11\n6、领取护照  https://galxe.com/EthSign/campaign/GCXThUw42T\n7、【撸币养家】一鱼多吃  | 最新版本教程 | Aztec隐私公链获得A16领投1 亿美元B 轮融资 ，zkmoney 是Aztec隐私公链的Defi 聚合器\nhttps://twitter.com/lubi1666/status/1603647598824300545?s=46&t=fFQlC3zUzjUHjbtienIhGw\n8、https://science.flipsidecrypto.xyz/optimist/\n9、https://mobile.twitter.com/ufo__club/status/1603681023115395072\n10、https://galxe.com/Galxe/campaign/GCCa9UwEVW\n11、cc今晚的zklink会议 https://discord.com/invite/erYHG9PKna\nIf you find submirror valuable, please consider donate to wong2.eth to help cover server cost.","guid":"https://mirror.xyz/seerlabs.eth/wFzrzbaSv7OgFdHrhHXaqxw_VlMtY3AC8ypUQxrhMDs","isoDate":"2022-12-16T14:57:33.000Z","from":"https://submirror.xyz/seerlabs.eth","hashId":"6a57201fb3a6edbdb974551d6d2acb4b"},{"title":"The MEV Supply Chain","link":"https://mirror.xyz/0x8BE2355417EF645f3A3739DD1B8aBd38C563c595/qi4wLhqsKUbLI1y0pbvxf7Bh9l86K8lCsMyNZMf6UOQ","pubDate":"Fri, 16 Dec 2022 15:08:37 GMT","content:encoded":"<p><img src=\"https://images.mirror-media.xyz/publication-images/fpiOd2wu2wAfCrKIgeY_F.webp?height=916&width=1420\" alt=\"\"></p>\n<p>MEV as a topic has had a decently large following in crypto since last year when it really started to come out of the dark; however, of course, MEV has been around for a lot longer than that. There is its long history in crypto, but also, as an abstracted concept, its much longer history in traditional finance. Given that history, the intellectually stimulating discussions around MEV, and the alluring monetary rewards, there have been several thoughtful research papers, posts, podcasts, and threads authored on the subject. I have found repositories like <a href=\"https://github.com/0xemperor/Awesome-MEV\">these</a> helpful in aggregating such reading material. Now with all this out there, why should I offer a written piece as well? After all, it would be inefficient to summarize one of those arguments when the authors in this space tend to have a solid grasp of the subject and some impressive qualifications. That being said, I’d like to talk about MEV as it is seen from a supply chain analysis standpoint, hopefully offering something more unique than the average MEV piece. I believe that understanding MEV through this lens unlocks some interesting future scenarios and key questions, which as an investor in the space, can be valuable to constructing theses.</p>\n<h2 id=\"supply-chains-and-thesis-construction\">Supply Chains and Thesis Construction</h2>\n<p>At a very high level, one can construct a thesis using a bottoms-up or top-down framework. These are not mutually exclusive. In fact, it is nice when both make sense: the best company with solid idiosyncratic strengths operating in an appealing, high growth, rich TAM sector. As it pertains to this post, supply chain (or value chain) analysis would fall in the top-down thesis category.</p>\n<p>When building theses, I’ve found that looking at the different parts of a supply chain can provide some clues as to which sectors in the chain are value saps and which are commoditized. If the value saps possess means of defensibility / moat building, then this can be a very attractive area to look for investment opportunities. One of the easiest clues is concentration among the steps of a supply chain — which regions have several providers, which only have a couple? Taking this further, it is not just the analysis of the interlinked sectors that is valuable, but it is also the analysis of how these sectors interact. Interactions alongside stand-still qualities will drive the long-term evolution of the supply chain. What are the pricing arrangements? How does information and value flow? A lot can be gleamed from answering these types of questions.</p>\n<p>When I think about MEV, I think about a supply chain. From transaction origination to transaction inclusion in the block, there are several parties that play a role in the journey of a transaction. Thinking through each of these players and how they interact with each other can lead to some interesting observations.</p>\n<h2 id=\"the-mev-supply-chain\">The MEV Supply Chain</h2>\n<p>Using a diagram from a Flashbots MEV-boost post, let’s walk through each of the players within a supply chain:</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/Imfih-LxFONIinKloe9BY.webp?height=290&width=936\" alt=\"\"></p>\n<ul>\n<li><p>User — the individual or entity which does something on-chain that is represented through a transaction</p>\n</li>\n<li><p>Wallet / CEX — often the first touch point of the transaction the user emits as they attempt to do something on-chain</p>\n</li>\n<li><p>dApp / smart contracts — many times, the protocol the user is trying to do something with. The transaction may be interacting with an element of the protocol (i.e., liquidity or lending pool)</p>\n</li>\n<li><p>Relay — the piping for transaction flow. These can deliver a transaction from a source to a builder, a searcher to a builder, a design from a builder to a proposer, etc.</p>\n</li>\n<li><p>Searcher — typically a bot (developed by an individual or entity) that takes transactions it has access to and bundles them up with some of their own transactions to capture a profit (frontrun, sandwich attack, liquidation, etc.)</p>\n</li>\n<li><p>Block builder — *post ETH 2.0*, this entity takes a bunch of transactions and/or bundles and, using algorithms, designs a block that is then submitted to a validator (note PBS will be introducing some pertinent changes to how this role interacts with a validator)</p>\n</li>\n<li><p>Validator (or proposer) — this used to be the miner pre-ETH 2.0. An entity or user that stakes 32 ETH and runs client software which gives it a slot to add a block to the chain (economically incentivized to act accordingly via their stake)</p>\n</li>\n</ul>\n<p>At a high level, it might also be interesting to define what drives competitive advantages in each (excluding the user):</p>\n<ul>\n<li><p>Wallet / CEX — user count and integrations propagate aggregator economics, which lends to significant opportunities to add services and/or further control the user experience. In the context of MEV, large wallet providers and exchanges are capable of routing user transaction order flow through their own infrastructure, which could be monetized directly via selling the order flow to block builders / relays or less directly via coming to a sizable revenue split (of MEV profits) with a block builder / relay</p>\n</li>\n<li><p>dApp — usage and control over its infrastructure configure its odds of being able to profit from MEV. To the extent it can control order routing (say via permissions through the frontend), it could, for example, route transactions through its own relays and obtain an MEV profit split with a builder or route transactions via partner infrastructure, which executes MEV operations and returns a share of the profits</p>\n</li>\n<li><p>Relay — the <em>piping</em> benefits significantly to the extent order flow becomes exclusive. Additionally, there are network effects for relays and builders in the sense that the more transactions successfully go through a relay / builder into a block, the more other transactions are likely to be routed there. This makes the relay / builder more valuable over time and further cements its ability to build the blocks that end up being included on-chain (potential flywheel at play)</p>\n</li>\n<li><p>Searcher — a competitive market, these players benefit from <em>edge</em>, which can arise through tools and infrastructure, access to private transaction sources, and colocation (to increase the speed of receiving transactions and getting bundles through to builders)</p>\n</li>\n<li><p>Block builder — block building algorithms, hardware, and transaction sources come together to define how valuable produced blocks are. Over time, this role could lead to barriers to entry, with sophisticated hardware, evolving algorithms, and exclusive order flow agreements making it hard for new entrants to build as profitable blocks as incumbents. Differentiation in blocks aside from price are to be rendered pretty futile post PBS implementation (censorship, however, is an interesting topic in the meantime here)</p>\n</li>\n<li><p>Validator — in terms of an individual validator, ETH 2.0 has changed the game and made block proposing much more accessible. With PBS (and the current MEV-boost infrastructure), the validator does not need to know much about MEV and can just select the block with the highest bid. Thus, there is little competitive advantage. However, in terms of collective validator organizations / networks, some interesting questions around competition and bargaining power emerge</p>\n</li>\n</ul>\n<h2 id=\"pushing-and-pulling-validators-vs-block-builders\">Pushing and Pulling: Validators vs. Block builders</h2>\n<p>A fascinating part of this MEV supply chain to ponder about is the final link between validator networks and builders. Consolidation on both ends is possible. Barriers to entry, mutual exclusivity, and virtuous cycle mechanics drive it for block builders. Validator share, LSD liquidity / integrations / composability, brand moats, and also some virtuous cycle mechanics drive it for validators.</p>\n<p>Thus, one will see the shifting of bargaining power between these two sectors as consolidation forces evolve over time. Stronger block builders could demand a larger share of the MEV profits from validators and validator networks, reducing staked ETH APY and the Ethereum economy’s <em>native yield</em>. Dominating validator networks would be able to push back and use their validator share to ensure that block builders give them a fair split of the MEV profits. Should they choose not to, they can just accept a block design from another builder (note, PBS could make things a bit different here).</p>\n<p>Similar dynamics have played out in the past, a very relatable one being in the computer stack. Chips and computer hardware providers had certain periods of increased and decreased concentration, however, it was concentration that was more sustained on the chip side, which eventually led to a killer company in Intel and several hardware manufactures losing margin year after year as their bargaining power dwindled. Moreover, Intel even allocated capital to funding open-source hardware development, strategically forcing the commoditization and reduction in bargaining power of its supply chain neighbor.</p>\n<p>Could the space one day see a large validator network use its treasury to support a new block building operation? This could be the case, both in terms of following Intel’s strategy with open source hardware development, but also in terms of backwards integration, which has dynamics of its own. The bottom line here is that both the block builder and validator sectors in the supply chain have some strong characteristics to their names. Operating in a chain where finite MEV can only be split so many ways will most likely lead to forms of strategic conflict and maneuvers on each end. Thus, tracking the drivers of competitive advantage, the relative concentration in each supply chain step, and strategic developments will be imperative for understanding where the value will flow.</p>\n<h2 id=\"upstream-vs-downstream\">Upstream vs. Downstream</h2>\n<p>Zooming out, I’d like to take the 2D supply chain diagram and make it 3D, with some inspiration from a stream descending downwards — this is the MEV supply chain. At its most basic level, MEV starts with user transactions (the source of the stream) and comes to fruition on the blockchain (the ocean). Just like with streams, rivers, and other waterways, diverting the valuable substance upstream carries effects on the quantity and quality of the water downstream.</p>\n<p>Overtime, with MEV becoming better understood and the quantum of it becoming higher and higher (as more value comes on-chain), the space will see more initiatives at the user, protocol, wallet, and L2 levels to either reduce MEV (providing consumer surplus to the user) or capture MEV (as a revenue source for the protocol or serving as kickback to the user). This hasn’t predominantly been the case yet, however, several changes are becoming apparent:</p>\n<ul>\n<li><p>Protocols that partner with users: Over the last 1.5 years we have seen growth in the teams forming and methods being designed to help protocols (and consequently their users) retain more of the MEV profits. Especially last year (different market environment as well as state of infrastructure), so much money was ‘being left on the table’ per se, with users and their apps losing out to bots, MEV operations, and miners. This consumer or producer surplus was not being captured and thus a market opportunity emerged to help protocols capture this. Several projects arose with the goal of building infra that works with protocols to run transactions through private relays, capture some of the MEV, share it with builders, and then route back a portion of the MEV to the protocol (while keeping the remaining amount as a profit). This profit routed back could serve as protocol earnings or user kickbacks. Should this trend continue to proliferate, we would be witnessing the drying up of MEV profits downstream (searchers, relayers / builders, validators), which could lead to very interesting knock-on effects. One thing is clear, however — there is a fair argument that the user could benefit a lot more from progress with this trend</p>\n</li>\n<li><p>L2s: the increasing relevance of L2s as <a href=\"https://dune.com/funnyking/L2-Gas-Consumption\">sources</a> of crypto transactions presents a similar shift to the prior point, with L2 networks being presented with the opportunity to retain more of the MEV profits for either the benefit of their users or their own income. This is not a novel statement — L2 teams have been open about MEV and what they could do with it. There is the FIFO / FCFS approach for decentralized sequencers. This would reduce frontrunning but could lead to spam proliferation as parties such as searchers try to be first or to increases in colocation benefits. There is the verifiable delay function (VDF), which obscures transaction data for a set amount of time, revealing it after being sequenced. And there are concepts like threshold encryption, which hide transaction details from validators. Put together, the three mentioned carry the same effect of : (-) MEV profit, (+) UX / consumer surplus. On another side, there is also the opportunity for other L2s to monetize MEV and use that for public goods funding or their own native staking yields</p>\n</li>\n<li><p>App-chains: In a similar camp to L2s, app-chains represent a drain of MEV profits away from validators and builders; however, it must be specified that these would be away from Ethereum validators and other supply chain participants. An app-chain would have its own validators (and other participants) and local MEV profits would be split among those participants. The app-chain trend becomes important in the case of Ethereum MEV analysis as it represents both a loss of future MEV profits (should a powerful Ethereum app chose to move over to its own chain) as well as a loss of what could have been MEV profits (should an app that would have otherwise been on Ethereum launch on its own chain). Note, this also sparks some interesting discussions around the value of native network tokens (both in the case of ETH and in the case of the one launching the app chain)</p>\n</li>\n</ul>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>There are plenty of other theses to dive into as it pertains to the MEV supply chain (i.e., cross-chain MEV), however, these are still under development (perhaps a topic for a future post). From a first principles basis, MEV is a ‘must’ as a sector to pay attention to. It is integral to the functioning of blockchains, more so fluid than static in terms of evolution, and has the potential to grow in value (in aggregate) as crypto economies scale. With this in mind, the state of its supply chain is something to be cognizant of as it can provide some worthy insights into where some great startups might evolve from.</p>\n<h2 id=\"disclosure-this-blog-series-is-strictly-personal-educational-and-is-not-investment-advice-nor-a-solicitation-to-buy-or-sell-any-assets-it-does-not-represent-any-views-from-where-the-author-is-working--all-views-opinions-and-arguments-are-the-authors-please-always-do-your-own-research\"><em><strong>Disclosure:</strong></em>* This blog series is strictly personal/ educational and is not investment advice nor a solicitation to buy or sell any assets. It does not represent any views from where the author is working — all views, opinions, and arguments are the author’s. Please always do your own research.*</h2>\n<p><em>If you find submirror valuable, please consider donate to wong2.eth to help cover server cost.</em></p>\n","content:encodedSnippet":"MEV as a topic has had a decently large following in crypto since last year when it really started to come out of the dark; however, of course, MEV has been around for a lot longer than that. There is its long history in crypto, but also, as an abstracted concept, its much longer history in traditional finance. Given that history, the intellectually stimulating discussions around MEV, and the alluring monetary rewards, there have been several thoughtful research papers, posts, podcasts, and threads authored on the subject. I have found repositories like these helpful in aggregating such reading material. Now with all this out there, why should I offer a written piece as well? After all, it would be inefficient to summarize one of those arguments when the authors in this space tend to have a solid grasp of the subject and some impressive qualifications. That being said, I’d like to talk about MEV as it is seen from a supply chain analysis standpoint, hopefully offering something more unique than the average MEV piece. I believe that understanding MEV through this lens unlocks some interesting future scenarios and key questions, which as an investor in the space, can be valuable to constructing theses.\nSupply Chains and Thesis Construction\nAt a very high level, one can construct a thesis using a bottoms-up or top-down framework. These are not mutually exclusive. In fact, it is nice when both make sense: the best company with solid idiosyncratic strengths operating in an appealing, high growth, rich TAM sector. As it pertains to this post, supply chain (or value chain) analysis would fall in the top-down thesis category.\nWhen building theses, I’ve found that looking at the different parts of a supply chain can provide some clues as to which sectors in the chain are value saps and which are commoditized. If the value saps possess means of defensibility / moat building, then this can be a very attractive area to look for investment opportunities. One of the easiest clues is concentration among the steps of a supply chain — which regions have several providers, which only have a couple? Taking this further, it is not just the analysis of the interlinked sectors that is valuable, but it is also the analysis of how these sectors interact. Interactions alongside stand-still qualities will drive the long-term evolution of the supply chain. What are the pricing arrangements? How does information and value flow? A lot can be gleamed from answering these types of questions.\nWhen I think about MEV, I think about a supply chain. From transaction origination to transaction inclusion in the block, there are several parties that play a role in the journey of a transaction. Thinking through each of these players and how they interact with each other can lead to some interesting observations.\nThe MEV Supply Chain\nUsing a diagram from a Flashbots MEV-boost post, let’s walk through each of the players within a supply chain:\n\nUser — the individual or entity which does something on-chain that is represented through a transaction\nWallet / CEX — often the first touch point of the transaction the user emits as they attempt to do something on-chain\ndApp / smart contracts — many times, the protocol the user is trying to do something with. The transaction may be interacting with an element of the protocol (i.e., liquidity or lending pool)\nRelay — the piping for transaction flow. These can deliver a transaction from a source to a builder, a searcher to a builder, a design from a builder to a proposer, etc.\nSearcher — typically a bot (developed by an individual or entity) that takes transactions it has access to and bundles them up with some of their own transactions to capture a profit (frontrun, sandwich attack, liquidation, etc.)\nBlock builder — *post ETH 2.0*, this entity takes a bunch of transactions and/or bundles and, using algorithms, designs a block that is then submitted to a validator (note PBS will be introducing some pertinent changes to how this role interacts with a validator)\nValidator (or proposer) — this used to be the miner pre-ETH 2.0. An entity or user that stakes 32 ETH and runs client software which gives it a slot to add a block to the chain (economically incentivized to act accordingly via their stake)\nAt a high level, it might also be interesting to define what drives competitive advantages in each (excluding the user):\nWallet / CEX — user count and integrations propagate aggregator economics, which lends to significant opportunities to add services and/or further control the user experience. In the context of MEV, large wallet providers and exchanges are capable of routing user transaction order flow through their own infrastructure, which could be monetized directly via selling the order flow to block builders / relays or less directly via coming to a sizable revenue split (of MEV profits) with a block builder / relay\ndApp — usage and control over its infrastructure configure its odds of being able to profit from MEV. To the extent it can control order routing (say via permissions through the frontend), it could, for example, route transactions through its own relays and obtain an MEV profit split with a builder or route transactions via partner infrastructure, which executes MEV operations and returns a share of the profits\nRelay — the piping benefits significantly to the extent order flow becomes exclusive. Additionally, there are network effects for relays and builders in the sense that the more transactions successfully go through a relay / builder into a block, the more other transactions are likely to be routed there. This makes the relay / builder more valuable over time and further cements its ability to build the blocks that end up being included on-chain (potential flywheel at play)\nSearcher — a competitive market, these players benefit from edge, which can arise through tools and infrastructure, access to private transaction sources, and colocation (to increase the speed of receiving transactions and getting bundles through to builders)\nBlock builder — block building algorithms, hardware, and transaction sources come together to define how valuable produced blocks are. Over time, this role could lead to barriers to entry, with sophisticated hardware, evolving algorithms, and exclusive order flow agreements making it hard for new entrants to build as profitable blocks as incumbents. Differentiation in blocks aside from price are to be rendered pretty futile post PBS implementation (censorship, however, is an interesting topic in the meantime here)\nValidator — in terms of an individual validator, ETH 2.0 has changed the game and made block proposing much more accessible. With PBS (and the current MEV-boost infrastructure), the validator does not need to know much about MEV and can just select the block with the highest bid. Thus, there is little competitive advantage. However, in terms of collective validator organizations / networks, some interesting questions around competition and bargaining power emerge\nPushing and Pulling: Validators vs. Block builders\nA fascinating part of this MEV supply chain to ponder about is the final link between validator networks and builders. Consolidation on both ends is possible. Barriers to entry, mutual exclusivity, and virtuous cycle mechanics drive it for block builders. Validator share, LSD liquidity / integrations / composability, brand moats, and also some virtuous cycle mechanics drive it for validators.\nThus, one will see the shifting of bargaining power between these two sectors as consolidation forces evolve over time. Stronger block builders could demand a larger share of the MEV profits from validators and validator networks, reducing staked ETH APY and the Ethereum economy’s native yield. Dominating validator networks would be able to push back and use their validator share to ensure that block builders give them a fair split of the MEV profits. Should they choose not to, they can just accept a block design from another builder (note, PBS could make things a bit different here).\nSimilar dynamics have played out in the past, a very relatable one being in the computer stack. Chips and computer hardware providers had certain periods of increased and decreased concentration, however, it was concentration that was more sustained on the chip side, which eventually led to a killer company in Intel and several hardware manufactures losing margin year after year as their bargaining power dwindled. Moreover, Intel even allocated capital to funding open-source hardware development, strategically forcing the commoditization and reduction in bargaining power of its supply chain neighbor.\nCould the space one day see a large validator network use its treasury to support a new block building operation? This could be the case, both in terms of following Intel’s strategy with open source hardware development, but also in terms of backwards integration, which has dynamics of its own. The bottom line here is that both the block builder and validator sectors in the supply chain have some strong characteristics to their names. Operating in a chain where finite MEV can only be split so many ways will most likely lead to forms of strategic conflict and maneuvers on each end. Thus, tracking the drivers of competitive advantage, the relative concentration in each supply chain step, and strategic developments will be imperative for understanding where the value will flow.\nUpstream vs. Downstream\nZooming out, I’d like to take the 2D supply chain diagram and make it 3D, with some inspiration from a stream descending downwards — this is the MEV supply chain. At its most basic level, MEV starts with user transactions (the source of the stream) and comes to fruition on the blockchain (the ocean). Just like with streams, rivers, and other waterways, diverting the valuable substance upstream carries effects on the quantity and quality of the water downstream.\nOvertime, with MEV becoming better understood and the quantum of it becoming higher and higher (as more value comes on-chain), the space will see more initiatives at the user, protocol, wallet, and L2 levels to either reduce MEV (providing consumer surplus to the user) or capture MEV (as a revenue source for the protocol or serving as kickback to the user). This hasn’t predominantly been the case yet, however, several changes are becoming apparent:\nProtocols that partner with users: Over the last 1.5 years we have seen growth in the teams forming and methods being designed to help protocols (and consequently their users) retain more of the MEV profits. Especially last year (different market environment as well as state of infrastructure), so much money was ‘being left on the table’ per se, with users and their apps losing out to bots, MEV operations, and miners. This consumer or producer surplus was not being captured and thus a market opportunity emerged to help protocols capture this. Several projects arose with the goal of building infra that works with protocols to run transactions through private relays, capture some of the MEV, share it with builders, and then route back a portion of the MEV to the protocol (while keeping the remaining amount as a profit). This profit routed back could serve as protocol earnings or user kickbacks. Should this trend continue to proliferate, we would be witnessing the drying up of MEV profits downstream (searchers, relayers / builders, validators), which could lead to very interesting knock-on effects. One thing is clear, however — there is a fair argument that the user could benefit a lot more from progress with this trend\nL2s: the increasing relevance of L2s as sources of crypto transactions presents a similar shift to the prior point, with L2 networks being presented with the opportunity to retain more of the MEV profits for either the benefit of their users or their own income. This is not a novel statement — L2 teams have been open about MEV and what they could do with it. There is the FIFO / FCFS approach for decentralized sequencers. This would reduce frontrunning but could lead to spam proliferation as parties such as searchers try to be first or to increases in colocation benefits. There is the verifiable delay function (VDF), which obscures transaction data for a set amount of time, revealing it after being sequenced. And there are concepts like threshold encryption, which hide transaction details from validators. Put together, the three mentioned carry the same effect of : (-) MEV profit, (+) UX / consumer surplus. On another side, there is also the opportunity for other L2s to monetize MEV and use that for public goods funding or their own native staking yields\nApp-chains: In a similar camp to L2s, app-chains represent a drain of MEV profits away from validators and builders; however, it must be specified that these would be away from Ethereum validators and other supply chain participants. An app-chain would have its own validators (and other participants) and local MEV profits would be split among those participants. The app-chain trend becomes important in the case of Ethereum MEV analysis as it represents both a loss of future MEV profits (should a powerful Ethereum app chose to move over to its own chain) as well as a loss of what could have been MEV profits (should an app that would have otherwise been on Ethereum launch on its own chain). Note, this also sparks some interesting discussions around the value of native network tokens (both in the case of ETH and in the case of the one launching the app chain)\nConclusion\nThere are plenty of other theses to dive into as it pertains to the MEV supply chain (i.e., cross-chain MEV), however, these are still under development (perhaps a topic for a future post). From a first principles basis, MEV is a ‘must’ as a sector to pay attention to. It is integral to the functioning of blockchains, more so fluid than static in terms of evolution, and has the potential to grow in value (in aggregate) as crypto economies scale. With this in mind, the state of its supply chain is something to be cognizant of as it can provide some worthy insights into where some great startups might evolve from.\nDisclosure:* This blog series is strictly personal/ educational and is not investment advice nor a solicitation to buy or sell any assets. It does not represent any views from where the author is working — all views, opinions, and arguments are the author’s. Please always do your own research.*\nIf you find submirror valuable, please consider donate to wong2.eth to help cover server cost.","guid":"https://mirror.xyz/0x8BE2355417EF645f3A3739DD1B8aBd38C563c595/qi4wLhqsKUbLI1y0pbvxf7Bh9l86K8lCsMyNZMf6UOQ","isoDate":"2022-12-16T15:08:37.000Z","from":"https://submirror.xyz/0x8BE2355417EF645f3A3739DD1B8aBd38C563c595","hashId":"de3ccaddbc29626cf21886190acfa171"}]