[{"title":"12月9日 Discord AMA ","link":"https://mirror.xyz/0xaF819C7d5B9E98AfD3b59561a33067a94393E9d2/ZDYJn-wB36bEk1SKtKZGYLHo4iYXwC7VFCUwCxLGruA","pubDate":"Fri, 16 Dec 2022 17:09:25 GMT","content:encoded":"<p>Discord 音频 AMA 摘要，2022 年 12 月 9 日。</p>\n<p>Space and Time 参与人:</p>\n<ul>\n<li><p><em>Scott Dykstra,</em> 首席技术官兼联合创始人</p>\n</li>\n<li><p><em>Spencer Reeves,</em> 创意总监</p>\n</li>\n<li><p><em>Mike Post,</em> 社区管理员</p>\n</li>\n</ul>\n<p>感谢所有出席的社区成员！</p>\n<p><code>[会议开始]</code></p>\n<p><strong>介绍</strong></p>\n<p>Mike：Scott，对于那些没有参加或没有参加你上次 AMA 的人，你为什么不介绍一下你自己呢？</p>\n<p>Scott：当然；我是 Space and Time 的联合创始人兼首席技术官。我的背景：我在数据仓库行业工作了大约十年，将来自财富 500 强的世界数据集中到基于云的、单一的、集中的数据仓库中，这一切都是 Web3 的对立面。我很幸运地遇到了 Nate Holiday，并在这些年里与他成为了非常亲密的朋友，谢天谢地，他在几年前把我从集中世界数据的悲惨企业带入了 Web3。我有机会开始研究 Web3 架构，研究像 Chainlink 这样的去中心化网络，并且对他们构建的东西印象深刻。我意识到这是一种更好的经商方式。这解决了互联网成员围绕数据隐私、用户拥有自己的数据以及不允许大公司出售其数据以获取利润的诸多挫败感。这解决了围绕数据共享以及不同组织和 DAO 以及企业和用户以创造良好经济的方式相互共享数据的挑战。</p>\n<p>我也意识到这个空间非常有趣，所以现在我们正在研究一个真正分散的数据仓库模型。这不仅仅是关于查询和分析，它也是关于在区块链上共享数据，这就是我的背景。在过去的几年里，我一直在研究 ZK 证明，为查询构建一个新颖的 ZK 证明，一种数据库实际证明它对智能合约所做的工作的方法，一种分散数据库节点实际说的方法，“嘿，这是我的查询结果，但这是一个证明，一个 ZK 证明，我已经准确地以防篡改的方式完成了这项工作。”我们刚刚从美国专利局获得了这项研究的专利，所以称我为数据库构建者，称我为半个密码学家，很高兴认识你们。</p>\n<p>Mike：<em>Spencer</em>，对于那些还没有见过你的人，你为什么不给我们介绍一下你的背景呢？</p>\n<p><em>Spencer</em>：是的，当然。所以我通过过去的项目认识了<em>Spencer</em>。我来自传统营销，我已经参与加密了大概五年了。我最初是一名加密货币交易员，后来进入了更多的创作者内容和 Web3 类型的营销观点。所以让 Space and Time 脱离地面是一件非常有趣的事情。我的意思是，这绝对是一种快乐。我的意思是，看到社区与我们的内部团队一起成长，这绝对是疯狂的。我看着这里的数字仍然有点攀升，这很棒。这真的很有趣，因为我们在年底接近一年的标志，我只记得在这些空间里有五到十个人，现在我们已经超过 500 人了。所以我非常兴奋。</p>\n<p>Mike：我叫Mike，我是社区经理，我很高兴也有幸每天与你们互动。在过去的几个月里真的认识了你们中的很多人，这很棒，我期待着继续与你们一起建立这个社区。在我们开始之前，我想特别感谢我们的社区助手 S.Crypto、NFTerraX、Leon 和 Mystery Men。非常感谢你们为帮助这个社区成为现在的样子所做的所有工作，好吧，既然如此，让我们开始吧。</p>\n<p><code>AMA</code></p>\n<p><strong>Mike：那么，第一个问题：Scott，对于社区的新人，你为什么不向我们解释一下，什么是Space and Time？</strong></p>\n<p>Scott：是的，当然。我们希望社区能就我们如何进一步定义此消息并真正弄清楚什么是Space and Time提供反馈。因为Space and Time太难解释，我承认这一点。Space and Time 是一个去中心化的数据仓库。这意味着什么？这意味着我们正在构建一个可以由社区运营和拥有的查询引擎，用户运营的节点嵌入了 ZK 证明，以便它可以将查询结果发送到智能合约。它是一个数据仓库平台，可以索引来自区块链的实时数据，从主要区块链中捕获始终最新的实时数据并使其可供查询，将数据与链外数据结合起来，但最重要的是允许针对该数据的查询结果将被发送到主要链上的智能合约，这为智能合约和一般的 Web3 开辟了一组全新的用例， Space and Time 是一个 Web3 原生数据仓库。</p>\n<p><strong>Mike：太好了，让我们继续讨论 Space and Time 与其竞争对手的真正区别？</strong></p>\n<p>Scott：与此类似，这是我们希望社区提供消息反馈的另一个问题。当你构建像这样的复杂协议时，我们会做很多不同的事情，我们有很多消息要共享，很难将其归结为一条简洁的消息。<em>Spencer</em> 和我花了很多时间思考这个问题，比如，嘿，我们如何用一两句话非常清楚地描述 Space and Time以及我们的不同之处。但总的来说，像 TheGraph 这样的协议真的很有趣，因为它们创建了第一个社区运营的数据库节点网络，在这个社区运营的网络中，任何人都可以运行自己的节点并开始从区块链索引数据。像 Dune Analytics 这样的协议非常有趣，因为它们创建了第一种真正开源、真正协作的 SQL 引擎。 Dune Analytics 允许任何人编写 SQL、与世界分享它、获得上下投票、在公共数据集上使用公共查询构建仪表板。回到我过去十年在 Web2 中度过的这个故事，将世界的数据库集中到云中，没有人共享查询，没有企业会编写查询并将其公开供其他人协作，他们绝不会公开分享他们的数据，供其他组织或个人实际合作。</p>\n<p>从差异化的角度来看，我们刚刚构建了一个新的协议，我们获得了一项名为 Proof of SQL 的专利，它是我们数据库生成的查询结果的加密证明。然后我认为 Web3 中的大多数协议通常都是单节点操作，它们可以扩展到每个节点 0.5TB。例如，您可以考虑 TheGraph，它是一个基于 PostgreSQL 的数据库，您可以扩展到大约 0.5 TB。因此，如果你想索引区块链数据，从区块链捕获实时数据并查询它，你将只能捕获主要链的一小部分，如 Ethereum 或 Avalanche 或 Polygon 或 Binance 等。而 Space而 Time 正在构建一个集群规模的数据仓库，其中用户操作的节点实际上是用户操作的集群，三个甚至 300 个节点的集群。这允许任何给定的集群非常高效地扩展到数十 TB，有朝一日可能达到数百 TB。这意味着我们可以在空间和时间集群上持久保存整个区块链——整个区块链的关系、可查询副本。想象一下，您拥有这个大型计算集群，可以将 Ethereum、Avalanche、Polygon、Binance、Sui 全部放在同一个数据库集群上，并跨这些区块链上的所有协议询问用户活动的非常复杂的问题。这不是说，“嘿，我关心这些智能合约，我想问有关这些智能合约的问题。”就像，“嘿，我可以问任何关于链上的问题”</p>\n<p>因此，总结一下：极端的规模、新颖的密码证明，最重要的是，拆除过去十年将世界数据集中到大公司控制的私人数据仓库中的做法。</p>\n<p><strong>Mike：让我们继续下一个问题：谁会从使用 Space and Time 中受益？谁是目标客户？</strong></p>\n<p>Scott：是的，这些都是很好的问题。我可以给你一个一句话的答案，但我希望社区能帮助改进这个并说，“嘿Scott，你的一句话答案肯定可以改进”我们的客户是分析师，他们希望分析区块链数据、查询数据使其可用，并通过更深入的洞察力了解链上发生的事情。我们的客户是其他 DeFi、游戏、通用 Web3 协议，需要将链下数据和链上数据连接到他们的智能合约。任何需要构建更智能的下一代 DeFi 协议、下一代金融工具、想要连接链下数据和链上数据的链上游戏，并构建新的智能合约，根据他们的用户奖励给用户的人游戏活动，需要运行查询的智能合约，我们的客户是协议构建者和数据分析师。</p>\n<p><strong>Mike：太好了，让我们继续讨论有关该项目未来的一些问题。那么，在这一点上，您认为该项目的任何主要技术计划是否会发生变化，或者此时的技术路线图是否已经确定？</strong></p>\n<p>Scott：路线图总是会扩大范围；他们总是把东西加到他们身上。我们有一个关于近期优先事项的既定路线图，但当然可以编辑长期优先事项，并且我们一直在向路线图添加新功能。现在，在短期内，我们将继续稳定我们的数据库并提高性能。我们计划在第一季度末引入节点运营商并开始运行。我们期待在第二季度的某个时候，即第二季度初的某个时候，为 SQL 证明提供一个测试网。而且我认为接下来的几个季度真的要开始扩大规模了。我们对围绕人工智能的新举措以及我们可以让我们的分析师在 AI 协助的帮助下更轻松地访问、理解和处理数据的方式感到非常兴奋。当然，还要针对数 TB 的数据扩展 SQL 证明。</p>\n<p><strong>Mike：<em>Spencer</em>，我认为这是一个特别关注你的问题，我们计划在 2023 年围绕 Space and Time 建立一个开发者社区？</strong></p>\n<p>Spencer：首先，也是最重要的，我们希望获得构建在 Space and Time 之上的优质项目，而我们可以开始这样做的一种方式是真正专注于通过我们的 Discord 等渠道，通过我们的 Twitter 构建开发者社区平台，通过我们现在正在开展的所有这些社交活动，我们真的很想培养一个为我们的产品做出贡献的开源社区，今年我们还想真正投入到远程和面对面的黑客马拉松中，并通过营销继续这些密切的合作伙伴关系，并真正尝试整合到其他一些项目中。</p>\n<p>Scott：关于黑客马拉松的话题，我真的很高兴看到社区中的谁将在几个月后开始阅读我们的文档，并在我们脱离封闭受控版本后开始构建 Space and Time .我们很接近。我们距离真正为像您这样的构建者提供空间和时间数据以及Space and Time计算只有几个月的时间。你将能够跳上我们的文档，开始查询Space and Time并开始构建东西，无论是在黑客马拉松中正式还是在你自己的时间非正式地，并向我们发送一些关于你在 Discord 上构建的信息，“看看这个，我使用你们的区块链数据在Space and Time之上构建了这个 dapp，我真的为此感到自豪”我们很乐意展示你们在第一季度的建设，这将是一个绝对的爆炸。</p>\n<p>Spencer：是的，与此同时，正如你们所知或注意到的那样，一旦我们进入新的一年，我们的 Discord 社区也将朝着开发者的方向发展，非常高兴能使这个平台成为开发人员交流的场所。</p>\n<p><strong>Mike：另一个给你的，Spencer：你认为 Space and Time 在 2023 年参加了哪些重要会议？</strong></p>\n<p>Spencer：我们将参加大型 ETH 基金会会议，我们将与 ETHDenver 一起开启新的一年。我们真的在关注 GDC，甚至处理一些传统的游戏会议。正如你们所知，我们真的很想依靠 GameFi，我们正在研究共识，又是SmartCon。我们也在考虑韩国区块链周的想法，然后是今年晚些时候的 DevCon。所以我们今年有很多会议计划，我们非常高兴你们能在这一过程中支持我们。</p>\n<p><strong>Mike：让我们继续讨论一些技术问题，Scott，你是 Proof of SQL 大师。你能解释一下什么是 SQL 证明吗？它将在《Space and Time》中扮演什么角色，为什么它会如此改变游戏规则？</strong></p>\n<p>Scott：是的，我会称自己为 Proof of SQL 项目的关键部分，但真正的 Proof of SQL 大师是我们的研究主管兼联合创始人 Jay White。</p>\n<p>在 SQL Proof of SQL 方面，我们刚刚获得了美国专利局的专利，这真的是为了保护我们免受将要研究这项技术并说：“哦，我想复制它“从构建者的角度来看，这将是开源的，可供社区在适当的时候构建，可能是明年年中，或多或少，给予或接受，走着瞧。 SQL 的证明真的很令人兴奋，这很令人兴奋，因为 Web3 中的许多投资者、用户和其他构建者告诉我们我们做不到。他们说，“不，你不能构建一个专门为数据库中的复杂查询生成 ZK 证明的协议。那永远不会扩展，事实上，这是不可能的，Scott。”我们说，“是的，除了我们已经做到了，我们已经证明它是有效的”</p>\n<p>它需要大量的 GPU 计算，我们正在谈论一个大型 GPU 计算集群来生成这些 ZK 证明。事实是，我们用来回答复杂的数据问题以运行这些查询的这些集群已经可以利用 GPU。因此，我们已经拥有一个遍布全球的大型计算集群网络来处理查询。为什么不在该计算之上生成 ZK 证明呢？所以我们扩展了这个协议，允许智能合约请求关于他们自己的链的数据或关于链外数据集的数据。疯狂的是，智能合约，尤其是在 EVM 上，对数据的访问权限如此有限，甚至是关于它们自己的链。今天的智能合约真的没有那么智能，他们不能问复杂的问题。他们甚至不能问一些简单的问题，比如“告诉我所有购买了这个特定系列至少三个 NFT 的钱包。”</p>\n<p>今天在 EVM 上，智能合约无法回答这么简单的问题。他们将需要Space and Time，然后智能合约可以向Space and Time 询问有关自己链、其他链和链外数据上的数据的更复杂的问题。因此，EVM 上的智能合约可以说，“嘿，Space and Time，给我 BNB 的 AVAX 代币的隐含波动率，”例如；然后 Polygon 上的智能合约可以围绕该分析洞察力构建一个衍生品交易平台，一个期权交易平台。这些是如何使用 SQL 证明连接链下数据的示例。从游戏的角度来看，想象一下 Polygon 或 Avalanche 上的智能合约定期查询空间和时间并说，“嘿，告诉我在最后一分钟赢得这场比赛的所有钱包以及为什么，钱包得分是多少，告诉我代表在最后一分钟赢得比赛的玩家的钱包，我将为他们提供额外的奖励和额外的链上激励。”这些是 SQL 证明如何工作的一些示例。</p>\n<p>Spencer：当我们推出 SQL 证明时，甚至从你那里，来自这个沉重的数据仓库背景，我的意思是，这将成为某种新标准，对吧？我的意思是，当您返回查询语句时，为什么不想使用 SQL 证明之类的东西呢？这将改变该领域的标准。所以我想如果我不得不再问你一个问题，你如何看待数据仓库空间的发展，因为 SQL Proof of SQL 更主流一点？</p>\n<p>Scott：是的，随着我们进一步扩大规模，主流采用将会到来。我认为很多协议最初采用Proof of SQL 的速度会有点慢，因为它们不会完全围绕可以立即构建的新用例。随着越来越多的协议建立新的用例、新的游戏理念、奖励链上游戏玩家的新方式、支持下一代 DeFi 协议的新金融工具、新的保险用例、新的链上社交网络和社交媒体使用案例，然后，当然还有新的借贷和借贷协议用例，因为 Web3 中的这些不同的子垂直领域开始建立在Space and Time之上，并讲述他们的故事，“嘿，我们刚刚为这个令人难以置信的新用例提供了动力，我们没有 SQL 证明就不可能完成，”它为其他协议创建了一堆内容以最终理解，“哦，好吧，这就是 SQL 证明的证明。这是另一个 DeFi 协议构建的一个有趣的用例，它提供了关于我的 DeFi 协议或我的借贷平台或我的 Web3 游戏如何利用这项技术来做以前不可能做的事情，我有一些想法”</p>\n<p>今天，你可以将数据库连接到智能合约，人们正在这样做，但他们是以一种非常可篡改、非常集中的方式进行的，他们只是简单地在中央数据库和智能合约之间放置一个 oracle 网络，然后让他们的智能合约启动 oracle 作业以从该中央数据库获取数据，从数据流的角度来看，这没有错，但问题是，它永远无法确保链上数亿或数十亿美元的价值，因为它是中心化的和可篡改的。因此，SQL 证明只是开辟了一组全新的用例，人们将开始意识到他们可以在他们的协议中构建这些用例。</p>\n<p><strong>Mike：进入无信任网络时代；因此，当我们讨论可篡改问题时——不完全是您在谈论什么，但我们知道数据安全漏洞是当今世界的持续威胁，Space and Time 将如何保护用户数据？</strong></p>\n<p>Scott：我们在 Space and Time 中内置了很多安全层，这不仅仅是防止黑客和试图破坏 Space and Time 集群的人的安全，也是用户拥有自己的数据、隐私和自我的方式- 仅在他们愿意时进行识别，仅在他们愿意时共享有关他们自己的数据，仅在他们愿意时才让协议更深入地访问有关他们自己的信息。我认为在过去的十年里，当每个人都意识到主要社交媒体公司正在用他们的数据做什么时，实际上只是一般的大型企业，我们需要将隐私返回给互联网的选民，我认为过去十年确实在数据隐私方面对互联网的选民产生了一些影响。Space and Time 具有数据库内加密功能，因此我们对数据、传输和静态数据进行加密。我们有一个平台，允许协议用户、最终用户、钱包持有者选择共享数据。我们正在与该领域的许多其他致力于数据隐私的初创公司合作。然后我们当然有 SQL 证明，一种新颖的 ZK 证明，就你的观点而言，迈克，支持无信任网络，支持从智能合约到我们的数据仓库的无信任连接，因此如果我们要将数据放在链上，我们可以以一种无需信任、去中心化、防篡改且最重要的是可在链上验证的方式做到这一点。</p>\n<p><strong>Mike：当然；那么，谈到链上与链下，您能否解释一下 Space and Time 如何连接链上和链下数据，以及它如何在实现如此快速查询的同时做到这一点？</strong></p>\n<p>Scott：是的，这是简单的部分。我的意思是，我们只是自动地从 Ethereum、Polygon、Avalanche、Binance、Sui 等主要区块链中自动捕获实时、始终最新、始终准确的信息。我们捕获该数据，将其摄取到Space and Time 中，并且我们以防篡改的方式进行。然后我们的构建者、我们的开发者、我们的协议用户、客户和合作伙伴在 Space and Time 上构建，可以使用我们在数据库空间中流行的熟悉的接口，使用熟悉的数据仓库工具加载他们自己的数据。比如，他们可以加载 Kafka Streams，有用于加载数据的 REST API。有用于执行 SQL 插入的 JDBC 连接。只是熟悉的正常、舒适的方式将链下数据加载到空间和时间中。对于那些想要实际加载防篡改链下数据的协议，我们有一个 oracle 网络可供他们通过 oracle 网络加载数据。</p>\n<p>与您传统上使用 oracle 网络获取数据源并将它们连接到您的智能合约的方式相同，您可以使用 oracle 网络以防篡改的方式将链下数据加载到 Space and Time 中。请再次记住，我们已经在自动收集链上数据，有点像为我们的开发人员提供的服务。 Space and Time 以防篡改的方式获取链上数据，开发人员可选择以防篡改的方式加载他们自己的链下数据，然后智能合约启动查询，将这些数据集连接到钱包地址等连接键上，比如事务 ID 块、用户 ID，随你便。</p>\n<p>因此，如果我们想要赋予具有这些功能的新金融工具，比如区块链上成熟的社交网络，那么我们当然需要推进 EVM 上的智能合约的能力。因此，Space and Time 通过为智能合约提供自己的查询引擎来做到这一点，从而允许智能合约以防篡改的方式访问数 TB 的数据。你可以在 Space and Time 上构建你的社交网络，与你的链上智能合约紧密集成，对吧？例如，您在 Polygon 上向您的内容创建者付费，但您在管理您的网络每天在空间和时间中生成的数 TB 数据。您将该数据汇总到智能合约，就像侧链将交易汇总到Ethereum一样，Space and Time 可以将复杂的数据、聚合、复杂的数据问题汇总到智能合约中。</p>\n<p><strong>Mike：Spencer，让我们继续问你另一个问题。我们从社区成员那里收到了很多关于该网站的问题。现在，除了他在公司的无数其他职责之外，Spencer还负责网络开发，Spencer，你能告诉我们新网站吗？</strong></p>\n<p>Spencer：是的，我真的很高兴终于推出它。Scott 和我已经在这方面工作了很长一段时间，所以这绝对是超级的，非常感谢社区以它的方式回应它。我的意思是，从一开始，Scott 和我就对 UX 和 UI 非常着迷，我们真的只想为我们所有的产品带来最高质量的设计和用户体验，除了我们的网站，最终我们的 dapp将于 2023 年发布，我们真正拿到手的任何东西，我们都从设计的角度着迷。我真的很想为网站带来一个社区和用户线程，并且真的只是将任何用户活动驱动到 Discord，以便有朝一日与我们的产品进行交互。总的来说，这是一个非常有趣的项目，我很高兴能继续在它之上进行建设。有趣的是，我正在将该网站视为我们社区成员进一步与我们互动并了解我们产品的更多信息的平台。我们也刚刚更新了我们的文档。非常感谢 Stephen Hilton、Catherine Hickox 和整个开发团队，他们夜以继日地更新我们的文档。我对一切的推出感到非常兴奋，是的，这真是太棒了。</p>\n<p><strong>Mike：让我们继续谈谈合作伙伴关系，所以回到 SmartCon，我们宣布了 Space and Time 与 Microsoft 的合作伙伴关系，Scott，Space and Time 将如何与 Microsoft 整合？</strong></p>\n<p>Scott：微软Azure正在做一些非常有趣的事情，引领着保密计算的发展。人们并没有意识到Azure在保密计算方面所做的工作。首先，Azure与NVIDIA有最大的合作关系之一，他们在Azure上真正推动了GPU加速的操作。他们也对Web3感到非常兴奋，他们正在关注Web3空间，并开始与越来越多的协议合作，他们开始为Web3开发者在Azure堆栈中加入产品和功能。最重要的是，Azure实际上在可信执行环境，enclave ，保密计算方面处于领先地位。想想英特尔的SGX芯片，它实现了一个enclave，在这个enclave里，计算被执行，证明这个在芯片上被加密的计算正在以一种不可篡改的方式准确地完成。这不是全新的技术。这项技术已经存在了很多年，但它真正被推进是在去年的Web3。</p>\n<p>在 Web3 开发人员的推动下，在加密证明的推动下，在防篡改计算和可验证计算的推动下，对可信执行环境和英特尔飞地以及来自英特尔竞争对手的其他enclave的需求在去年急剧增长。我们总是开玩笑说 2023 年是 SNARK 和 STARK 的一年，但老实说，2022 年已经是 SNARK 和 STARK 的一年了。围绕 zkEVM、ZK rollup、StarkNet——STARKs 和 SNARKs 作为可验证计算的讨论如此之多。我所说的是 Azure 在提供服务方面处于领先地位，开发人员可以在这些服务中使用更熟悉的工具和更易于使用的工具在enclave内部、这些加密芯片内部进行构建，我们对此感到非常兴奋。因此，通过专门与 Microsoft 和 Azure 合作，我们并不是说 Space and Time 将完全在 Azure 上运行。我们说很多Space and Time服务都可以在 Azure 上运行，我们将使想要使用 Azure 的开发人员能够真正轻松地启动Space and Time<strong>，</strong>将其连接到其他 Azure 服务，然后运行它在安全的私人enclave中。当然，还可以利用与 NVIDIA 令人难以置信的合作伙伴关系以及 Azure 上的 GPU 执行。我们为这种伙伴关系感到非常自豪。我们为 Microsoft 对 Space and Time 的投资和参与感到自豪，他们一直是很好的合作伙伴。这不是将集中式系统引入 Web3，它实际上是关于在云中真正的超大规模计算之上运行分散式系统。</p>\n<p><strong>Mike：你提到了 NVIDIA，我们最近宣布与 NVIDIA 建立合作伙伴关系。那么对我们来说，为什么选择 NVIDIA 以及 NVIDIA 将为Space and Time提供什么样的支持？</strong></p>\n<p>Scott：与 NVIDIA 的合作围绕 GPU 加速展开，推动了这一进程。在本次 AMA 的早些时候，我们讨论了 SQL 证明如何在 GPU 上运行。我们需要一个大型 GPU 集群来生成这些 ZK 证明，以生成这些零知识证明我们的查询执行是以准确的方式完成的。因此，我们的目标是越来越深入地融入 NVIDIA 社区，并站在 GPU 执行的最前沿。他们正在帮助我们解决查询加速问题，他们正在帮助我们实施加速查询的方法，使我们的查询使用 GPU 运行得更快，当然他们也在帮助我们进入市场。</p>\n<p><strong>Mike：接着我们来到了另一个巨大的合作伙伴关系，那就是 Chainlink。加入 Chainlink BUILD 计划对 Space and Time 有什么好处？</strong></p>\n<p>Scott：是的，现在它变得有趣了，我们喜欢 Chainlink。我知道很多社区也通过 Chainlink 连接找到了我们，在过去的几年里，我们与 Chainlink 团队的关系非常紧密。我认为从合作伙伴关系的角度来看，Chainlink 可能是目前 Web3 方面最重要的合作伙伴。显然，在将防篡改查询结果连接到智能合约时，您希望利用一个成熟、强大和现有的预言机网络。归根结底，如果我们想将数据发送到智能合约，我们必须解决预言机问题。而不是自己完全解决它。为什么不与一流的 Chainlink 合作来解决这个预言机问题呢？无论我们如何使用 SQL 证明生成 ZK 证明，无论我们向智能合约发送什么数据，无论是链上、链下还是两者，我们都需要在数据仓库和智能合约之间建立一个预言机网络合同实际将该数据写入链或执行将该数据交给智能合约的交易。所以Chainlink是智能合约和Space and Time数据库之间的桥梁。当然，就我们使用的服务而言，未来将在某种程度上是可组合的，但我们与 Chainlink 的集成让开发人员能够真正轻松地启动 Chainlink 作业，以防篡改、无需信任的方式从Space and Time中获取数据和完全去中心化的方式。</p>\n<p>Spencer：我也会很快补充这一点，我的意思是，能够与 Chainlink 团队密切合作，他们对我们的整个过程非常有吸引力并且非常有帮助。更不用说来自 Chainlink 社区的每个人都会涌入我们的社区。对于你们给予我们的所有支持，我们感激不尽。 Discord、Twitter，包罗万象，是与 Chainlink 社区的一次非常好的体验。</p>\n<p><strong>Mike：是的，棒了；因此，让我们继续讨论我们所有人都喜欢的主题，即特定用例，Scott，您认为 Space and Time 平台将支持什么样的新用例？</strong></p>\n<p>Scott：当然，我们来谈谈 Web3 中不同的子垂直领域。你有游戏、DeFi、参数保险、社交网络。你有围绕行业的新用例，你有大型金融机构在链上建立忠诚度计划的企业用例。你有大型金融机构在链上铸造证券，如债券、碳信用、股票、ETF。你有这种能源用例的扩散。我看到壳牌石油公司在 Solana 建设。没想到。我们开始看到企业采用这个空间并构建新的用例来标记资产并奖励用户和忠诚度。从 Web3 初创公司的角度来看，当然，游戏和 DeFi 将成为我们的生计，我对此感到非常兴奋，我们将为 DeFi 和游戏启用一组全新的用例。</p>\n<p>让我们从 DeFi 开始，在 DeFi 方面，链上抵押不足或无抵押的贷款将需要大量的链下计算来决定谁应该获得这些贷款，前提是这些贷款没有过度抵押，收益率和借贷利率是多少.想要进行更高级的衍生品交易的 DeFi 协议。现在我们对链上的永久期权有点饱和，但我相信，未来将是欧洲结算的链上期权。为了实现这一点，我们确实需要将智能合约与空间和时间联系起来。 Space and Time 需要向合约提供有关如何为这些衍生品定价的信息。欧洲结算的期权交易所中的衍生品定价极其复杂，需要大量计算和输入数据，而这些数据需要链下、去中心化的数据仓库。在 DeFi 方面，最后一个用例是协议本身变得越来越智能。他们正在构建由数据支持的更复杂的金融工具。</p>\n<p>然而，智能合约并没有变得更加智能，EVM 没有太多发展。因此，由于 EVM 的智能合约功能停滞不前，但 DeFi 开发人员正在突破可能的界限，Space and Time 与智能合约并驾齐驱，并通过额外的计算、额外的数据处理能力来补充它们，以提供一些额外的能量，一些气体, 这些智能合约。在游戏方面，我们对围绕质押的一系列新用例感到非常兴奋，比如粉丝可以对电子竞技团队进行质押，当该团队获胜时，粉丝就会获胜。围绕奖励链上顶级玩家的游戏内活动的新用例。游戏服务器将防篡改数据加载到 Space and Time，该游戏的链上智能合约会查询 Space and Time，并询问最近谁赢了，他们为什么赢，他们的分数是多少，以及他们应该得到什么奖励和奖励空投。</p>\n<p>如果我赢得大型电子竞技锦标赛，我想获得一些代币。那么，智能合约如何知道谁赢得了电子竞技比赛以及为什么？它并不像通过预言机网络将游戏服务器直接连接到智能合约那么简单。在游戏服务器和智能合约之间需要有一个无需信任的中介，Space and Time，它准备将这些数据交给智能合约，在智能合约中可以在链上执行额外的业务逻辑，例如，有人在火箭联盟中获得 30 个进球的 NFT。最后，在保险方面，每个人都在谈论参数保险进入区块链，但它在哪里？你们知道吗？你看到了吗？我们的参数保险用例在哪里？像 dClimate 这样非常酷的公司正在建设基础设施以实现这一目标；但是，我还没有看到真正的保险提供商使用区块链。</p>\n<p>为什么呢？好吧，因为他们需要更多的基础设施。这些保险用例需要大量真实世界的数据、来自汽车遥测的真实世界数据、驾驶记录、来自天气的真实世界遥测数据，以实现围绕天气、气候和农业的参数保险。他们需要来自金融市场的真实数据来对冲股票，并建立保险和衍生品以确保股票和对冲头寸。他们需要来自区块链外部的关于航运、运输和物流的真实数据，以确保供应链。我们都相信所有这些用例都将到来。我们知道区块链非常适合实现这些。区块链创建了一个防篡改审计跟踪，一旦数据在链上，它就永远不会被改变，永远不会被篡改或操纵。这是一条审计线索，可以为这些真正具有前瞻性的保险用例提供动力。但要建立这些保险用例，我们需要从供应链、交通、能源、股票市场、气象站获取链下数据。</p>\n<p>我们需要让所有链上的 Space and Time 充当中介来准备所有数据，聚合数据，并通过智能合约将其放在链上，我知道我已经深入探讨了用例，但这真的让我很兴奋。Lens、Hyperconnect 和许多其他很棒的协议正在为 Web3 社交构建工具。但是我们的 Web3 社交网络在哪里？我们有 Farcaster，我对此感到非常兴奋，但归根结底，这是一个社交网络，它并没有以我们期望的令人难以置信的速度增长。那么除了 Farcaster，我们的 Web3 社交网络在哪里？如果我们相信内容创建者可以通过他们创建的内容在链上获得报酬并以更稳健的方式拥有他们的内容，那么让我们开始构建它。</p>\n<p>好吧，挑战在于社交网络会产生大量数据。我不是在谈论公司将要出售的有关用户的敏感私人数据。我说的只是，例如，谁看了什么内容。仅是关于谁查看了哪些内容的数据每天就可以产生数 TB 的数据，你不能把那种数据量放在链上。链上需要的是一天结束时的聚合信息，即“Scott 多次查看了这组内容。”或者“嘿，这个内容创作者的视频今天被观看了 100 万次。支付给他们 10,000 美元的链上加密货币”聚合信息，创建较小数据集的更高级别的信息，可以上链以奖励内容创建者创建的内容，其他一切都可以存在于空间和时间的无信任、防篡改数据仓库中。</p>\n<p>Mike：是的，社交媒体是一个非常棒的 Web3 用例，Space and Time 将使它成为可能。我知道你不是在谈论委托用户数据，但最终我们将拥有 Web3 社交媒体网络，你不必将你的数据委托给 Facebook 等网站。</p>\n<p>Spencer：当然，有趣的是，我认为社交可能会将一些最多的用户带到 Web3，但我认为它的采用速度最慢，我认为用户可能会比 GameFi 或 DeFi 晚很多。</p>\n<p><strong>Mike：让我们谈谈空间和时间将如何在成本方面影响整个市场，那么你认为Space and Time开发的解决方案将如何影响 Web3 业务的某些服务的成本？</strong></p>\n<p>Scott：是关于天然气的，EVM 将数据放在链上的成本很高。在将数据写入链时，我们对以太坊与 Polygon 的 gas 成本进行了大量研究。Polygon 变得更加实惠，但即使使用 Polygon，当您在链上编写查询结果时，事情也开始真正增加。例如，考虑一下 Web3 游戏的这个用例，其中每一分钟，你都想告诉智能合约哪些游戏玩家最近赢得了游戏并在链上支付给他们。如果你的游戏有几百万玩家，那么每分钟你都会将数百个钱包地址或实际上可能是数千或数万个钱包地址传递到你的智能合约中。即使在 Polygon 上，一个更实惠的链，你每天将数据写入链的 gas 成本也将达到数千美元。</p>\n<p>而在以太坊上，这实际上是每天数百万美元，这是站不住脚的。因此，Space and Time 聚合了这些数据，创建了一个可以同步该数据、存储该数据的数据仓库，并且可以上链的只是实现这些支付和奖励所需的重要内容。所有额外的信息，比如我在游戏中做了什么，我去了哪里，我是如何获胜的，我获得了什么分数，以及为什么，所有这些都可以存在于空间和时间中，因为它不需要由区块链，它可以通过Space and Time来保护。链上的是所有实际实现激励、奖励和支付的数据。因此，从节省成本的角度来看，它实际上会扩展区块链。与第 2 层和侧链扩展以太坊的方式相同，Space and Time在数据方面扩展以太坊。人们没有意识到的是，如果没有非常复杂的数据集，您就无法构建任何这些用例。没有 TB 级数据就无法构建游戏。没有 TB 级数据就无法建立金融市场。你当然不能建立社交网络。不幸的是，您不能将数 TB 的数据放在区块链上。您可以放置​​重要的元数据、聚合和支持业务逻辑的有用信息。其他一切都可以进入Space and Time，以获得两到三个数量级的更便宜的存储空间。</p>\n<p><strong>Mike：所以，这里有最后几个问题。第一，这当然是 Scott 提出的一个问题，我相信你经常会在个人基础上报复，该项目在盈利模式和代币发行方面的计划是什么？</strong></p>\n<p>Scott：我们将让这个社区的一群人说，“Scott，什么时候？”我喜欢它，但我们必须等待合适的时机，市场变化无常，市场现在有点粗糙。此外，我们需要让我们的平台成熟一点。我们还没有真正为代币化激励做好准备。当然，我们正在朝着这个方向努力。目前，随着我们引入节点运营商，随着我们引入用户运营的节点来启用网络，我们将根据节点运营商和用例，以 USDC、ETH 和 LINK 奖励他们。但总的来说，客户和开发者以及合作伙伴用 USDC、ETH 和 LINK 为Space and Time付费是我们的意图，他们以非常实惠、低成本的方式为运行的查询付费。他们基本上是在为他们正在执行的查询支付 gas，但这将比链上 gas 便宜几个数量级。因此，开发人员在 Space and Time 的基础上进行构建。他们用稳定币或 ETH 或 LINK 支付我们集群为他们所做的工作，Space and Time 为开发人员执行查询所做的工作。然后我们也用代币奖励节点运营商，目的是在适当的时候，我们可能会掉落Space and Time代币。</p>\n<p><strong>Mike：我想我们还有时间在这里再来一次，很多社区成员都非常关心地问我们这个问题，我们非常感谢他们的关心。确实，熊市如何影响Space and Time，如果有的话？</strong></p>\n<p>Scott：我们真的很幸运，我们没有接触过 FTX，甚至我们的大多数合作伙伴和支持者也没有接触过 FTX，我们真的毫发无损地出来了。现在对每个人来说都是一段艰难的时期，我们感到痛苦。我们社区中的很多人都受到伤害，很多人感到沮丧，他们想知道，区块链真的会成为推动未来前进的东西吗？我仍然非常乐观，在 Space and Time 的路线图、Space and Time 的资本配置、我们的财务以及我们完成这项工作的能力方面没有任何变化。如果有的话，我认为熊市对我们有很大帮助。你知道，它消除了所有噪音。去年在 Web3 中开始构建与数据相关的东西后，启动后启动了很多噪音，所有这些噪音都被消除了。它为 Space and Time 创造了一个机会，可以向市场发出明确的信息，即我们将带头推动下一波智能合约浪潮。当下一波浪潮到来时，可能会出现牛市，我们都将成为其中的一部分。</p>\n<p><strong>总结</strong></p>\n<p>Mike：当然，期待它。所以，我认为今天的 AMA 就是这样，我要感谢所有提交问题的人，我要感谢所有到场聆听的人。我真的很震惊；我认为我们这里的社区成员达到顶峰时大约有 600 名，Scott和Spencer，我要感谢你们来回答问题，Scott，你想把它带走并得出一些结论只是为了在这里结束它吗？</p>\n<p>Scott：是的，当然，我真的很感谢你们的加入，这绝对是一场爆炸。我不知所措并感谢您的支持，这个社区真是太棒了，出现，出现，给我发一些表情包，继续做你们正在做的事情。和你们一起工作真的很愉快。继续提交问题，我们将继续进行 AMA，我们将让社区了解我们的最新进展，2023 年将是史诗般的一年，Space and Time正在发射，Space and Time 正在接管并为开发人员提供新服务以构建下一代智能合约，让我们一起做吧，团队。</p>\n<p>Mike：当然！</p>\n<p>Spencer：非常感谢大家，今天真是太棒了。</p>\n<p>Mike：再见，各位，我们将在下一个 AMA 中见到你。</p>\n<p>Scott：谢谢，伙计们！</p>\n<p><code>[会议结束]</code></p>\n<p><strong>Space and Time链接：</strong></p>\n<p>网站： <a href=\"http://spaceandtime.io/\">http://spaceandtime.io</a></p>\n<p>推特： <a href=\"http://twitter.com/spaceandtimeDB\">http://twitter.com/spaceandtimeDB</a></p>\n<p>Discord： <a href=\"http://discord.com/spaceandtimeDB\">http://discord.com/spaceandtimeDB</a></p>\n<p>电报： <a href=\"http://t.me/spaceandtimeDB\">http://t.me/spaceandtimeDB</a></p>\n<p>LinkedIn： <a href=\"http://linkedin.com/space-and-time-db\">http://linkedin.com/space-and-time-db</a></p>\n<h2 id=\"reddit：-httpredditcomrspaceandtimedb\">Reddit： <a href=\"http://reddit.com/r/spaceandtimeDB\">http://reddit.com/r/spaceandtimeDB</a></h2>\n<p><em>If you find submirror valuable, please consider donate to wong2.eth to help cover server cost.</em></p>\n","content:encodedSnippet":"Discord 音频 AMA 摘要，2022 年 12 月 9 日。\nSpace and Time 参与人:\nScott Dykstra, 首席技术官兼联合创始人\nSpencer Reeves, 创意总监\nMike Post, 社区管理员\n感谢所有出席的社区成员！\n[会议开始]\n介绍\nMike：Scott，对于那些没有参加或没有参加你上次 AMA 的人，你为什么不介绍一下你自己呢？\nScott：当然；我是 Space and Time 的联合创始人兼首席技术官。我的背景：我在数据仓库行业工作了大约十年，将来自财富 500 强的世界数据集中到基于云的、单一的、集中的数据仓库中，这一切都是 Web3 的对立面。我很幸运地遇到了 Nate Holiday，并在这些年里与他成为了非常亲密的朋友，谢天谢地，他在几年前把我从集中世界数据的悲惨企业带入了 Web3。我有机会开始研究 Web3 架构，研究像 Chainlink 这样的去中心化网络，并且对他们构建的东西印象深刻。我意识到这是一种更好的经商方式。这解决了互联网成员围绕数据隐私、用户拥有自己的数据以及不允许大公司出售其数据以获取利润的诸多挫败感。这解决了围绕数据共享以及不同组织和 DAO 以及企业和用户以创造良好经济的方式相互共享数据的挑战。\n我也意识到这个空间非常有趣，所以现在我们正在研究一个真正分散的数据仓库模型。这不仅仅是关于查询和分析，它也是关于在区块链上共享数据，这就是我的背景。在过去的几年里，我一直在研究 ZK 证明，为查询构建一个新颖的 ZK 证明，一种数据库实际证明它对智能合约所做的工作的方法，一种分散数据库节点实际说的方法，“嘿，这是我的查询结果，但这是一个证明，一个 ZK 证明，我已经准确地以防篡改的方式完成了这项工作。”我们刚刚从美国专利局获得了这项研究的专利，所以称我为数据库构建者，称我为半个密码学家，很高兴认识你们。\nMike：Spencer，对于那些还没有见过你的人，你为什么不给我们介绍一下你的背景呢？\nSpencer：是的，当然。所以我通过过去的项目认识了Spencer。我来自传统营销，我已经参与加密了大概五年了。我最初是一名加密货币交易员，后来进入了更多的创作者内容和 Web3 类型的营销观点。所以让 Space and Time 脱离地面是一件非常有趣的事情。我的意思是，这绝对是一种快乐。我的意思是，看到社区与我们的内部团队一起成长，这绝对是疯狂的。我看着这里的数字仍然有点攀升，这很棒。这真的很有趣，因为我们在年底接近一年的标志，我只记得在这些空间里有五到十个人，现在我们已经超过 500 人了。所以我非常兴奋。\nMike：我叫Mike，我是社区经理，我很高兴也有幸每天与你们互动。在过去的几个月里真的认识了你们中的很多人，这很棒，我期待着继续与你们一起建立这个社区。在我们开始之前，我想特别感谢我们的社区助手 S.Crypto、NFTerraX、Leon 和 Mystery Men。非常感谢你们为帮助这个社区成为现在的样子所做的所有工作，好吧，既然如此，让我们开始吧。\nAMA\nMike：那么，第一个问题：Scott，对于社区的新人，你为什么不向我们解释一下，什么是Space and Time？\nScott：是的，当然。我们希望社区能就我们如何进一步定义此消息并真正弄清楚什么是Space and Time提供反馈。因为Space and Time太难解释，我承认这一点。Space and Time 是一个去中心化的数据仓库。这意味着什么？这意味着我们正在构建一个可以由社区运营和拥有的查询引擎，用户运营的节点嵌入了 ZK 证明，以便它可以将查询结果发送到智能合约。它是一个数据仓库平台，可以索引来自区块链的实时数据，从主要区块链中捕获始终最新的实时数据并使其可供查询，将数据与链外数据结合起来，但最重要的是允许针对该数据的查询结果将被发送到主要链上的智能合约，这为智能合约和一般的 Web3 开辟了一组全新的用例， Space and Time 是一个 Web3 原生数据仓库。\nMike：太好了，让我们继续讨论 Space and Time 与其竞争对手的真正区别？\nScott：与此类似，这是我们希望社区提供消息反馈的另一个问题。当你构建像这样的复杂协议时，我们会做很多不同的事情，我们有很多消息要共享，很难将其归结为一条简洁的消息。Spencer 和我花了很多时间思考这个问题，比如，嘿，我们如何用一两句话非常清楚地描述 Space and Time以及我们的不同之处。但总的来说，像 TheGraph 这样的协议真的很有趣，因为它们创建了第一个社区运营的数据库节点网络，在这个社区运营的网络中，任何人都可以运行自己的节点并开始从区块链索引数据。像 Dune Analytics 这样的协议非常有趣，因为它们创建了第一种真正开源、真正协作的 SQL 引擎。 Dune Analytics 允许任何人编写 SQL、与世界分享它、获得上下投票、在公共数据集上使用公共查询构建仪表板。回到我过去十年在 Web2 中度过的这个故事，将世界的数据库集中到云中，没有人共享查询，没有企业会编写查询并将其公开供其他人协作，他们绝不会公开分享他们的数据，供其他组织或个人实际合作。\n从差异化的角度来看，我们刚刚构建了一个新的协议，我们获得了一项名为 Proof of SQL 的专利，它是我们数据库生成的查询结果的加密证明。然后我认为 Web3 中的大多数协议通常都是单节点操作，它们可以扩展到每个节点 0.5TB。例如，您可以考虑 TheGraph，它是一个基于 PostgreSQL 的数据库，您可以扩展到大约 0.5 TB。因此，如果你想索引区块链数据，从区块链捕获实时数据并查询它，你将只能捕获主要链的一小部分，如 Ethereum 或 Avalanche 或 Polygon 或 Binance 等。而 Space而 Time 正在构建一个集群规模的数据仓库，其中用户操作的节点实际上是用户操作的集群，三个甚至 300 个节点的集群。这允许任何给定的集群非常高效地扩展到数十 TB，有朝一日可能达到数百 TB。这意味着我们可以在空间和时间集群上持久保存整个区块链——整个区块链的关系、可查询副本。想象一下，您拥有这个大型计算集群，可以将 Ethereum、Avalanche、Polygon、Binance、Sui 全部放在同一个数据库集群上，并跨这些区块链上的所有协议询问用户活动的非常复杂的问题。这不是说，“嘿，我关心这些智能合约，我想问有关这些智能合约的问题。”就像，“嘿，我可以问任何关于链上的问题”\n因此，总结一下：极端的规模、新颖的密码证明，最重要的是，拆除过去十年将世界数据集中到大公司控制的私人数据仓库中的做法。\nMike：让我们继续下一个问题：谁会从使用 Space and Time 中受益？谁是目标客户？\nScott：是的，这些都是很好的问题。我可以给你一个一句话的答案，但我希望社区能帮助改进这个并说，“嘿Scott，你的一句话答案肯定可以改进”我们的客户是分析师，他们希望分析区块链数据、查询数据使其可用，并通过更深入的洞察力了解链上发生的事情。我们的客户是其他 DeFi、游戏、通用 Web3 协议，需要将链下数据和链上数据连接到他们的智能合约。任何需要构建更智能的下一代 DeFi 协议、下一代金融工具、想要连接链下数据和链上数据的链上游戏，并构建新的智能合约，根据他们的用户奖励给用户的人游戏活动，需要运行查询的智能合约，我们的客户是协议构建者和数据分析师。\nMike：太好了，让我们继续讨论有关该项目未来的一些问题。那么，在这一点上，您认为该项目的任何主要技术计划是否会发生变化，或者此时的技术路线图是否已经确定？\nScott：路线图总是会扩大范围；他们总是把东西加到他们身上。我们有一个关于近期优先事项的既定路线图，但当然可以编辑长期优先事项，并且我们一直在向路线图添加新功能。现在，在短期内，我们将继续稳定我们的数据库并提高性能。我们计划在第一季度末引入节点运营商并开始运行。我们期待在第二季度的某个时候，即第二季度初的某个时候，为 SQL 证明提供一个测试网。而且我认为接下来的几个季度真的要开始扩大规模了。我们对围绕人工智能的新举措以及我们可以让我们的分析师在 AI 协助的帮助下更轻松地访问、理解和处理数据的方式感到非常兴奋。当然，还要针对数 TB 的数据扩展 SQL 证明。\nMike：Spencer，我认为这是一个特别关注你的问题，我们计划在 2023 年围绕 Space and Time 建立一个开发者社区？\nSpencer：首先，也是最重要的，我们希望获得构建在 Space and Time 之上的优质项目，而我们可以开始这样做的一种方式是真正专注于通过我们的 Discord 等渠道，通过我们的 Twitter 构建开发者社区平台，通过我们现在正在开展的所有这些社交活动，我们真的很想培养一个为我们的产品做出贡献的开源社区，今年我们还想真正投入到远程和面对面的黑客马拉松中，并通过营销继续这些密切的合作伙伴关系，并真正尝试整合到其他一些项目中。\nScott：关于黑客马拉松的话题，我真的很高兴看到社区中的谁将在几个月后开始阅读我们的文档，并在我们脱离封闭受控版本后开始构建 Space and Time .我们很接近。我们距离真正为像您这样的构建者提供空间和时间数据以及Space and Time计算只有几个月的时间。你将能够跳上我们的文档，开始查询Space and Time并开始构建东西，无论是在黑客马拉松中正式还是在你自己的时间非正式地，并向我们发送一些关于你在 Discord 上构建的信息，“看看这个，我使用你们的区块链数据在Space and Time之上构建了这个 dapp，我真的为此感到自豪”我们很乐意展示你们在第一季度的建设，这将是一个绝对的爆炸。\nSpencer：是的，与此同时，正如你们所知或注意到的那样，一旦我们进入新的一年，我们的 Discord 社区也将朝着开发者的方向发展，非常高兴能使这个平台成为开发人员交流的场所。\nMike：另一个给你的，Spencer：你认为 Space and Time 在 2023 年参加了哪些重要会议？\nSpencer：我们将参加大型 ETH 基金会会议，我们将与 ETHDenver 一起开启新的一年。我们真的在关注 GDC，甚至处理一些传统的游戏会议。正如你们所知，我们真的很想依靠 GameFi，我们正在研究共识，又是SmartCon。我们也在考虑韩国区块链周的想法，然后是今年晚些时候的 DevCon。所以我们今年有很多会议计划，我们非常高兴你们能在这一过程中支持我们。\nMike：让我们继续讨论一些技术问题，Scott，你是 Proof of SQL 大师。你能解释一下什么是 SQL 证明吗？它将在《Space and Time》中扮演什么角色，为什么它会如此改变游戏规则？\nScott：是的，我会称自己为 Proof of SQL 项目的关键部分，但真正的 Proof of SQL 大师是我们的研究主管兼联合创始人 Jay White。\n在 SQL Proof of SQL 方面，我们刚刚获得了美国专利局的专利，这真的是为了保护我们免受将要研究这项技术并说：“哦，我想复制它“从构建者的角度来看，这将是开源的，可供社区在适当的时候构建，可能是明年年中，或多或少，给予或接受，走着瞧。 SQL 的证明真的很令人兴奋，这很令人兴奋，因为 Web3 中的许多投资者、用户和其他构建者告诉我们我们做不到。他们说，“不，你不能构建一个专门为数据库中的复杂查询生成 ZK 证明的协议。那永远不会扩展，事实上，这是不可能的，Scott。”我们说，“是的，除了我们已经做到了，我们已经证明它是有效的”\n它需要大量的 GPU 计算，我们正在谈论一个大型 GPU 计算集群来生成这些 ZK 证明。事实是，我们用来回答复杂的数据问题以运行这些查询的这些集群已经可以利用 GPU。因此，我们已经拥有一个遍布全球的大型计算集群网络来处理查询。为什么不在该计算之上生成 ZK 证明呢？所以我们扩展了这个协议，允许智能合约请求关于他们自己的链的数据或关于链外数据集的数据。疯狂的是，智能合约，尤其是在 EVM 上，对数据的访问权限如此有限，甚至是关于它们自己的链。今天的智能合约真的没有那么智能，他们不能问复杂的问题。他们甚至不能问一些简单的问题，比如“告诉我所有购买了这个特定系列至少三个 NFT 的钱包。”\n今天在 EVM 上，智能合约无法回答这么简单的问题。他们将需要Space and Time，然后智能合约可以向Space and Time 询问有关自己链、其他链和链外数据上的数据的更复杂的问题。因此，EVM 上的智能合约可以说，“嘿，Space and Time，给我 BNB 的 AVAX 代币的隐含波动率，”例如；然后 Polygon 上的智能合约可以围绕该分析洞察力构建一个衍生品交易平台，一个期权交易平台。这些是如何使用 SQL 证明连接链下数据的示例。从游戏的角度来看，想象一下 Polygon 或 Avalanche 上的智能合约定期查询空间和时间并说，“嘿，告诉我在最后一分钟赢得这场比赛的所有钱包以及为什么，钱包得分是多少，告诉我代表在最后一分钟赢得比赛的玩家的钱包，我将为他们提供额外的奖励和额外的链上激励。”这些是 SQL 证明如何工作的一些示例。\nSpencer：当我们推出 SQL 证明时，甚至从你那里，来自这个沉重的数据仓库背景，我的意思是，这将成为某种新标准，对吧？我的意思是，当您返回查询语句时，为什么不想使用 SQL 证明之类的东西呢？这将改变该领域的标准。所以我想如果我不得不再问你一个问题，你如何看待数据仓库空间的发展，因为 SQL Proof of SQL 更主流一点？\nScott：是的，随着我们进一步扩大规模，主流采用将会到来。我认为很多协议最初采用Proof of SQL 的速度会有点慢，因为它们不会完全围绕可以立即构建的新用例。随着越来越多的协议建立新的用例、新的游戏理念、奖励链上游戏玩家的新方式、支持下一代 DeFi 协议的新金融工具、新的保险用例、新的链上社交网络和社交媒体使用案例，然后，当然还有新的借贷和借贷协议用例，因为 Web3 中的这些不同的子垂直领域开始建立在Space and Time之上，并讲述他们的故事，“嘿，我们刚刚为这个令人难以置信的新用例提供了动力，我们没有 SQL 证明就不可能完成，”它为其他协议创建了一堆内容以最终理解，“哦，好吧，这就是 SQL 证明的证明。这是另一个 DeFi 协议构建的一个有趣的用例，它提供了关于我的 DeFi 协议或我的借贷平台或我的 Web3 游戏如何利用这项技术来做以前不可能做的事情，我有一些想法”\n今天，你可以将数据库连接到智能合约，人们正在这样做，但他们是以一种非常可篡改、非常集中的方式进行的，他们只是简单地在中央数据库和智能合约之间放置一个 oracle 网络，然后让他们的智能合约启动 oracle 作业以从该中央数据库获取数据，从数据流的角度来看，这没有错，但问题是，它永远无法确保链上数亿或数十亿美元的价值，因为它是中心化的和可篡改的。因此，SQL 证明只是开辟了一组全新的用例，人们将开始意识到他们可以在他们的协议中构建这些用例。\nMike：进入无信任网络时代；因此，当我们讨论可篡改问题时——不完全是您在谈论什么，但我们知道数据安全漏洞是当今世界的持续威胁，Space and Time 将如何保护用户数据？\nScott：我们在 Space and Time 中内置了很多安全层，这不仅仅是防止黑客和试图破坏 Space and Time 集群的人的安全，也是用户拥有自己的数据、隐私和自我的方式- 仅在他们愿意时进行识别，仅在他们愿意时共享有关他们自己的数据，仅在他们愿意时才让协议更深入地访问有关他们自己的信息。我认为在过去的十年里，当每个人都意识到主要社交媒体公司正在用他们的数据做什么时，实际上只是一般的大型企业，我们需要将隐私返回给互联网的选民，我认为过去十年确实在数据隐私方面对互联网的选民产生了一些影响。Space and Time 具有数据库内加密功能，因此我们对数据、传输和静态数据进行加密。我们有一个平台，允许协议用户、最终用户、钱包持有者选择共享数据。我们正在与该领域的许多其他致力于数据隐私的初创公司合作。然后我们当然有 SQL 证明，一种新颖的 ZK 证明，就你的观点而言，迈克，支持无信任网络，支持从智能合约到我们的数据仓库的无信任连接，因此如果我们要将数据放在链上，我们可以以一种无需信任、去中心化、防篡改且最重要的是可在链上验证的方式做到这一点。\nMike：当然；那么，谈到链上与链下，您能否解释一下 Space and Time 如何连接链上和链下数据，以及它如何在实现如此快速查询的同时做到这一点？\nScott：是的，这是简单的部分。我的意思是，我们只是自动地从 Ethereum、Polygon、Avalanche、Binance、Sui 等主要区块链中自动捕获实时、始终最新、始终准确的信息。我们捕获该数据，将其摄取到Space and Time 中，并且我们以防篡改的方式进行。然后我们的构建者、我们的开发者、我们的协议用户、客户和合作伙伴在 Space and Time 上构建，可以使用我们在数据库空间中流行的熟悉的接口，使用熟悉的数据仓库工具加载他们自己的数据。比如，他们可以加载 Kafka Streams，有用于加载数据的 REST API。有用于执行 SQL 插入的 JDBC 连接。只是熟悉的正常、舒适的方式将链下数据加载到空间和时间中。对于那些想要实际加载防篡改链下数据的协议，我们有一个 oracle 网络可供他们通过 oracle 网络加载数据。\n与您传统上使用 oracle 网络获取数据源并将它们连接到您的智能合约的方式相同，您可以使用 oracle 网络以防篡改的方式将链下数据加载到 Space and Time 中。请再次记住，我们已经在自动收集链上数据，有点像为我们的开发人员提供的服务。 Space and Time 以防篡改的方式获取链上数据，开发人员可选择以防篡改的方式加载他们自己的链下数据，然后智能合约启动查询，将这些数据集连接到钱包地址等连接键上，比如事务 ID 块、用户 ID，随你便。\n因此，如果我们想要赋予具有这些功能的新金融工具，比如区块链上成熟的社交网络，那么我们当然需要推进 EVM 上的智能合约的能力。因此，Space and Time 通过为智能合约提供自己的查询引擎来做到这一点，从而允许智能合约以防篡改的方式访问数 TB 的数据。你可以在 Space and Time 上构建你的社交网络，与你的链上智能合约紧密集成，对吧？例如，您在 Polygon 上向您的内容创建者付费，但您在管理您的网络每天在空间和时间中生成的数 TB 数据。您将该数据汇总到智能合约，就像侧链将交易汇总到Ethereum一样，Space and Time 可以将复杂的数据、聚合、复杂的数据问题汇总到智能合约中。\nMike：Spencer，让我们继续问你另一个问题。我们从社区成员那里收到了很多关于该网站的问题。现在，除了他在公司的无数其他职责之外，Spencer还负责网络开发，Spencer，你能告诉我们新网站吗？\nSpencer：是的，我真的很高兴终于推出它。Scott 和我已经在这方面工作了很长一段时间，所以这绝对是超级的，非常感谢社区以它的方式回应它。我的意思是，从一开始，Scott 和我就对 UX 和 UI 非常着迷，我们真的只想为我们所有的产品带来最高质量的设计和用户体验，除了我们的网站，最终我们的 dapp将于 2023 年发布，我们真正拿到手的任何东西，我们都从设计的角度着迷。我真的很想为网站带来一个社区和用户线程，并且真的只是将任何用户活动驱动到 Discord，以便有朝一日与我们的产品进行交互。总的来说，这是一个非常有趣的项目，我很高兴能继续在它之上进行建设。有趣的是，我正在将该网站视为我们社区成员进一步与我们互动并了解我们产品的更多信息的平台。我们也刚刚更新了我们的文档。非常感谢 Stephen Hilton、Catherine Hickox 和整个开发团队，他们夜以继日地更新我们的文档。我对一切的推出感到非常兴奋，是的，这真是太棒了。\nMike：让我们继续谈谈合作伙伴关系，所以回到 SmartCon，我们宣布了 Space and Time 与 Microsoft 的合作伙伴关系，Scott，Space and Time 将如何与 Microsoft 整合？\nScott：微软Azure正在做一些非常有趣的事情，引领着保密计算的发展。人们并没有意识到Azure在保密计算方面所做的工作。首先，Azure与NVIDIA有最大的合作关系之一，他们在Azure上真正推动了GPU加速的操作。他们也对Web3感到非常兴奋，他们正在关注Web3空间，并开始与越来越多的协议合作，他们开始为Web3开发者在Azure堆栈中加入产品和功能。最重要的是，Azure实际上在可信执行环境，enclave ，保密计算方面处于领先地位。想想英特尔的SGX芯片，它实现了一个enclave，在这个enclave里，计算被执行，证明这个在芯片上被加密的计算正在以一种不可篡改的方式准确地完成。这不是全新的技术。这项技术已经存在了很多年，但它真正被推进是在去年的Web3。\n在 Web3 开发人员的推动下，在加密证明的推动下，在防篡改计算和可验证计算的推动下，对可信执行环境和英特尔飞地以及来自英特尔竞争对手的其他enclave的需求在去年急剧增长。我们总是开玩笑说 2023 年是 SNARK 和 STARK 的一年，但老实说，2022 年已经是 SNARK 和 STARK 的一年了。围绕 zkEVM、ZK rollup、StarkNet——STARKs 和 SNARKs 作为可验证计算的讨论如此之多。我所说的是 Azure 在提供服务方面处于领先地位，开发人员可以在这些服务中使用更熟悉的工具和更易于使用的工具在enclave内部、这些加密芯片内部进行构建，我们对此感到非常兴奋。因此，通过专门与 Microsoft 和 Azure 合作，我们并不是说 Space and Time 将完全在 Azure 上运行。我们说很多Space and Time服务都可以在 Azure 上运行，我们将使想要使用 Azure 的开发人员能够真正轻松地启动Space and Time，将其连接到其他 Azure 服务，然后运行它在安全的私人enclave中。当然，还可以利用与 NVIDIA 令人难以置信的合作伙伴关系以及 Azure 上的 GPU 执行。我们为这种伙伴关系感到非常自豪。我们为 Microsoft 对 Space and Time 的投资和参与感到自豪，他们一直是很好的合作伙伴。这不是将集中式系统引入 Web3，它实际上是关于在云中真正的超大规模计算之上运行分散式系统。\nMike：你提到了 NVIDIA，我们最近宣布与 NVIDIA 建立合作伙伴关系。那么对我们来说，为什么选择 NVIDIA 以及 NVIDIA 将为Space and Time提供什么样的支持？\nScott：与 NVIDIA 的合作围绕 GPU 加速展开，推动了这一进程。在本次 AMA 的早些时候，我们讨论了 SQL 证明如何在 GPU 上运行。我们需要一个大型 GPU 集群来生成这些 ZK 证明，以生成这些零知识证明我们的查询执行是以准确的方式完成的。因此，我们的目标是越来越深入地融入 NVIDIA 社区，并站在 GPU 执行的最前沿。他们正在帮助我们解决查询加速问题，他们正在帮助我们实施加速查询的方法，使我们的查询使用 GPU 运行得更快，当然他们也在帮助我们进入市场。\nMike：接着我们来到了另一个巨大的合作伙伴关系，那就是 Chainlink。加入 Chainlink BUILD 计划对 Space and Time 有什么好处？\nScott：是的，现在它变得有趣了，我们喜欢 Chainlink。我知道很多社区也通过 Chainlink 连接找到了我们，在过去的几年里，我们与 Chainlink 团队的关系非常紧密。我认为从合作伙伴关系的角度来看，Chainlink 可能是目前 Web3 方面最重要的合作伙伴。显然，在将防篡改查询结果连接到智能合约时，您希望利用一个成熟、强大和现有的预言机网络。归根结底，如果我们想将数据发送到智能合约，我们必须解决预言机问题。而不是自己完全解决它。为什么不与一流的 Chainlink 合作来解决这个预言机问题呢？无论我们如何使用 SQL 证明生成 ZK 证明，无论我们向智能合约发送什么数据，无论是链上、链下还是两者，我们都需要在数据仓库和智能合约之间建立一个预言机网络合同实际将该数据写入链或执行将该数据交给智能合约的交易。所以Chainlink是智能合约和Space and Time数据库之间的桥梁。当然，就我们使用的服务而言，未来将在某种程度上是可组合的，但我们与 Chainlink 的集成让开发人员能够真正轻松地启动 Chainlink 作业，以防篡改、无需信任的方式从Space and Time中获取数据和完全去中心化的方式。\nSpencer：我也会很快补充这一点，我的意思是，能够与 Chainlink 团队密切合作，他们对我们的整个过程非常有吸引力并且非常有帮助。更不用说来自 Chainlink 社区的每个人都会涌入我们的社区。对于你们给予我们的所有支持，我们感激不尽。 Discord、Twitter，包罗万象，是与 Chainlink 社区的一次非常好的体验。\nMike：是的，棒了；因此，让我们继续讨论我们所有人都喜欢的主题，即特定用例，Scott，您认为 Space and Time 平台将支持什么样的新用例？\nScott：当然，我们来谈谈 Web3 中不同的子垂直领域。你有游戏、DeFi、参数保险、社交网络。你有围绕行业的新用例，你有大型金融机构在链上建立忠诚度计划的企业用例。你有大型金融机构在链上铸造证券，如债券、碳信用、股票、ETF。你有这种能源用例的扩散。我看到壳牌石油公司在 Solana 建设。没想到。我们开始看到企业采用这个空间并构建新的用例来标记资产并奖励用户和忠诚度。从 Web3 初创公司的角度来看，当然，游戏和 DeFi 将成为我们的生计，我对此感到非常兴奋，我们将为 DeFi 和游戏启用一组全新的用例。\n让我们从 DeFi 开始，在 DeFi 方面，链上抵押不足或无抵押的贷款将需要大量的链下计算来决定谁应该获得这些贷款，前提是这些贷款没有过度抵押，收益率和借贷利率是多少.想要进行更高级的衍生品交易的 DeFi 协议。现在我们对链上的永久期权有点饱和，但我相信，未来将是欧洲结算的链上期权。为了实现这一点，我们确实需要将智能合约与空间和时间联系起来。 Space and Time 需要向合约提供有关如何为这些衍生品定价的信息。欧洲结算的期权交易所中的衍生品定价极其复杂，需要大量计算和输入数据，而这些数据需要链下、去中心化的数据仓库。在 DeFi 方面，最后一个用例是协议本身变得越来越智能。他们正在构建由数据支持的更复杂的金融工具。\n然而，智能合约并没有变得更加智能，EVM 没有太多发展。因此，由于 EVM 的智能合约功能停滞不前，但 DeFi 开发人员正在突破可能的界限，Space and Time 与智能合约并驾齐驱，并通过额外的计算、额外的数据处理能力来补充它们，以提供一些额外的能量，一些气体, 这些智能合约。在游戏方面，我们对围绕质押的一系列新用例感到非常兴奋，比如粉丝可以对电子竞技团队进行质押，当该团队获胜时，粉丝就会获胜。围绕奖励链上顶级玩家的游戏内活动的新用例。游戏服务器将防篡改数据加载到 Space and Time，该游戏的链上智能合约会查询 Space and Time，并询问最近谁赢了，他们为什么赢，他们的分数是多少，以及他们应该得到什么奖励和奖励空投。\n如果我赢得大型电子竞技锦标赛，我想获得一些代币。那么，智能合约如何知道谁赢得了电子竞技比赛以及为什么？它并不像通过预言机网络将游戏服务器直接连接到智能合约那么简单。在游戏服务器和智能合约之间需要有一个无需信任的中介，Space and Time，它准备将这些数据交给智能合约，在智能合约中可以在链上执行额外的业务逻辑，例如，有人在火箭联盟中获得 30 个进球的 NFT。最后，在保险方面，每个人都在谈论参数保险进入区块链，但它在哪里？你们知道吗？你看到了吗？我们的参数保险用例在哪里？像 dClimate 这样非常酷的公司正在建设基础设施以实现这一目标；但是，我还没有看到真正的保险提供商使用区块链。\n为什么呢？好吧，因为他们需要更多的基础设施。这些保险用例需要大量真实世界的数据、来自汽车遥测的真实世界数据、驾驶记录、来自天气的真实世界遥测数据，以实现围绕天气、气候和农业的参数保险。他们需要来自金融市场的真实数据来对冲股票，并建立保险和衍生品以确保股票和对冲头寸。他们需要来自区块链外部的关于航运、运输和物流的真实数据，以确保供应链。我们都相信所有这些用例都将到来。我们知道区块链非常适合实现这些。区块链创建了一个防篡改审计跟踪，一旦数据在链上，它就永远不会被改变，永远不会被篡改或操纵。这是一条审计线索，可以为这些真正具有前瞻性的保险用例提供动力。但要建立这些保险用例，我们需要从供应链、交通、能源、股票市场、气象站获取链下数据。\n我们需要让所有链上的 Space and Time 充当中介来准备所有数据，聚合数据，并通过智能合约将其放在链上，我知道我已经深入探讨了用例，但这真的让我很兴奋。Lens、Hyperconnect 和许多其他很棒的协议正在为 Web3 社交构建工具。但是我们的 Web3 社交网络在哪里？我们有 Farcaster，我对此感到非常兴奋，但归根结底，这是一个社交网络，它并没有以我们期望的令人难以置信的速度增长。那么除了 Farcaster，我们的 Web3 社交网络在哪里？如果我们相信内容创建者可以通过他们创建的内容在链上获得报酬并以更稳健的方式拥有他们的内容，那么让我们开始构建它。\n好吧，挑战在于社交网络会产生大量数据。我不是在谈论公司将要出售的有关用户的敏感私人数据。我说的只是，例如，谁看了什么内容。仅是关于谁查看了哪些内容的数据每天就可以产生数 TB 的数据，你不能把那种数据量放在链上。链上需要的是一天结束时的聚合信息，即“Scott 多次查看了这组内容。”或者“嘿，这个内容创作者的视频今天被观看了 100 万次。支付给他们 10,000 美元的链上加密货币”聚合信息，创建较小数据集的更高级别的信息，可以上链以奖励内容创建者创建的内容，其他一切都可以存在于空间和时间的无信任、防篡改数据仓库中。\nMike：是的，社交媒体是一个非常棒的 Web3 用例，Space and Time 将使它成为可能。我知道你不是在谈论委托用户数据，但最终我们将拥有 Web3 社交媒体网络，你不必将你的数据委托给 Facebook 等网站。\nSpencer：当然，有趣的是，我认为社交可能会将一些最多的用户带到 Web3，但我认为它的采用速度最慢，我认为用户可能会比 GameFi 或 DeFi 晚很多。\nMike：让我们谈谈空间和时间将如何在成本方面影响整个市场，那么你认为Space and Time开发的解决方案将如何影响 Web3 业务的某些服务的成本？\nScott：是关于天然气的，EVM 将数据放在链上的成本很高。在将数据写入链时，我们对以太坊与 Polygon 的 gas 成本进行了大量研究。Polygon 变得更加实惠，但即使使用 Polygon，当您在链上编写查询结果时，事情也开始真正增加。例如，考虑一下 Web3 游戏的这个用例，其中每一分钟，你都想告诉智能合约哪些游戏玩家最近赢得了游戏并在链上支付给他们。如果你的游戏有几百万玩家，那么每分钟你都会将数百个钱包地址或实际上可能是数千或数万个钱包地址传递到你的智能合约中。即使在 Polygon 上，一个更实惠的链，你每天将数据写入链的 gas 成本也将达到数千美元。\n而在以太坊上，这实际上是每天数百万美元，这是站不住脚的。因此，Space and Time 聚合了这些数据，创建了一个可以同步该数据、存储该数据的数据仓库，并且可以上链的只是实现这些支付和奖励所需的重要内容。所有额外的信息，比如我在游戏中做了什么，我去了哪里，我是如何获胜的，我获得了什么分数，以及为什么，所有这些都可以存在于空间和时间中，因为它不需要由区块链，它可以通过Space and Time来保护。链上的是所有实际实现激励、奖励和支付的数据。因此，从节省成本的角度来看，它实际上会扩展区块链。与第 2 层和侧链扩展以太坊的方式相同，Space and Time在数据方面扩展以太坊。人们没有意识到的是，如果没有非常复杂的数据集，您就无法构建任何这些用例。没有 TB 级数据就无法构建游戏。没有 TB 级数据就无法建立金融市场。你当然不能建立社交网络。不幸的是，您不能将数 TB 的数据放在区块链上。您可以放置​​重要的元数据、聚合和支持业务逻辑的有用信息。其他一切都可以进入Space and Time，以获得两到三个数量级的更便宜的存储空间。\nMike：所以，这里有最后几个问题。第一，这当然是 Scott 提出的一个问题，我相信你经常会在个人基础上报复，该项目在盈利模式和代币发行方面的计划是什么？\nScott：我们将让这个社区的一群人说，“Scott，什么时候？”我喜欢它，但我们必须等待合适的时机，市场变化无常，市场现在有点粗糙。此外，我们需要让我们的平台成熟一点。我们还没有真正为代币化激励做好准备。当然，我们正在朝着这个方向努力。目前，随着我们引入节点运营商，随着我们引入用户运营的节点来启用网络，我们将根据节点运营商和用例，以 USDC、ETH 和 LINK 奖励他们。但总的来说，客户和开发者以及合作伙伴用 USDC、ETH 和 LINK 为Space and Time付费是我们的意图，他们以非常实惠、低成本的方式为运行的查询付费。他们基本上是在为他们正在执行的查询支付 gas，但这将比链上 gas 便宜几个数量级。因此，开发人员在 Space and Time 的基础上进行构建。他们用稳定币或 ETH 或 LINK 支付我们集群为他们所做的工作，Space and Time 为开发人员执行查询所做的工作。然后我们也用代币奖励节点运营商，目的是在适当的时候，我们可能会掉落Space and Time代币。\nMike：我想我们还有时间在这里再来一次，很多社区成员都非常关心地问我们这个问题，我们非常感谢他们的关心。确实，熊市如何影响Space and Time，如果有的话？\nScott：我们真的很幸运，我们没有接触过 FTX，甚至我们的大多数合作伙伴和支持者也没有接触过 FTX，我们真的毫发无损地出来了。现在对每个人来说都是一段艰难的时期，我们感到痛苦。我们社区中的很多人都受到伤害，很多人感到沮丧，他们想知道，区块链真的会成为推动未来前进的东西吗？我仍然非常乐观，在 Space and Time 的路线图、Space and Time 的资本配置、我们的财务以及我们完成这项工作的能力方面没有任何变化。如果有的话，我认为熊市对我们有很大帮助。你知道，它消除了所有噪音。去年在 Web3 中开始构建与数据相关的东西后，启动后启动了很多噪音，所有这些噪音都被消除了。它为 Space and Time 创造了一个机会，可以向市场发出明确的信息，即我们将带头推动下一波智能合约浪潮。当下一波浪潮到来时，可能会出现牛市，我们都将成为其中的一部分。\n总结\nMike：当然，期待它。所以，我认为今天的 AMA 就是这样，我要感谢所有提交问题的人，我要感谢所有到场聆听的人。我真的很震惊；我认为我们这里的社区成员达到顶峰时大约有 600 名，Scott和Spencer，我要感谢你们来回答问题，Scott，你想把它带走并得出一些结论只是为了在这里结束它吗？\nScott：是的，当然，我真的很感谢你们的加入，这绝对是一场爆炸。我不知所措并感谢您的支持，这个社区真是太棒了，出现，出现，给我发一些表情包，继续做你们正在做的事情。和你们一起工作真的很愉快。继续提交问题，我们将继续进行 AMA，我们将让社区了解我们的最新进展，2023 年将是史诗般的一年，Space and Time正在发射，Space and Time 正在接管并为开发人员提供新服务以构建下一代智能合约，让我们一起做吧，团队。\nMike：当然！\nSpencer：非常感谢大家，今天真是太棒了。\nMike：再见，各位，我们将在下一个 AMA 中见到你。\nScott：谢谢，伙计们！\n[会议结束]\nSpace and Time链接：\n网站： http://spaceandtime.io\n推特： http://twitter.com/spaceandtimeDB\nDiscord： http://discord.com/spaceandtimeDB\n电报： http://t.me/spaceandtimeDB\nLinkedIn： http://linkedin.com/space-and-time-db\nReddit： http://reddit.com/r/spaceandtimeDB\nIf you find submirror valuable, please consider donate to wong2.eth to help cover server cost.","guid":"https://mirror.xyz/0xaF819C7d5B9E98AfD3b59561a33067a94393E9d2/ZDYJn-wB36bEk1SKtKZGYLHo4iYXwC7VFCUwCxLGruA","isoDate":"2022-12-16T17:09:25.000Z","from":"https://submirror.xyz/0xaF819C7d5B9E98AfD3b59561a33067a94393E9d2","hashId":"3f10f391e52884598e2d2f8da9f3808e"}]