[{"creator":"Nelson Wang","title":"Chinese Police Arrest 63 People Accused of Laundering $1.7B Using Cryptocurrency","link":"https://www.coindesk.com/policy/2022/12/12/chinese-police-arrest-63-people-accused-of-laundering-17b-using-cryptocurrency/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","pubDate":"Mon, 12 Dec 2022 16:54:27 +0000","dc:creator":"Nelson Wang","content":"The illicit funds were converted into tether and then laundered by people around the world, authorities said.","contentSnippet":"The illicit funds were converted into tether and then laundered by people around the world, authorities said.","guid":"FDPANEGRHRGA5BWIVZLXXOAEMU","categories":[{"_":"Policy","$":{"domain":"https://www.coindesk.com/policy/"}}],"isoDate":"2022-12-12T16:54:27.000Z","from":"http://feeds.feedburner.com/Coindesk"},{"creator":"Katarina Stefanovic","title":"ABCs of Web3 for Designers","link":"https://medium.com/reach-sh/abcs-of-web3-for-designers-5a71af20c973?source=rss----d99f38c59b5---4","pubDate":"Mon, 12 Dec 2022 17:09:56 GMT","content:encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*yStiFxVN_AV2XrCsyt3ldA.png\" /></figure><p>For Web3 to grow in popularity and expand beyond digital wallets and financial platforms,<strong> designers need to make Web3 apps more consistent and intuitive</strong>. They also have to provide more straightforward user education to help familiarize newcomers with novel features and interactions found on Web3 platforms.</p><p>Making DApps feel secure has to be a high priority too. It’s impossible to control the trustless, permissionless nature of Web3, but designers can predict what may go wrong and help prevent those occurrences. More transparent caveats about risks will go a long way to assuage people’s concerns and convince them to embrace Web3.</p><p>However, to start doing that — designers need to have a good grasp of terms used on a day-to-day basis in Web3.</p><p>Let’s go over the ABCs of Web3.</p><h3>A</h3><p><strong>Address </strong><em>(noun)</em><strong><br></strong>also referred to as wallet address or blockchain address — just like someone has a home and business address, a blockchain has an address to identify its location. A blockchain address is a long alphanumeric reference to access the precise location of the transaction’s home. It also can be where someone receives, sends, or holds their blockchain transactions. An example of a blockchain address is: <em>5TdA55HeLopzzwe3Lg7W335tGdCc623PoQ.</em></p><p><strong>Airdrop </strong><em>(noun, verb)<br></em>a specified amount of cryptocurrency, social tokens, or a new NFT dropped into a holder’s wallet for free or in exchange for minimal promotional work. It is a popular way for startups, NFT projects and social token creators to reward and engage their community.</p><p><strong>Altcoin </strong><em>(noun)</em><br>initially used to refer to any cryptocurrency that wasn’t Bitcoin, altcoin may now refer to any new cryptocurrency with a relatively small market cap.</p><p><strong>Alts </strong><em>(noun)</em><br>short for altcoins.</p><p><strong>ATH- All Time High </strong><em>(noun)</em><br>the highest price an asset has ever had.</p><p><strong>ATL- All Time Low </strong><em>(noun)</em><br>the lowest price an asset has ever had.</p><h3>B</h3><p><strong>Blockchain </strong><em>(noun)</em><strong><br></strong>a distributed database shared among the nodes of a computer network. As a database, a blockchain stores information electronically in digital format. It’s an immutable database, which means that information can’t be tampered with or altered once it’s been recorded. If there’s an error in an entry, then a new, revised entry must be made, and both entries will subsequently be visible on the ledger.</p><p><strong>Bridge in/bridge out </strong><em>(verb)</em><strong><br></strong>a blockchain bridge is a connection that allows the transfer of social tokens from one chain to another. Both chains can have distinct protocols, rules, and governance models, but the bridge provides a compatible way to conduct the transaction securely on both sides. For example, holders of Rally.io tokens can bridge out some (or all) of their holdings in the Rally sidechain to the Ethereum chain. From there, they can sell (or bridge) their Ethereum for currency.</p><p><strong>Burn </strong><em>(verb)</em><strong><br></strong>the process where tokens are removed from circulation. Coin burning is a market tool to increase the value of cryptocurrency.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*1-rumDpe_f_lfa2uS8k54Q.png\" /></figure><h3>C</h3><p><strong>Circulating supply </strong><em>(noun)</em><strong><br></strong>the number of cryptocurrency coins or tokens publicly available in the market.</p><p><strong>Composability </strong><em>(noun)</em><strong><br></strong> the ability of decentralized applications (dApps) and DAOs to effectively clone and integrate one another.</p><h3>D</h3><p><strong>DAO </strong><em>(noun)</em><strong><br></strong><em>Decentralized Autonomous Organization</em> — a community-led entity with no central authority. Ultimately, a DAO is run exclusively by its individual members, who jointly decide on important project issues including technical advancements and treasury allocations. Smart contracts set the ground rules, carry out the decisions reached by the community, and allow for public auditing at any time, making it completely autonomous and transparent.</p><p><strong>DApps </strong><em>(noun)</em><strong><br></strong>Decentralized Applications — digital applications that run on a blockchain network of computers instead of relying on a single computer. Since DApps are decentralized, they are free from the control and interference of a single authority. Benefits of dApps include the safeguarding of user privacy, the lack of censorship, and the flexibility of development.</p><p><strong>Decentralized exchange — DEX </strong><em>(noun)</em><strong><br></strong>DEX decentralized exchanges are smart contracts tailored for offering peer-to-peer transactions that ensure theoretically complete anonymity. This means the actual asset being exchanged never passes through the hands of an intermediary.</p><p><strong>Decentralized network </strong><em>(noun)</em><strong><br></strong>in computing terms, a decentralized network architecture distributes workloads among several machines instead of relying on a single central server. No one company or company’s servers control the network. Decentralized networks offer a wide range of benefits over centralized networks, including increased system reliability, scale, and privacy.</p><p><strong>Degen </strong><em>(noun)</em><strong><br></strong>now an affectionate and self-assigned term that members of the crypto world refer to themselves and others. Even though it stems from Degenerate or Degenerative Gambler, it is generally used as a badge of honour without negative ideals. Degens can often be found at 4am staring at multiple screens, looking for the next token or NFT drop.</p><h3>E</h3><p><strong>ETH </strong><em>(noun)</em><strong><br></strong>abbreviation for Ethereum cryptocurrency. Ethereum is a blockchain network with a decentralized public ledger for verifying and recording transactions. Its currency is Ether (ETH).</p><p><strong>Exchange </strong><em>(noun)</em><strong><br></strong>a platform on which to buy and sell cryptocurrency. Users can trade one crypto for another or buy crypto using traditional currency. Exchanges also can convert cryptocurrencies into US dollars or other government-backed currencies to be deposited into a traditional bank account.</p><h3>F</h3><p><strong>Fiat currency </strong><em>(noun)</em><strong><br></strong>the paper/coin currency of the government or region, typically declared as legal tender (eg. USD, EUR, CAD, GBP, etc).</p><p><strong>Floor</strong> <em>(noun)</em><br>the floor or floor price is the lowest price to buy an NFT on the secondary market.</p><p><strong>Fork </strong><em>(noun)</em><strong><br></strong>an update in the network protocol (the open-source software that runs blockchains)</p><h3>G</h3><p><strong>Gas and gas fees </strong><em>(noun)</em><strong><br></strong>transaction fees that users pay to miners on a blockchain protocol to have their transactions included in the block. The system works on a standard supply-and-demand mechanism. If there is a higher demand for transactions, miners may decide to include different levels of transactions, forcing users to pay more for more rapid and effective transaction processing.</p><p><strong>Gwei </strong><em>(noun)</em><strong><br></strong>a term for a very small amount of Ethereum cryptocurrency and commonly used when discussing and paying transactions fees on the Ethereum network. One Gwei is equal to 0.000000001 ETH.</p><h3>H</h3><p><strong>Hodl (or hodling) </strong><em>(verb)</em><strong><br></strong>a hold in the context of buying and holding Bitcoin and other cryptocurrencies. Hodl is derived from a misspelling of “hold” from a Bitcoin forum post from 2013.</p><h3>I</h3><p><strong>Impermanent loss </strong><em>(noun)<br></em>the loss that occurs when the tokens are in a liquidity pool compared to if they are just held in a crypto wallet is called impermanent loss. This type of loss is considered “impermanent” because it is only realized and becomes “permanent” when you withdraw the deposit. Interestingly enough, impermanent loss happens whichever way the price moves, no matter up or down. The bigger the change in price, the bigger the impermanent loss.</p><h3>K</h3><p><strong>KYC </strong><em>(noun)</em><strong><br>“</strong>know your customer “— the process of verifying a customer’s identity. Most commonly used by financial institutions and financial service businesses, including banks, stockbrokers, and cryptocurrency exchanges.</p><h3>L</h3><p><strong>Liquidity Pool </strong><em>(noun)</em><strong><br></strong>a platform where a pool of cryptocurrencies or tokens are crowdsourced and locked in a smart contract. And while being locked, they are being used as sources for loans for exchanges, and other applications.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*9518dzOt0dAKdxAEB5CG_w.png\" /></figure><h3>M</h3><p><strong>Mainnet </strong><em>(noun)</em><strong><br></strong>a blockchain that transfers a digital currency from a sender to a recipient. Mainnet is the main network; actual transactions take place on a distributed ledger.</p><p><strong>Metaverse </strong><em>(noun)</em><strong><br></strong>the metaverse is an expansive network of persistent, real-time rendered 3D worlds and simulations that support continuity of identity, objects, history, payments, and entitlements; can be experienced synchronously by an unlimited number of users, each with an individual sense of presence. More simply, a set of virtual spaces where people can create and explore with other people who aren’t in the same physical space. Decentraland and The Sandbox are two of the most popular metaverse platforms.</p><p><a href=\"https://www.techopedia.com/definition/32530/mining-blockchain\"><strong>Mining/miners</strong></a><strong> </strong><em>(verb)</em><strong><br></strong>the process of adding transactions to a large distributed public ledger of existing transactions known as a blockchain. Mining involves creating a hash of a block (a digital fingerprint) of transactions that cannot be easily forged, protecting the integrity of the entire blockchain without the need for a central system. The main incentive for mining is that individuals who choose to use a computer for mining are rewarded for doing so via cryptocurrency compensation. For example, bitcoin miners earn 25 bitcoin per hash.</p><p><strong>Minting </strong><em>(verb)</em><strong><br></strong>the process of turning a digital file into a crypto collectible or digital asset on a blockchain. The digital item or file is stored forever in this decentralized database or distributed ledger, and it is impossible to edit, modify, or delete. During the minting process, the creator of the NFT can schedule royalties from every subsequent sale.</p><h3>N</h3><p><strong>NFA </strong><em>(noun)</em><strong><br></strong>Not Financial Advice — a warning of the inherent risks to potential investors of cryptocurrency and NFT projects.</p><p><strong>NFT<br></strong>Non-Fungible Tokens — cryptographic assets on a blockchain with unique identification codes and metadata that distinguish them from each other. NFTs can also be used to represent real-world items like artwork and real estate.</p><p><strong>Node</strong> — a computer connected to a cryptocurrency network; can execute functions like creating, receiving, or sending information.</p><h3>P</h3><p><strong>P2P </strong><em>(noun)</em><strong><br></strong>peer-to-peer, a decentralized platform where two individuals interact without intermediation by a third party. The buyer and the seller transact directly with each other via the P2P service. The P2P platform may provide services such as search, screening, rating, payment processing, or escrow.</p><p><strong>PFP </strong><em>(noun)</em><strong><br></strong>profile picture — usually refers to a profile picture as an NFT.</p><p><strong>Play to earn </strong><em>(noun)</em><strong><br></strong>a business model for the video game industry that allows players to earn digital assets they can sell for money in a marketplace. Many of the assets are NFTs, such as a game skin, cool weapon, or an animal to breed.</p><p><strong>POAP </strong><em>(noun)</em><strong><br></strong>proof-of-attendance protocol — a system used to distribute crypto-badges to event attendees, course graduates, or something similar.</p><p><strong>Public/private key </strong><em>(noun)</em><strong><br></strong>allows users to send and receive cryptocurrency without requiring third-party verification. Together, the public and private keys form a key pair. Users keep their private keys a hidden but share their public keys in order to receive transactions. Any cryptocurrency linked to those private keys is accessible to anybody who has access to those keys. Private keys are not stored on the cryptocurrency blockchain network; instead, they are held in a digital wallet.</p><h3>S</h3><p><strong>Satoshi </strong><em>(noun)</em><strong><br></strong>the smallest fraction of coins in the Bitcoin cryptocurrency system. Named after Satoshi Nakamoto, the alias of the inventor of Bitcoin. One Satoshi is one-hundred-millionth (0.00000001) Bitcoin.</p><p><strong>Seed phrase </strong><em>(noun)</em><strong><br></strong>a series of words generated by the cryptocurrency wallet provider that gives the holder access to the crypto in their wallet. The list of 12 to 24 simple words is not a sentence (e.g., fiction, tree, cat, radio, stream, cloud, paper, cushion, abstract, bronze, pilot, orange).</p><p><strong>Sidechain </strong><em>(noun)</em><strong><br></strong>a separate blockchain that runs parallel to Layer 1 Blockchain and operates independently. It has its own consensus algorithm and is connected to Mainnet by a two-way bridge.</p><p><strong>Smart contracts </strong><em>(noun)</em><strong><br></strong>a tamper-proof program that runs on a blockchain network when certain predefined conditions are satisfied. Smart contracts enable multiple parties to reach a shared result in an accurate, timely, and tamper-proof manner by operating on a decentralized blockchain rather than a centralized server.</p><p><strong>Social token </strong><em>(noun)</em><strong><br></strong>community coins/token, creator coins — tokens issued by a community, creator, brand, or influencer; decentralized and secured by the blockchain.</p><p><strong>Staking </strong><em>(noun)</em><strong><br></strong>a way of earning rewards for holding certain cryptocurrencies. Cryptocurrencies allow staking using a “consensus mechanism” called proof of stake to ensure that all transactions are verified and secured without a bank or payment processor in the middle.</p><h3>T</h3><p><strong>Testnet </strong><em>(noun)<br></em>an alternative, value-less blockchain where developers can experiment with code and functions prior to application onto the network’s mainnet.</p><p><strong>Token </strong><em>(noun)</em><strong><br></strong>anything that has value or anything that can be exchanged for goods or services. Examples include fiat currency, cryptocurrency, NFTs, and gifts.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*DugXFbrSnpIjYL53Q00qUg.png\" /></figure><h3>W</h3><p><strong>Wallet </strong><em>(noun)</em><strong><br></strong>a digital wallet that facilitates transactions and holds cryptocurrency and NFTs. Wallets are necessary to purchase and trade NFTs and cryptocurrencies.</p><p><strong>Whale </strong><em>(noun)<br></em>an individual who holds a large amount of a particular cryptocurrency, social token, or NFT. A whale has enough coins or tokens to cause a significant impact on the market prices by selling or buying large amounts.</p><p>These were just some of the more common terms in Web3. However, the glossary keeps expanding so it’s helpful to stay updated with the industry lingo. There’s multiple websites that keep an updated Web3 Dictionary. Feel free to check two of my personal favorites — <a href=\"https://mhouse.club/dictionary/\">MHouse</a> &amp; <a href=\"https://web3.hashnode.com/glossary\">Hashnode</a>.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=5a71af20c973\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/reach-sh/abcs-of-web3-for-designers-5a71af20c973\">ABCs of Web3 for Designers</a> was originally published in <a href=\"https://medium.com/reach-sh\">Reach Platform</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>","content:encodedSnippet":"For Web3 to grow in popularity and expand beyond digital wallets and financial platforms, designers need to make Web3 apps more consistent and intuitive. They also have to provide more straightforward user education to help familiarize newcomers with novel features and interactions found on Web3 platforms.\nMaking DApps feel secure has to be a high priority too. It’s impossible to control the trustless, permissionless nature of Web3, but designers can predict what may go wrong and help prevent those occurrences. More transparent caveats about risks will go a long way to assuage people’s concerns and convince them to embrace Web3.\nHowever, to start doing that — designers need to have a good grasp of terms used on a day-to-day basis in Web3.\nLet’s go over the ABCs of Web3.\nA\nAddress (noun)\nalso referred to as wallet address or blockchain address — just like someone has a home and business address, a blockchain has an address to identify its location. A blockchain address is a long alphanumeric reference to access the precise location of the transaction’s home. It also can be where someone receives, sends, or holds their blockchain transactions. An example of a blockchain address is: 5TdA55HeLopzzwe3Lg7W335tGdCc623PoQ.\nAirdrop (noun, verb)\na specified amount of cryptocurrency, social tokens, or a new NFT dropped into a holder’s wallet for free or in exchange for minimal promotional work. It is a popular way for startups, NFT projects and social token creators to reward and engage their community.\nAltcoin (noun)\ninitially used to refer to any cryptocurrency that wasn’t Bitcoin, altcoin may now refer to any new cryptocurrency with a relatively small market cap.\nAlts (noun)\nshort for altcoins.\nATH- All Time High (noun)\nthe highest price an asset has ever had.\nATL- All Time Low (noun)\nthe lowest price an asset has ever had.\nB\nBlockchain (noun)\na distributed database shared among the nodes of a computer network. As a database, a blockchain stores information electronically in digital format. It’s an immutable database, which means that information can’t be tampered with or altered once it’s been recorded. If there’s an error in an entry, then a new, revised entry must be made, and both entries will subsequently be visible on the ledger.\nBridge in/bridge out (verb)\na blockchain bridge is a connection that allows the transfer of social tokens from one chain to another. Both chains can have distinct protocols, rules, and governance models, but the bridge provides a compatible way to conduct the transaction securely on both sides. For example, holders of Rally.io tokens can bridge out some (or all) of their holdings in the Rally sidechain to the Ethereum chain. From there, they can sell (or bridge) their Ethereum for currency.\nBurn (verb)\nthe process where tokens are removed from circulation. Coin burning is a market tool to increase the value of cryptocurrency.\n\nC\nCirculating supply (noun)\nthe number of cryptocurrency coins or tokens publicly available in the market.\nComposability (noun)\n the ability of decentralized applications (dApps) and DAOs to effectively clone and integrate one another.\nD\nDAO (noun)\nDecentralized Autonomous Organization — a community-led entity with no central authority. Ultimately, a DAO is run exclusively by its individual members, who jointly decide on important project issues including technical advancements and treasury allocations. Smart contracts set the ground rules, carry out the decisions reached by the community, and allow for public auditing at any time, making it completely autonomous and transparent.\nDApps (noun)\nDecentralized Applications — digital applications that run on a blockchain network of computers instead of relying on a single computer. Since DApps are decentralized, they are free from the control and interference of a single authority. Benefits of dApps include the safeguarding of user privacy, the lack of censorship, and the flexibility of development.\nDecentralized exchange — DEX (noun)\nDEX decentralized exchanges are smart contracts tailored for offering peer-to-peer transactions that ensure theoretically complete anonymity. This means the actual asset being exchanged never passes through the hands of an intermediary.\nDecentralized network (noun)\nin computing terms, a decentralized network architecture distributes workloads among several machines instead of relying on a single central server. No one company or company’s servers control the network. Decentralized networks offer a wide range of benefits over centralized networks, including increased system reliability, scale, and privacy.\nDegen (noun)\nnow an affectionate and self-assigned term that members of the crypto world refer to themselves and others. Even though it stems from Degenerate or Degenerative Gambler, it is generally used as a badge of honour without negative ideals. Degens can often be found at 4am staring at multiple screens, looking for the next token or NFT drop.\nE\nETH (noun)\nabbreviation for Ethereum cryptocurrency. Ethereum is a blockchain network with a decentralized public ledger for verifying and recording transactions. Its currency is Ether (ETH).\nExchange (noun)\na platform on which to buy and sell cryptocurrency. Users can trade one crypto for another or buy crypto using traditional currency. Exchanges also can convert cryptocurrencies into US dollars or other government-backed currencies to be deposited into a traditional bank account.\nF\nFiat currency (noun)\nthe paper/coin currency of the government or region, typically declared as legal tender (eg. USD, EUR, CAD, GBP, etc).\nFloor (noun)\nthe floor or floor price is the lowest price to buy an NFT on the secondary market.\nFork (noun)\nan update in the network protocol (the open-source software that runs blockchains)\nG\nGas and gas fees (noun)\ntransaction fees that users pay to miners on a blockchain protocol to have their transactions included in the block. The system works on a standard supply-and-demand mechanism. If there is a higher demand for transactions, miners may decide to include different levels of transactions, forcing users to pay more for more rapid and effective transaction processing.\nGwei (noun)\na term for a very small amount of Ethereum cryptocurrency and commonly used when discussing and paying transactions fees on the Ethereum network. One Gwei is equal to 0.000000001 ETH.\nH\nHodl (or hodling) (verb)\na hold in the context of buying and holding Bitcoin and other cryptocurrencies. Hodl is derived from a misspelling of “hold” from a Bitcoin forum post from 2013.\nI\nImpermanent loss (noun)\nthe loss that occurs when the tokens are in a liquidity pool compared to if they are just held in a crypto wallet is called impermanent loss. This type of loss is considered “impermanent” because it is only realized and becomes “permanent” when you withdraw the deposit. Interestingly enough, impermanent loss happens whichever way the price moves, no matter up or down. The bigger the change in price, the bigger the impermanent loss.\nK\nKYC (noun)\n“know your customer “— the process of verifying a customer’s identity. Most commonly used by financial institutions and financial service businesses, including banks, stockbrokers, and cryptocurrency exchanges.\nL\nLiquidity Pool (noun)\na platform where a pool of cryptocurrencies or tokens are crowdsourced and locked in a smart contract. And while being locked, they are being used as sources for loans for exchanges, and other applications.\n\nM\nMainnet (noun)\na blockchain that transfers a digital currency from a sender to a recipient. Mainnet is the main network; actual transactions take place on a distributed ledger.\nMetaverse (noun)\nthe metaverse is an expansive network of persistent, real-time rendered 3D worlds and simulations that support continuity of identity, objects, history, payments, and entitlements; can be experienced synchronously by an unlimited number of users, each with an individual sense of presence. More simply, a set of virtual spaces where people can create and explore with other people who aren’t in the same physical space. Decentraland and The Sandbox are two of the most popular metaverse platforms.\nMining/miners (verb)\nthe process of adding transactions to a large distributed public ledger of existing transactions known as a blockchain. Mining involves creating a hash of a block (a digital fingerprint) of transactions that cannot be easily forged, protecting the integrity of the entire blockchain without the need for a central system. The main incentive for mining is that individuals who choose to use a computer for mining are rewarded for doing so via cryptocurrency compensation. For example, bitcoin miners earn 25 bitcoin per hash.\nMinting (verb)\nthe process of turning a digital file into a crypto collectible or digital asset on a blockchain. The digital item or file is stored forever in this decentralized database or distributed ledger, and it is impossible to edit, modify, or delete. During the minting process, the creator of the NFT can schedule royalties from every subsequent sale.\nN\nNFA (noun)\nNot Financial Advice — a warning of the inherent risks to potential investors of cryptocurrency and NFT projects.\nNFT\nNon-Fungible Tokens — cryptographic assets on a blockchain with unique identification codes and metadata that distinguish them from each other. NFTs can also be used to represent real-world items like artwork and real estate.\nNode — a computer connected to a cryptocurrency network; can execute functions like creating, receiving, or sending information.\nP\nP2P (noun)\npeer-to-peer, a decentralized platform where two individuals interact without intermediation by a third party. The buyer and the seller transact directly with each other via the P2P service. The P2P platform may provide services such as search, screening, rating, payment processing, or escrow.\nPFP (noun)\nprofile picture — usually refers to a profile picture as an NFT.\nPlay to earn (noun)\na business model for the video game industry that allows players to earn digital assets they can sell for money in a marketplace. Many of the assets are NFTs, such as a game skin, cool weapon, or an animal to breed.\nPOAP (noun)\nproof-of-attendance protocol — a system used to distribute crypto-badges to event attendees, course graduates, or something similar.\nPublic/private key (noun)\nallows users to send and receive cryptocurrency without requiring third-party verification. Together, the public and private keys form a key pair. Users keep their private keys a hidden but share their public keys in order to receive transactions. Any cryptocurrency linked to those private keys is accessible to anybody who has access to those keys. Private keys are not stored on the cryptocurrency blockchain network; instead, they are held in a digital wallet.\nS\nSatoshi (noun)\nthe smallest fraction of coins in the Bitcoin cryptocurrency system. Named after Satoshi Nakamoto, the alias of the inventor of Bitcoin. One Satoshi is one-hundred-millionth (0.00000001) Bitcoin.\nSeed phrase (noun)\na series of words generated by the cryptocurrency wallet provider that gives the holder access to the crypto in their wallet. The list of 12 to 24 simple words is not a sentence (e.g., fiction, tree, cat, radio, stream, cloud, paper, cushion, abstract, bronze, pilot, orange).\nSidechain (noun)\na separate blockchain that runs parallel to Layer 1 Blockchain and operates independently. It has its own consensus algorithm and is connected to Mainnet by a two-way bridge.\nSmart contracts (noun)\na tamper-proof program that runs on a blockchain network when certain predefined conditions are satisfied. Smart contracts enable multiple parties to reach a shared result in an accurate, timely, and tamper-proof manner by operating on a decentralized blockchain rather than a centralized server.\nSocial token (noun)\ncommunity coins/token, creator coins — tokens issued by a community, creator, brand, or influencer; decentralized and secured by the blockchain.\nStaking (noun)\na way of earning rewards for holding certain cryptocurrencies. Cryptocurrencies allow staking using a “consensus mechanism” called proof of stake to ensure that all transactions are verified and secured without a bank or payment processor in the middle.\nT\nTestnet (noun)\nan alternative, value-less blockchain where developers can experiment with code and functions prior to application onto the network’s mainnet.\nToken (noun)\nanything that has value or anything that can be exchanged for goods or services. Examples include fiat currency, cryptocurrency, NFTs, and gifts.\n\nW\nWallet (noun)\na digital wallet that facilitates transactions and holds cryptocurrency and NFTs. Wallets are necessary to purchase and trade NFTs and cryptocurrencies.\nWhale (noun)\nan individual who holds a large amount of a particular cryptocurrency, social token, or NFT. A whale has enough coins or tokens to cause a significant impact on the market prices by selling or buying large amounts.\nThese were just some of the more common terms in Web3. However, the glossary keeps expanding so it’s helpful to stay updated with the industry lingo. There’s multiple websites that keep an updated Web3 Dictionary. Feel free to check two of my personal favorites — MHouse & Hashnode.\n\nABCs of Web3 for Designers was originally published in Reach Platform on Medium, where people are continuing the conversation by highlighting and responding to this story.","dc:creator":"Katarina Stefanovic","guid":"https://medium.com/p/5a71af20c973","categories":["crypto","product-design","glossary","blockhain","web3"],"isoDate":"2022-12-12T17:09:56.000Z","from":"https://medium.com/feed/reach-sh"},{"creator":"Aptos","title":"Securing Move","link":"https://aptoslabs.medium.com/securing-move-f81099f5e08c?source=rss-70211828fe2e------2","pubDate":"Mon, 12 Dec 2022 17:25:27 GMT","content:encoded":"<p><em>by Aptos Labs and OtterSec</em></p><p>The Aptos Network uses the Move smart contract language as the underlying programming model. While Move is designed for an ecosystem of secure smart contracts, a <em>faulty implementation of Move itself</em> can jeopardize those properties. At Aptos Labs, we are committed to making Move as secure as possible, together with the community. We are both investing in tools for writing correct smart contracts (e.g. the Move Prover, developed predominantly by Aptos), as well as the correctness of runtime core components like the Move Virtual Machine. In this article we describe how we, together with our partners, achieve the latter via auditing, bug bounties, fuzzing, and security hardening of the underlying implementation.</p><h3>What are we securing?</h3><p>Move’s security is based on a few basic properties. These properties are defined in terms of the <em>bytecode</em> that the Move execution engine consumes and are independent of the source language:</p><ul><li><strong>Type safety</strong>: Each value has a unique and unforgeable type. For example, it is not possible to take some value of type `address` and turn it into a security relevant token of type `signer`.</li><li><strong>Modular encapsulation</strong>: Resources in storage can only be manipulated from code within modules that are declaring those resources. Only functions with matching visibilities can be called cross-module.</li><li><strong>Ownership and lifetime</strong>: Move’s ability system enforces that a value is not copied, dropped, stored, or used as a key unless the corresponding ability is declared for the value type.</li><li><strong>Reference safety</strong>: References do not outlive the values that they are pointing to. A mutable reference is exclusively owned, such that aliasing is not possible.</li></ul><p>The traditional architecture of the Move virtual machine delegates validation of the above properties to the <em>(bytecode) verifier</em> as seen in the diagram below:</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/548/0*kNRSZ7ixRqD28pet\" /></figure><p>The following are the questions that we are interested in:</p><ol><li>Is the bytecode verifier <em>complete</em>, and does it guarantee that all of the properties above are satisfied for every program? This is important because violating any of the properties above can potentially result in the loss of assets.</li><li>Can a given Move bytecode program crash the execution engine? Because in a replicated state machine, all nodes execute the same programs, this can be used to halt the network.</li><li>Can a given program cause the execution engine to run out of resources (memory or time)? This can be exploited for DoS attacks slowing or suspending the network.</li></ol><h3>How are we doing it?</h3><p>At the core of developing bug-free code are disciplined software engineering practices paired with the right tools. At Aptos, we are following the rigorous process of mandatory code review and continuous testing and integration, combined with the best practices of the Rust ecosystem. In addition to these traditional aspects, we are also applying the following measurements to keep Move as safe as it is designed to be.</p><h3>Auditing and Consulting</h3><p>One of the most respected measurements in the industry to gain confidence in blockchain networks is auditing. At Aptos Labs, we contracted Certik (<a href=\"https://www.certik.com/projects/aptos\">report</a>) and Holburn for auditing the Move Virtual machine. Multiple critical issues were found, one of them in the category of type safety.</p><p>In addition to external auditing, Aptos Labs led and organized a community auditing effort, focused on the <em>bytecode</em> verifier. Engineers from Mysten Labs, Starcoin, and auditing companies like MoveBit and OtterSec teamed up with Aptos engineers for this effort, investing about 6 person weeks of auditing time. The results of this are captured<a href=\"https://docs.google.com/spreadsheets/d/1B0vRkM-UtZ2hICru6jwW08XmJUiP8-YuD1Z8HxVkfs4/edit?usp=sharing\"> in this spreadsheet</a>, referring to dozens of documents created during this audit. This auditing effort found and addressed multiple issues before Aptos hit mainnet.</p><p>Last, but not least, we have a close collaboration with <a href=\"https://osec.io/\">OtterSec</a>. The OtterSec team performed manual code reviews and developed fuzzing technology for various targets, identifying multiple critical issues in both the Move VM and Aptos framework code. They also led efforts to add redundant defense-in-depth logic to the Move VM (see below), influencing our ongoing design work to mitigate further loss of funds vulnerabilities.</p><h3>Bug Bounty</h3><p>Aptos Labs runs a <a href=\"https://github.com/aptos-labs/aptos-core/blob/main/SECURITY.md\">bug bounty program</a>. For critical bugs of the kind which can lead to loss of assets, bounties of up to $1,000,000 are offered. Similarly, crash bugs can be rewarded with up to $100,000.</p><p>With the bounty program, we have worked closely with a talented set of security researchers to find and fix bugs. A few of those bugs were in the critical category, while other bugs have been crashes found by using fuzzers.</p><p>Aptos Labs has stood to its commitments in bug bounties, and significant bounties were paid out. Moreover, Aptos Labs has continued to utilize the expertise of whitehats we met via the bounty program and intend on continuing to work together with this community.</p><h3>Fuzzing</h3><p>The bounty program motivated us to invest in fuzzing at Aptos Labs ourselves. The Move VM code has been modified to implement the `Arbitrary` Rust fuzzing trait at relevant points, thus enabling the use of ‘cargo fuzz’ to dynamically generate and validate bytecode modules.. We have a few continuous jobs running with those fuzzing targets.</p><h3>Redundancy</h3><p>One way to achieve extra assurance of security is via redundancy. We added a so-called <em>paranoid mode </em>to the Move VM, which enforces type safety and the other rules mentioned above at execution time. While the bytecode verifier already checks such properties when the code enters the system, the paranoid mode reverifies the same checks again during bytecode execution time. The paranoid mode was extensively discussed within the Move community, with Aptos engineers leading the design. For more information see <a href=\"https://github.com/move-language/move/pull/642\">this PR</a> (final version) and <a href=\"https://github.com/move-language/move/pull/598\">this PR</a> (intermediate version).</p><h3>What’s next?</h3><p>At Aptos Labs, we are committed to making Move as secure as possible, and invested heavily into this area. Here we described ongoing efforts around auditing, bug bounties, fuzzing, and hardening conducted by us and our partners. Moving forward, we plan to continue to invest in this space. We will continue to offer a bug bounty program, engage with reputable security auditors, and drive development of security hardening tools, e.g., fuzzing technology.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=f81099f5e08c\" width=\"1\" height=\"1\" alt=\"\">","content:encodedSnippet":"by Aptos Labs and OtterSec\nThe Aptos Network uses the Move smart contract language as the underlying programming model. While Move is designed for an ecosystem of secure smart contracts, a faulty implementation of Move itself can jeopardize those properties. At Aptos Labs, we are committed to making Move as secure as possible, together with the community. We are both investing in tools for writing correct smart contracts (e.g. the Move Prover, developed predominantly by Aptos), as well as the correctness of runtime core components like the Move Virtual Machine. In this article we describe how we, together with our partners, achieve the latter via auditing, bug bounties, fuzzing, and security hardening of the underlying implementation.\nWhat are we securing?\nMove’s security is based on a few basic properties. These properties are defined in terms of the bytecode that the Move execution engine consumes and are independent of the source language:\n\nType safety: Each value has a unique and unforgeable type. For example, it is not possible to take some value of type `address` and turn it into a security relevant token of type `signer`.\nModular encapsulation: Resources in storage can only be manipulated from code within modules that are declaring those resources. Only functions with matching visibilities can be called cross-module.\nOwnership and lifetime: Move’s ability system enforces that a value is not copied, dropped, stored, or used as a key unless the corresponding ability is declared for the value type.\nReference safety: References do not outlive the values that they are pointing to. A mutable reference is exclusively owned, such that aliasing is not possible.\n\nThe traditional architecture of the Move virtual machine delegates validation of the above properties to the (bytecode) verifier as seen in the diagram below:\n\nThe following are the questions that we are interested in:\n\nIs the bytecode verifier complete, and does it guarantee that all of the properties above are satisfied for every program? This is important because violating any of the properties above can potentially result in the loss of assets.\nCan a given Move bytecode program crash the execution engine? Because in a replicated state machine, all nodes execute the same programs, this can be used to halt the network.\nCan a given program cause the execution engine to run out of resources (memory or time)? This can be exploited for DoS attacks slowing or suspending the network.\n\nHow are we doing it?\nAt the core of developing bug-free code are disciplined software engineering practices paired with the right tools. At Aptos, we are following the rigorous process of mandatory code review and continuous testing and integration, combined with the best practices of the Rust ecosystem. In addition to these traditional aspects, we are also applying the following measurements to keep Move as safe as it is designed to be.\nAuditing and Consulting\nOne of the most respected measurements in the industry to gain confidence in blockchain networks is auditing. At Aptos Labs, we contracted Certik (report) and Holburn for auditing the Move Virtual machine. Multiple critical issues were found, one of them in the category of type safety.\nIn addition to external auditing, Aptos Labs led and organized a community auditing effort, focused on the bytecode verifier. Engineers from Mysten Labs, Starcoin, and auditing companies like MoveBit and OtterSec teamed up with Aptos engineers for this effort, investing about 6 person weeks of auditing time. The results of this are captured in this spreadsheet, referring to dozens of documents created during this audit. This auditing effort found and addressed multiple issues before Aptos hit mainnet.\nLast, but not least, we have a close collaboration with OtterSec. The OtterSec team performed manual code reviews and developed fuzzing technology for various targets, identifying multiple critical issues in both the Move VM and Aptos framework code. They also led efforts to add redundant defense-in-depth logic to the Move VM (see below), influencing our ongoing design work to mitigate further loss of funds vulnerabilities.\nBug Bounty\nAptos Labs runs a bug bounty program. For critical bugs of the kind which can lead to loss of assets, bounties of up to $1,000,000 are offered. Similarly, crash bugs can be rewarded with up to $100,000.\nWith the bounty program, we have worked closely with a talented set of security researchers to find and fix bugs. A few of those bugs were in the critical category, while other bugs have been crashes found by using fuzzers.\nAptos Labs has stood to its commitments in bug bounties, and significant bounties were paid out. Moreover, Aptos Labs has continued to utilize the expertise of whitehats we met via the bounty program and intend on continuing to work together with this community.\nFuzzing\nThe bounty program motivated us to invest in fuzzing at Aptos Labs ourselves. The Move VM code has been modified to implement the `Arbitrary` Rust fuzzing trait at relevant points, thus enabling the use of ‘cargo fuzz’ to dynamically generate and validate bytecode modules.. We have a few continuous jobs running with those fuzzing targets.\nRedundancy\nOne way to achieve extra assurance of security is via redundancy. We added a so-called paranoid mode to the Move VM, which enforces type safety and the other rules mentioned above at execution time. While the bytecode verifier already checks such properties when the code enters the system, the paranoid mode reverifies the same checks again during bytecode execution time. The paranoid mode was extensively discussed within the Move community, with Aptos engineers leading the design. For more information see this PR (final version) and this PR (intermediate version).\nWhat’s next?\nAt Aptos Labs, we are committed to making Move as secure as possible, and invested heavily into this area. Here we described ongoing efforts around auditing, bug bounties, fuzzing, and hardening conducted by us and our partners. Moving forward, we plan to continue to invest in this space. We will continue to offer a bug bounty program, engage with reputable security auditors, and drive development of security hardening tools, e.g., fuzzing technology.","dc:creator":"Aptos","guid":"https://medium.com/p/f81099f5e08c","categories":["technology","aptos","crypto","web3","blockchain"],"isoDate":"2022-12-12T17:25:27.000Z","from":"https://aptoslabs.medium.com/feed"},{"creator":"Cointelegraph By Turner Wright","title":"NYC Mayor stands by Bitcoin pledge amid bear market, FTX: Report","link":"https://cointelegraph.com/news/nyc-mayor-stands-by-bitcoin-pledge-amid-bear-market-ftx-report","pubDate":"Mon, 12 Dec 2022 17:30:00 +0000","enclosure":{"url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvMmUwYzJhZTEtOWYyYi00NGU4LWEwN2EtYTUwZmY0NDNlYzkyLmpwZw==.jpg","length":"840","type":"image/jpg"},"dc:creator":"Cointelegraph By Turner Wright","content":"\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvMmUwYzJhZTEtOWYyYi00NGU4LWEwN2EtYTUwZmY0NDNlYzkyLmpwZw==.jpg\"></p><p>During Eric Adams’ time in office, the NY state government passed a law which will implement a two-year moratorium on proof-of-work mining, and the crypto market turned bearish.</p>\n            ","contentSnippet":"During Eric Adams’ time in office, the NY state government passed a law which will implement a two-year moratorium on proof-of-work mining, and the crypto market turned bearish.","guid":"https://cointelegraph.com/news/nyc-mayor-stands-by-bitcoin-pledge-amid-bear-market-ftx-report","categories":["regulation","new york","eric adams","united states","bitcoin payments"],"isoDate":"2022-12-12T17:30:00.000Z","from":"https://cointelegraph.com/rss"},{"creator":"Jack Schickler","title":"Pro-Crypto EU Lawmaker Eva Kaili Set to Lose Vice-Presidency Amid Corruption Probe","link":"https://www.coindesk.com/policy/2022/12/12/pro-crypto-eu-lawmaker-eva-kaili-set-to-lose-vice-presidency-amid-corruption-probe/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","pubDate":"Mon, 12 Dec 2022 17:33:30 +0000","dc:creator":"Jack Schickler","content":"Kaili, actively involved in European Parliament discussions on cryptocurrency and NFTs, has already been suspended from her party following allegations of lobbying by Qatar","contentSnippet":"Kaili, actively involved in European Parliament discussions on cryptocurrency and NFTs, has already been suspended from her party following allegations of lobbying by Qatar","guid":"QI3Q55F75BBTHKQSQ34C5IB72U","categories":[{"_":"Policy","$":{"domain":"https://www.coindesk.com/policy/"}}],"isoDate":"2022-12-12T17:33:30.000Z","from":"http://feeds.feedburner.com/Coindesk"}]