[{"title":"The Smart Contracting Brain","link":"https://mirror.xyz/0xa29FDDEc9C36BDD680D3f5867735ff8949a7F15D/SuoUHgHf_ldyAEr4f3g52jS8Fsg68P_d-odGPeqx8yY","pubDate":"Wed, 21 Dec 2022 20:06:10 GMT","content:encoded":"<p><em>Note: I am not a mathematician nor a physicist. I make observations, understand concepts, and I apply what I learn. This leads me to recognize patterns.</em></p>\n<h3 id=\"what-are-smart-contracts\">What are Smart Contracts?</h3>\n<blockquote>\n<p><em>Like how a vending machine removes the need for a vendor employee, Smart Contracts can replace intermediaries in many industries.</em></p>\n</blockquote>\n<p>Smart Contracts <em><strong>transform the relationship</strong></em> between <strong>Labor</strong> and <strong>Capital</strong>. Abstract concepts like these can be understood by analogy and metaphor.</p>\n<h3 id=\"background\">Background</h3>\n<p>In the 1950s, John Nash described how high-speed computers of the future would scale to implement what he called “<strong>Parallel Control</strong>.” The outlined structure was comprised of a communication network, “an apparatus analogous to an automatic telephone system.”</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/RnTSCgjdcdQ-9MGRn1gjK.png?height=621&width=951\" alt=\"\"></p>\n<p>This machine would have an elaborate configuration of component parts such as input &amp; output units, memory units, and logical units. <em>“The basic idea is simple. Instead of having a single unit sequencing operations of the machine in series…the idea is to <strong>decentralize</strong> control with several different control units capable of directing various simultaneous operations and interrelating them when appropriate.”</em></p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/bLPoA1K5Yzi1XHqhO43hI.png?height=686&width=926\" alt=\"\"></p>\n<p>Citing numerous advantages of such a system: Speed of Computation, Expansibility, Self-Maintenance, and a certain Programmable “Intelligence,” the paper summarizes how <em>commands</em> would interact with <em>addresses</em>. Nash seemingly outlines a blueprint consistent with a description of Ethereum, and goes on to conclude that the human brain “is a <strong>highly parallel setup</strong>. It has to be.”</p>\n<h3 id=\"predictive-coding-and-message-passing\">Predictive Coding and Message Passing</h3>\n<p>Fast forwarding to the 21st century in the world of computational neuroscience, the Nervous System has been found to continuously engage in a process of “message passing.” This perspective is illuminated by the Free Energy Principle and Active Inference framework.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/baXUjk5sFzpCu8_qWeqXC.png?height=521&width=980\" alt=\"\"></p>\n<p>The aim of this “game of telephone” is to minimize Prediction Errors, or Surprise, about the future. <em>“We are not simply making sense of our sensations; we have to <strong>actively create</strong> our sensorium.”</em> As depicted above, this game is played out within each neuronal micro-interaction. It also unfolds at the macro level with the Nervous System, as we continuously interact with the world through <strong>Action-Perception Loops</strong>.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/knOwTK3FFpgSZSFYeQbZV.png?height=1208&width=1740\" alt=\"\"></p>\n<p>In this framework, the systems are cybernetic and they process inputs &amp; outputs. Thus, every neuron functions as a unit that is computing inputs into outputs – it is <strong>executing logic</strong>. Ascending Prediction Errors that are carried forward are complemented by retrograde descending Predictions.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/QvmYSN4bwAyhJg6zIW8mD.png?height=825&width=641\" alt=\"Ascending messages originating from error units have been found to correlate with gamma frequency neuronal firing, while descending messages originating from expectation units matched with alpha and beta firing patterns. Variations of this dynamic are likely numerous.\"></p>\n<p>In the simplest sense, neurons are executing logic. Binary 0s and 1s are integrated as <strong>de-polarization</strong> and <strong>hyper-polarization</strong>. These signals are first registered at the boundary between us and the outside – the <strong>Markov Blanket</strong>. These inputs enter our Nervous System through the five senses.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/Ipkk1V48UrKAH0YOB8znO.png?height=1966&width=2124\" alt=\"\"></p>\n<p>These electrical 0s and 1s are transduced into intracellular signals that cascade in a multitude of directions to accommodate demand. <em>E.g., increase ATP synthesis; modulate cytoskeletal infrastructure; up or down-regulate neurotransmitter production at the terminal end of dendrites; modify gene transcription; etc.</em></p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/eJ8t6yNoDTOFY3X3spSR1.png?height=717&width=1080\" alt=\"\"></p>\n<p>Simultaneously, electrical energy travels down the length of axons as Action Potentials, racing through the nodes of Ranvier to arrive at the pre-synaptic end.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/xczVrhfrH9IV5xx4eqLsT.gif?height=570&width=800\" alt=\"\"></p>\n<p>Here at the pre-synaptic terminal, neurotransmitters are released and the signals are predictively coded again.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/2muUI2rjtZv987NNsXvAT.gif?height=240&width=320\" alt=\"\"></p>\n<p>This happens on the order of micro and milli seconds, as information is distributed throughout a network of 86 billion neurons. The output is a thoroughly sophisticated simulation of reality - an Active Inference of the dynamic universe.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/66_Ry4n5Ljai2spj5TWHq.gif?height=251&width=448\" alt=\"\"></p>\n<h3 id=\"labor-and-capital\">Labor and Capital</h3>\n<p>Throughout this perpetually unfolding process, Neurotransmitters exhibit properties of Money. Neurotransmitter exchange, then, appears to simulate an <strong>accounting</strong> system between the interacting neurons.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/63AQ3wi8KSNvn8owfXefQ.png?height=828&width=1315\" alt=\"https://bhau.substack.com/p/moneyness-of-eth-and-neurotransmitters\"></p>\n<p>What might be the purpose?</p>\n<p>From the <strong>pre-synaptic neuron’s perspective</strong>, to relay information: <em>“this number of charges entered our cell, and we used them to complete tasks x, y, and z; and here are our neurotransmitters as a token of this proof.”</em> This internal “<strong>labor</strong>” is expensed with “<strong>capital</strong>” in the form of Neurotransmitters that travel across the synapse to exert their action by binding to corresponding receptors.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/DBpzXpAl7-vuPrZ_Gacqp.png?height=1752&width=1856\" alt=\"\"></p>\n<p>Why might this be accepted by the post-synaptic neuron? From the <strong>post-synaptic neuron’s perspective</strong>: <em>“these neurotransmitters are accepted as the proof-of-work you performed internally to minimize your free energy (ascending prediction error), and you are the most proximal thing to us that will help us to minimize our own free energy as well. Besides if you lie, cheat, or in good faith happen to be wrong or partially correct, then we have distributed consensus with other neurons to check this since we’re all updating our databases in real time. Retrograde neurotransmission can be enacted by chemical messengers like endocannabinoids (descending prediction). We may elect to allocate a similar capital reserve of neurotransmitters at our pre-synaptic terminals (upstream ascending prediction errors carried forward).”</em></p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/R3hIrWauq_7bJBedXGpz6.png?height=1031&width=1008\" alt=\"\"></p>\n<p>The exchange of Neurotransmitters begins to resemble the <em><strong>transference of utility</strong></em> from one “ledger” to another.</p>\n<p>This makes sense when we contextualize the Active Inference framework:</p>\n<blockquote>\n<p>“...everything that we perceive, do, or plan is in the compass of one existential imperative - <strong>self-evidencing</strong>.”</p>\n</blockquote>\n<p>In this way, the individual Markov Blanket for each neuron expands to encompass both neurons, and all other neurons in the Nervous System. The divergences in the neurons’ Action-Perception loops are minimized. Free Energy is more minimized; <em>more</em> minimized because optimality is elusive.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/z9QRwuRmJePQQdSCslVQe.png?height=1868&width=1596\" alt=\"\"></p>\n<p><strong>A peer-to-peer agreement on the mutual allocation of labor and capital appears to be conducted with distributed consensus</strong>. Evidently, scale is unlocked without the interfering presence of value-extracting middlemen.</p>\n<p>Discrepancy – Uncertainty – between neurons is contained further by stabilizing the “price” of these neurotransmitters. I.e., the amount of charge carried forward by each neurotransmitter binding to its corresponding receptor is generally specified and therefore predictable. <em>E.g., Glutamate binding to NMDA receptor will trigger the release of calcium ions into the neuron, leading to depolarization and potentially, Action Potentials.</em> The confidence ~ <strong>certainty</strong> ~ in this fact that the simultaneous binding of glutamate and glycine to the NMDA receptor will <em><strong>reliably induce a +2-mV change</strong></em> (for instance) in the resting membrane potential, appears to <em><strong>embody</strong></em> an important mechanism for the Nervous System to systemically minimize Risk and Prediction Errors.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/Etb_1r-Pst4W9TFTguYbJ.png?height=913&width=975\" alt=\"Note: Synapses are far more complicated than depicted here, and significant components like glial cells and astrocytes were excluded for clarity.\"></p>\n<p>If more unit charges are demanded, <em>neurons will produce more Neurotransmitters</em> by way of Neuroplasticity. <em><strong>Neurons that fire together, wire together; neurons out of sync, fail to link.</strong></em> Long-Term Potentiation (LTP) strengthens the synapse of neurons, inducing an increased capacity and probability of Neurotransmitter vesicle release ~ <em><strong>stronger electrical responses</strong></em> to stimuli. The opposite process is Long-Term Depression (LTD). These processes drive learning and memory.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/U8SMRz4WaZgAOBQ116lu9.gif?height=371&width=660\" alt=\"\"></p>\n<p>In this game of message passing, the game theoretic solution entails modulation of neurotransmitter <strong>supply</strong> to accommodate efficiency in the transactional economy. <em><strong>Money is “lubrication which enables the efficient transfer of utility,”</strong></em> wrote Nash. Price stability and value storage is therefore emergent, as this too promotes free energy minimization; <em>i.e., uncertainty pertaining to error and expectation units in predictive coding.</em></p>\n<h3 id=\"smart-contract-mechanisms\">Smart Contract Mechanisms</h3>\n<p>Something similar happens as nodes on the Ethereum network interact with each other. The nodes communicate by transacting the digital asset ETH. In addition to the accounting of balances, there is distributed consensus around the <em><strong>logic executed</strong></em> within the Ethereum Virtual Machine (EVM). There appears to be a transference of utility.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/QyiMIeQYCeIuWX7g8OEsY.png?height=1848&width=1172\" alt=\"In the Nervous System, neurotransmission is coupled with second messenger cascades - capital exchange is paired with intracellular labor. On Ethereum, capital exchange is paired with logic execution in the EVM.\"></p>\n<p>The accounting of balances – <em><strong>value exchange</strong></em> – without an intermediary is a feature of public blockchains that was pioneered by Bitcoin. On Ethereum, this peer-to-peer characteristic has been designated as <strong>Trustlessness</strong>.</p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/iBHfm7zYeX6VzfqP1qo5V.png?height=220&width=840\" alt=\"https://ethereum.org/en/glossary/#trustlessness\"></p>\n<p>The network is trustless because participants don’t really need to <em>know</em> the other participants, so long as they adhere to the rules of the game; the <strong>consensus algorithm</strong> – Proof-of-Work (<strong>PoW</strong>) on Bitcoin, and Proof-of-Stake (<strong>PoS</strong>) on Ethereum.</p>\n<p>On Ethereum, trustless value exchange is coupled with trustless execution of logic in the EVM. The execution of this logic is an agreement between two or more parties, and the agreements are enforced by computer programs - these are known as Smart Contracts. <em>A Smart Contract resembles a digital vending machine that does not need a vendor employee.</em></p>\n<p><img src=\"https://images.mirror-media.xyz/publication-images/i8Q26B9rGSVzDwlOSOJUA.png?height=682&width=606\" alt=\"https://ethereum.org/en/developers/docs/smart-contracts/#a-digital-vending-machine\"></p>\n<p>Ethereum Smart Contracts enforce agreement regarding the <em><strong>individual and collective capital allocation of ETH</strong></em> expensed towards the “labor performed” ~ logic executed, in the EVM.  <em>E.g., EIP-1559 automatic fee burn accompanying every transaction.</em></p>\n<p>What kind of labor can be performed by Smart Contracts? The kind of labor that changes the world for the better.</p>\n<p>Smart Contracts already uphold an alternative decentralized finance system which is <strong>free of rent-seeking intermediaries</strong>, <strong>open to all</strong> (<em>permission-less &amp; censorship resistant</em>), and <strong>credibly neutral</strong> (<em>enabled by the transparency of public blockchain transactions; e.g., <a href=\"http://etherscan.io\">etherscan.io</a></em>). Quite frankly, these programs have replaced the work of stockbrokers, market makers, loan officers, and related middlemen.</p>\n<h3 id=\"concluding-thoughts\">Concluding Thoughts</h3>\n<p>On Ethereum, Information is Value, ETH is Capital, and Smart Contract function is Labor. The relationship between labor and capital is that of <em><strong>real-time auditing</strong></em> and expensing of capital, programmatically linked with the performance of labor and its <em><strong>verification</strong></em> on a transparent public ledger. Today, these programs execute logic that enables collateralized debt positions (CDPs), lending &amp; borrowing, automated market makers (AMMs), decentralized exchanges (DEXs), liquidity pools (LPs), perpetual future swaps, on-chain options, yield-splitting, self-repaying loans, and numerous innovations growing daily. <em><strong>Tomorrow, Smart Contracts will unlock a world wherein we can all be rewarded with capital for the performance of everyday labors.</strong></em> With middlemen removed from the equation, inputs like healthy eating, exercising, and <a href=\"https://mirror.xyz/bhau.eth/bmvuFY-vGbNC-WoCAThQkCbTnuM_qwkAzACoigCGO9I\">sleeping</a> can be configured to materialize mathematical concepts like <a href=\"https://en.wikipedia.org/wiki/Shapley_value#Value_of_a_player_to_another_player\">value surplus</a> for the network. The collectively created value can be redistributed back to those who contributed, as it is today to those who provide liquidity on DEXs like Uniswap in DeFi.</p>\n<p>In the Nervous System, Information is Value, Neurotransmitters are Capital, and Predictive Coding is Labor. Evolutionary design has iteratively sophisticated the mechanisms for minimizing inefficiencies associated with pairing labor &amp; capital in large-scale commerce. I am therefore keenly exploring the behaviors of elastic supply digital assets in DeFi. Like Neurotransmitters that increase/decrease in supply to accommodate neuroplasticity demand through mechanisms such as LTP or LTD, these assets maintain a stable price by transforming their price volatility into supply volatility through a mechanism known as Rebase. And more recently, a new primitive known as Tranche has offered even more ways to minimize uncertainty and promote price stability. <em><strong>These systems provide zero-liquidations and protection from cascading market-wide unwindings</strong></em>.</p>\n<p>Again it must be emphasized, <em><strong>middlemen/3rd parties are absent in both systems</strong></em>. Smart Contracts transform the relationship between labor &amp; capital, and enable the Markov Blanket to expand and instill <strong>Trust</strong> amongst network participants (nodes and neurons). The network itself becomes the “3rd party.”</p>\n<blockquote>\n<p><em>At this time, onboarding the world to web3 with Decentralized Identity (DID) can expand the Markov Blanket of Trust amongst people and communities. E.g., in healthcare, identity credentialing is conducted by 3rd parties who engage in rent-seeking behaviors and value extraction. Combining DID with elastic DeFi infrastructure that will facilitate efficient transferences of utility for the systems of tomorrow, seems like a natural next step.</em></p>\n</blockquote>\n<h3 id=\"references\">References</h3>\n<p>Most of the reference material was sourced from <a href=\"https://ethereum.org/en/\">Ethereum.org</a> and the works of John Nash et al. and Karl Friston et al. Namely:</p>\n<ul>\n<li><p><em><a href=\"https://www.rand.org/content/dam/rand/pubs/research_memoranda/2008/RM1361.pdf\">Parallel Control</a></em></p>\n</li>\n<li><p><em><a href=\"https://www.google.com/search?q=active+inference+book&amp;client=safari&amp;rls=en&amp;sxsrf=ALiCzsa0rV_47NWltfX7UZ3mZwJubLtwnw%3A1671652547427&amp;ei=w2SjY5CdGczZ5NoPxpeN8AM&amp;gs_ssp=eJzj4tVP1zc0LDTKyTDNTTIxYPQSTUwuySxLVcjMS0stSs1LTlVIys_PBgDjpwyU&amp;oq=active+inference+&amp;gs_lcp=Cgxnd3Mtd2l6LXNlcnAQARgBMgQIIxAnMgUILhCABDIFCAAQgAQyBQgAEIAEMgUIABCABDIFCAAQgAQyBQgAEIAEMgUIABCABDIFCAAQgAQyBQgAEIAEOgUIABCRAjoRCC4QgAQQsQMQgwEQxwEQ0QM6CwgAEIAEELEDEIMBOgsILhCDARDUAhCxAzoLCC4QgAQQsQMQgwE6BAgAEEM6EAgAEIAEEIcCELEDEIMBEBQ6CgguEIAEEIcCEBQ6DgguEIAEELEDEMcBENEDOgoIABCxAxCDARBDOhMILhCABBCHAhCxAxDHARCvARAUOggIABCABBCxAzoKCAAQgAQQsQMQCjoHCAAQgAQQCjoICC4QgAQQ1AJKBAhBGAFKBAhGGABQ_AZY_iNgoC1oA3AAeACAAZICiAGyEJIBBTYuOS4ymAEAoAEBwAEB&amp;sclient=gws-wiz-serp#ip=1\">Active Inference: The Free Energy Principle in Mind, Brain, and Behavior</a></em></p>\n</li>\n<li><p><em><a href=\"http://web.math.princeton.edu/jfnj/texts_and_graphics/Main.Content/IDEAL_MONEY.../Lindau.2008/IyAIMoney.landscape.2008.812.rm.pdf\">Ideal Money and Asymptotically Ideal Money</a></em></p>\n</li>\n<li><p><em><a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;ved=2ahUKEwjQipuCv4v8AhXMLFkFHcZLAz4QFnoECAsQAQ&amp;url=http%3A%2F%2Fweb.math.princeton.edu%2Fjfnj%2Ftexts_and_graphics%2FMain.Content%2FAGENCIES_and_COOPERATIVE_GAMES%2FIGTR.World.Scientific.publication%2Fpubfiles%2FGT%2FOG.etc%2FPaper%2FPaper.starting%2Fcombo.xd.doc.gz&amp;usg=AOvVaw1A1J_-SjoFnA9ghVTdERfo\">First Report on a Project to Study Cooperation in Games by Means of Modeling in Terms of Formally Non-Cooperative Action in a Repeated Game Context</a></em></p>\n</li>\n</ul>\n<h2 id=\"related-content\">Related Content:</h2>\n<p><a href=\"https://bhau.substack.com/p/traditional-contracts-and-the-violation\">Traditional Contracts and the Violation of Justice in Medicine</a>\n<a href=\"https://bhau.substack.com/p/the-value-of-trustlessness\">Value of Trustlessness</a>\n<a href=\"https://bhau.substack.com/p/moneyness-of-eth-and-neurotransmitters\">Moneyness of ETH and Neurotransmitters</a>\n<a href=\"https://www.youtube.com/watch?v=yWsURAZ8vSo\">Neuroscience of Ethereum: Active Inference</a>\n<a href=\"https://www.youtube.com/watch?v=FRJ4YMCMtzA\">Zero Liquidation Loans</a>\n<a href=\"https://www.youtube.com/watch?v=5ah5lRmaUAo\">Mechanized Vaults and Inflation Resistance</a>\n<a href=\"https://www.instagram.com/p/CmDA2PYse6_/?igshid=YmMyMTA2M2Y=\">AMPL Fundamentals</a>\n<a href=\"https://typefully.com/Bhau_jagmd/free-energy-and-risk-minimization-by-ampl-spot-K3NAVw6\">AMPL-SPOT Risk</a>\n<a href=\"https://typefully.com/Bhau_jagmd/the-risk-of-spot-Ey3giJ6\">Risk of SPOT</a></p>\n<hr>\n<p><em>If you find submirror valuable, please consider donate to wong2.eth to help cover server cost.</em></p>\n","content:encodedSnippet":"Note: I am not a mathematician nor a physicist. I make observations, understand concepts, and I apply what I learn. This leads me to recognize patterns.\nWhat are Smart Contracts?\nLike how a vending machine removes the need for a vendor employee, Smart Contracts can replace intermediaries in many industries.\nSmart Contracts transform the relationship between Labor and Capital. Abstract concepts like these can be understood by analogy and metaphor.\nBackground\nIn the 1950s, John Nash described how high-speed computers of the future would scale to implement what he called “Parallel Control.” The outlined structure was comprised of a communication network, “an apparatus analogous to an automatic telephone system.”\n\nThis machine would have an elaborate configuration of component parts such as input & output units, memory units, and logical units. “The basic idea is simple. Instead of having a single unit sequencing operations of the machine in series…the idea is to decentralize control with several different control units capable of directing various simultaneous operations and interrelating them when appropriate.”\n\nCiting numerous advantages of such a system: Speed of Computation, Expansibility, Self-Maintenance, and a certain Programmable “Intelligence,” the paper summarizes how commands would interact with addresses. Nash seemingly outlines a blueprint consistent with a description of Ethereum, and goes on to conclude that the human brain “is a highly parallel setup. It has to be.”\nPredictive Coding and Message Passing\nFast forwarding to the 21st century in the world of computational neuroscience, the Nervous System has been found to continuously engage in a process of “message passing.” This perspective is illuminated by the Free Energy Principle and Active Inference framework.\n\nThe aim of this “game of telephone” is to minimize Prediction Errors, or Surprise, about the future. “We are not simply making sense of our sensations; we have to actively create our sensorium.” As depicted above, this game is played out within each neuronal micro-interaction. It also unfolds at the macro level with the Nervous System, as we continuously interact with the world through Action-Perception Loops.\n\nIn this framework, the systems are cybernetic and they process inputs & outputs. Thus, every neuron functions as a unit that is computing inputs into outputs – it is executing logic. Ascending Prediction Errors that are carried forward are complemented by retrograde descending Predictions.\n\nIn the simplest sense, neurons are executing logic. Binary 0s and 1s are integrated as de-polarization and hyper-polarization. These signals are first registered at the boundary between us and the outside – the Markov Blanket. These inputs enter our Nervous System through the five senses.\n\nThese electrical 0s and 1s are transduced into intracellular signals that cascade in a multitude of directions to accommodate demand. E.g., increase ATP synthesis; modulate cytoskeletal infrastructure; up or down-regulate neurotransmitter production at the terminal end of dendrites; modify gene transcription; etc.\n\nSimultaneously, electrical energy travels down the length of axons as Action Potentials, racing through the nodes of Ranvier to arrive at the pre-synaptic end.\n\nHere at the pre-synaptic terminal, neurotransmitters are released and the signals are predictively coded again.\n\nThis happens on the order of micro and milli seconds, as information is distributed throughout a network of 86 billion neurons. The output is a thoroughly sophisticated simulation of reality - an Active Inference of the dynamic universe.\n\nLabor and Capital\nThroughout this perpetually unfolding process, Neurotransmitters exhibit properties of Money. Neurotransmitter exchange, then, appears to simulate an accounting system between the interacting neurons.\n\nWhat might be the purpose?\nFrom the pre-synaptic neuron’s perspective, to relay information: “this number of charges entered our cell, and we used them to complete tasks x, y, and z; and here are our neurotransmitters as a token of this proof.” This internal “labor” is expensed with “capital” in the form of Neurotransmitters that travel across the synapse to exert their action by binding to corresponding receptors.\n\nWhy might this be accepted by the post-synaptic neuron? From the post-synaptic neuron’s perspective: “these neurotransmitters are accepted as the proof-of-work you performed internally to minimize your free energy (ascending prediction error), and you are the most proximal thing to us that will help us to minimize our own free energy as well. Besides if you lie, cheat, or in good faith happen to be wrong or partially correct, then we have distributed consensus with other neurons to check this since we’re all updating our databases in real time. Retrograde neurotransmission can be enacted by chemical messengers like endocannabinoids (descending prediction). We may elect to allocate a similar capital reserve of neurotransmitters at our pre-synaptic terminals (upstream ascending prediction errors carried forward).”\n\nThe exchange of Neurotransmitters begins to resemble the transference of utility from one “ledger” to another.\nThis makes sense when we contextualize the Active Inference framework:\n“...everything that we perceive, do, or plan is in the compass of one existential imperative - self-evidencing.”\nIn this way, the individual Markov Blanket for each neuron expands to encompass both neurons, and all other neurons in the Nervous System. The divergences in the neurons’ Action-Perception loops are minimized. Free Energy is more minimized; more minimized because optimality is elusive.\n\nA peer-to-peer agreement on the mutual allocation of labor and capital appears to be conducted with distributed consensus. Evidently, scale is unlocked without the interfering presence of value-extracting middlemen.\nDiscrepancy – Uncertainty – between neurons is contained further by stabilizing the “price” of these neurotransmitters. I.e., the amount of charge carried forward by each neurotransmitter binding to its corresponding receptor is generally specified and therefore predictable. E.g., Glutamate binding to NMDA receptor will trigger the release of calcium ions into the neuron, leading to depolarization and potentially, Action Potentials. The confidence ~ certainty ~ in this fact that the simultaneous binding of glutamate and glycine to the NMDA receptor will reliably induce a +2-mV change (for instance) in the resting membrane potential, appears to embody an important mechanism for the Nervous System to systemically minimize Risk and Prediction Errors.\n\nIf more unit charges are demanded, neurons will produce more Neurotransmitters by way of Neuroplasticity. Neurons that fire together, wire together; neurons out of sync, fail to link. Long-Term Potentiation (LTP) strengthens the synapse of neurons, inducing an increased capacity and probability of Neurotransmitter vesicle release ~ stronger electrical responses to stimuli. The opposite process is Long-Term Depression (LTD). These processes drive learning and memory.\n\nIn this game of message passing, the game theoretic solution entails modulation of neurotransmitter supply to accommodate efficiency in the transactional economy. Money is “lubrication which enables the efficient transfer of utility,” wrote Nash. Price stability and value storage is therefore emergent, as this too promotes free energy minimization; i.e., uncertainty pertaining to error and expectation units in predictive coding.\nSmart Contract Mechanisms\nSomething similar happens as nodes on the Ethereum network interact with each other. The nodes communicate by transacting the digital asset ETH. In addition to the accounting of balances, there is distributed consensus around the logic executed within the Ethereum Virtual Machine (EVM). There appears to be a transference of utility.\n\nThe accounting of balances – value exchange – without an intermediary is a feature of public blockchains that was pioneered by Bitcoin. On Ethereum, this peer-to-peer characteristic has been designated as Trustlessness.\n\nThe network is trustless because participants don’t really need to know the other participants, so long as they adhere to the rules of the game; the consensus algorithm – Proof-of-Work (PoW) on Bitcoin, and Proof-of-Stake (PoS) on Ethereum.\nOn Ethereum, trustless value exchange is coupled with trustless execution of logic in the EVM. The execution of this logic is an agreement between two or more parties, and the agreements are enforced by computer programs - these are known as Smart Contracts. A Smart Contract resembles a digital vending machine that does not need a vendor employee.\n\nEthereum Smart Contracts enforce agreement regarding the individual and collective capital allocation of ETH expensed towards the “labor performed” ~ logic executed, in the EVM.  E.g., EIP-1559 automatic fee burn accompanying every transaction.\nWhat kind of labor can be performed by Smart Contracts? The kind of labor that changes the world for the better.\nSmart Contracts already uphold an alternative decentralized finance system which is free of rent-seeking intermediaries, open to all (permission-less & censorship resistant), and credibly neutral (enabled by the transparency of public blockchain transactions; e.g., etherscan.io). Quite frankly, these programs have replaced the work of stockbrokers, market makers, loan officers, and related middlemen.\nConcluding Thoughts\nOn Ethereum, Information is Value, ETH is Capital, and Smart Contract function is Labor. The relationship between labor and capital is that of real-time auditing and expensing of capital, programmatically linked with the performance of labor and its verification on a transparent public ledger. Today, these programs execute logic that enables collateralized debt positions (CDPs), lending & borrowing, automated market makers (AMMs), decentralized exchanges (DEXs), liquidity pools (LPs), perpetual future swaps, on-chain options, yield-splitting, self-repaying loans, and numerous innovations growing daily. Tomorrow, Smart Contracts will unlock a world wherein we can all be rewarded with capital for the performance of everyday labors. With middlemen removed from the equation, inputs like healthy eating, exercising, and sleeping can be configured to materialize mathematical concepts like value surplus for the network. The collectively created value can be redistributed back to those who contributed, as it is today to those who provide liquidity on DEXs like Uniswap in DeFi.\nIn the Nervous System, Information is Value, Neurotransmitters are Capital, and Predictive Coding is Labor. Evolutionary design has iteratively sophisticated the mechanisms for minimizing inefficiencies associated with pairing labor & capital in large-scale commerce. I am therefore keenly exploring the behaviors of elastic supply digital assets in DeFi. Like Neurotransmitters that increase/decrease in supply to accommodate neuroplasticity demand through mechanisms such as LTP or LTD, these assets maintain a stable price by transforming their price volatility into supply volatility through a mechanism known as Rebase. And more recently, a new primitive known as Tranche has offered even more ways to minimize uncertainty and promote price stability. These systems provide zero-liquidations and protection from cascading market-wide unwindings.\nAgain it must be emphasized, middlemen/3rd parties are absent in both systems. Smart Contracts transform the relationship between labor & capital, and enable the Markov Blanket to expand and instill Trust amongst network participants (nodes and neurons). The network itself becomes the “3rd party.”\nAt this time, onboarding the world to web3 with Decentralized Identity (DID) can expand the Markov Blanket of Trust amongst people and communities. E.g., in healthcare, identity credentialing is conducted by 3rd parties who engage in rent-seeking behaviors and value extraction. Combining DID with elastic DeFi infrastructure that will facilitate efficient transferences of utility for the systems of tomorrow, seems like a natural next step.\nReferences\nMost of the reference material was sourced from Ethereum.org and the works of John Nash et al. and Karl Friston et al. Namely:\nParallel Control\nActive Inference: The Free Energy Principle in Mind, Brain, and Behavior\nIdeal Money and Asymptotically Ideal Money\nFirst Report on a Project to Study Cooperation in Games by Means of Modeling in Terms of Formally Non-Cooperative Action in a Repeated Game Context\nRelated Content:\nTraditional Contracts and the Violation of Justice in Medicine\nValue of Trustlessness\nMoneyness of ETH and Neurotransmitters\nNeuroscience of Ethereum: Active Inference\nZero Liquidation Loans\nMechanized Vaults and Inflation Resistance\nAMPL Fundamentals\nAMPL-SPOT Risk\nRisk of SPOT\nIf you find submirror valuable, please consider donate to wong2.eth to help cover server cost.","guid":"https://mirror.xyz/0xa29FDDEc9C36BDD680D3f5867735ff8949a7F15D/SuoUHgHf_ldyAEr4f3g52jS8Fsg68P_d-odGPeqx8yY","isoDate":"2022-12-21T20:06:10.000Z","from":"https://submirror.xyz/0xa29FDDEc9C36BDD680D3f5867735ff8949a7F15D","hashId":"d1e3428a0e2c76b78e31ce5775337e77"}]