[{"creator":"Hyperledger","title":"Get started with Hyperledger Aries: Accelerate your decentralized  identity skills with a free instructor-led Workshop","link":"https://www.hyperledger.org/blog/2022/09/28/get-started-with-hyperledger-aries-accelerate-your-decentralized-identity-skills-with-a-free-instructor-led-workshop","pubDate":"Wed, 28 Sep 2022 16:00:00 +0000","content:encoded":"\n<p><a href=\"https://www.hyperledger.org/use/aries\">Hyperledger Aries</a> is one of the fastest growing open source projects propelling the advancement and adoption of decentralized identity and verifiable credentials out there today. More companies than ever are deploying Aries-based agents that allow for trusted online peer-to-peer interactions.</p>\n\n\n\n<p>Hyperledger Foundation has partnered with member company <a href=\"https://indicio.tech/\">Indicio</a> and its team of deeply experienced developers and architects to develop a free workshop to help developers and architects gain a deeper understanding of decentralized identity and become familiar with the technologies that are made possible by using Hyperledger Aries.&nbsp;</p>\n\n\n\n<p>This four-hour hands-on workshop provides beginner level opportunities to install and run the Hyperledger Aries components just like you would if you were making a real Aries-based application. Learn where to find the necessary Git repos and see how to use the Indy Command Line Interface (Indy CLI), and run the Aries toolbox to create and issue a verifiable credential.<br><br>This course also introduces some current projects using Hyperledger Aries to help you accelerate your understanding of decentralized identity and build the skills necessary to successfully make changes to the underlying code with hands-on guidance to develop your own projects.</p>\n\n\n\n<p><strong>About the Course</strong></p>\n\n\n\n<p><a href=\"https://wiki.hyperledger.org/display/events/Build+Your+Identity+Solution+Using+Hyperledger+Aries\">Build Your Identity Solution Using Hyperledger Aries</a><br>Thursday, November 10, 2022&nbsp;<br>8 AM to noon Pacific<br><a href=\"https://zoom.us/meeting/register/tJIocu2vqDwqEtw-UGeV94ds2Gd6b-PEXJcY\">Register for free</a></p>\n\n\n\n<p>This course, “Intro to Decentralized Identity,” is part of the Hyperledger Foundation Community Workshop series. It is a four hour online course that introduces the core concepts and principles of decentralized identity. As you progress, you’ll learn how to use a Hyperledger Indy-based network, be introduced to the Indy CLI, and install and run the Hyperledger Aries toolbox to create, issue, and verify a verifiable credential.</p>\n\n\n\n<p><strong>Topics also include:</strong></p>\n\n\n\n<ul><li>Decentralized identity concepts and principles</li><li>The verifiable credential data model</li><li>Decentralized identity ecosystem</li><li>Introduction to network tools Indyscan and SelfServe</li><li>Intro to Indy CLI and how to use the CLI to access a network</li><li>What Aries is</li><li>Install and run the Aries Toolbox</li><li>Create connections and issue a credential</li><li>How to verify a credential</li></ul>\n\n\n\n<p>Participants are encouraged to review the course prerequisites, including the installation of docker, installation of Indy-CLI, and download of important repositories. Information on prerequisites can be found <a href=\"https://wiki.hyperledger.org/display/events/Hyperledger+Aries+Training+Workshop+Prerequisites\">here</a>.</p>\n\n\n\n<p>This course is offered by the Hyperledger Foundation for free to expand the use, contributions, and maintainer community of Hyperledger Indy and Aries. A recording of the course will be made available at the conclusion of the instructor-led event.</p>\n\n\n\n<p>Registration links and further information about the prerequisites and course materials can be found at <a href=\"https://wiki.hyperledger.org/display/events/Build+Your+Identity+Solution+Using+Hyperledger+Aries\">https://wiki.hyperledger.org/display/events/Build+Your+Identity+Solution+Using+Hyperledger+Aries</a>&nbsp;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/09/28/get-started-with-hyperledger-aries-accelerate-your-decentralized-identity-skills-with-a-free-instructor-led-workshop\">Get started with Hyperledger Aries: Accelerate your decentralized  identity skills with a free instructor-led Workshop</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"Hyperledger Aries is one of the fastest growing open source projects propelling the advancement and adoption of decentralized identity and verifiable credentials out there today. More companies than ever are deploying Aries-based agents that allow for trusted online peer-to-peer interactions.\nHyperledger Foundation has partnered with member company Indicio and its team of deeply experienced developers and architects to develop a free workshop to help developers and architects gain a deeper understanding of decentralized identity and become familiar with the technologies that are made possible by using Hyperledger Aries. \nThis four-hour hands-on workshop provides beginner level opportunities to install and run the Hyperledger Aries components just like you would if you were making a real Aries-based application. Learn where to find the necessary Git repos and see how to use the Indy Command Line Interface (Indy CLI), and run the Aries toolbox to create and issue a verifiable credential.\nThis course also introduces some current projects using Hyperledger Aries to help you accelerate your understanding of decentralized identity and build the skills necessary to successfully make changes to the underlying code with hands-on guidance to develop your own projects.\nAbout the Course\nBuild Your Identity Solution Using Hyperledger Aries\nThursday, November 10, 2022 \n8 AM to noon Pacific\nRegister for free\nThis course, “Intro to Decentralized Identity,” is part of the Hyperledger Foundation Community Workshop series. It is a four hour online course that introduces the core concepts and principles of decentralized identity. As you progress, you’ll learn how to use a Hyperledger Indy-based network, be introduced to the Indy CLI, and install and run the Hyperledger Aries toolbox to create, issue, and verify a verifiable credential.\nTopics also include:\nDecentralized identity concepts and principles\nThe verifiable credential data model\nDecentralized identity ecosystem\nIntroduction to network tools Indyscan and SelfServe\nIntro to Indy CLI and how to use the CLI to access a network\nWhat Aries is\nInstall and run the Aries Toolbox\nCreate connections and issue a credential\nHow to verify a credential\n\n\n\n\nParticipants are encouraged to review the course prerequisites, including the installation of docker, installation of Indy-CLI, and download of important repositories. Information on prerequisites can be found here.\nThis course is offered by the Hyperledger Foundation for free to expand the use, contributions, and maintainer community of Hyperledger Indy and Aries. A recording of the course will be made available at the conclusion of the instructor-led event.\nRegistration links and further information about the prerequisites and course materials can be found at https://wiki.hyperledger.org/display/events/Build+Your+Identity+Solution+Using+Hyperledger+Aries \nThe post Get started with Hyperledger Aries: Accelerate your decentralized  identity skills with a free instructor-led Workshop appeared first on Hyperledger Foundation.","dc:creator":"Hyperledger","content":"<p>Hyperledger Aries is one of the fastest growing open source projects propelling the advancement and adoption of decentralized identity and verifiable credentials out there today. More companies than ever are...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/09/28/get-started-with-hyperledger-aries-accelerate-your-decentralized-identity-skills-with-a-free-instructor-led-workshop\">Get started with Hyperledger Aries: Accelerate your decentralized  identity skills with a free instructor-led Workshop</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"Hyperledger Aries is one of the fastest growing open source projects propelling the advancement and adoption of decentralized identity and verifiable credentials out there today. More companies than ever are...\nThe post Get started with Hyperledger Aries: Accelerate your decentralized  identity skills with a free instructor-led Workshop appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=226139","categories":["Blog","Hyperledger Aries","Identity","Decentralized identity","training","Verifiable Credentials","Workshop"],"isoDate":"2022-09-28T16:00:00.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Hyperledger","title":"#HyperledgerIdentity round-up: A cross section of production digital identity solutions built using Hyperledger technologies","link":"https://www.hyperledger.org/blog/2022/09/28/hyperledgeridentity-round-up-a-cross-section-of-production-digital-identity-solutions-built-using-hyperledger-technologies","pubDate":"Wed, 28 Sep 2022 23:10:07 +0000","content:encoded":"\n<p>Verifying identities and information in a digital world is critical for establishing trust. But there are issues of privacy as well as efficiency, scale and accuracy in models that rely on centralized data collectors and databases.&nbsp;</p>\n\n\n\n<p>The adoption of a new generation of digital identity solutions that leverage decentralized technologies such as distributed ledgers and verifiable credentials is accelerating. And Hyperledger technologies are playing a major role in this transformation.&nbsp;</p>\n\n\n\n<p>Read on for a cross section of the many Hyperledger-powered solutions that are in production now. For other examples, check out these past #HyperledgerIdentity round-ups:</p>\n\n\n\n<ul><li><a href=\"https://www.hyperledger.org/blog/2021/04/29/hyperledger-powered-digital-identity-solutions-at-work\">Hyperledger-Powered Digital Identity Solutions at Work</a> &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;</li><li><a href=\"https://www.hyperledger.org/blog/2020/04/30/identity-applications-in-action-powered-by-hyperledger\">Identity Applications in Action &amp; Powered by Hyperledger</a></li></ul>\n\n\n\n<p><strong>IBM Digital Health Pass</strong></p>\n\n\n\n<p><a href=\"https://www.ibm.com/products/digital-health-pass\">IBM Digital Health Pass</a>, built on<a href=\"https://www.hyperledger.org/use/fabric\"> Hyperledger Fabric</a>, offers a multi-credential verifier that organizations can use to manage and execute their verification policies for COVID-19 and vaccination status in a way that balances the privacy of the individual with the requirements set by the organization and local health authorities. With IBM Digital Health Pass, organizations can verify multiple types of health credentials, such as Good Health Pass, IBM Digital Health Pass, Smart Health Card and EU Digital COVID Certificate. Privacy is central to the solution, where the verifier application minimizes the personal data that is ever displayed to the user through the execution of business rules and it never lets any personal data leave, or be stored in, the verifier app.</p>\n\n\n\n<p><strong>Indicio Network&nbsp;</strong></p>\n\n\n\n<p>The <a href=\"https://indicio.tech/indicio-networks/\">Indicio Network</a> is a collection of four professionally-staffed, enterprise-grade public-permissioned ledgers that provide a neutral, independent, and reliable network for the exchange of verifiable credentials. <a href=\"https://indicio.tech/indicio-mainnet/\">MainNet</a>, <a href=\"https://indicio.tech/indicio-demonet/\">DemoNet</a>, <a href=\"https://indicio.tech/indicio-testnet/\">TestNet</a>, and <a href=\"https://indicio.tech/deploy-your-own-private-network-for-critical-performance-testing/\">TempNet</a> are all Hyperledger Indy-based networks with nodes operating on five continents—and a growing number of node operators. The Indicio Network is one of the networks that can support <a href=\"https://indicio.tech/indicio-proven/\">Indicio Proven</a>, a complete suite of decentralized identity components for authenticating and sharing high value data in a privacy-preserving way using verifiable digital credentials. Built on <a href=\"https://www.hyperledger.org/use/aries\">Hyperledger Aries</a> and <a href=\"https://www.hyperledger.org/use/ursa\">Hyperledger Ursa</a>, as well as AnonCreds and DIDComm, Proven is designed to make implementing and using these open source codebases simple, providing users with a fully-owned solution that’s easy to integrate with existing systems, to innovate on, and to scale.&nbsp;&nbsp;</p>\n\n\n\n<p><strong>IDUnion&nbsp;</strong></p>\n\n\n\n<p><a href=\"https://idunion.org/?lang=en\">IDUnion</a>, the European identity verification network created as part of the “Secure Digital Identities Showcase” funding project, brings together public institutions, government agencies, private organizations, associations, educational institutions and other stakeholders from various fields to enable a fundamentally new, secure digital infrastructure for the verification of identity information. In August, 2022, IDUnion spun off Sociedad Cooperativa Europea (SCE) to operate the production network for credential verification. </p>\n\n\n\n<p>The IDUnion network, which is built on <a href=\"https://www.hyperledger.org/use/hyperledger-indy\">Hyperledger Indy</a>, enables the clear verification of individuals, companies and institutions while allowing people and organizations to manage their identity information by themselves and to decide when they want to share this information and with whom. It has a decentralized structure and stores no personal data &#8211; not even as a hash. In order to protect privacy right from the start, all personal data is stored on the user&#8217;s end device. Users have a choice of wallets for storing and presenting credentials to third parties as required. Credentials are issued, verified and stored using open standards to ensure interoperability. Hyperledger Aries is the framework for managing the credentials.</p>\n\n\n\n<p><strong>NHS Covid-19 Digital Staff Passport</strong></p>\n\n\n\n<p>In 2019, the NHS was preparing to pilot a digital passport project that would allow staff to carry their HR and other records as credentials on their phones as a long-term plan to make it easier to transfer from one facility to another. When the pandemic hit, this went from a pilot to a production deployment quickly. The <a href=\"https://beta.staffpassports.nhs.uk/\">NHS Covid-19 Digital Staff Passport</a> rolled out in summer to support swift and efficient staff movement between NHS organizations in response to the response health emergency. The COVID-19 Digital Staff Passport provided a solid legal framework for staff to be temporarily deployed into other NHS organizations with evidence available that checks have been completed before staff move. As laid out in the pilot, the information was transferred securely by the staff member as verified credentials stored on their own smartphone, putting them in control.</p>\n\n\n\n<p>This staff passport used the <a href=\"https://sovrin.org/overview/\">Sorvin Network</a>, which is built on Hyperledger Indy, to verify the digital credentials, and the Evernym (now Avast) <a href=\"https://connect.me/\">Connect.me</a> digital wallet app, which is powered by Hyperledger Aries, Indy and Ursa, to enable staff to store and share their credentials.&nbsp;</p>\n\n\n\n<p>The NHS is now gearing up to roll out the <a href=\"https://beta.staffpassports.nhs.uk/whats-next.htm\">next generation</a> of its Digital Staff Passport, which will streamline transfers and staff movements through the NHS.&nbsp;</p>\n\n\n\n<p><strong>OrgBook BC&nbsp;</strong></p>\n\n\n\n<p><a href=\"https://orgbook.gov.bc.ca/search\">OrgBook BC</a> is a searchable public directory of organizations registered in British Columbia, Canada, provided by the BC Government’s Ministry of Citizens’ Services. OrgBook BC provides verified data, including legal names and DBA names, business numbers, BC registration status and select licensee and permits, for more than 1.4 million organizations. All of the information in the OrgBookBC is received, stored, verified and displayed using the latest digital trust technologies.&nbsp;</p>\n\n\n\n<p>OrgBookBC uses verifiable credentials to ensure that information about organizations are digitally signed by the entity that issues it. Issuers are public sector organizations that hold information about businesses, issue licenses or permits or certify processes. That electronic signature stays with the data throughout its life in OrgBook and is validated before its is display on the website.&nbsp;</p>\n\n\n\n<p>OrgBookBC is part of an overall commitment to digital trust technologies by the Government of British Columbia. In addition to deploying Hyperledger Aries, Indy and Ursa, the team there is leading much of the open source development for those projects. Read more on the Government of BC’s investment in verifiable credentials and digital wallet technologies <a href=\"https://www.hyperledger.org/blog/2022/08/23/investing-in-verifiable-credentials-technical-interoperability-and-open-source\">here</a>.&nbsp;</p>\n\n\n\n<p><strong>Digital Identity updates from Hyperledger Global Forum</strong></p>\n\n\n\n<p>At Hyperledger Global Forum 2022, there was a range of business, technical and demo sessions focused on digital identity, including:</p>\n\n\n\n<ul><li><a href=\"https://sched.co/14H61\">Bringing Trustworthiness in Industrial Device Lifecycle using Verifiable Credentials &#8211; Marquart Franz &amp; Saad Bin Shams, Siemens AG</a></li></ul>\n\n\n\n<ul><li><a href=\"https://sched.co/14H5g\">Findy Agency — Highway to Verified Data Networks</a> – Laura Vuorenoja &amp; Harri Lainio, OP Financial Group</li></ul>\n\n\n\n<ul><li><a href=\"https://sched.co/14H6n\">Digital Identity Using the vLEI</a> – Christoph Schneider, Global Legal Entity Identifier Foundation (GLEIF)</li></ul>\n\n\n\n<ul><li><a href=\"https://sched.co/14H5m\">Blockchain, Biometrics and Geo-Location: Lessons Learned from the Implementation of Innovative Technologies at the United Nations Joint Staff Pension Fund</a> – Dino Cataldo Dellaccio, United Nations Joint Staff Pension Fund &amp; Shashank Rai, United Nations International Computing Centre (UNICC)</li></ul>\n\n\n\n<ul><li><a href=\"https://sched.co/14H6e\">Hosted Discussion: Rhode Island Leads on Digital Identity Solutions with Hyperledger</a> – Liz Tanner, State of Rhode Island &amp; Jim Mason, DTCC</li></ul>\n\n\n\n<ul><li><a href=\"https://sched.co/14H4u\">Last Mile Problem in Self-Sovereign Identity – Biometric Authentification and Device Independent Wallet for Hyperledger Indy</a> – Non Kawana &amp; Ken Naganuma, Hitachi, Ltd.</li></ul>\n\n\n\n<ul><li><a href=\"https://sched.co/15Bid\">Workshop: How To Build a Self-Sovereign Identity Agent With Hyperledger Aries Framework JavaScript</a> – Timo Glastra &amp; Berend Sliedrecht, ANIMO &amp; Jakub Koci, ABSA</li></ul>\n\n\n\n<p><a href=\"https://twitter.com/Hyperledger\">Join the conversation</a> about blockchain-based identity technologies and solutions with #HyperledgerIdentity on social channels. For a hands-on introduction to the market and technologies, join the free four hour <a href=\"https://wiki.hyperledger.org/display/events/Build+Your+Identity+Solution+Using+Hyperledger+Aries\">Build Your Identity Solution Using Hyperledger Aries</a> workshop. Or, for a more business level introduction, sign up for the free <a href=\"https://training.linuxfoundation.org/blog/learn-the-fundamentals-of-self-sovereign-identity-in-free-online-training-course/?utm_medium=partner-marketing&amp;utm_source=lf&amp;utm_campaign=linuxfoundation&amp;utm_content=pr-lfs178\">Getting Started with Self-Sovereign Identity (LFS178x)</a> online course from Linux Foundation Training &amp; Certification.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/09/28/hyperledgeridentity-round-up-a-cross-section-of-production-digital-identity-solutions-built-using-hyperledger-technologies\">#HyperledgerIdentity round-up: A cross section of production digital identity solutions built using Hyperledger technologies</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"Verifying identities and information in a digital world is critical for establishing trust. But there are issues of privacy as well as efficiency, scale and accuracy in models that rely on centralized data collectors and databases. \nThe adoption of a new generation of digital identity solutions that leverage decentralized technologies such as distributed ledgers and verifiable credentials is accelerating. And Hyperledger technologies are playing a major role in this transformation. \nRead on for a cross section of the many Hyperledger-powered solutions that are in production now. For other examples, check out these past #HyperledgerIdentity round-ups:\nHyperledger-Powered Digital Identity Solutions at Work                \nIdentity Applications in Action & Powered by Hyperledger\n\n\n\n\nIBM Digital Health Pass\nIBM Digital Health Pass, built on Hyperledger Fabric, offers a multi-credential verifier that organizations can use to manage and execute their verification policies for COVID-19 and vaccination status in a way that balances the privacy of the individual with the requirements set by the organization and local health authorities. With IBM Digital Health Pass, organizations can verify multiple types of health credentials, such as Good Health Pass, IBM Digital Health Pass, Smart Health Card and EU Digital COVID Certificate. Privacy is central to the solution, where the verifier application minimizes the personal data that is ever displayed to the user through the execution of business rules and it never lets any personal data leave, or be stored in, the verifier app.\nIndicio Network \nThe Indicio Network is a collection of four professionally-staffed, enterprise-grade public-permissioned ledgers that provide a neutral, independent, and reliable network for the exchange of verifiable credentials. MainNet, DemoNet, TestNet, and TempNet are all Hyperledger Indy-based networks with nodes operating on five continents—and a growing number of node operators. The Indicio Network is one of the networks that can support Indicio Proven, a complete suite of decentralized identity components for authenticating and sharing high value data in a privacy-preserving way using verifiable digital credentials. Built on Hyperledger Aries and Hyperledger Ursa, as well as AnonCreds and DIDComm, Proven is designed to make implementing and using these open source codebases simple, providing users with a fully-owned solution that’s easy to integrate with existing systems, to innovate on, and to scale.  \nIDUnion \nIDUnion, the European identity verification network created as part of the “Secure Digital Identities Showcase” funding project, brings together public institutions, government agencies, private organizations, associations, educational institutions and other stakeholders from various fields to enable a fundamentally new, secure digital infrastructure for the verification of identity information. In August, 2022, IDUnion spun off Sociedad Cooperativa Europea (SCE) to operate the production network for credential verification. \nThe IDUnion network, which is built on Hyperledger Indy, enables the clear verification of individuals, companies and institutions while allowing people and organizations to manage their identity information by themselves and to decide when they want to share this information and with whom. It has a decentralized structure and stores no personal data – not even as a hash. In order to protect privacy right from the start, all personal data is stored on the user’s end device. Users have a choice of wallets for storing and presenting credentials to third parties as required. Credentials are issued, verified and stored using open standards to ensure interoperability. Hyperledger Aries is the framework for managing the credentials.\nNHS Covid-19 Digital Staff Passport\nIn 2019, the NHS was preparing to pilot a digital passport project that would allow staff to carry their HR and other records as credentials on their phones as a long-term plan to make it easier to transfer from one facility to another. When the pandemic hit, this went from a pilot to a production deployment quickly. The NHS Covid-19 Digital Staff Passport rolled out in summer to support swift and efficient staff movement between NHS organizations in response to the response health emergency. The COVID-19 Digital Staff Passport provided a solid legal framework for staff to be temporarily deployed into other NHS organizations with evidence available that checks have been completed before staff move. As laid out in the pilot, the information was transferred securely by the staff member as verified credentials stored on their own smartphone, putting them in control.\nThis staff passport used the Sorvin Network, which is built on Hyperledger Indy, to verify the digital credentials, and the Evernym (now Avast) Connect.me digital wallet app, which is powered by Hyperledger Aries, Indy and Ursa, to enable staff to store and share their credentials. \nThe NHS is now gearing up to roll out the next generation of its Digital Staff Passport, which will streamline transfers and staff movements through the NHS. \nOrgBook BC \nOrgBook BC is a searchable public directory of organizations registered in British Columbia, Canada, provided by the BC Government’s Ministry of Citizens’ Services. OrgBook BC provides verified data, including legal names and DBA names, business numbers, BC registration status and select licensee and permits, for more than 1.4 million organizations. All of the information in the OrgBookBC is received, stored, verified and displayed using the latest digital trust technologies. \nOrgBookBC uses verifiable credentials to ensure that information about organizations are digitally signed by the entity that issues it. Issuers are public sector organizations that hold information about businesses, issue licenses or permits or certify processes. That electronic signature stays with the data throughout its life in OrgBook and is validated before its is display on the website. \nOrgBookBC is part of an overall commitment to digital trust technologies by the Government of British Columbia. In addition to deploying Hyperledger Aries, Indy and Ursa, the team there is leading much of the open source development for those projects. Read more on the Government of BC’s investment in verifiable credentials and digital wallet technologies here. \nDigital Identity updates from Hyperledger Global Forum\nAt Hyperledger Global Forum 2022, there was a range of business, technical and demo sessions focused on digital identity, including:\nBringing Trustworthiness in Industrial Device Lifecycle using Verifiable Credentials – Marquart Franz & Saad Bin Shams, Siemens AG\n\n\n\n\n\nFindy Agency — Highway to Verified Data Networks – Laura Vuorenoja & Harri Lainio, OP Financial Group\n\n\n\n\n\nDigital Identity Using the vLEI – Christoph Schneider, Global Legal Entity Identifier Foundation (GLEIF)\n\n\n\n\n\nBlockchain, Biometrics and Geo-Location: Lessons Learned from the Implementation of Innovative Technologies at the United Nations Joint Staff Pension Fund – Dino Cataldo Dellaccio, United Nations Joint Staff Pension Fund & Shashank Rai, United Nations International Computing Centre (UNICC)\n\n\n\n\n\nHosted Discussion: Rhode Island Leads on Digital Identity Solutions with Hyperledger – Liz Tanner, State of Rhode Island & Jim Mason, DTCC\n\n\n\n\n\nLast Mile Problem in Self-Sovereign Identity – Biometric Authentification and Device Independent Wallet for Hyperledger Indy – Non Kawana & Ken Naganuma, Hitachi, Ltd.\n\n\n\n\n\nWorkshop: How To Build a Self-Sovereign Identity Agent With Hyperledger Aries Framework JavaScript – Timo Glastra & Berend Sliedrecht, ANIMO & Jakub Koci, ABSA\n\n\n\n\nJoin the conversation about blockchain-based identity technologies and solutions with #HyperledgerIdentity on social channels. For a hands-on introduction to the market and technologies, join the free four hour Build Your Identity Solution Using Hyperledger Aries workshop. Or, for a more business level introduction, sign up for the free Getting Started with Self-Sovereign Identity (LFS178x) online course from Linux Foundation Training & Certification.\nThe post #HyperledgerIdentity round-up: A cross section of production digital identity solutions built using Hyperledger technologies appeared first on Hyperledger Foundation.","dc:creator":"Hyperledger","content":"<p>Verifying identities and information in a digital world is critical for establishing trust. But there are issues of privacy as well as efficiency, scale and accuracy in models that rely...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/09/28/hyperledgeridentity-round-up-a-cross-section-of-production-digital-identity-solutions-built-using-hyperledger-technologies\">#HyperledgerIdentity round-up: A cross section of production digital identity solutions built using Hyperledger technologies</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"Verifying identities and information in a digital world is critical for establishing trust. But there are issues of privacy as well as efficiency, scale and accuracy in models that rely...\nThe post #HyperledgerIdentity round-up: A cross section of production digital identity solutions built using Hyperledger technologies appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=226163","categories":["Blog","Hyperledger Aries","Hyperledger Fabric","Hyperledger Indy","Hyperledger Ursa","Identity","#HyperledgerIdentity","Digital Identity","Hyperledger in action","self-sovereign identity"],"isoDate":"2022-09-28T23:10:07.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Hyperledger","title":"Climate Action and Accounting Special Interest Group (CA2SIG) wins The Hyperledger Challenge 2022!","link":"https://www.hyperledger.org/blog/2022/10/05/climate-action-and-accounting-special-interest-group-ca2sig-wins-the-hyperledger-challenge-2022","pubDate":"Thu, 06 Oct 2022 00:01:09 +0000","content:encoded":"\n<p>The Hyperledger Climate Action and Accounting Special Interest Group (CA2SIG) has just taken first place in the <a href=\"https://www.hyperledger.org/blog/2022/02/11/hyperledger-challenge-2022-is-all-set\">Hyperledger Challenge 2022</a> for its prototype for <a href=\"https://wiki.hyperledger.org/display/events/Reducing+Methane+Leakage+and+Flaring+with+Supply+Chain+Tokens\">Reducing Methane Leakage and Flaring with Supply Chain Tokens</a>. </p>\n\n\n\n<p>The Hyperledger Challenge 2022 took into careful consideration the following factors: </p>\n\n\n\n<p>1. Technology advancement and research objectives<br>2. Impact to the blockchain ecosystem<br>3. Value addition through social benefits<br>4. Process followed to build an open-source community around the proposed project<br>5. Activities outside the Hyperledger community to build the ecosystem<br>6. Bring in innovation in the marketplace<br>7. Headway into the community that is not represented well within the ecosystem.</p>\n\n\n\n<p>This Hyperledger Challenge 2022 award follows the recent announcement of another award from <a href=\"https://www.hyperledger.org/blog/2022/08/19/hyperledger-climate-action-and-accounting-special-interest-group-takes-first-place-in-the-2022-ibm-call-for-code-green-practices-accelerator\">IBM’s 2022 Call for Code Green Practices Accelerator</a>, where the CA2SIG team also took first place for its prototype.&nbsp;</p>\n\n\n\n<p>&#8220;<em>The team would like to thank the Hyperledger Challenge 2022 team for supporting our project. These recent wins/awards provide our team with added momentum and validation for the solution we are developing and the larger problem we seek to solve. Moving forward our focus is on marketing our solution to the energy industry and helping to scale auditing services, crucial to achieving climate targets by mid century. </em>&#8221; &#8211; Bertrand Rioux, Director, Two Ravens Energy &amp; Climate Consulting</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh5.googleusercontent.com/P7nLCkRpGaCAVOXpTDTgMxl5OaTmUJHRWm0Lv1uxqie6rQDhSDmzfsEqvTs413uaf9mIe034865pBxxIiyB0hjMypkGsocpBLQGKeTL22K99EkwRXXFXqTqRGgQc7ITgeVuk5uQHCqrgX38UCoYzUUk941uwVn36su24broJJ9bBKHq25Pa_ZXSl\" alt=\"\"/></figure>\n\n\n\n<p>This prototype, which is built using <a href=\"https://www.hyperledger.org/use/besu\">Hyperledger Besu</a>, <a href=\"https://www.hyperledger.org/use/fabric\">Hyperledger Fabric</a>, <a href=\"https://www.hyperledger.org/use/bevel\">Hyperledger Bevel</a> and <a href=\"https://www.hyperledger.org/use/cactus\">Hyperledger Cactus</a>, represents an important step towards creating an open climate accounting system that can be used to decarbonize corporate supply chains. By building a solution that can provide a free flow of trusted environmental data, we can create a more efficient marketplace that can unlock the power of green finance, consumer demand and government regulation to work together to decarbonize corporate supply chains. `</p>\n\n\n\n<p>Click the CA2SIG <a href=\"https://drive.google.com/file/d/1fF0QTYjj3fQ0BlGrh9CuvIMZKyhFgUuR/view?usp=sharing\">One-Pager</a> to learn more. We also invite you to visit the <a href=\"https://wiki.hyperledger.org/display/CASIG/\">Climate Action and Accounting Wiki</a> or join one of our bi-monthly meetings to learn about the different opportunities to get involved!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/05/climate-action-and-accounting-special-interest-group-ca2sig-wins-the-hyperledger-challenge-2022\">Climate Action and Accounting Special Interest Group (CA2SIG) wins The Hyperledger Challenge 2022!</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"The Hyperledger Climate Action and Accounting Special Interest Group (CA2SIG) has just taken first place in the Hyperledger Challenge 2022 for its prototype for Reducing Methane Leakage and Flaring with Supply Chain Tokens. \nThe Hyperledger Challenge 2022 took into careful consideration the following factors: \n1. Technology advancement and research objectives\n2. Impact to the blockchain ecosystem\n3. Value addition through social benefits\n4. Process followed to build an open-source community around the proposed project\n5. Activities outside the Hyperledger community to build the ecosystem\n6. Bring in innovation in the marketplace\n7. Headway into the community that is not represented well within the ecosystem.\nThis Hyperledger Challenge 2022 award follows the recent announcement of another award from IBM’s 2022 Call for Code Green Practices Accelerator, where the CA2SIG team also took first place for its prototype. \n“The team would like to thank the Hyperledger Challenge 2022 team for supporting our project. These recent wins/awards provide our team with added momentum and validation for the solution we are developing and the larger problem we seek to solve. Moving forward our focus is on marketing our solution to the energy industry and helping to scale auditing services, crucial to achieving climate targets by mid century. ” – Bertrand Rioux, Director, Two Ravens Energy & Climate Consulting\n\n\n\n\nThis prototype, which is built using Hyperledger Besu, Hyperledger Fabric, Hyperledger Bevel and Hyperledger Cactus, represents an important step towards creating an open climate accounting system that can be used to decarbonize corporate supply chains. By building a solution that can provide a free flow of trusted environmental data, we can create a more efficient marketplace that can unlock the power of green finance, consumer demand and government regulation to work together to decarbonize corporate supply chains. `\nClick the CA2SIG One-Pager to learn more. We also invite you to visit the Climate Action and Accounting Wiki or join one of our bi-monthly meetings to learn about the different opportunities to get involved!\nThe post Climate Action and Accounting Special Interest Group (CA2SIG) wins The Hyperledger Challenge 2022! appeared first on Hyperledger Foundation.","dc:creator":"Hyperledger","content":"<p>The Hyperledger Climate Action and Accounting Special Interest Group (CA2SIG) has just taken first place in the Hyperledger Challenge 2022 for its prototype for Reducing Methane Leakage and Flaring with...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/05/climate-action-and-accounting-special-interest-group-ca2sig-wins-the-hyperledger-challenge-2022\">Climate Action and Accounting Special Interest Group (CA2SIG) wins The Hyperledger Challenge 2022!</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"The Hyperledger Climate Action and Accounting Special Interest Group (CA2SIG) has just taken first place in the Hyperledger Challenge 2022 for its prototype for Reducing Methane Leakage and Flaring with...\nThe post Climate Action and Accounting Special Interest Group (CA2SIG) wins The Hyperledger Challenge 2022! appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=226251","categories":["Blog","Climate","Hyperledger Besu","Hyperledger Bevel","Hyperledger Cacti","Hyperledger Fabric","Special Interest Group","carbon accounting","Hyperledger Challenge","open source","Supply chain"],"isoDate":"2022-10-06T00:01:09.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Hyperledger","title":"LACChain introduces permissioned public blockchain ecosystem built on Hyperledger Besu to Latin America","link":"https://www.hyperledger.org/blog/2022/10/12/lacchain-introduces-permissioned-public-blockchain-ecosystem-built-on-hyperledger-besu-to-latin-america","pubDate":"Wed, 12 Oct 2022 17:00:00 +0000","content:encoded":"\n<p><strong>Read the full case study </strong><a href=\"https://www.hyperledger.org/learn/publications/lacchain-case-study\"><strong>here</strong></a><strong>.</strong></p>\n\n\n\n<p>Permissionless public blockchains are accessible to anyone, but they’re often unsuitable for heavily regulated institutions, like banks or public-sector initiatives. Permissioned private blockchains offer what permissionless public ones lack, but they also cost a lot to develop and maintain, making them hard to scale. Yet blockchain remains the ideal solution for many use cases.</p>\n\n\n\n<p>The Inter-American Development Bank (IDB) struggled to find the balance by using different networks for different projects. But this variety came with other issues, like compliance, technical support, and accountability. These challenges prevented IDB’s pilot projects from expanding into enterprise-level projects.&nbsp;&nbsp;</p>\n\n\n\n<p>IDB Lab is the innovation laboratory for IDB. It set about finding solutions to the problems of regulatory compliance, support, and governance. As it looked into the problem, IDB Lab noticed similar struggles throughout Latin America and the Caribbean (LAC). Organizations were looking for an alternative to permissionless public and private blockchain networks to deploy their solutions.</p>\n\n\n\n<p>Permissioned public networks—combining the benefits of the other blockchains without their drawbacks—seemed like the answer. Successful networks already existed in the EU, and IDB Lab thought it could develop one for LAC. In March 2019, with support from a global alliance for developing blockchain in Latin America and the Caribbean, IDB Labs funded a project to create LACChain, a permissioned public blockchain infrastructure in an effort to build a scalable and sustainable network for the LAC region…and beyond.</p>\n\n\n\n<p>Now, LACChain, which is built using <a href=\"https://www.hyperledger.org/use/besu\">Hyperledger Besu</a> as an enterprise Ethereum client, has become the world’s largest public permissioned network with 15 countries participating in the ecosystem. It has over 190 nodes and supports more than 60 projects, including 40 that impact financial and social inclusion. And there is a strategy for long-term orchestration of the network via the not-for-profit LACNet.</p>\n\n\n\n<p>The Hyperledger Foundation team worked with LACChain on a case study that details the goals and approach for creating the network. The behind the scenes look at launching LACChain also delves into the technology and governance planning behind the project as well as results to date and plans for growth for this network.</p>\n\n\n\n<p><strong>Read the full case study </strong><a href=\"https://www.hyperledger.org/learn/publications/lacchain-case-study\"><strong>here</strong></a><strong>.</strong></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/12/lacchain-introduces-permissioned-public-blockchain-ecosystem-built-on-hyperledger-besu-to-latin-america\">LACChain introduces permissioned public blockchain ecosystem built on Hyperledger Besu to Latin America</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"Read the full case study here.\nPermissionless public blockchains are accessible to anyone, but they’re often unsuitable for heavily regulated institutions, like banks or public-sector initiatives. Permissioned private blockchains offer what permissionless public ones lack, but they also cost a lot to develop and maintain, making them hard to scale. Yet blockchain remains the ideal solution for many use cases.\nThe Inter-American Development Bank (IDB) struggled to find the balance by using different networks for different projects. But this variety came with other issues, like compliance, technical support, and accountability. These challenges prevented IDB’s pilot projects from expanding into enterprise-level projects.  \nIDB Lab is the innovation laboratory for IDB. It set about finding solutions to the problems of regulatory compliance, support, and governance. As it looked into the problem, IDB Lab noticed similar struggles throughout Latin America and the Caribbean (LAC). Organizations were looking for an alternative to permissionless public and private blockchain networks to deploy their solutions.\nPermissioned public networks—combining the benefits of the other blockchains without their drawbacks—seemed like the answer. Successful networks already existed in the EU, and IDB Lab thought it could develop one for LAC. In March 2019, with support from a global alliance for developing blockchain in Latin America and the Caribbean, IDB Labs funded a project to create LACChain, a permissioned public blockchain infrastructure in an effort to build a scalable and sustainable network for the LAC region…and beyond.\nNow, LACChain, which is built using Hyperledger Besu as an enterprise Ethereum client, has become the world’s largest public permissioned network with 15 countries participating in the ecosystem. It has over 190 nodes and supports more than 60 projects, including 40 that impact financial and social inclusion. And there is a strategy for long-term orchestration of the network via the not-for-profit LACNet.\nThe Hyperledger Foundation team worked with LACChain on a case study that details the goals and approach for creating the network. The behind the scenes look at launching LACChain also delves into the technology and governance planning behind the project as well as results to date and plans for growth for this network.\nRead the full case study here.\nThe post LACChain introduces permissioned public blockchain ecosystem built on Hyperledger Besu to Latin America appeared first on Hyperledger Foundation.","dc:creator":"Hyperledger","content":"<p>Read the full case study here. Permissionless public blockchains are accessible to anyone, but they’re often unsuitable for heavily regulated institutions, like banks or public-sector initiatives. Permissioned private blockchains offer...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/12/lacchain-introduces-permissioned-public-blockchain-ecosystem-built-on-hyperledger-besu-to-latin-america\">LACChain introduces permissioned public blockchain ecosystem built on Hyperledger Besu to Latin America</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"Read the full case study here. Permissionless public blockchains are accessible to anyone, but they’re often unsuitable for heavily regulated institutions, like banks or public-sector initiatives. Permissioned private blockchains offer...\nThe post LACChain introduces permissioned public blockchain ecosystem built on Hyperledger Besu to Latin America appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=226335","categories":["Blog","Governance","Hyperledger Besu","case study","LAC","Latin America"],"isoDate":"2022-10-12T17:00:00.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Ry Jones and David Boswell, Community Architects","title":"Staff Corner: Thanking community members for their contributions","link":"https://www.hyperledger.org/blog/2022/10/14/staff-corner-thanking-community-members-for-their-contributions","pubDate":"Fri, 14 Oct 2022 16:00:00 +0000","content:encoded":"\n<p>Our community is strong and growing thanks to hundreds of community leaders around the world. We recently got back from <a href=\"https://events.linuxfoundation.org/hyperledger-global-forum/\">Hyperledger Global Forum 2022</a> in Dublin where the strength of our community was displayed in force. While we were there, we had the opportunity to recognize our community members in a number of fun (and hopefully meaningful) ways.&nbsp;</p>\n\n\n\n<p>This year, on the main stage, we announced the winners of our annual Community Recognition Awards:</p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"2022 Community Recognition - Hyperledger Awards Ceremony\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/E21m2ktLqWM?feature=oembed&#038;enablejsapi=1&#038;origin=https://www.hyperledger.org\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>This year’s honorees were:</p>\n\n\n\n<ul><li><strong>Daniel Szegö, DLT Advisor, CBDC Think Tank Budapest</strong> &#8211; Recognised for hosting the most meetups of any organizer this year and doing events in three languages, In addition, he also actively brings community members together around Hyperledger Fabric and Kubernetes projects</li><li><strong>Josh Kneubuhl, IBM Research, IBM</strong> &#8211; Recognized for his cross project and lab collaboration with the Hyperledger Fabric community.</li><li><strong>Arun S M, Staff Software Engineer, Walmart Global Tech India </strong>&#8211; Recognized for his active role in welcoming new community members on Discord and as one of the leaders of the Hyperledger India Chapter.</li><li><strong>Char Howland, Software Engineer, Indicio</strong> &#8211; Recognized for her active role in the Hyperledger Aries/Identity community, including running the identity implementers calls and welcoming new members to that growing community.</li><li><strong>Nicko Guyer, Senior Full Stack Engineer, Kaleido </strong>&#8211; Recognized for being very active on Discord and Github and very good at onboarding new people into the Hyperledger FireFly community.</li><li><strong>Andrew Whitehead, Senior Software Architect, Portage CyberTech</strong> &#8211; Recognized for being an active Hyperledger Aries contributor who helps with onboarding new people and does a lot of work on security.</li><li><strong>Antoine Toulme, Senior Engineering Manager, Splunk </strong>&#8211; Recognized for being extremely responsive on the Hyperledger Besu channels as well as contributing workshops and more.</li><li><strong>Marcos Sarres, Director Executivo, GoLedger</strong> &#8211; Recognized as a co-lead our Hyperledger Brazil Chapter and organizer of many very well received meetups for the community this year.</li><li><strong>Vipin Bharathan, Principal Consultant, dlt.nyc </strong>&#8211; Recognized for running the Identity WG, serving as the Chair of our Financial Services SIG and doing so much to welcome others into our community.</li><li><strong>Peter Somogyvari, Software Product Architecture Manager, Accenture</strong> &#8211; Recognized for always making the time to onboard and help new community members, taking on multiple mentees through our mentorship program and so much more.</li></ul>\n\n\n\n<p class=\"has-text-align-center\" style=\"font-size:11px\"><img style=\"\" src=\"https://lh4.googleusercontent.com/fCKDQIYawdtQyycrbHBSGkK4v_6moGRHNWRvHQVZYHd6hELy0FiE-_VKFuq9SxOphw1u7wuYayVZ6XboE8VhaM4-4KzfS_3qwWiDMRHY5ona6vFr9M4Gif25C0fFw9jStVMH2idv8SEHAs0L_W8oOh001bDzFyHde9JfdsOENwmQbgtbuPJmcdBP\"><br><em>Hyperledger Foundation Executive Governing Board Chair David Treat, Executive&nbsp; Director Daniela Barbosa and Senior Director of Community Architects David Boswell join Community Recognition Awards recipients Marcos Sarres of GoLedger, Arun S M of Walmart Global Tech India, Vipin Bharathan of dlt.nyc, Nicko Guyer of Kaleido and Josh Kneubuhl of IBM&nbsp; on stage at Hyperledger Global Forum 2022 in Dublin.</em></p>\n\n\n\n<p class=\"has-text-align-center\" style=\"font-size:11px\"><img style=\"\" src=\"https://lh6.googleusercontent.com/PPxiwPLZexrvrEc_7zBRvDrQ72d7JFIPkK52rW4-B8pPffONIneRQdeF0ekQ22vqd-mYqrFRplaBfCmAiLpQ3vxq9eXNV8mLWcfPpaOBEUDRLBDPHXVPHGcj3cJuUaFhOXOos_NUGtEPwvcRZV0Fv2N_8HQJrTOMd-h8DP37TUGG95allSov3wXT5A\"><br><em>Daniela Barbosa presents Community Recognition Awards to Accenute’s Peter Somogyvari and Splunk’s Antoine Toulme</em></p>\n\n\n\n<p>Throughout the event, we were also handing out small pieces of swag to thank the community members who were there. Taking the time to travel to the event and spend multiple days meeting and talking with others is an important contribution attendees were making to the health of the Hyperledger community. We wanted to recognize them for their time, effort and commitment.</p>\n\n\n\n<p>One of the items we were giving out were Hyperledger coins that said “Community Code Collaboration Contribution” on the back and had 2022 on the front. Since the event this year was being held in Dublin, we designed the coins to have the two color look of a <a href=\"https://en.wikipedia.org/wiki/2_euro_coin\">2 euro coin</a>.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/T4F_L06Zfh8ri9nffC-nfQA_95NfpD3i4KGXXRwoltYHjuRaDyzK26VEhRKw5yXiVUKBepNJ1tZzLyR1HlQn67PqincR8dIhcCpFHwDrLmPcNtg8572rb9Dtq376Y0A3OJC6kwq8l1pYGqyOcRspJne56MVX5rYCjXZmPrDQKssn6Y7bpqACuS1yYQ\" alt=\"\"/></figure>\n\n\n\n<p>We started making coins to thank community members – an idea long championed by our current TOC Chair, <a href=\"https://github.com/tkuhrt\">Tracy Kuhrt</a> &#8211; in 2021. People seemed to like them so we wanted to do it again this year. It also seems fun to have an ongoing series of coins that change each year that people can collect to show how long they’ve been active in the community. We don’t know what a 2023 coin would look like yet, so feel free to send us suggestions.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh5.googleusercontent.com/-V2NX8TowBQBlZ4YaIsxrAEM_AzuZza9C53Dhl5VVLLuiGtbgKEYQJzTrtHy8EWXFhJldbZsX6scYLVLHQPfd1DTYqIS9LK1Osbjl9oh0higFMdJCCxChV3MefQ-XcAOyQg0LzHxFggnBh6yzJvY1Vp5rfKZDBuSyZjvdhS1p-6XEbWfL8m1kuVO6g\" alt=\"\"/></figure>\n\n\n\n<p>For special occasions, we&#8217;ve also engraved the coins for some of the technical leaders in the community. Check out this video of a coin being engraved by a laser for <a href=\"https://youtu.be/aGe-ry7AbAw\">Danno Ferrin</a>, our TOC Vice Chair:</p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"@shemnon\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/aGe-ry7AbAw?feature=oembed&#038;enablejsapi=1&#038;origin=https://www.hyperledger.org\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>There are many other ways to recognize people for the contributions they make &#8211; one of <a href=\"https://github.com/ntp-project/ntp/blob/9c75327c3796ff59ac648478cd4da8b205bceb77/ntpd/ntp_control.c#L3807\">Ry’s personal favorites is a comment in the NTPd source code</a>. At the Hyperledger Foundation, we&#8217;ve also<a href=\"https://www.credly.com/badges/f0112709-7a9c-429e-83e4-b2322c5f1258/public_url\"> issued badges</a>, given<a href=\"https://raw.githubusercontent.com/ryjones/recognition/main/2020.jpg\"> poker</a><a href=\"https://raw.githubusercontent.com/ryjones/recognition/main/2019.jpg\"> chips</a> for events and<a href=\"https://raw.githubusercontent.com/ryjones/recognition/main/token-obverse.jpg\"> other</a><a href=\"https://raw.githubusercontent.com/ryjones/recognition/main/token-reverse.jpg\"> contributions</a>, published <a href=\"https://www.hyperledger.org/category/developer-showcase\">Developer Showcase blog posts</a> and have made stickers and shirts.</p>\n\n\n\n<p>Different ways to recognize people will be relevant for different people. Some people may want a coin or shirt and others may not. We’re interested to hear what sort of recognition is important to you so we can make sure what we do is meaningful. Please send us your thoughts (email <a href=\"mailto:community-architects@hyperledger.org\">community-architects@hyperledger.org</a>). And, if you’d like to earn a coin, a token, a badge or anything else, <a href=\"https://www.hyperledger.org/participate\">get involved in the community</a>, and we’ll be happy to thank you for your contributions.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/14/staff-corner-thanking-community-members-for-their-contributions\">Staff Corner: Thanking community members for their contributions</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"Our community is strong and growing thanks to hundreds of community leaders around the world. We recently got back from Hyperledger Global Forum 2022 in Dublin where the strength of our community was displayed in force. While we were there, we had the opportunity to recognize our community members in a number of fun (and hopefully meaningful) ways. \nThis year, on the main stage, we announced the winners of our annual Community Recognition Awards:\n\n\n\n\n\n\nThis year’s honorees were:\nDaniel Szegö, DLT Advisor, CBDC Think Tank Budapest – Recognised for hosting the most meetups of any organizer this year and doing events in three languages, In addition, he also actively brings community members together around Hyperledger Fabric and Kubernetes projects\nJosh Kneubuhl, IBM Research, IBM – Recognized for his cross project and lab collaboration with the Hyperledger Fabric community.\nArun S M, Staff Software Engineer, Walmart Global Tech India – Recognized for his active role in welcoming new community members on Discord and as one of the leaders of the Hyperledger India Chapter.\nChar Howland, Software Engineer, Indicio – Recognized for her active role in the Hyperledger Aries/Identity community, including running the identity implementers calls and welcoming new members to that growing community.\nNicko Guyer, Senior Full Stack Engineer, Kaleido – Recognized for being very active on Discord and Github and very good at onboarding new people into the Hyperledger FireFly community.\nAndrew Whitehead, Senior Software Architect, Portage CyberTech – Recognized for being an active Hyperledger Aries contributor who helps with onboarding new people and does a lot of work on security.\nAntoine Toulme, Senior Engineering Manager, Splunk – Recognized for being extremely responsive on the Hyperledger Besu channels as well as contributing workshops and more.\nMarcos Sarres, Director Executivo, GoLedger – Recognized as a co-lead our Hyperledger Brazil Chapter and organizer of many very well received meetups for the community this year.\nVipin Bharathan, Principal Consultant, dlt.nyc – Recognized for running the Identity WG, serving as the Chair of our Financial Services SIG and doing so much to welcome others into our community.\nPeter Somogyvari, Software Product Architecture Manager, Accenture – Recognized for always making the time to onboard and help new community members, taking on multiple mentees through our mentorship program and so much more.\n\n\n\n\n\nHyperledger Foundation Executive Governing Board Chair David Treat, Executive  Director Daniela Barbosa and Senior Director of Community Architects David Boswell join Community Recognition Awards recipients Marcos Sarres of GoLedger, Arun S M of Walmart Global Tech India, Vipin Bharathan of dlt.nyc, Nicko Guyer of Kaleido and Josh Kneubuhl of IBM  on stage at Hyperledger Global Forum 2022 in Dublin.\n\nDaniela Barbosa presents Community Recognition Awards to Accenute’s Peter Somogyvari and Splunk’s Antoine Toulme\nThroughout the event, we were also handing out small pieces of swag to thank the community members who were there. Taking the time to travel to the event and spend multiple days meeting and talking with others is an important contribution attendees were making to the health of the Hyperledger community. We wanted to recognize them for their time, effort and commitment.\nOne of the items we were giving out were Hyperledger coins that said “Community Code Collaboration Contribution” on the back and had 2022 on the front. Since the event this year was being held in Dublin, we designed the coins to have the two color look of a 2 euro coin.\n\n\n\n\nWe started making coins to thank community members – an idea long championed by our current TOC Chair, Tracy Kuhrt – in 2021. People seemed to like them so we wanted to do it again this year. It also seems fun to have an ongoing series of coins that change each year that people can collect to show how long they’ve been active in the community. We don’t know what a 2023 coin would look like yet, so feel free to send us suggestions.\n\n\n\n\nFor special occasions, we’ve also engraved the coins for some of the technical leaders in the community. Check out this video of a coin being engraved by a laser for Danno Ferrin, our TOC Vice Chair:\n\n\n\n\n\n\nThere are many other ways to recognize people for the contributions they make – one of Ry’s personal favorites is a comment in the NTPd source code. At the Hyperledger Foundation, we’ve also issued badges, given poker chips for events and other contributions, published Developer Showcase blog posts and have made stickers and shirts.\nDifferent ways to recognize people will be relevant for different people. Some people may want a coin or shirt and others may not. We’re interested to hear what sort of recognition is important to you so we can make sure what we do is meaningful. Please send us your thoughts (email community-architects@hyperledger.org). And, if you’d like to earn a coin, a token, a badge or anything else, get involved in the community, and we’ll be happy to thank you for your contributions.\nThe post Staff Corner: Thanking community members for their contributions appeared first on Hyperledger Foundation.","dc:creator":"Ry Jones and David Boswell, Community Architects","content":"<p>Our community is strong and growing thanks to hundreds of community leaders around the world. We recently got back from Hyperledger Global Forum 2022 in Dublin where the strength of...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/14/staff-corner-thanking-community-members-for-their-contributions\">Staff Corner: Thanking community members for their contributions</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"Our community is strong and growing thanks to hundreds of community leaders around the world. We recently got back from Hyperledger Global Forum 2022 in Dublin where the strength of...\nThe post Staff Corner: Thanking community members for their contributions appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=226291","categories":["Blog","Hyperledger Foundation Staff Corner","Hyperledger Global Forum","Community","contribution","Hyperledger community","open source","Swag"],"isoDate":"2022-10-14T16:00:00.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Hyperledger","title":"Hyperledger Foundation Charter Updates: Looking to 2023 and Beyond","link":"https://www.hyperledger.org/blog/2022/10/18/hyperledger-foundation-charter-updates-looking-to-2023-and-beyond","pubDate":"Tue, 18 Oct 2022 16:05:45 +0000","content:encoded":"\n<p>Looking ahead to 2023 and beyond, the Hyperledger Foundation Governing Board, working with our technical community and staff, recently updated the <a href=\"https://www.hyperledger.org/about/charter\">Hyperledger Foundation charter</a> to support our ever growing and evolving ecosystem. The charter spells out the governance for Hyperledger Foundation, which is now home to 15 projects, more than 50 labs, 13 working and special interest groups and seven regional chapters. These new updates were made as a follow-up to our change from a <a href=\"https://www.hyperledger.org/blog/2021/10/27/staff-corner-introducing-hyperledger-foundation\">project to a foundation with an umbrella of projects</a> to create the opportunity for more autonomy for technical projects and enable further growth for the community and the ecosystem.&nbsp;</p>\n\n\n\n<p>The key changes fall into two related categories:</p>\n\n\n\n<p><em>New Governance options for technical projects</em></p>\n\n\n\n<p>New and existing Hyperledger projects may now opt to have their own technical governance charter. The updated charter spells out that the scope of Hyperledger Foundation includes supporting various open technical projects including open source software, open standards / specifications, open data and other open projects. These projects can either be overseen by the Technical Oversight Committee of the Hyperledger Foundation (and be known as a “TOC Project”) or establish their own technical oversight pursuant to a technical charter specific to the project (and be known as a “Supported Project”).</p>\n\n\n\n<p><strong>_______________</strong><br><strong>Why is this an important feature to an umbrella project like the Hyperledger Foundation? </strong><br>Some projects want their own formal governance and, with the foundation’s umbrella format, it makes sense to create a path for projects to formalize how to govern themselves. This may be an  appealing path to both new code projects and open source projects that exist elsewhere but are interested in bringing their code and community to the world’s largest open global ecosystem for enterprise-grade blockchain technologies. <br><strong>_______________</strong></p>\n\n\n\n<p><em>Transition from a Technical Steering Committee (TSC) to a Technical Oversight Committee (TOC)</em></p>\n\n\n\n<p>Reflecting the shift to a full umbrella project, the revised charter not only renames the technical governance body but also clarifies its responsibilities. The structure and elections for the TOC are also updated. Going forward, the TOC will comprise  eleven individuals who are active within the scope of Hyperledger Foundation and have nominated themselves for the TOC.</p>\n\n\n\n<p>During the annual elections, <a href=\"https://wiki.hyperledger.org/display/TSC/TOC+Election+2022\">which kick off this week</a>, all maintainers (or similar technical role in a supported project) who have been active in the past year will elect six individuals from among the TOC Nominees to serve as TOC voting members.</p>\n\n\n\n<p>To ensure diversity and relevant expertise on the TOC, the Governing Board annually will appoint the remaining five voting members of the TOC from among the TOC Nominees. Once the TOC is selected, its members will elect a chair.</p>\n\n\n\n<p><strong>_______________</strong><br><strong>What’s the role of the TOC in a project’s life cycle?</strong><br>The TOC approves the creation of all technical projects, guides them through their life cycles, and makes sure they follow best open development and security practices. The day-to-day technical direction and roadmaps of each project are determined by its maintainers and the project’s own community.<br><strong>______________</strong></p>\n\n\n\n<p>As we enter our 7th year under the Linux Foundation project umbrella, these changes and enhancements to our governance model is a reflection of where Hyperledger technology and our community are today. We look forward to working with our active and growing community to meet the needs of the developers and the companies and governments that rely on Hyperledger projects.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/18/hyperledger-foundation-charter-updates-looking-to-2023-and-beyond\">Hyperledger Foundation Charter Updates: Looking to 2023 and Beyond</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"Looking ahead to 2023 and beyond, the Hyperledger Foundation Governing Board, working with our technical community and staff, recently updated the Hyperledger Foundation charter to support our ever growing and evolving ecosystem. The charter spells out the governance for Hyperledger Foundation, which is now home to 15 projects, more than 50 labs, 13 working and special interest groups and seven regional chapters. These new updates were made as a follow-up to our change from a project to a foundation with an umbrella of projects to create the opportunity for more autonomy for technical projects and enable further growth for the community and the ecosystem. \nThe key changes fall into two related categories:\nNew Governance options for technical projects\nNew and existing Hyperledger projects may now opt to have their own technical governance charter. The updated charter spells out that the scope of Hyperledger Foundation includes supporting various open technical projects including open source software, open standards / specifications, open data and other open projects. These projects can either be overseen by the Technical Oversight Committee of the Hyperledger Foundation (and be known as a “TOC Project”) or establish their own technical oversight pursuant to a technical charter specific to the project (and be known as a “Supported Project”).\n_______________\nWhy is this an important feature to an umbrella project like the Hyperledger Foundation? \nSome projects want their own formal governance and, with the foundation’s umbrella format, it makes sense to create a path for projects to formalize how to govern themselves. This may be an  appealing path to both new code projects and open source projects that exist elsewhere but are interested in bringing their code and community to the world’s largest open global ecosystem for enterprise-grade blockchain technologies. \n_______________\nTransition from a Technical Steering Committee (TSC) to a Technical Oversight Committee (TOC)\nReflecting the shift to a full umbrella project, the revised charter not only renames the technical governance body but also clarifies its responsibilities. The structure and elections for the TOC are also updated. Going forward, the TOC will comprise  eleven individuals who are active within the scope of Hyperledger Foundation and have nominated themselves for the TOC.\nDuring the annual elections, which kick off this week, all maintainers (or similar technical role in a supported project) who have been active in the past year will elect six individuals from among the TOC Nominees to serve as TOC voting members.\nTo ensure diversity and relevant expertise on the TOC, the Governing Board annually will appoint the remaining five voting members of the TOC from among the TOC Nominees. Once the TOC is selected, its members will elect a chair.\n_______________\nWhat’s the role of the TOC in a project’s life cycle?\nThe TOC approves the creation of all technical projects, guides them through their life cycles, and makes sure they follow best open development and security practices. The day-to-day technical direction and roadmaps of each project are determined by its maintainers and the project’s own community.\n______________\nAs we enter our 7th year under the Linux Foundation project umbrella, these changes and enhancements to our governance model is a reflection of where Hyperledger technology and our community are today. We look forward to working with our active and growing community to meet the needs of the developers and the companies and governments that rely on Hyperledger projects.\nThe post Hyperledger Foundation Charter Updates: Looking to 2023 and Beyond appeared first on Hyperledger Foundation.","dc:creator":"Hyperledger","content":"<p>Looking ahead to 2023 and beyond, the Hyperledger Foundation Governing Board, working with our technical community and staff, recently updated the Hyperledger Foundation charter to support our ever growing and...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/18/hyperledger-foundation-charter-updates-looking-to-2023-and-beyond\">Hyperledger Foundation Charter Updates: Looking to 2023 and Beyond</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"Looking ahead to 2023 and beyond, the Hyperledger Foundation Governing Board, working with our technical community and staff, recently updated the Hyperledger Foundation charter to support our ever growing and...\nThe post Hyperledger Foundation Charter Updates: Looking to 2023 and Beyond appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=234730","categories":["Blog","Governance","Charter","Technical oversight","TOC"],"isoDate":"2022-10-18T16:05:45.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Peter Somogyvari (Accenture), Jagpreet Singh Sasan (Accenture), Izuru Sato (Fujitsu), Takuma Takeuchi (Fujitsu), Venkatraman Ramakrishna (IBM), Sandeep Nishad (IBM), Krishnasuri Narayanam (IBM), Dhinakaran Vinayagamurthy (IBM)","title":"Introducing Hyperledger Cacti, a multi-faceted pluggable interoperability framework","link":"https://www.hyperledger.org/blog/2022/11/07/introducing-hyperledger-cacti-a-multi-faceted-pluggable-interoperability-framework","pubDate":"Mon, 07 Nov 2022 16:00:00 +0000","content:encoded":"\n<p>In a Hyperledger first, the community has merged two systems (architectures as well as code bases) to create a new project. <a href=\"https://www.hyperledger.org/use/cacti\">Hyperledger Cacti</a> is a multi-faceted interoperability platform that draws on the cutting-edge technical features of Hyperledger Cactus and Weaver, a Hyperledger Lab, and provides a clear path forward for users of both technologies.</p>\n\n\n\n<p>Hyperledger Cacti is a pluggable interoperability framework to link networks built on heterogeneous distributed ledger and blockchain technologies and to run transactions spanning multiple networks. Cacti was motivated by the observation that the blockchain/DLT ecosystem is fragmented into several independent networks built on a diverse set of DLTs, many of which are permissioned, but which cannot afford to remain isolated from each other, limiting the scale and utility of their business processes (smart contracts and “dapps”) and trapping their assets in silos.</p>\n\n\n\n<p>Consider a trade logistics network (like <a href=\"https://www.tradelens.com\">TradeLens</a>) that maintains bills of lading for shipments on its ledger. These bills are necessary to fulfill letters of credits’ payment obligations on a trade finance network (like <a href=\"https://marcopolonetwork.com\">Marco Polo</a>), but without an institutionalized mechanism to share a bill of lading with proof of authenticity between the two networks, the trade finance network will have to depend on untrustworthy shippers, who are incentivized to supply fake bills in order to get payment. In another scenario that is increasingly common and salient in the DeFi world, financial instruments and currency accounts (e.g., Central Bank DIgital Currency, or CBDC) are maintained on different ledgers. But this state-of-affairs will inhibit trading, and limit the utility of these networks as well as the DLTs they are built on, unless mechanisms to atomically exchange, say, a security on one network for digital currency tokens on another, are institutionalized.</p>\n\n\n\n<p>Extrapolating from these examples and others that are commonly encountered by enterprises and business consortia, we can identify the need for networks to interoperate for the purposes of sharing ledger state, moving assets across network boundaries, and exchanging assets atomically. But, because there are cogent privacy, autonomy, and performance reasons for a large number of such networks to co-exist, such interoperability must be enabled without forcing them all to coalesce into a single global chain or subscribe to a single global settlement chain.</p>\n\n\n\n<p>Hyperledger Cacti provides an interoperability solution that does not require the networks’ respective chains to coalesce into one “chain to rule them all.” It also does not require the creation of yet another settlement chain and consensus protocol to which existing networks must subscribe. Instead, Cacti allows networks to preserve autonomy of decision-making while conducting cross-network transactions on a need basis. In effect, Hyperledger Cacti scales decentralized trust above and beyond the confines of a single network without requiring networks to merge or integrate, in effect enabling a network-of-networks, as illustrated in the figure below using samples of DLT networks and cross-chain operations.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/cSZowCvlr3mIRAO5H6YkUhdQc5lRhGdhKdHD_SNbYXiTpYm4odB7PGzBg4zML85NHlaIWlyJx__tfUG2yEvTHqAYaBPAq9FlhNbtgLl8SdOSvfhm8NEJQ1e4G-HnVuPR2aackQsJ1wSML6zV5th2Fw6kDbRLJ3p2HkjMf9ROAUgXkja8T3Dmeu37O5P53w\" alt=\"\"/></figure>\n\n\n\n<p>A core design tenet of Hyperledger Cacti is that it does not require modification to any existing DLT stack, and operates purely at the contract- and-application layers (or Layer 2). This allows Cacti to be used not only for networks built on existing DLTs but potentially for DLTs that have yet to emerge. The initial release of Hyperledger Cacti will provide interoperability and connectivity features to varying extents for the following nine DLTs. (Interoperability support for other DLTs will be added to the future roadmap of the project.)</p>\n\n\n\n<ul><li>Hyperledger Besu</li><li>Hyperledger Fabric</li><li>Hyperledger Indy</li><li>Hyperledger Iroha</li><li>Hyperledger Sawtooth</li><li>R3 Corda</li><li>Go-Ethereum</li><li>Quorum</li><li>Xdai<br></li></ul>\n\n\n\n<p>The Cacti architecture builds on the pre-existing architecture of both Hyperledger Cactus and the Weaver Labs frameworks, merging components having similar or identical functionality and aggregating distinct components to offer several features that span a wide spectrum of trust and usability. The Cacti plugin architecture will enable the coexistence and maintenance of different feature/protocol implementations which can be selectively activated on demand with minimum configuration overhead. Users can customize the level of decentralization they require using a combination of the Node Server inherited from Cactus and a pluggable network-centric relay (or gateway) inherited from Weaver. The figure below illustrates how distributed applications running on distinct ledgers can trigger cross-network transactions either from a centralized Node Server or in a peer-to-peer manner using relays. The applications can be deployed in a standalone legacy manner or be “plugged into” the Node Server; developers and administrators may choose the option that fits their requirements better. All cross-relay communication protocols implemented in Cacti will be DLT-agnostic and comply with emerging standards.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh6.googleusercontent.com/nnn_KjGXEfHwNO5xBUlmzLgfaJzgR-_aWzZFMmonMw259BxPSkDTy5sP8J3Fj5i_8ylZOnWzLDjbx5Hg_Puqx-UAU5Wa7DILBHU66bFi3uiYDVOdZLMIQtW_gaIrCuBR-y-1Z670aRmc0ZqgRu7e_xrVbVScj3Mkzh52BgvjzzlMeLzYeThmqRmHBED9Ig\" alt=\"\"/></figure>\n\n\n\n<p>Core interoperability features of proof validation and lock management can be performed using either designated validator pools or with smart contracts and DApps installed in the core networks themselves; users may select these options depending on the level of trust they require and correspondingly, the level of administrative overhead they are willing to accept. Cacti will offer these features and the ability to select and activate them through a common (and comprehensive) client SDK and API. To provide a foundation for interoperability across heterogeneous DLTs, Cacti will maintain a pool of DLT- and version-specific connectors or drivers that will act as entry points for operations in a given ledger that must occur in the context of a multi-ledger transaction.</p>\n\n\n\n<p>To learn more, join us Monday, November 14, from 11am-2pm EST for the &#8220;Blockchain Interoperability with Hyperledger Cacti&#8221; hands-on workshop. To register, go <a href=\"https://zoom.us/meeting/register/tJ0vdOuoqT0qH9bRetrLUqbuHH_UykJs7DTf\">here</a>.&nbsp;</p>\n\n\n\n<p>To get involved in the Hyperledger Cacti community, connect with us on <a href=\"https://discord.com/channels/905194001349627914/908379366650703943\">Discord</a>. All are welcome!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/07/introducing-hyperledger-cacti-a-multi-faceted-pluggable-interoperability-framework\">Introducing Hyperledger Cacti, a multi-faceted pluggable interoperability framework</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"In a Hyperledger first, the community has merged two systems (architectures as well as code bases) to create a new project. Hyperledger Cacti is a multi-faceted interoperability platform that draws on the cutting-edge technical features of Hyperledger Cactus and Weaver, a Hyperledger Lab, and provides a clear path forward for users of both technologies.\nHyperledger Cacti is a pluggable interoperability framework to link networks built on heterogeneous distributed ledger and blockchain technologies and to run transactions spanning multiple networks. Cacti was motivated by the observation that the blockchain/DLT ecosystem is fragmented into several independent networks built on a diverse set of DLTs, many of which are permissioned, but which cannot afford to remain isolated from each other, limiting the scale and utility of their business processes (smart contracts and “dapps”) and trapping their assets in silos.\nConsider a trade logistics network (like TradeLens) that maintains bills of lading for shipments on its ledger. These bills are necessary to fulfill letters of credits’ payment obligations on a trade finance network (like Marco Polo), but without an institutionalized mechanism to share a bill of lading with proof of authenticity between the two networks, the trade finance network will have to depend on untrustworthy shippers, who are incentivized to supply fake bills in order to get payment. In another scenario that is increasingly common and salient in the DeFi world, financial instruments and currency accounts (e.g., Central Bank DIgital Currency, or CBDC) are maintained on different ledgers. But this state-of-affairs will inhibit trading, and limit the utility of these networks as well as the DLTs they are built on, unless mechanisms to atomically exchange, say, a security on one network for digital currency tokens on another, are institutionalized.\nExtrapolating from these examples and others that are commonly encountered by enterprises and business consortia, we can identify the need for networks to interoperate for the purposes of sharing ledger state, moving assets across network boundaries, and exchanging assets atomically. But, because there are cogent privacy, autonomy, and performance reasons for a large number of such networks to co-exist, such interoperability must be enabled without forcing them all to coalesce into a single global chain or subscribe to a single global settlement chain.\nHyperledger Cacti provides an interoperability solution that does not require the networks’ respective chains to coalesce into one “chain to rule them all.” It also does not require the creation of yet another settlement chain and consensus protocol to which existing networks must subscribe. Instead, Cacti allows networks to preserve autonomy of decision-making while conducting cross-network transactions on a need basis. In effect, Hyperledger Cacti scales decentralized trust above and beyond the confines of a single network without requiring networks to merge or integrate, in effect enabling a network-of-networks, as illustrated in the figure below using samples of DLT networks and cross-chain operations. \n\n\n\n\nA core design tenet of Hyperledger Cacti is that it does not require modification to any existing DLT stack, and operates purely at the contract- and-application layers (or Layer 2). This allows Cacti to be used not only for networks built on existing DLTs but potentially for DLTs that have yet to emerge. The initial release of Hyperledger Cacti will provide interoperability and connectivity features to varying extents for the following nine DLTs. (Interoperability support for other DLTs will be added to the future roadmap of the project.)\nHyperledger Besu\nHyperledger Fabric\nHyperledger Indy\nHyperledger Iroha\nHyperledger Sawtooth\nR3 Corda\nGo-Ethereum\nQuorum\nXdai\n\nThe Cacti architecture builds on the pre-existing architecture of both Hyperledger Cactus and the Weaver Labs frameworks, merging components having similar or identical functionality and aggregating distinct components to offer several features that span a wide spectrum of trust and usability. The Cacti plugin architecture will enable the coexistence and maintenance of different feature/protocol implementations which can be selectively activated on demand with minimum configuration overhead. Users can customize the level of decentralization they require using a combination of the Node Server inherited from Cactus and a pluggable network-centric relay (or gateway) inherited from Weaver. The figure below illustrates how distributed applications running on distinct ledgers can trigger cross-network transactions either from a centralized Node Server or in a peer-to-peer manner using relays. The applications can be deployed in a standalone legacy manner or be “plugged into” the Node Server; developers and administrators may choose the option that fits their requirements better. All cross-relay communication protocols implemented in Cacti will be DLT-agnostic and comply with emerging standards. \n\n\n\n\nCore interoperability features of proof validation and lock management can be performed using either designated validator pools or with smart contracts and DApps installed in the core networks themselves; users may select these options depending on the level of trust they require and correspondingly, the level of administrative overhead they are willing to accept. Cacti will offer these features and the ability to select and activate them through a common (and comprehensive) client SDK and API. To provide a foundation for interoperability across heterogeneous DLTs, Cacti will maintain a pool of DLT- and version-specific connectors or drivers that will act as entry points for operations in a given ledger that must occur in the context of a multi-ledger transaction.\nTo learn more, join us Monday, November 14, from 11am-2pm EST for the “Blockchain Interoperability with Hyperledger Cacti” hands-on workshop. To register, go here. \nTo get involved in the Hyperledger Cacti community, connect with us on Discord. All are welcome!\nThe post Introducing Hyperledger Cacti, a multi-faceted pluggable interoperability framework appeared first on Hyperledger Foundation.","dc:creator":"Peter Somogyvari (Accenture), Jagpreet Singh Sasan (Accenture), Izuru Sato (Fujitsu), Takuma Takeuchi (Fujitsu), Venkatraman Ramakrishna (IBM), Sandeep Nishad (IBM), Krishnasuri Narayanam (IBM), Dhinakaran Vinayagamurthy (IBM)","content":"<p>In a Hyperledger first, the community has merged two systems (architectures as well as code bases) to create a new project. Hyperledger Cacti is a multi-faceted interoperability platform that draws...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/07/introducing-hyperledger-cacti-a-multi-faceted-pluggable-interoperability-framework\">Introducing Hyperledger Cacti, a multi-faceted pluggable interoperability framework</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"In a Hyperledger first, the community has merged two systems (architectures as well as code bases) to create a new project. Hyperledger Cacti is a multi-faceted interoperability platform that draws...\nThe post Introducing Hyperledger Cacti, a multi-faceted pluggable interoperability framework appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=234910","categories":["Blog","Hyperledger Cacti","Interoperability","framework","Hyperledger Cactus","new project","Weaver"],"isoDate":"2022-11-07T16:00:00.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Gopikrishnan Konnanath, Senior Vice President, Global Head – Engineering Services and Blockchain, Infosys, and Srikanth Challa, Senior Director, Blockchain, Infosys","title":"Process Transformation for Public Services Driven by Blockchain","link":"https://www.hyperledger.org/blog/2022/11/10/process-transformation-for-public-services-driven-by-blockchain","pubDate":"Thu, 10 Nov 2022 16:00:00 +0000","content:encoded":"\n<p>Several government departments around the world are keen to offer their citizens seamless interactions and engaging experiences, akin to those in the private sector.&nbsp;</p>\n\n\n\n<p>The public sector is often riddled with manual processes, time-consuming verifications, legacy systems leading to low transparency and high costs. Over the years, digitalization has alleviated some of the challenges, but rising threats on privacy, data security coupled with the increasing legislations that enshrine the right-to-be-forgotten such as Europe’s GDPR or California’s CCPA pose new challenges for leaders serving in the public sector.</p>\n\n\n\n<p>In the future, we will witness a monumental shift in what citizens will come to expect from their governments &#8211; nothing short of how they experience retail or banking in their life. While this digital transformation has already begun in the public sector, technologies such as blockchain are essential foundations that will power the next generation of citizen experiences. Blockchain and, more broadly, distributed ledger technologies will create a core of trust, transparency, and immutability that&nbsp; breaks down information silos, reducing&nbsp; cost all while vastly enriching the citizen experiences.</p>\n\n\n\n<p>Infosys is proud to have been part of the transformation that is driving change in the public sector. We are happy to share a couple of examples where Infosys brought our strong capabilities in blockchain to help clients reimagine citizen experiences.</p>\n\n\n\n<ol>\n<li><strong>Blockchain helps reimagine public records validation for Riverside County California</strong></li>\n</ol>\n\n\n\n<p>Riverside County California relied heavily on security paper and wet signatures to establish ‘trust’ and authenticate records. Citizens often had to wait for the physical copies of verified documents to reach them by post, which led to delays. In addition, easy access to numerous online tools increased the incidence of fraud, making it challenging to verify proof-of-records and physical documents, which was done manually.&nbsp;</p>\n\n\n\n<p>Infosys Public Services helped create a blockchain-based digital records fulfillment solution for Riverside County’s Assessor-County Clerk-Recorder Office. Built on the Hyperledger Fabric blockchain framework, the new platform can seamlessly verify and authenticate several types of digital records (like land records, births, marriages, and deaths). The solution also bypasses physical paper records by issuing digital documents when a citizen or entity requests them, thereby providing an e-commerce-like experience. The blockchain solution will help Riverside County California achieve cost savings, faster turnaround time, and enhanced customer service.</p>\n\n\n\n<p><em>Read the full case study to see </em><a href=\"https://www.infosyspublicservices.com/insights/public-records-validation-process.html\"><em>how Riverside County authenticates and delivers digital records with 100% trust to citizens</em></a><em>.</em></p>\n\n\n\n<ol start=\"2\">\n<li><strong>Blockchain streamlines professional license issuance and verification for the State of Rhode Island</strong></li>\n</ol>\n\n\n\n<p>The Department of Business Regulation (DBR) in the State of Rhode Island chose to pilot a blockchain solution for identity validation, which is a pre-requisite for issuing licenses. The department used paper-based applications to issue nearly 200,000 licenses annually. This led to high operational inefficiencies, greater costs, and a poor citizen experience.&nbsp;</p>\n\n\n\n<p>DBR partnered with Infosys Public Services (Infosys) for its proven expertise in transforming government processes and implementing blockchain technology. Infosys implemented a blockchain-based identity and credential management solution using Hyperledger Indy and Hyperledger Aries that can quickly and securely validate an individual’s credentials. The solution is built on the Self-Sovereign Identity Model where citizens are the custodians of their data (i.e., personal data is stored on citizen mobile wallets, not on the blockchain). Instead, the blockchain stores the information needed to cryptographically validate the citizen’s credentials, which is shared with other parties. This solution can be easily adopted by other departments within the state paving the way for greater adoption across the entire state.</p>\n\n\n\n<p><em>Read the complete case study to see </em><a href=\"https://www.infosys.com/services/blockchain/analyst-reports/streamline-identity-validation.html\"><em>why blockchain was the right solution for the State of Rhode Island</em></a><em>.</em></p>\n\n\n\n<p>Beyond the buzz, blockchain is proving to be a beneficial technology in the real world across banking, insurance, retail and other industries. Governments around the world are not sitting on the sidelines but jumping mainstream into this disruptive technology to drive citizen-centered governance.</p>\n\n\n\n<p>To learn more about how Infosys leverages blockchain technologies to build reliable, trusted and sustainable ecosystems for governments and other organizations, go <a href=\"https://www.infosys.com/services/blockchain/\">here</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/10/process-transformation-for-public-services-driven-by-blockchain\">Process Transformation for Public Services Driven by Blockchain</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"Several government departments around the world are keen to offer their citizens seamless interactions and engaging experiences, akin to those in the private sector. \nThe public sector is often riddled with manual processes, time-consuming verifications, legacy systems leading to low transparency and high costs. Over the years, digitalization has alleviated some of the challenges, but rising threats on privacy, data security coupled with the increasing legislations that enshrine the right-to-be-forgotten such as Europe’s GDPR or California’s CCPA pose new challenges for leaders serving in the public sector.\nIn the future, we will witness a monumental shift in what citizens will come to expect from their governments – nothing short of how they experience retail or banking in their life. While this digital transformation has already begun in the public sector, technologies such as blockchain are essential foundations that will power the next generation of citizen experiences. Blockchain and, more broadly, distributed ledger technologies will create a core of trust, transparency, and immutability that  breaks down information silos, reducing  cost all while vastly enriching the citizen experiences.\nInfosys is proud to have been part of the transformation that is driving change in the public sector. We are happy to share a couple of examples where Infosys brought our strong capabilities in blockchain to help clients reimagine citizen experiences.\nBlockchain helps reimagine public records validation for Riverside County California\nRiverside County California relied heavily on security paper and wet signatures to establish ‘trust’ and authenticate records. Citizens often had to wait for the physical copies of verified documents to reach them by post, which led to delays. In addition, easy access to numerous online tools increased the incidence of fraud, making it challenging to verify proof-of-records and physical documents, which was done manually. \nInfosys Public Services helped create a blockchain-based digital records fulfillment solution for Riverside County’s Assessor-County Clerk-Recorder Office. Built on the Hyperledger Fabric blockchain framework, the new platform can seamlessly verify and authenticate several types of digital records (like land records, births, marriages, and deaths). The solution also bypasses physical paper records by issuing digital documents when a citizen or entity requests them, thereby providing an e-commerce-like experience. The blockchain solution will help Riverside County California achieve cost savings, faster turnaround time, and enhanced customer service.\nRead the full case study to see how Riverside County authenticates and delivers digital records with 100% trust to citizens.\nBlockchain streamlines professional license issuance and verification for the State of Rhode Island\nThe Department of Business Regulation (DBR) in the State of Rhode Island chose to pilot a blockchain solution for identity validation, which is a pre-requisite for issuing licenses. The department used paper-based applications to issue nearly 200,000 licenses annually. This led to high operational inefficiencies, greater costs, and a poor citizen experience. \nDBR partnered with Infosys Public Services (Infosys) for its proven expertise in transforming government processes and implementing blockchain technology. Infosys implemented a blockchain-based identity and credential management solution using Hyperledger Indy and Hyperledger Aries that can quickly and securely validate an individual’s credentials. The solution is built on the Self-Sovereign Identity Model where citizens are the custodians of their data (i.e., personal data is stored on citizen mobile wallets, not on the blockchain). Instead, the blockchain stores the information needed to cryptographically validate the citizen’s credentials, which is shared with other parties. This solution can be easily adopted by other departments within the state paving the way for greater adoption across the entire state.\nRead the complete case study to see why blockchain was the right solution for the State of Rhode Island.\nBeyond the buzz, blockchain is proving to be a beneficial technology in the real world across banking, insurance, retail and other industries. Governments around the world are not sitting on the sidelines but jumping mainstream into this disruptive technology to drive citizen-centered governance.\nTo learn more about how Infosys leverages blockchain technologies to build reliable, trusted and sustainable ecosystems for governments and other organizations, go here.\nThe post Process Transformation for Public Services Driven by Blockchain appeared first on Hyperledger Foundation.","dc:creator":"Gopikrishnan Konnanath, Senior Vice President, Global Head – Engineering Services and Blockchain, Infosys, and Srikanth Challa, Senior Director, Blockchain, Infosys","content":"<p>Several government departments around the world are keen to offer their citizens seamless interactions and engaging experiences, akin to those in the private sector.&#160; The public sector is often riddled...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/10/process-transformation-for-public-services-driven-by-blockchain\">Process Transformation for Public Services Driven by Blockchain</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"Several government departments around the world are keen to offer their citizens seamless interactions and engaging experiences, akin to those in the private sector.  The public sector is often riddled...\nThe post Process Transformation for Public Services Driven by Blockchain appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=235001","categories":["Blog","Hyperledger Aries","Hyperledger Fabric","Hyperledger Indy","InfoSys","Public sector","Riverside County California","State of Rhode Island"],"isoDate":"2022-11-10T16:00:00.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Stephen Curran, Maintainer, Hyperledger AnonCreds","title":"Announcing Hyperledger AnonCreds: Open Source, Open Specification Privacy Preserving Verifiable Credentials","link":"https://www.hyperledger.org/blog/2022/11/15/announcing-hyperledger-anoncreds-open-source-open-specification-privacy-preserving-verifiable-credentials","pubDate":"Tue, 15 Nov 2022 16:00:00 +0000","content:encoded":"\n<p>AnonCreds, the most commonly used Verifiable Credential (VC) format in the world*, is now a Hyperledger project. Ledger agnostic and with a formal open specification, AnonCreds continues to evolve as a mature verifiable credential format with unique privacy-protecting capabilities. As a Hyperledger project, AnonCreds will have support to grow its code base and community on a global level with technical governance that fosters best open development and security practices.</p>\n\n\n\n<p>As the Internet transitions to allowing people, organizations, and things to have greater control over the sharing of their credentials, protecting privacy is of paramount concern.</p>\n\n\n\n<p><a href=\"https://www.hyperledger.org/use/anoncreds\">Hyperledger AnonCreds</a>—short for “Anonymous Credentials”—is a type of VC that adds important privacy-protecting ZKP (zero-knowledge proof) capabilities to the core VC assurances. A core element of the Hyperledger Indy project for more than five years, AnonCreds is a mature, complete model and interactions set, with extensive support across Hyperledger Aries frameworks.</p>\n\n\n\n<p>The creation of this project signifies the continued healthy evolution of an open source software project that was once monolithic and is now a set of well-defined independent components.&nbsp;</p>\n\n\n\n<p>Hyperledger AnonCreds is ledger-agnostic and client-agnostic. It is not tied to Hyperledger Indy or Aries. This makes it usable with other verifiable data registries/ledgers and verifiable credential client stacks. As a result, important&nbsp; privacy-protecting capabilities become available to a much broader audience, and the underlying cryptography can evolve without affecting the features above it.</p>\n\n\n\n<p>Additional benefits of using Hyperledger AnonCreds include:</p>\n\n\n\n<ul>\n<li>Avoidance of identifiers: No correlatable identifiers are required in presenting data to a verifier. Correlatable identifiers may be applied in a use case specific manner.</li>\n\n\n\n<li>Verifier assurances: Credentials are bound to the holder, so verifiers know that credentials presented together were all issued to the holder providing the presentation.</li>\n\n\n\n<li>Minimal data sharing: Data to be shared by a holder to a verifier is minimized through the use of selective disclosure and ZKP predicates</li>\n</ul>\n\n\n\n<p>Flexible formatting: Credentials and presentations can be formatted in the W3C VC Data Model standard format.</p>\n\n\n\n<p>AnonCreds has joined the Hyperledger ecosystem with <a href=\"https://hyperledger.github.io/hyperledger-hip/HIPs/anoncreds.html\">over 25 sponsors</a>. The project consists of:</p>\n\n\n\n<ul>\n<li>The AnonCreds Specification, managed by the <a href=\"https://wiki.hyperledger.org/display/ANONCREDS/AnonCreds+Specification+Working+Group\">Hyperledger AnonCreds Specification Working Group</a> and with the potential of being submitted to an appropriate Standards organization</li>\n\n\n\n<li>Ledger/Verifiable Data Registry-agnostic, open source code implementations of the AnonCreds specification, suitable for use with Hyperledger Aries and non-Aries agents</li>\n\n\n\n<li>Guidance for creating ledger-specific <a href=\"https://hyperledger.github.io/anoncreds-methods-registry/\">AnonCreds Methods</a> to write and resolve AnonCreds objects for specific ledgers</li>\n\n\n\n<li>Documentation on AnonCreds suitable for all audiences, from business audiences to cryptographers</li>\n\n\n\n<li>A test suite to verify adherence to the AnonCreds specification and the interoperability of AnonCreds implementations.</li>\n</ul>\n\n\n\n<p>Next steps include evolving the existing <a href=\"https://github.com/hyperledger/anoncreds-rs\">AnonCreds Rust implementation</a> to be friendlier to VDRs/ledgers other than Indy, wrapping up the v1.0 specification, and gaining compliance with the W3C Verifiable Credentials Data Model Standard.</p>\n\n\n\n<p>If you’re interested in learning more about AnonCreds start with the <a href=\"https://hyperledger.org/use/anoncreds\">Hyperledger AnonCreds project page</a>. From there you can find how to join project discussions on Discord, add yourself to the project mailing list, find the AnonCreds repositories on GitHub, and join the AnonCreds Working Groups.</p>\n\n\n\n<p>We welcome interest from all groups and organizations, including enterprises and standards organizations. We look forward to hearing from you!</p>\n\n\n\n<p class=\"has-small-font-size\">*<em>Source: godiddy.com combined “sov” (Indy) network volume</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/15/announcing-hyperledger-anoncreds-open-source-open-specification-privacy-preserving-verifiable-credentials\">Announcing Hyperledger AnonCreds: Open Source, Open Specification Privacy Preserving Verifiable Credentials</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"AnonCreds, the most commonly used Verifiable Credential (VC) format in the world*, is now a Hyperledger project. Ledger agnostic and with a formal open specification, AnonCreds continues to evolve as a mature verifiable credential format with unique privacy-protecting capabilities. As a Hyperledger project, AnonCreds will have support to grow its code base and community on a global level with technical governance that fosters best open development and security practices.\nAs the Internet transitions to allowing people, organizations, and things to have greater control over the sharing of their credentials, protecting privacy is of paramount concern.\nHyperledger AnonCreds—short for “Anonymous Credentials”—is a type of VC that adds important privacy-protecting ZKP (zero-knowledge proof) capabilities to the core VC assurances. A core element of the Hyperledger Indy project for more than five years, AnonCreds is a mature, complete model and interactions set, with extensive support across Hyperledger Aries frameworks.\nThe creation of this project signifies the continued healthy evolution of an open source software project that was once monolithic and is now a set of well-defined independent components. \nHyperledger AnonCreds is ledger-agnostic and client-agnostic. It is not tied to Hyperledger Indy or Aries. This makes it usable with other verifiable data registries/ledgers and verifiable credential client stacks. As a result, important  privacy-protecting capabilities become available to a much broader audience, and the underlying cryptography can evolve without affecting the features above it.\nAdditional benefits of using Hyperledger AnonCreds include:\nAvoidance of identifiers: No correlatable identifiers are required in presenting data to a verifier. Correlatable identifiers may be applied in a use case specific manner.\nVerifier assurances: Credentials are bound to the holder, so verifiers know that credentials presented together were all issued to the holder providing the presentation.\nMinimal data sharing: Data to be shared by a holder to a verifier is minimized through the use of selective disclosure and ZKP predicates\nFlexible formatting: Credentials and presentations can be formatted in the W3C VC Data Model standard format.\nAnonCreds has joined the Hyperledger ecosystem with over 25 sponsors. The project consists of:\nThe AnonCreds Specification, managed by the Hyperledger AnonCreds Specification Working Group and with the potential of being submitted to an appropriate Standards organization\nLedger/Verifiable Data Registry-agnostic, open source code implementations of the AnonCreds specification, suitable for use with Hyperledger Aries and non-Aries agents\nGuidance for creating ledger-specific AnonCreds Methods to write and resolve AnonCreds objects for specific ledgers\nDocumentation on AnonCreds suitable for all audiences, from business audiences to cryptographers\nA test suite to verify adherence to the AnonCreds specification and the interoperability of AnonCreds implementations.\nNext steps include evolving the existing AnonCreds Rust implementation to be friendlier to VDRs/ledgers other than Indy, wrapping up the v1.0 specification, and gaining compliance with the W3C Verifiable Credentials Data Model Standard.\nIf you’re interested in learning more about AnonCreds start with the Hyperledger AnonCreds project page. From there you can find how to join project discussions on Discord, add yourself to the project mailing list, find the AnonCreds repositories on GitHub, and join the AnonCreds Working Groups.\nWe welcome interest from all groups and organizations, including enterprises and standards organizations. We look forward to hearing from you!\n*Source: godiddy.com combined “sov” (Indy) network volume\nThe post Announcing Hyperledger AnonCreds: Open Source, Open Specification Privacy Preserving Verifiable Credentials appeared first on Hyperledger Foundation.","dc:creator":"Stephen Curran, Maintainer, Hyperledger AnonCreds","content":"<p>AnonCreds, the most commonly used Verifiable Credential (VC) format in the world*, is now a Hyperledger project. Ledger agnostic and with a formal open specification, AnonCreds continues to evolve as...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/15/announcing-hyperledger-anoncreds-open-source-open-specification-privacy-preserving-verifiable-credentials\">Announcing Hyperledger AnonCreds: Open Source, Open Specification Privacy Preserving Verifiable Credentials</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"AnonCreds, the most commonly used Verifiable Credential (VC) format in the world*, is now a Hyperledger project. Ledger agnostic and with a formal open specification, AnonCreds continues to evolve as...\nThe post Announcing Hyperledger AnonCreds: Open Source, Open Specification Privacy Preserving Verifiable Credentials appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=235018","categories":["Blog","Hyperledger AnonCreds","Identity","new project","news","Open Source Development","Verifiable Credentials"],"isoDate":"2022-11-15T16:00:00.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Hyperledger","title":"GSBN Builds Global Trade Operating Platform with Hyperledger Fabric as the Foundation","link":"https://www.hyperledger.org/blog/2022/11/16/gsbn-builds-global-trade-operating-platform-with-hyperledger-fabric-as-the-foundation","pubDate":"Wed, 16 Nov 2022 19:07:54 +0000","content:encoded":"\n<p><strong>Read the full case study</strong><strong> </strong><a href=\"https://www.hyperledger.org/learn/publications/gsbn-case-study\"><strong>here</strong></a><strong>.</strong></p>\n\n\n\n<p>Global trade is systemically important to the world’s economy. In 2021, it represented $28.5 trillion. Yet, it hasn’t evolved along with the digital transformation of other industries.</p>\n\n\n\n<p>Perhaps that’s because evolution seems like an insurmountable task. Processes are complex. Documents and information flow continuously — but asynchronously — between parties across the globe. Many processes still rely on paper and legacy systems.&nbsp;</p>\n\n\n\n<p>This lack of digital, on-demand data makes it difficult for the shipping sector to respond to global events, like the COVID-19 pandemic in 2020 or the supply chain disruptions in 2021. In short, existing global trade processes aren’t efficient nor resilient enough.&nbsp;&nbsp;</p>\n\n\n\n<p>GSBN, a not-for-profit backed (and governed) by a <a href=\"https://www.gsbn.trade/our-ecosystem\">collection</a> of major shipping lines and global terminal operators, set out to create the trusted data sharing infrastructure needed for efficient, digital and resilient global trade. To do so, GSBN built a new global trade operating platform using Hyperledger Fabric as the foundation.&nbsp;</p>\n\n\n\n<p>The initial launch of GSBN centered around a Cargo Release offering aimed at improving shipping container turn-around time, reducing port congestion and pollution. Since its launch in March of 2021, more than 10,000 customers have used Cargo Release to get real-time updates on over 1 million shipments.</p>\n\n\n\n<p>In September 2021, GSBN formed the Trade Finance Advisory Group with Bank of China (Hong Kong) Limited (BOCHK), DBS Bank and The Hongkong and Shanghai Banking Corporation Limited (HSBC) to develop digital solutions to help improve the financing process for banks. To break barriers in data sharing that were hindering financing approvals for trade companies, especially SMEs, GSBN created an application for consent collection. It allows banks to source data directly from shipping lines so they can verify information based on a single source of truth.</p>\n\n\n\n<p>The third application for GSBN is electronic bills of lading (eBL). In June 2022, IQAX eBL application, built on top of GSBN, obtained approval by the International Group of P&amp;I Clubs. The eBL application provides a digital channel for all parties to access real-time data on the shipping process. It also guarantees the security, accuracy, and authenticity of data. And it ensures the data on the blockchain network is traceable to a single source. This application has already been adopted by three shipping lines and one bank.</p>\n\n\n\n<p>The Hyperledger Foundation team worked with GSBN on a case study that details the business and technical drivers and decisions that went into the creation of GSBN as well as key results to date. It also lays out how GSBN, as CTO Edmund To puts it, “will expand the global trade ecosystem by creating bridges to new market participants like banks, FinTech’s, and other consortia and launching new solutions.”</p>\n\n\n\n<p><strong>Read the full case study </strong><a href=\"https://www.hyperledger.org/learn/publications/gsbn-case-study\"><strong>here</strong></a><strong>.</strong></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/16/gsbn-builds-global-trade-operating-platform-with-hyperledger-fabric-as-the-foundation\">GSBN Builds Global Trade Operating Platform with Hyperledger Fabric as the Foundation</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"Read the full case study here.\nGlobal trade is systemically important to the world’s economy. In 2021, it represented $28.5 trillion. Yet, it hasn’t evolved along with the digital transformation of other industries.\nPerhaps that’s because evolution seems like an insurmountable task. Processes are complex. Documents and information flow continuously — but asynchronously — between parties across the globe. Many processes still rely on paper and legacy systems. \nThis lack of digital, on-demand data makes it difficult for the shipping sector to respond to global events, like the COVID-19 pandemic in 2020 or the supply chain disruptions in 2021. In short, existing global trade processes aren’t efficient nor resilient enough.  \nGSBN, a not-for-profit backed (and governed) by a collection of major shipping lines and global terminal operators, set out to create the trusted data sharing infrastructure needed for efficient, digital and resilient global trade. To do so, GSBN built a new global trade operating platform using Hyperledger Fabric as the foundation. \nThe initial launch of GSBN centered around a Cargo Release offering aimed at improving shipping container turn-around time, reducing port congestion and pollution. Since its launch in March of 2021, more than 10,000 customers have used Cargo Release to get real-time updates on over 1 million shipments.\nIn September 2021, GSBN formed the Trade Finance Advisory Group with Bank of China (Hong Kong) Limited (BOCHK), DBS Bank and The Hongkong and Shanghai Banking Corporation Limited (HSBC) to develop digital solutions to help improve the financing process for banks. To break barriers in data sharing that were hindering financing approvals for trade companies, especially SMEs, GSBN created an application for consent collection. It allows banks to source data directly from shipping lines so they can verify information based on a single source of truth.\nThe third application for GSBN is electronic bills of lading (eBL). In June 2022, IQAX eBL application, built on top of GSBN, obtained approval by the International Group of P&I Clubs. The eBL application provides a digital channel for all parties to access real-time data on the shipping process. It also guarantees the security, accuracy, and authenticity of data. And it ensures the data on the blockchain network is traceable to a single source. This application has already been adopted by three shipping lines and one bank.\nThe Hyperledger Foundation team worked with GSBN on a case study that details the business and technical drivers and decisions that went into the creation of GSBN as well as key results to date. It also lays out how GSBN, as CTO Edmund To puts it, “will expand the global trade ecosystem by creating bridges to new market participants like banks, FinTech’s, and other consortia and launching new solutions.”\nRead the full case study here.\nThe post GSBN Builds Global Trade Operating Platform with Hyperledger Fabric as the Foundation appeared first on Hyperledger Foundation.","dc:creator":"Hyperledger","content":"<p>Read the full case study here. Global trade is systemically important to the world’s economy. In 2021, it represented $28.5 trillion. Yet, it hasn’t evolved along with the digital transformation...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/16/gsbn-builds-global-trade-operating-platform-with-hyperledger-fabric-as-the-foundation\">GSBN Builds Global Trade Operating Platform with Hyperledger Fabric as the Foundation</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"Read the full case study here. Global trade is systemically important to the world’s economy. In 2021, it represented $28.5 trillion. Yet, it hasn’t evolved along with the digital transformation...\nThe post GSBN Builds Global Trade Operating Platform with Hyperledger Fabric as the Foundation appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=235053","categories":["Blog","Hyperledger Fabric","Supply Chain","consortium","Global Trade","GSBN","Shipping"],"isoDate":"2022-11-16T19:07:54.000Z","from":"https://www.hyperledger.org/feed"},{"title":"Sam Bankman-Fried hopes to start new venture in effort to repay FTX investors - report","link":"https://seekingalpha.com/news/3916199-sam-bankman-fried-hopes-to-start-new-venture-in-effort-to-repay-ftx-investors-report?utm_source=feed_news_crypto&utm_medium=referral","pubDate":"Mon, 12 Dec 2022 12:00:25 -0500","guid":"https://seekingalpha.com/news/3916199-sam-bankman-fried-hopes-to-start-new-venture-in-effort-to-repay-ftx-investors-report?utm_source=feed_news_crypto&utm_medium=referral","categories":[{"_":"ftt-usd","$":{"domain":"https://seekingalpha.com/symbol/FTT-USD"}}],"isoDate":"2022-12-12T17:00:25.000Z","from":"https://seekingalpha.com/news/crypto/feed"},{"creator":"Andrew Throuvalas","title":"Coinbase Stock Hits New All-Time Low Amid Plummeting Yearly Revenues","link":"https://decrypt.co/116997/coinbase-stock-hits-new-all-time-low-plummeting-yearly-revenues","pubDate":"Mon, 12 Dec 2022 17:00:31 +0000","enclosure":{"url":"https://img.decrypt.co/insecure/rs:fill:1024:512:1:0/plain/https://cdn.decrypt.co/wp-content/uploads/2021/04/coinbase-app-skew-analytics-gID_4.jpeg@png","length":"1000000","type":"image/png"},"dc:creator":"Andrew Throuvalas","content":"Coinbase’s stock (COIN) continues to slide as the exchange braces for year-end figures that grossly underperform its 2021 numbers. ","contentSnippet":"Coinbase’s stock (COIN) continues to slide as the exchange braces for year-end figures that grossly underperform its 2021 numbers.","guid":"https://decrypt.co/?p=116997","categories":["Business"],"isoDate":"2022-12-12T17:00:31.000Z","from":"https://decryptmedia.com/feed/"}]