{"1670726102":[{"creator":"Ben Turtel","title":"Web3 Enables Coordination Without Hierarchy","link":"https://medium.com/bankless-dao/web3-enables-coordination-without-hierarchy-2c2345e1b319?source=rss----2e8b6adb479c---4","pubDate":"Sun, 11 Dec 2022 02:31:41 GMT","content:encoded":"<h4>Token Incentives and Network Effects Reduce the Need for Top-Down Structures</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*_FAYb3j8SVyefeFNLrCEyg.jpeg\" /><figcaption>Image credit: <a href=\"https://twitter.com/olutadetony?s=09\">Tonytad</a></figcaption></figure><p>Web3 is unique in its ability to inspire hope across the political spectrum — from capitalists, Marxists, and libertarians alike — that it will usher in a more virtuous economy. Claims about a blockchain-enabled future predict <a href=\"https://hackernoon.com/is-the-free-market-possible-with-a-blockchain-powered-economy-ae259cfd3eb9\">freer markets through decentralization</a>, more <a href=\"https://future.com/the-future-of-work-daos-crypto-networks/\">meritocratic allocations of resources</a>, and even a <a href=\"https://twitter.com/ljin18/status/1464994679468998661\">progression of the labor movement</a> through shared <a href=\"https://newsletter.banklesshq.com/p/-101-the-ownership-economy-li-jin\">ownership</a>. To understand the economic transformations enabled by web3, we must first understand the different kinds of economic coordination that exist and consider their respective advantages and disadvantages.</p><h3>Free Markets Are a Form of Coordination</h3><p>One major economic coordination system is the free market economy. Free markets are decentralized. Instead of a top-down government directive dictating the allocation of resources and pricing of products, autonomous participants spontaneously make these production decisions based on demand and supply fluctuations. This results in efficient allocation of resources without coercing transactions or labor from participants. This efficiency is achieved without top-down <em>government</em> control.</p><p>Ironically however, free markets often lead to large swaths of production becoming centrally organized within top-down <em>corporations</em> where workers sacrifice autonomy for employment. <a href=\"https://www.civicsnation.org/2018/06/05/george-orwell-prefer-socialism-free-market-capitalism/\">Orwell described</a> how free competition “means for the great mass of people a tyranny probably worse… than that of the State.” <a href=\"https://www.youtube.com/watch?v=pjDnuc0y1Gc&amp;list=PLghL9V9QTN0h6LUzveyvWsglmSAi7EjPh&amp;index=12\"><em>Rick &amp; Morty</em> aptly demonstrates the contradiction</a> between the principles of freedom and individualism promised by a free market economy, and the everyday experience of workers, who feel like cogs in a machine:</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*etOF4y_iTn11qSCc\" /><figcaption><em>From the </em><a href=\"https://www.netflix.com/in/title/80014749\"><em>Rick &amp; Morty series</em></a></figcaption></figure><p>Economists typically describe <a href=\"https://www.e-education.psu.edu/eme805/node/643\">three forms of economic coordination:</a></p><ul><li>Hierarchies: Centralized planning guided by top-down decision making.</li><li>Markets: Free exchange and competition guided through supply and demand dynamics.</li><li>Networks: Cooperation driven through <a href=\"https://databigandsmall.com/2016/04/07/hierarchy-market-or-network-the-disruptive-world-of-the-digital-platform/\">social relationships, shared norms, and trust</a>.</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*mCqR4q66uGcWiGWNcmB3hA.png\" /><figcaption><em>Various forms of economic coordination. Illustration by </em><a href=\"https://twitter.com/TheGhostDesignr\"><em>TheGhostDesignr</em></a></figcaption></figure><p>Web3 disrupts networks through decentralization and enables markets through automation and permissionless participation. In this article, we’ll explore how web3 might tip the scales away from hierarchy and towards coordination through markets and networks.</p><h3>Lowered Costs of Market Transactions</h3><p>If the free market is so good at efficiently allocating resources, why then do firms exist? Under what circumstances is it more efficient to coordinate hierarchically instead of through market forces?</p><p>In <a href=\"https://onlinelibrary.wiley.com/doi/10.1111/j.1468-0335.1937.tb00002.x\"><em>The Nature of the Firm</em></a> (1937), Ronald Coase argues that firms form and grow when there are high costs associated with accessing the market. These costs can include anything that raises the overall material price of a transaction — search costs for vendors, negotiation of terms, risk of fraud, etc. The author of this <a href=\"https://www.economist.com/schools-brief/2017/07/29/coases-theory-of-the-firm\">article</a> in the Economist notes that “a well-defined task can easily be put out to the market… the firm comes into its own when simple contracts of this kind will not suffice.” Instead, employees<a href=\"https://nav.al/renting-time\"> rent out their time</a> for a fixed salary and participate by following orders from up the chain.</p><p>For example, imagine that a small software business needs to hire new contractors to develop every new software feature: each new contractor would generate high onboarding costs; including recruitment, interview, training, and orientation time. It is more economical to permanently hire an engineer and direct all their work, to avoid re-bargaining over any and every change to deliverables.</p><p>Similarly, firms economize on the <a href=\"https://www.sciencedirect.com/topics/social-sciences/transaction-costs-theory\">cost of coordinating economic activity</a> when it is cheaper to direct tasks within a hierarchical structure than it is to enforce contracts for every transaction. Large corporations, operating at economies of scale, are better able to avoid these high transaction costs than small businesses.</p><h4>Web3 Optimizes for Market Coordination</h4><p>Web3 changes things by favoring coordination via markets over hierarchy. This plays out in several ways:</p><ul><li><strong>Lowered fees.</strong> Web3 platforms have <a href=\"https://a16zcrypto.com/state-of-crypto-report-a16z-2022/\">dramatically lower take-rates</a> than web2 companies. OpenSea takes a 2.5% fee compared to Apple’s 30% in the App Store.</li><li><strong>Trustless transactions.</strong> Smart contracts enable coordination between parties without third-party trust agents or legal contracts. This reduces risk as well as the price of enforcing contracts.</li><li><strong>Transparency.</strong> Open-source code and data make it easier for a community to coordinate and contribute without high integration costs or ramp-up time.</li><li><strong>Automation.</strong> Smart contracts automate processes and can calculate rewards based on output instead of time. This makes it possible for <a href=\"https://future.com/the-future-of-work-daos-crypto-networks/\">DAOs to outsource work</a> through incentivized bounties or quests without vetting participants. Contributors need not sacrifice autonomy to participate — they decide what to work on, how to work, when to work, and how to best optimize value for themselves.</li></ul><p>As it becomes possible to outsource more tasks with more flexibility through on-chain marketplaces, the costs associated with coordinating production via market forces will fall relative to the costs of coordinating production hierarchically. More capable markets, enabled by blockchain, will incentivize a shift towards marketplaces and away from top-down control.</p><h3>Community-owned Data</h3><p>Perhaps most importantly, web3 enables accumulation of <strong>data-driven network effects</strong> without centralized control.</p><p>Web1 was defined by <a href=\"https://medium.com/geekculture/the-fundamental-forces-of-web3-5285dfc381d2\">open, standardized protocols</a>, like HTTP for connecting websites, or SMTP for email. These web1 protocols accumulated network effects; they became increasingly useful as they were adopted by more users. These technologies still serve as critical infrastructure for the internet today.</p><p>One limitation of web1 protocols is that they weren’t capable of storing data about users — they simply defined how participants could interact with one another. As a result, centralized services stepped in to fill that gap. For example, email addresses and content are stored privately by third-party servers; Gmail addresses are stored in Google’s servers, and Outlook email is stored in Microsoft’s servers. The protocol defines how email users interact, but user data lives with centralized providers.</p><p>Web2 behemoths essentially built moats through the accumulation of this <em>user data</em>. Google’s search and ad targeting both improve as more users reveal and generate more training data for their systems. Facebook’s and Twitter’s social graphs increase in value as more users participate and generate content. Amazon’s marketplace increases in value as more products are added to its catalog and more users reveal their purchasing preferences. Unlike email, where users are able to participate in an open network through one of many third-party providers, these new networks are closed and only accessible through their centralized owners.</p><p>In web2, databases and their content are privately owned. Large-scale development and monetization of datasets emerged almost entirely through hierarchical relationships where network participants contribute but centralized entities retain all ownership and control.</p><p>Enter <a href=\"https://banklesspublishing.com/distributed-ledger-technology-101/\">blockchains</a>, which are essentially <a href=\"https://www.theverge.com/23020727/decoder-chris-dixon-web3-crypto-a16z-vc-silicon-valley-investing-podcast-interview\">community-owned databases</a>. Blockchain is to data what open source is to code — a database that can be contributed to and used freely through decentralized collaboration. This makes it possible for data-driven network effects to accumulate beyond the scope of hierarchical organizations.</p><p>Web3 projects are leveraging open data to challenge their centralized counterparts. Here are some examples of open-source protocols which are now freely available:</p><ul><li><a href=\"https://www.farcaster.xyz/\">Farcaster</a> is a decentralized social network. Users can choose from a variety of apps built on Farcaster, and developers can permissionlessly build new experiences on the network. Identities are <a href=\"https://github.com/farcasterxyz/protocol\">stored on chain</a>, instead of in privately owned third-party servers.</li><li><a href=\"https://help.sound.xyz/hc/en-us/categories/5404745714075-Learn-About-Sound\">Sound.xyz</a> stores all songs on decentralized storage networks. Artists retain full control, even if Sound.xyz ceases to exist. Anyone can listen to any song, without even opening an account.</li><li><a href=\"https://www.teleport.xyz/\">Teleport.xyz</a> is building a Solana-based TRIP protocol to enable an <a href=\"https://decrypt.co/112957/teleport-creators-raise-9m-build-decentralized-uber-rival-solana\">array of blockchain-powered apps</a> to compete with ridesharing services like Uber and Lyft.</li></ul><p>While there are teams of people who work with the protocol, ownership does not equate to control over the network. In each case, an ecosystem of apps might emerge and compete to help users interact with the same underlying open dataset, but network effects will continue to accumulate to the protocol. Users benefit from network effects without driving the formation of centralized hierarchies. Unlike a corporation, the original protocol team can’t opportunistically change prices, remove previously granted access, or selectively alter the rules of engagement.</p><h3>Token-aligned Networks</h3><p>Shared ownership is a powerful means to align incentives. We know this from web2, where employees are frequently compensated with company equity to align their long-term success with that of an organization. Shared ownership generates aligned incentives and values because all participants are incentivized to see the underlying asset accrue value.</p><p>While initial compensation (in cash, tokens, or equity) is set by market forces, the coordination that follows from shared ownership resembles more of a network. While equity-based compensation in web2 aligns owners and employees, web3 greatly expands participation in ownership.</p><p>In addition to core contributors who work to earn, or bounty hunters who contribute to earn, web3 networks can transform all users into evangelists through <a href=\"https://future.com/the-future-of-work-daos-crypto-networks/\">participation-based token distributions</a>. Some <a href=\"https://kazm.substack.com/p/a-closer-looks-at-smart-airdrops\">web3 projects use targeted airdrops</a> to seed ownership among existing ecosystem participants, who are then incentivized to help those projects succeed. Similar behavior is seen among NFT collectors who go on to amplify their communities on Twitter without direct rewards for doing so; ownership alone creates a network of shared values and aligned incentives. New models of sharing ownership, enabled by tokens, allow new network-coordinated go-to-market models to replace hierarchically-coordinated marketing campaigns.</p><h3>Transitioning From Tyranny</h3><p>Web3 facilitates a shift from top-down coordination towards frictionless markets and decentralized networks. Does this imply a future of fully autonomous workers? Probably not. There may always be roles that are easier to coordinate through top-down direction.</p><p>On the other hand, this transition will make it possible for small, independent players to benefit from economies of scale — which were previously amassed exclusively corporations — while remaining autonomous if they so choose. Trustless transactions, fewer intermediaries, and inherent transparency will reduce the advantages of giant corporations over small businesses. Open data will enable powerful network effects without cementing monopolies, ushering in the methods of effective cooperation without embracing tyranny.</p><p><strong>Bios</strong></p><p>Author</p><p><a href=\"https://twitter.com/BTurtel\"><strong><em>Ben Turtel</em></strong></a><em> is the Founder &amp; CEO @ Kazm.xyz. He advises startups through The Garage @ Northwestern, and previously founded Rivet @ Google’s Area120.</em></p><p>Editors</p><p><a href=\"https://twitter.com/trewkat\"><strong><em>Trewkat</em></strong></a><em> is a writer and editor at BanklessDAO. She’s interested in learning as much as possible about crypto and NFTs, with a particular focus on how best to communicate this knowledge to others.</em></p><p><a href=\"https://twitter.com/Kornekt1\"><strong><em>Kornekt</em></strong></a><em> is a writer and editor with strong conviction in the world Web3 creates.</em></p><p>Designer</p><p><a href=\"https://twitter.com/olutadetony?s=09\"><strong><em>Tonytad</em></strong></a><strong><em> </em></strong><em>is a graphic designer who has worked locally and internationally with organisations and firms on over 200 projects, which includes branding, logo, flyers, cards, and covers</em></p><p><strong>BanklessDAO</strong> is an education and media engine dedicated to helping individuals achieve financial independence.</p><p><a href=\"https://twitter.com/banklesspub\"><strong>Bankless Publishing</strong></a> is always accepting submissions for publication. We’d love to read your work, so please submit your article <a href=\"https://forms.gle/6QZ8gpNM7rua6xcS6\">here</a>!</p><p><em>This post </em><strong><em>does not contain financial advice</em></strong><em>, only educational information. By reading this article, you agree and affirm the above, as well as that you are not being solicited to make a financial decision, and that you in no way are receiving any fiduciary projection, promise, or tacit inference of your ability to achieve financial gains.</em></p><p><strong>More Like This</strong></p><p><a href=\"https://banklesspublishing.com/four-factors-that-make-a-dao-sticky/\"><strong><em>Four Factors That Make a DAO Sticky</em></strong></a><em> by Peter Jones</em></p><p><a href=\"https://banklesspublishing.com/daos-v-corps-is-the-trial-of-the-century/\"><strong><em>DAOs v. Corps Is the Trial of the Century</em></strong></a><em> by teeLEROO</em></p><p><a href=\"https://banklesspublishing.com/updating-the-dao-operating-system/\"><strong><em>Updating the DAO Operating System</em></strong></a><em> by siddhearta</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=2c2345e1b319\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/bankless-dao/web3-enables-coordination-without-hierarchy-2c2345e1b319\">Web3 Enables Coordination Without Hierarchy</a> was originally published in <a href=\"https://medium.com/bankless-dao\">BanklessDAO</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>","content:encodedSnippet":"Token Incentives and Network Effects Reduce the Need for Top-Down Structures\nImage credit: Tonytad\nWeb3 is unique in its ability to inspire hope across the political spectrum — from capitalists, Marxists, and libertarians alike — that it will usher in a more virtuous economy. Claims about a blockchain-enabled future predict freer markets through decentralization, more meritocratic allocations of resources, and even a progression of the labor movement through shared ownership. To understand the economic transformations enabled by web3, we must first understand the different kinds of economic coordination that exist and consider their respective advantages and disadvantages.\nFree Markets Are a Form of Coordination\nOne major economic coordination system is the free market economy. Free markets are decentralized. Instead of a top-down government directive dictating the allocation of resources and pricing of products, autonomous participants spontaneously make these production decisions based on demand and supply fluctuations. This results in efficient allocation of resources without coercing transactions or labor from participants. This efficiency is achieved without top-down government control.\nIronically however, free markets often lead to large swaths of production becoming centrally organized within top-down corporations where workers sacrifice autonomy for employment. Orwell described how free competition “means for the great mass of people a tyranny probably worse… than that of the State.” Rick & Morty aptly demonstrates the contradiction between the principles of freedom and individualism promised by a free market economy, and the everyday experience of workers, who feel like cogs in a machine:\nFrom the Rick & Morty series\nEconomists typically describe three forms of economic coordination:\n\nHierarchies: Centralized planning guided by top-down decision making.\nMarkets: Free exchange and competition guided through supply and demand dynamics.\nNetworks: Cooperation driven through social relationships, shared norms, and trust.\nVarious forms of economic coordination. Illustration by TheGhostDesignr\nWeb3 disrupts networks through decentralization and enables markets through automation and permissionless participation. In this article, we’ll explore how web3 might tip the scales away from hierarchy and towards coordination through markets and networks.\nLowered Costs of Market Transactions\nIf the free market is so good at efficiently allocating resources, why then do firms exist? Under what circumstances is it more efficient to coordinate hierarchically instead of through market forces?\nIn The Nature of the Firm (1937), Ronald Coase argues that firms form and grow when there are high costs associated with accessing the market. These costs can include anything that raises the overall material price of a transaction — search costs for vendors, negotiation of terms, risk of fraud, etc. The author of this article in the Economist notes that “a well-defined task can easily be put out to the market… the firm comes into its own when simple contracts of this kind will not suffice.” Instead, employees rent out their time for a fixed salary and participate by following orders from up the chain.\nFor example, imagine that a small software business needs to hire new contractors to develop every new software feature: each new contractor would generate high onboarding costs; including recruitment, interview, training, and orientation time. It is more economical to permanently hire an engineer and direct all their work, to avoid re-bargaining over any and every change to deliverables.\nSimilarly, firms economize on the cost of coordinating economic activity when it is cheaper to direct tasks within a hierarchical structure than it is to enforce contracts for every transaction. Large corporations, operating at economies of scale, are better able to avoid these high transaction costs than small businesses.\nWeb3 Optimizes for Market Coordination\nWeb3 changes things by favoring coordination via markets over hierarchy. This plays out in several ways:\n\nLowered fees. Web3 platforms have dramatically lower take-rates than web2 companies. OpenSea takes a 2.5% fee compared to Apple’s 30% in the App Store.\nTrustless transactions. Smart contracts enable coordination between parties without third-party trust agents or legal contracts. This reduces risk as well as the price of enforcing contracts.\nTransparency. Open-source code and data make it easier for a community to coordinate and contribute without high integration costs or ramp-up time.\nAutomation. Smart contracts automate processes and can calculate rewards based on output instead of time. This makes it possible for DAOs to outsource work through incentivized bounties or quests without vetting participants. Contributors need not sacrifice autonomy to participate — they decide what to work on, how to work, when to work, and how to best optimize value for themselves.\n\nAs it becomes possible to outsource more tasks with more flexibility through on-chain marketplaces, the costs associated with coordinating production via market forces will fall relative to the costs of coordinating production hierarchically. More capable markets, enabled by blockchain, will incentivize a shift towards marketplaces and away from top-down control.\nCommunity-owned Data\nPerhaps most importantly, web3 enables accumulation of data-driven network effects without centralized control.\nWeb1 was defined by open, standardized protocols, like HTTP for connecting websites, or SMTP for email. These web1 protocols accumulated network effects; they became increasingly useful as they were adopted by more users. These technologies still serve as critical infrastructure for the internet today.\nOne limitation of web1 protocols is that they weren’t capable of storing data about users — they simply defined how participants could interact with one another. As a result, centralized services stepped in to fill that gap. For example, email addresses and content are stored privately by third-party servers; Gmail addresses are stored in Google’s servers, and Outlook email is stored in Microsoft’s servers. The protocol defines how email users interact, but user data lives with centralized providers.\nWeb2 behemoths essentially built moats through the accumulation of this user data. Google’s search and ad targeting both improve as more users reveal and generate more training data for their systems. Facebook’s and Twitter’s social graphs increase in value as more users participate and generate content. Amazon’s marketplace increases in value as more products are added to its catalog and more users reveal their purchasing preferences. Unlike email, where users are able to participate in an open network through one of many third-party providers, these new networks are closed and only accessible through their centralized owners.\nIn web2, databases and their content are privately owned. Large-scale development and monetization of datasets emerged almost entirely through hierarchical relationships where network participants contribute but centralized entities retain all ownership and control.\nEnter blockchains, which are essentially community-owned databases. Blockchain is to data what open source is to code — a database that can be contributed to and used freely through decentralized collaboration. This makes it possible for data-driven network effects to accumulate beyond the scope of hierarchical organizations.\nWeb3 projects are leveraging open data to challenge their centralized counterparts. Here are some examples of open-source protocols which are now freely available:\n\nFarcaster is a decentralized social network. Users can choose from a variety of apps built on Farcaster, and developers can permissionlessly build new experiences on the network. Identities are stored on chain, instead of in privately owned third-party servers.\nSound.xyz stores all songs on decentralized storage networks. Artists retain full control, even if Sound.xyz ceases to exist. Anyone can listen to any song, without even opening an account.\nTeleport.xyz is building a Solana-based TRIP protocol to enable an array of blockchain-powered apps to compete with ridesharing services like Uber and Lyft.\n\nWhile there are teams of people who work with the protocol, ownership does not equate to control over the network. In each case, an ecosystem of apps might emerge and compete to help users interact with the same underlying open dataset, but network effects will continue to accumulate to the protocol. Users benefit from network effects without driving the formation of centralized hierarchies. Unlike a corporation, the original protocol team can’t opportunistically change prices, remove previously granted access, or selectively alter the rules of engagement.\nToken-aligned Networks\nShared ownership is a powerful means to align incentives. We know this from web2, where employees are frequently compensated with company equity to align their long-term success with that of an organization. Shared ownership generates aligned incentives and values because all participants are incentivized to see the underlying asset accrue value.\nWhile initial compensation (in cash, tokens, or equity) is set by market forces, the coordination that follows from shared ownership resembles more of a network. While equity-based compensation in web2 aligns owners and employees, web3 greatly expands participation in ownership.\nIn addition to core contributors who work to earn, or bounty hunters who contribute to earn, web3 networks can transform all users into evangelists through participation-based token distributions. Some web3 projects use targeted airdrops to seed ownership among existing ecosystem participants, who are then incentivized to help those projects succeed. Similar behavior is seen among NFT collectors who go on to amplify their communities on Twitter without direct rewards for doing so; ownership alone creates a network of shared values and aligned incentives. New models of sharing ownership, enabled by tokens, allow new network-coordinated go-to-market models to replace hierarchically-coordinated marketing campaigns.\nTransitioning From Tyranny\nWeb3 facilitates a shift from top-down coordination towards frictionless markets and decentralized networks. Does this imply a future of fully autonomous workers? Probably not. There may always be roles that are easier to coordinate through top-down direction.\nOn the other hand, this transition will make it possible for small, independent players to benefit from economies of scale — which were previously amassed exclusively corporations — while remaining autonomous if they so choose. Trustless transactions, fewer intermediaries, and inherent transparency will reduce the advantages of giant corporations over small businesses. Open data will enable powerful network effects without cementing monopolies, ushering in the methods of effective cooperation without embracing tyranny.\nBios\nAuthor\nBen Turtel is the Founder & CEO @ Kazm.xyz. He advises startups through The Garage @ Northwestern, and previously founded Rivet @ Google’s Area120.\nEditors\nTrewkat is a writer and editor at BanklessDAO. She’s interested in learning as much as possible about crypto and NFTs, with a particular focus on how best to communicate this knowledge to others.\nKornekt is a writer and editor with strong conviction in the world Web3 creates.\nDesigner\nTonytad is a graphic designer who has worked locally and internationally with organisations and firms on over 200 projects, which includes branding, logo, flyers, cards, and covers\nBanklessDAO is an education and media engine dedicated to helping individuals achieve financial independence.\nBankless Publishing is always accepting submissions for publication. We’d love to read your work, so please submit your article here!\nThis post does not contain financial advice, only educational information. By reading this article, you agree and affirm the above, as well as that you are not being solicited to make a financial decision, and that you in no way are receiving any fiduciary projection, promise, or tacit inference of your ability to achieve financial gains.\nMore Like This\nFour Factors That Make a DAO Sticky by Peter Jones\nDAOs v. Corps Is the Trial of the Century by teeLEROO\nUpdating the DAO Operating System by siddhearta\n\nWeb3 Enables Coordination Without Hierarchy was originally published in BanklessDAO on Medium, where people are continuing the conversation by highlighting and responding to this story.","dc:creator":"Ben Turtel","guid":"https://medium.com/p/2c2345e1b319","categories":["economics","web3","blockchain","nft","data"],"isoDate":"2022-12-11T02:31:41.000Z"}]}