[{"creator":"Hyperledger","title":"Get started with Hyperledger Aries: Accelerate your decentralized  identity skills with a free instructor-led Workshop","link":"https://www.hyperledger.org/blog/2022/09/28/get-started-with-hyperledger-aries-accelerate-your-decentralized-identity-skills-with-a-free-instructor-led-workshop","pubDate":"Wed, 28 Sep 2022 16:00:00 +0000","content:encoded":"\n<p><a href=\"https://www.hyperledger.org/use/aries\">Hyperledger Aries</a> is one of the fastest growing open source projects propelling the advancement and adoption of decentralized identity and verifiable credentials out there today. More companies than ever are deploying Aries-based agents that allow for trusted online peer-to-peer interactions.</p>\n\n\n\n<p>Hyperledger Foundation has partnered with member company <a href=\"https://indicio.tech/\">Indicio</a> and its team of deeply experienced developers and architects to develop a free workshop to help developers and architects gain a deeper understanding of decentralized identity and become familiar with the technologies that are made possible by using Hyperledger Aries.&nbsp;</p>\n\n\n\n<p>This four-hour hands-on workshop provides beginner level opportunities to install and run the Hyperledger Aries components just like you would if you were making a real Aries-based application. Learn where to find the necessary Git repos and see how to use the Indy Command Line Interface (Indy CLI), and run the Aries toolbox to create and issue a verifiable credential.<br><br>This course also introduces some current projects using Hyperledger Aries to help you accelerate your understanding of decentralized identity and build the skills necessary to successfully make changes to the underlying code with hands-on guidance to develop your own projects.</p>\n\n\n\n<p><strong>About the Course</strong></p>\n\n\n\n<p><a href=\"https://wiki.hyperledger.org/display/events/Build+Your+Identity+Solution+Using+Hyperledger+Aries\">Build Your Identity Solution Using Hyperledger Aries</a><br>Thursday, November 10, 2022&nbsp;<br>8 AM to noon Pacific<br><a href=\"https://zoom.us/meeting/register/tJIocu2vqDwqEtw-UGeV94ds2Gd6b-PEXJcY\">Register for free</a></p>\n\n\n\n<p>This course, “Intro to Decentralized Identity,” is part of the Hyperledger Foundation Community Workshop series. It is a four hour online course that introduces the core concepts and principles of decentralized identity. As you progress, you’ll learn how to use a Hyperledger Indy-based network, be introduced to the Indy CLI, and install and run the Hyperledger Aries toolbox to create, issue, and verify a verifiable credential.</p>\n\n\n\n<p><strong>Topics also include:</strong></p>\n\n\n\n<ul><li>Decentralized identity concepts and principles</li><li>The verifiable credential data model</li><li>Decentralized identity ecosystem</li><li>Introduction to network tools Indyscan and SelfServe</li><li>Intro to Indy CLI and how to use the CLI to access a network</li><li>What Aries is</li><li>Install and run the Aries Toolbox</li><li>Create connections and issue a credential</li><li>How to verify a credential</li></ul>\n\n\n\n<p>Participants are encouraged to review the course prerequisites, including the installation of docker, installation of Indy-CLI, and download of important repositories. Information on prerequisites can be found <a href=\"https://wiki.hyperledger.org/display/events/Hyperledger+Aries+Training+Workshop+Prerequisites\">here</a>.</p>\n\n\n\n<p>This course is offered by the Hyperledger Foundation for free to expand the use, contributions, and maintainer community of Hyperledger Indy and Aries. A recording of the course will be made available at the conclusion of the instructor-led event.</p>\n\n\n\n<p>Registration links and further information about the prerequisites and course materials can be found at <a href=\"https://wiki.hyperledger.org/display/events/Build+Your+Identity+Solution+Using+Hyperledger+Aries\">https://wiki.hyperledger.org/display/events/Build+Your+Identity+Solution+Using+Hyperledger+Aries</a>&nbsp;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/09/28/get-started-with-hyperledger-aries-accelerate-your-decentralized-identity-skills-with-a-free-instructor-led-workshop\">Get started with Hyperledger Aries: Accelerate your decentralized  identity skills with a free instructor-led Workshop</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"Hyperledger Aries is one of the fastest growing open source projects propelling the advancement and adoption of decentralized identity and verifiable credentials out there today. More companies than ever are deploying Aries-based agents that allow for trusted online peer-to-peer interactions.\nHyperledger Foundation has partnered with member company Indicio and its team of deeply experienced developers and architects to develop a free workshop to help developers and architects gain a deeper understanding of decentralized identity and become familiar with the technologies that are made possible by using Hyperledger Aries. \nThis four-hour hands-on workshop provides beginner level opportunities to install and run the Hyperledger Aries components just like you would if you were making a real Aries-based application. Learn where to find the necessary Git repos and see how to use the Indy Command Line Interface (Indy CLI), and run the Aries toolbox to create and issue a verifiable credential.\nThis course also introduces some current projects using Hyperledger Aries to help you accelerate your understanding of decentralized identity and build the skills necessary to successfully make changes to the underlying code with hands-on guidance to develop your own projects.\nAbout the Course\nBuild Your Identity Solution Using Hyperledger Aries\nThursday, November 10, 2022 \n8 AM to noon Pacific\nRegister for free\nThis course, “Intro to Decentralized Identity,” is part of the Hyperledger Foundation Community Workshop series. It is a four hour online course that introduces the core concepts and principles of decentralized identity. As you progress, you’ll learn how to use a Hyperledger Indy-based network, be introduced to the Indy CLI, and install and run the Hyperledger Aries toolbox to create, issue, and verify a verifiable credential.\nTopics also include:\nDecentralized identity concepts and principles\nThe verifiable credential data model\nDecentralized identity ecosystem\nIntroduction to network tools Indyscan and SelfServe\nIntro to Indy CLI and how to use the CLI to access a network\nWhat Aries is\nInstall and run the Aries Toolbox\nCreate connections and issue a credential\nHow to verify a credential\n\n\n\n\nParticipants are encouraged to review the course prerequisites, including the installation of docker, installation of Indy-CLI, and download of important repositories. Information on prerequisites can be found here.\nThis course is offered by the Hyperledger Foundation for free to expand the use, contributions, and maintainer community of Hyperledger Indy and Aries. A recording of the course will be made available at the conclusion of the instructor-led event.\nRegistration links and further information about the prerequisites and course materials can be found at https://wiki.hyperledger.org/display/events/Build+Your+Identity+Solution+Using+Hyperledger+Aries \nThe post Get started with Hyperledger Aries: Accelerate your decentralized  identity skills with a free instructor-led Workshop appeared first on Hyperledger Foundation.","dc:creator":"Hyperledger","content":"<p>Hyperledger Aries is one of the fastest growing open source projects propelling the advancement and adoption of decentralized identity and verifiable credentials out there today. More companies than ever are...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/09/28/get-started-with-hyperledger-aries-accelerate-your-decentralized-identity-skills-with-a-free-instructor-led-workshop\">Get started with Hyperledger Aries: Accelerate your decentralized  identity skills with a free instructor-led Workshop</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"Hyperledger Aries is one of the fastest growing open source projects propelling the advancement and adoption of decentralized identity and verifiable credentials out there today. More companies than ever are...\nThe post Get started with Hyperledger Aries: Accelerate your decentralized  identity skills with a free instructor-led Workshop appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=226139","categories":["Blog","Hyperledger Aries","Identity","Decentralized identity","training","Verifiable Credentials","Workshop"],"isoDate":"2022-09-28T16:00:00.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Hyperledger","title":"#HyperledgerIdentity round-up: A cross section of production digital identity solutions built using Hyperledger technologies","link":"https://www.hyperledger.org/blog/2022/09/28/hyperledgeridentity-round-up-a-cross-section-of-production-digital-identity-solutions-built-using-hyperledger-technologies","pubDate":"Wed, 28 Sep 2022 23:10:07 +0000","content:encoded":"\n<p>Verifying identities and information in a digital world is critical for establishing trust. But there are issues of privacy as well as efficiency, scale and accuracy in models that rely on centralized data collectors and databases.&nbsp;</p>\n\n\n\n<p>The adoption of a new generation of digital identity solutions that leverage decentralized technologies such as distributed ledgers and verifiable credentials is accelerating. And Hyperledger technologies are playing a major role in this transformation.&nbsp;</p>\n\n\n\n<p>Read on for a cross section of the many Hyperledger-powered solutions that are in production now. For other examples, check out these past #HyperledgerIdentity round-ups:</p>\n\n\n\n<ul><li><a href=\"https://www.hyperledger.org/blog/2021/04/29/hyperledger-powered-digital-identity-solutions-at-work\">Hyperledger-Powered Digital Identity Solutions at Work</a> &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;</li><li><a href=\"https://www.hyperledger.org/blog/2020/04/30/identity-applications-in-action-powered-by-hyperledger\">Identity Applications in Action &amp; Powered by Hyperledger</a></li></ul>\n\n\n\n<p><strong>IBM Digital Health Pass</strong></p>\n\n\n\n<p><a href=\"https://www.ibm.com/products/digital-health-pass\">IBM Digital Health Pass</a>, built on<a href=\"https://www.hyperledger.org/use/fabric\"> Hyperledger Fabric</a>, offers a multi-credential verifier that organizations can use to manage and execute their verification policies for COVID-19 and vaccination status in a way that balances the privacy of the individual with the requirements set by the organization and local health authorities. With IBM Digital Health Pass, organizations can verify multiple types of health credentials, such as Good Health Pass, IBM Digital Health Pass, Smart Health Card and EU Digital COVID Certificate. Privacy is central to the solution, where the verifier application minimizes the personal data that is ever displayed to the user through the execution of business rules and it never lets any personal data leave, or be stored in, the verifier app.</p>\n\n\n\n<p><strong>Indicio Network&nbsp;</strong></p>\n\n\n\n<p>The <a href=\"https://indicio.tech/indicio-networks/\">Indicio Network</a> is a collection of four professionally-staffed, enterprise-grade public-permissioned ledgers that provide a neutral, independent, and reliable network for the exchange of verifiable credentials. <a href=\"https://indicio.tech/indicio-mainnet/\">MainNet</a>, <a href=\"https://indicio.tech/indicio-demonet/\">DemoNet</a>, <a href=\"https://indicio.tech/indicio-testnet/\">TestNet</a>, and <a href=\"https://indicio.tech/deploy-your-own-private-network-for-critical-performance-testing/\">TempNet</a> are all Hyperledger Indy-based networks with nodes operating on five continents—and a growing number of node operators. The Indicio Network is one of the networks that can support <a href=\"https://indicio.tech/indicio-proven/\">Indicio Proven</a>, a complete suite of decentralized identity components for authenticating and sharing high value data in a privacy-preserving way using verifiable digital credentials. Built on <a href=\"https://www.hyperledger.org/use/aries\">Hyperledger Aries</a> and <a href=\"https://www.hyperledger.org/use/ursa\">Hyperledger Ursa</a>, as well as AnonCreds and DIDComm, Proven is designed to make implementing and using these open source codebases simple, providing users with a fully-owned solution that’s easy to integrate with existing systems, to innovate on, and to scale.&nbsp;&nbsp;</p>\n\n\n\n<p><strong>IDUnion&nbsp;</strong></p>\n\n\n\n<p><a href=\"https://idunion.org/?lang=en\">IDUnion</a>, the European identity verification network created as part of the “Secure Digital Identities Showcase” funding project, brings together public institutions, government agencies, private organizations, associations, educational institutions and other stakeholders from various fields to enable a fundamentally new, secure digital infrastructure for the verification of identity information. In August, 2022, IDUnion spun off Sociedad Cooperativa Europea (SCE) to operate the production network for credential verification. </p>\n\n\n\n<p>The IDUnion network, which is built on <a href=\"https://www.hyperledger.org/use/hyperledger-indy\">Hyperledger Indy</a>, enables the clear verification of individuals, companies and institutions while allowing people and organizations to manage their identity information by themselves and to decide when they want to share this information and with whom. It has a decentralized structure and stores no personal data &#8211; not even as a hash. In order to protect privacy right from the start, all personal data is stored on the user&#8217;s end device. Users have a choice of wallets for storing and presenting credentials to third parties as required. Credentials are issued, verified and stored using open standards to ensure interoperability. Hyperledger Aries is the framework for managing the credentials.</p>\n\n\n\n<p><strong>NHS Covid-19 Digital Staff Passport</strong></p>\n\n\n\n<p>In 2019, the NHS was preparing to pilot a digital passport project that would allow staff to carry their HR and other records as credentials on their phones as a long-term plan to make it easier to transfer from one facility to another. When the pandemic hit, this went from a pilot to a production deployment quickly. The <a href=\"https://beta.staffpassports.nhs.uk/\">NHS Covid-19 Digital Staff Passport</a> rolled out in summer to support swift and efficient staff movement between NHS organizations in response to the response health emergency. The COVID-19 Digital Staff Passport provided a solid legal framework for staff to be temporarily deployed into other NHS organizations with evidence available that checks have been completed before staff move. As laid out in the pilot, the information was transferred securely by the staff member as verified credentials stored on their own smartphone, putting them in control.</p>\n\n\n\n<p>This staff passport used the <a href=\"https://sovrin.org/overview/\">Sorvin Network</a>, which is built on Hyperledger Indy, to verify the digital credentials, and the Evernym (now Avast) <a href=\"https://connect.me/\">Connect.me</a> digital wallet app, which is powered by Hyperledger Aries, Indy and Ursa, to enable staff to store and share their credentials.&nbsp;</p>\n\n\n\n<p>The NHS is now gearing up to roll out the <a href=\"https://beta.staffpassports.nhs.uk/whats-next.htm\">next generation</a> of its Digital Staff Passport, which will streamline transfers and staff movements through the NHS.&nbsp;</p>\n\n\n\n<p><strong>OrgBook BC&nbsp;</strong></p>\n\n\n\n<p><a href=\"https://orgbook.gov.bc.ca/search\">OrgBook BC</a> is a searchable public directory of organizations registered in British Columbia, Canada, provided by the BC Government’s Ministry of Citizens’ Services. OrgBook BC provides verified data, including legal names and DBA names, business numbers, BC registration status and select licensee and permits, for more than 1.4 million organizations. All of the information in the OrgBookBC is received, stored, verified and displayed using the latest digital trust technologies.&nbsp;</p>\n\n\n\n<p>OrgBookBC uses verifiable credentials to ensure that information about organizations are digitally signed by the entity that issues it. Issuers are public sector organizations that hold information about businesses, issue licenses or permits or certify processes. That electronic signature stays with the data throughout its life in OrgBook and is validated before its is display on the website.&nbsp;</p>\n\n\n\n<p>OrgBookBC is part of an overall commitment to digital trust technologies by the Government of British Columbia. In addition to deploying Hyperledger Aries, Indy and Ursa, the team there is leading much of the open source development for those projects. Read more on the Government of BC’s investment in verifiable credentials and digital wallet technologies <a href=\"https://www.hyperledger.org/blog/2022/08/23/investing-in-verifiable-credentials-technical-interoperability-and-open-source\">here</a>.&nbsp;</p>\n\n\n\n<p><strong>Digital Identity updates from Hyperledger Global Forum</strong></p>\n\n\n\n<p>At Hyperledger Global Forum 2022, there was a range of business, technical and demo sessions focused on digital identity, including:</p>\n\n\n\n<ul><li><a href=\"https://sched.co/14H61\">Bringing Trustworthiness in Industrial Device Lifecycle using Verifiable Credentials &#8211; Marquart Franz &amp; Saad Bin Shams, Siemens AG</a></li></ul>\n\n\n\n<ul><li><a href=\"https://sched.co/14H5g\">Findy Agency — Highway to Verified Data Networks</a> – Laura Vuorenoja &amp; Harri Lainio, OP Financial Group</li></ul>\n\n\n\n<ul><li><a href=\"https://sched.co/14H6n\">Digital Identity Using the vLEI</a> – Christoph Schneider, Global Legal Entity Identifier Foundation (GLEIF)</li></ul>\n\n\n\n<ul><li><a href=\"https://sched.co/14H5m\">Blockchain, Biometrics and Geo-Location: Lessons Learned from the Implementation of Innovative Technologies at the United Nations Joint Staff Pension Fund</a> – Dino Cataldo Dellaccio, United Nations Joint Staff Pension Fund &amp; Shashank Rai, United Nations International Computing Centre (UNICC)</li></ul>\n\n\n\n<ul><li><a href=\"https://sched.co/14H6e\">Hosted Discussion: Rhode Island Leads on Digital Identity Solutions with Hyperledger</a> – Liz Tanner, State of Rhode Island &amp; Jim Mason, DTCC</li></ul>\n\n\n\n<ul><li><a href=\"https://sched.co/14H4u\">Last Mile Problem in Self-Sovereign Identity – Biometric Authentification and Device Independent Wallet for Hyperledger Indy</a> – Non Kawana &amp; Ken Naganuma, Hitachi, Ltd.</li></ul>\n\n\n\n<ul><li><a href=\"https://sched.co/15Bid\">Workshop: How To Build a Self-Sovereign Identity Agent With Hyperledger Aries Framework JavaScript</a> – Timo Glastra &amp; Berend Sliedrecht, ANIMO &amp; Jakub Koci, ABSA</li></ul>\n\n\n\n<p><a href=\"https://twitter.com/Hyperledger\">Join the conversation</a> about blockchain-based identity technologies and solutions with #HyperledgerIdentity on social channels. For a hands-on introduction to the market and technologies, join the free four hour <a href=\"https://wiki.hyperledger.org/display/events/Build+Your+Identity+Solution+Using+Hyperledger+Aries\">Build Your Identity Solution Using Hyperledger Aries</a> workshop. Or, for a more business level introduction, sign up for the free <a href=\"https://training.linuxfoundation.org/blog/learn-the-fundamentals-of-self-sovereign-identity-in-free-online-training-course/?utm_medium=partner-marketing&amp;utm_source=lf&amp;utm_campaign=linuxfoundation&amp;utm_content=pr-lfs178\">Getting Started with Self-Sovereign Identity (LFS178x)</a> online course from Linux Foundation Training &amp; Certification.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/09/28/hyperledgeridentity-round-up-a-cross-section-of-production-digital-identity-solutions-built-using-hyperledger-technologies\">#HyperledgerIdentity round-up: A cross section of production digital identity solutions built using Hyperledger technologies</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"Verifying identities and information in a digital world is critical for establishing trust. But there are issues of privacy as well as efficiency, scale and accuracy in models that rely on centralized data collectors and databases. \nThe adoption of a new generation of digital identity solutions that leverage decentralized technologies such as distributed ledgers and verifiable credentials is accelerating. And Hyperledger technologies are playing a major role in this transformation. \nRead on for a cross section of the many Hyperledger-powered solutions that are in production now. For other examples, check out these past #HyperledgerIdentity round-ups:\nHyperledger-Powered Digital Identity Solutions at Work                \nIdentity Applications in Action & Powered by Hyperledger\n\n\n\n\nIBM Digital Health Pass\nIBM Digital Health Pass, built on Hyperledger Fabric, offers a multi-credential verifier that organizations can use to manage and execute their verification policies for COVID-19 and vaccination status in a way that balances the privacy of the individual with the requirements set by the organization and local health authorities. With IBM Digital Health Pass, organizations can verify multiple types of health credentials, such as Good Health Pass, IBM Digital Health Pass, Smart Health Card and EU Digital COVID Certificate. Privacy is central to the solution, where the verifier application minimizes the personal data that is ever displayed to the user through the execution of business rules and it never lets any personal data leave, or be stored in, the verifier app.\nIndicio Network \nThe Indicio Network is a collection of four professionally-staffed, enterprise-grade public-permissioned ledgers that provide a neutral, independent, and reliable network for the exchange of verifiable credentials. MainNet, DemoNet, TestNet, and TempNet are all Hyperledger Indy-based networks with nodes operating on five continents—and a growing number of node operators. The Indicio Network is one of the networks that can support Indicio Proven, a complete suite of decentralized identity components for authenticating and sharing high value data in a privacy-preserving way using verifiable digital credentials. Built on Hyperledger Aries and Hyperledger Ursa, as well as AnonCreds and DIDComm, Proven is designed to make implementing and using these open source codebases simple, providing users with a fully-owned solution that’s easy to integrate with existing systems, to innovate on, and to scale.  \nIDUnion \nIDUnion, the European identity verification network created as part of the “Secure Digital Identities Showcase” funding project, brings together public institutions, government agencies, private organizations, associations, educational institutions and other stakeholders from various fields to enable a fundamentally new, secure digital infrastructure for the verification of identity information. In August, 2022, IDUnion spun off Sociedad Cooperativa Europea (SCE) to operate the production network for credential verification. \nThe IDUnion network, which is built on Hyperledger Indy, enables the clear verification of individuals, companies and institutions while allowing people and organizations to manage their identity information by themselves and to decide when they want to share this information and with whom. It has a decentralized structure and stores no personal data – not even as a hash. In order to protect privacy right from the start, all personal data is stored on the user’s end device. Users have a choice of wallets for storing and presenting credentials to third parties as required. Credentials are issued, verified and stored using open standards to ensure interoperability. Hyperledger Aries is the framework for managing the credentials.\nNHS Covid-19 Digital Staff Passport\nIn 2019, the NHS was preparing to pilot a digital passport project that would allow staff to carry their HR and other records as credentials on their phones as a long-term plan to make it easier to transfer from one facility to another. When the pandemic hit, this went from a pilot to a production deployment quickly. The NHS Covid-19 Digital Staff Passport rolled out in summer to support swift and efficient staff movement between NHS organizations in response to the response health emergency. The COVID-19 Digital Staff Passport provided a solid legal framework for staff to be temporarily deployed into other NHS organizations with evidence available that checks have been completed before staff move. As laid out in the pilot, the information was transferred securely by the staff member as verified credentials stored on their own smartphone, putting them in control.\nThis staff passport used the Sorvin Network, which is built on Hyperledger Indy, to verify the digital credentials, and the Evernym (now Avast) Connect.me digital wallet app, which is powered by Hyperledger Aries, Indy and Ursa, to enable staff to store and share their credentials. \nThe NHS is now gearing up to roll out the next generation of its Digital Staff Passport, which will streamline transfers and staff movements through the NHS. \nOrgBook BC \nOrgBook BC is a searchable public directory of organizations registered in British Columbia, Canada, provided by the BC Government’s Ministry of Citizens’ Services. OrgBook BC provides verified data, including legal names and DBA names, business numbers, BC registration status and select licensee and permits, for more than 1.4 million organizations. All of the information in the OrgBookBC is received, stored, verified and displayed using the latest digital trust technologies. \nOrgBookBC uses verifiable credentials to ensure that information about organizations are digitally signed by the entity that issues it. Issuers are public sector organizations that hold information about businesses, issue licenses or permits or certify processes. That electronic signature stays with the data throughout its life in OrgBook and is validated before its is display on the website. \nOrgBookBC is part of an overall commitment to digital trust technologies by the Government of British Columbia. In addition to deploying Hyperledger Aries, Indy and Ursa, the team there is leading much of the open source development for those projects. Read more on the Government of BC’s investment in verifiable credentials and digital wallet technologies here. \nDigital Identity updates from Hyperledger Global Forum\nAt Hyperledger Global Forum 2022, there was a range of business, technical and demo sessions focused on digital identity, including:\nBringing Trustworthiness in Industrial Device Lifecycle using Verifiable Credentials – Marquart Franz & Saad Bin Shams, Siemens AG\n\n\n\n\n\nFindy Agency — Highway to Verified Data Networks – Laura Vuorenoja & Harri Lainio, OP Financial Group\n\n\n\n\n\nDigital Identity Using the vLEI – Christoph Schneider, Global Legal Entity Identifier Foundation (GLEIF)\n\n\n\n\n\nBlockchain, Biometrics and Geo-Location: Lessons Learned from the Implementation of Innovative Technologies at the United Nations Joint Staff Pension Fund – Dino Cataldo Dellaccio, United Nations Joint Staff Pension Fund & Shashank Rai, United Nations International Computing Centre (UNICC)\n\n\n\n\n\nHosted Discussion: Rhode Island Leads on Digital Identity Solutions with Hyperledger – Liz Tanner, State of Rhode Island & Jim Mason, DTCC\n\n\n\n\n\nLast Mile Problem in Self-Sovereign Identity – Biometric Authentification and Device Independent Wallet for Hyperledger Indy – Non Kawana & Ken Naganuma, Hitachi, Ltd.\n\n\n\n\n\nWorkshop: How To Build a Self-Sovereign Identity Agent With Hyperledger Aries Framework JavaScript – Timo Glastra & Berend Sliedrecht, ANIMO & Jakub Koci, ABSA\n\n\n\n\nJoin the conversation about blockchain-based identity technologies and solutions with #HyperledgerIdentity on social channels. For a hands-on introduction to the market and technologies, join the free four hour Build Your Identity Solution Using Hyperledger Aries workshop. Or, for a more business level introduction, sign up for the free Getting Started with Self-Sovereign Identity (LFS178x) online course from Linux Foundation Training & Certification.\nThe post #HyperledgerIdentity round-up: A cross section of production digital identity solutions built using Hyperledger technologies appeared first on Hyperledger Foundation.","dc:creator":"Hyperledger","content":"<p>Verifying identities and information in a digital world is critical for establishing trust. But there are issues of privacy as well as efficiency, scale and accuracy in models that rely...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/09/28/hyperledgeridentity-round-up-a-cross-section-of-production-digital-identity-solutions-built-using-hyperledger-technologies\">#HyperledgerIdentity round-up: A cross section of production digital identity solutions built using Hyperledger technologies</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"Verifying identities and information in a digital world is critical for establishing trust. But there are issues of privacy as well as efficiency, scale and accuracy in models that rely...\nThe post #HyperledgerIdentity round-up: A cross section of production digital identity solutions built using Hyperledger technologies appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=226163","categories":["Blog","Hyperledger Aries","Hyperledger Fabric","Hyperledger Indy","Hyperledger Ursa","Identity","#HyperledgerIdentity","Digital Identity","Hyperledger in action","self-sovereign identity"],"isoDate":"2022-09-28T23:10:07.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Hyperledger","title":"Climate Action and Accounting Special Interest Group (CA2SIG) wins The Hyperledger Challenge 2022!","link":"https://www.hyperledger.org/blog/2022/10/05/climate-action-and-accounting-special-interest-group-ca2sig-wins-the-hyperledger-challenge-2022","pubDate":"Thu, 06 Oct 2022 00:01:09 +0000","content:encoded":"\n<p>The Hyperledger Climate Action and Accounting Special Interest Group (CA2SIG) has just taken first place in the <a href=\"https://www.hyperledger.org/blog/2022/02/11/hyperledger-challenge-2022-is-all-set\">Hyperledger Challenge 2022</a> for its prototype for <a href=\"https://wiki.hyperledger.org/display/events/Reducing+Methane+Leakage+and+Flaring+with+Supply+Chain+Tokens\">Reducing Methane Leakage and Flaring with Supply Chain Tokens</a>. </p>\n\n\n\n<p>The Hyperledger Challenge 2022 took into careful consideration the following factors: </p>\n\n\n\n<p>1. Technology advancement and research objectives<br>2. Impact to the blockchain ecosystem<br>3. Value addition through social benefits<br>4. Process followed to build an open-source community around the proposed project<br>5. Activities outside the Hyperledger community to build the ecosystem<br>6. Bring in innovation in the marketplace<br>7. Headway into the community that is not represented well within the ecosystem.</p>\n\n\n\n<p>This Hyperledger Challenge 2022 award follows the recent announcement of another award from <a href=\"https://www.hyperledger.org/blog/2022/08/19/hyperledger-climate-action-and-accounting-special-interest-group-takes-first-place-in-the-2022-ibm-call-for-code-green-practices-accelerator\">IBM’s 2022 Call for Code Green Practices Accelerator</a>, where the CA2SIG team also took first place for its prototype.&nbsp;</p>\n\n\n\n<p>&#8220;<em>The team would like to thank the Hyperledger Challenge 2022 team for supporting our project. These recent wins/awards provide our team with added momentum and validation for the solution we are developing and the larger problem we seek to solve. Moving forward our focus is on marketing our solution to the energy industry and helping to scale auditing services, crucial to achieving climate targets by mid century. </em>&#8221; &#8211; Bertrand Rioux, Director, Two Ravens Energy &amp; Climate Consulting</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh5.googleusercontent.com/P7nLCkRpGaCAVOXpTDTgMxl5OaTmUJHRWm0Lv1uxqie6rQDhSDmzfsEqvTs413uaf9mIe034865pBxxIiyB0hjMypkGsocpBLQGKeTL22K99EkwRXXFXqTqRGgQc7ITgeVuk5uQHCqrgX38UCoYzUUk941uwVn36su24broJJ9bBKHq25Pa_ZXSl\" alt=\"\"/></figure>\n\n\n\n<p>This prototype, which is built using <a href=\"https://www.hyperledger.org/use/besu\">Hyperledger Besu</a>, <a href=\"https://www.hyperledger.org/use/fabric\">Hyperledger Fabric</a>, <a href=\"https://www.hyperledger.org/use/bevel\">Hyperledger Bevel</a> and <a href=\"https://www.hyperledger.org/use/cactus\">Hyperledger Cactus</a>, represents an important step towards creating an open climate accounting system that can be used to decarbonize corporate supply chains. By building a solution that can provide a free flow of trusted environmental data, we can create a more efficient marketplace that can unlock the power of green finance, consumer demand and government regulation to work together to decarbonize corporate supply chains. `</p>\n\n\n\n<p>Click the CA2SIG <a href=\"https://drive.google.com/file/d/1fF0QTYjj3fQ0BlGrh9CuvIMZKyhFgUuR/view?usp=sharing\">One-Pager</a> to learn more. We also invite you to visit the <a href=\"https://wiki.hyperledger.org/display/CASIG/\">Climate Action and Accounting Wiki</a> or join one of our bi-monthly meetings to learn about the different opportunities to get involved!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/05/climate-action-and-accounting-special-interest-group-ca2sig-wins-the-hyperledger-challenge-2022\">Climate Action and Accounting Special Interest Group (CA2SIG) wins The Hyperledger Challenge 2022!</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"The Hyperledger Climate Action and Accounting Special Interest Group (CA2SIG) has just taken first place in the Hyperledger Challenge 2022 for its prototype for Reducing Methane Leakage and Flaring with Supply Chain Tokens. \nThe Hyperledger Challenge 2022 took into careful consideration the following factors: \n1. Technology advancement and research objectives\n2. Impact to the blockchain ecosystem\n3. Value addition through social benefits\n4. Process followed to build an open-source community around the proposed project\n5. Activities outside the Hyperledger community to build the ecosystem\n6. Bring in innovation in the marketplace\n7. Headway into the community that is not represented well within the ecosystem.\nThis Hyperledger Challenge 2022 award follows the recent announcement of another award from IBM’s 2022 Call for Code Green Practices Accelerator, where the CA2SIG team also took first place for its prototype. \n“The team would like to thank the Hyperledger Challenge 2022 team for supporting our project. These recent wins/awards provide our team with added momentum and validation for the solution we are developing and the larger problem we seek to solve. Moving forward our focus is on marketing our solution to the energy industry and helping to scale auditing services, crucial to achieving climate targets by mid century. ” – Bertrand Rioux, Director, Two Ravens Energy & Climate Consulting\n\n\n\n\nThis prototype, which is built using Hyperledger Besu, Hyperledger Fabric, Hyperledger Bevel and Hyperledger Cactus, represents an important step towards creating an open climate accounting system that can be used to decarbonize corporate supply chains. By building a solution that can provide a free flow of trusted environmental data, we can create a more efficient marketplace that can unlock the power of green finance, consumer demand and government regulation to work together to decarbonize corporate supply chains. `\nClick the CA2SIG One-Pager to learn more. We also invite you to visit the Climate Action and Accounting Wiki or join one of our bi-monthly meetings to learn about the different opportunities to get involved!\nThe post Climate Action and Accounting Special Interest Group (CA2SIG) wins The Hyperledger Challenge 2022! appeared first on Hyperledger Foundation.","dc:creator":"Hyperledger","content":"<p>The Hyperledger Climate Action and Accounting Special Interest Group (CA2SIG) has just taken first place in the Hyperledger Challenge 2022 for its prototype for Reducing Methane Leakage and Flaring with...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/05/climate-action-and-accounting-special-interest-group-ca2sig-wins-the-hyperledger-challenge-2022\">Climate Action and Accounting Special Interest Group (CA2SIG) wins The Hyperledger Challenge 2022!</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"The Hyperledger Climate Action and Accounting Special Interest Group (CA2SIG) has just taken first place in the Hyperledger Challenge 2022 for its prototype for Reducing Methane Leakage and Flaring with...\nThe post Climate Action and Accounting Special Interest Group (CA2SIG) wins The Hyperledger Challenge 2022! appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=226251","categories":["Blog","Climate","Hyperledger Besu","Hyperledger Bevel","Hyperledger Cacti","Hyperledger Fabric","Special Interest Group","carbon accounting","Hyperledger Challenge","open source","Supply chain"],"isoDate":"2022-10-06T00:01:09.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Hyperledger","title":"LACChain introduces permissioned public blockchain ecosystem built on Hyperledger Besu to Latin America","link":"https://www.hyperledger.org/blog/2022/10/12/lacchain-introduces-permissioned-public-blockchain-ecosystem-built-on-hyperledger-besu-to-latin-america","pubDate":"Wed, 12 Oct 2022 17:00:00 +0000","content:encoded":"\n<p><strong>Read the full case study </strong><a href=\"https://www.hyperledger.org/learn/publications/lacchain-case-study\"><strong>here</strong></a><strong>.</strong></p>\n\n\n\n<p>Permissionless public blockchains are accessible to anyone, but they’re often unsuitable for heavily regulated institutions, like banks or public-sector initiatives. Permissioned private blockchains offer what permissionless public ones lack, but they also cost a lot to develop and maintain, making them hard to scale. Yet blockchain remains the ideal solution for many use cases.</p>\n\n\n\n<p>The Inter-American Development Bank (IDB) struggled to find the balance by using different networks for different projects. But this variety came with other issues, like compliance, technical support, and accountability. These challenges prevented IDB’s pilot projects from expanding into enterprise-level projects.&nbsp;&nbsp;</p>\n\n\n\n<p>IDB Lab is the innovation laboratory for IDB. It set about finding solutions to the problems of regulatory compliance, support, and governance. As it looked into the problem, IDB Lab noticed similar struggles throughout Latin America and the Caribbean (LAC). Organizations were looking for an alternative to permissionless public and private blockchain networks to deploy their solutions.</p>\n\n\n\n<p>Permissioned public networks—combining the benefits of the other blockchains without their drawbacks—seemed like the answer. Successful networks already existed in the EU, and IDB Lab thought it could develop one for LAC. In March 2019, with support from a global alliance for developing blockchain in Latin America and the Caribbean, IDB Labs funded a project to create LACChain, a permissioned public blockchain infrastructure in an effort to build a scalable and sustainable network for the LAC region…and beyond.</p>\n\n\n\n<p>Now, LACChain, which is built using <a href=\"https://www.hyperledger.org/use/besu\">Hyperledger Besu</a> as an enterprise Ethereum client, has become the world’s largest public permissioned network with 15 countries participating in the ecosystem. It has over 190 nodes and supports more than 60 projects, including 40 that impact financial and social inclusion. And there is a strategy for long-term orchestration of the network via the not-for-profit LACNet.</p>\n\n\n\n<p>The Hyperledger Foundation team worked with LACChain on a case study that details the goals and approach for creating the network. The behind the scenes look at launching LACChain also delves into the technology and governance planning behind the project as well as results to date and plans for growth for this network.</p>\n\n\n\n<p><strong>Read the full case study </strong><a href=\"https://www.hyperledger.org/learn/publications/lacchain-case-study\"><strong>here</strong></a><strong>.</strong></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/12/lacchain-introduces-permissioned-public-blockchain-ecosystem-built-on-hyperledger-besu-to-latin-america\">LACChain introduces permissioned public blockchain ecosystem built on Hyperledger Besu to Latin America</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"Read the full case study here.\nPermissionless public blockchains are accessible to anyone, but they’re often unsuitable for heavily regulated institutions, like banks or public-sector initiatives. Permissioned private blockchains offer what permissionless public ones lack, but they also cost a lot to develop and maintain, making them hard to scale. Yet blockchain remains the ideal solution for many use cases.\nThe Inter-American Development Bank (IDB) struggled to find the balance by using different networks for different projects. But this variety came with other issues, like compliance, technical support, and accountability. These challenges prevented IDB’s pilot projects from expanding into enterprise-level projects.  \nIDB Lab is the innovation laboratory for IDB. It set about finding solutions to the problems of regulatory compliance, support, and governance. As it looked into the problem, IDB Lab noticed similar struggles throughout Latin America and the Caribbean (LAC). Organizations were looking for an alternative to permissionless public and private blockchain networks to deploy their solutions.\nPermissioned public networks—combining the benefits of the other blockchains without their drawbacks—seemed like the answer. Successful networks already existed in the EU, and IDB Lab thought it could develop one for LAC. In March 2019, with support from a global alliance for developing blockchain in Latin America and the Caribbean, IDB Labs funded a project to create LACChain, a permissioned public blockchain infrastructure in an effort to build a scalable and sustainable network for the LAC region…and beyond.\nNow, LACChain, which is built using Hyperledger Besu as an enterprise Ethereum client, has become the world’s largest public permissioned network with 15 countries participating in the ecosystem. It has over 190 nodes and supports more than 60 projects, including 40 that impact financial and social inclusion. And there is a strategy for long-term orchestration of the network via the not-for-profit LACNet.\nThe Hyperledger Foundation team worked with LACChain on a case study that details the goals and approach for creating the network. The behind the scenes look at launching LACChain also delves into the technology and governance planning behind the project as well as results to date and plans for growth for this network.\nRead the full case study here.\nThe post LACChain introduces permissioned public blockchain ecosystem built on Hyperledger Besu to Latin America appeared first on Hyperledger Foundation.","dc:creator":"Hyperledger","content":"<p>Read the full case study here. Permissionless public blockchains are accessible to anyone, but they’re often unsuitable for heavily regulated institutions, like banks or public-sector initiatives. Permissioned private blockchains offer...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/12/lacchain-introduces-permissioned-public-blockchain-ecosystem-built-on-hyperledger-besu-to-latin-america\">LACChain introduces permissioned public blockchain ecosystem built on Hyperledger Besu to Latin America</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"Read the full case study here. Permissionless public blockchains are accessible to anyone, but they’re often unsuitable for heavily regulated institutions, like banks or public-sector initiatives. Permissioned private blockchains offer...\nThe post LACChain introduces permissioned public blockchain ecosystem built on Hyperledger Besu to Latin America appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=226335","categories":["Blog","Governance","Hyperledger Besu","case study","LAC","Latin America"],"isoDate":"2022-10-12T17:00:00.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Ry Jones and David Boswell, Community Architects","title":"Staff Corner: Thanking community members for their contributions","link":"https://www.hyperledger.org/blog/2022/10/14/staff-corner-thanking-community-members-for-their-contributions","pubDate":"Fri, 14 Oct 2022 16:00:00 +0000","content:encoded":"\n<p>Our community is strong and growing thanks to hundreds of community leaders around the world. We recently got back from <a href=\"https://events.linuxfoundation.org/hyperledger-global-forum/\">Hyperledger Global Forum 2022</a> in Dublin where the strength of our community was displayed in force. While we were there, we had the opportunity to recognize our community members in a number of fun (and hopefully meaningful) ways.&nbsp;</p>\n\n\n\n<p>This year, on the main stage, we announced the winners of our annual Community Recognition Awards:</p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"2022 Community Recognition - Hyperledger Awards Ceremony\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/E21m2ktLqWM?feature=oembed&#038;enablejsapi=1&#038;origin=https://www.hyperledger.org\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>This year’s honorees were:</p>\n\n\n\n<ul><li><strong>Daniel Szegö, DLT Advisor, CBDC Think Tank Budapest</strong> &#8211; Recognised for hosting the most meetups of any organizer this year and doing events in three languages, In addition, he also actively brings community members together around Hyperledger Fabric and Kubernetes projects</li><li><strong>Josh Kneubuhl, IBM Research, IBM</strong> &#8211; Recognized for his cross project and lab collaboration with the Hyperledger Fabric community.</li><li><strong>Arun S M, Staff Software Engineer, Walmart Global Tech India </strong>&#8211; Recognized for his active role in welcoming new community members on Discord and as one of the leaders of the Hyperledger India Chapter.</li><li><strong>Char Howland, Software Engineer, Indicio</strong> &#8211; Recognized for her active role in the Hyperledger Aries/Identity community, including running the identity implementers calls and welcoming new members to that growing community.</li><li><strong>Nicko Guyer, Senior Full Stack Engineer, Kaleido </strong>&#8211; Recognized for being very active on Discord and Github and very good at onboarding new people into the Hyperledger FireFly community.</li><li><strong>Andrew Whitehead, Senior Software Architect, Portage CyberTech</strong> &#8211; Recognized for being an active Hyperledger Aries contributor who helps with onboarding new people and does a lot of work on security.</li><li><strong>Antoine Toulme, Senior Engineering Manager, Splunk </strong>&#8211; Recognized for being extremely responsive on the Hyperledger Besu channels as well as contributing workshops and more.</li><li><strong>Marcos Sarres, Director Executivo, GoLedger</strong> &#8211; Recognized as a co-lead our Hyperledger Brazil Chapter and organizer of many very well received meetups for the community this year.</li><li><strong>Vipin Bharathan, Principal Consultant, dlt.nyc </strong>&#8211; Recognized for running the Identity WG, serving as the Chair of our Financial Services SIG and doing so much to welcome others into our community.</li><li><strong>Peter Somogyvari, Software Product Architecture Manager, Accenture</strong> &#8211; Recognized for always making the time to onboard and help new community members, taking on multiple mentees through our mentorship program and so much more.</li></ul>\n\n\n\n<p class=\"has-text-align-center\" style=\"font-size:11px\"><img style=\"\" src=\"https://lh4.googleusercontent.com/fCKDQIYawdtQyycrbHBSGkK4v_6moGRHNWRvHQVZYHd6hELy0FiE-_VKFuq9SxOphw1u7wuYayVZ6XboE8VhaM4-4KzfS_3qwWiDMRHY5ona6vFr9M4Gif25C0fFw9jStVMH2idv8SEHAs0L_W8oOh001bDzFyHde9JfdsOENwmQbgtbuPJmcdBP\"><br><em>Hyperledger Foundation Executive Governing Board Chair David Treat, Executive&nbsp; Director Daniela Barbosa and Senior Director of Community Architects David Boswell join Community Recognition Awards recipients Marcos Sarres of GoLedger, Arun S M of Walmart Global Tech India, Vipin Bharathan of dlt.nyc, Nicko Guyer of Kaleido and Josh Kneubuhl of IBM&nbsp; on stage at Hyperledger Global Forum 2022 in Dublin.</em></p>\n\n\n\n<p class=\"has-text-align-center\" style=\"font-size:11px\"><img style=\"\" src=\"https://lh6.googleusercontent.com/PPxiwPLZexrvrEc_7zBRvDrQ72d7JFIPkK52rW4-B8pPffONIneRQdeF0ekQ22vqd-mYqrFRplaBfCmAiLpQ3vxq9eXNV8mLWcfPpaOBEUDRLBDPHXVPHGcj3cJuUaFhOXOos_NUGtEPwvcRZV0Fv2N_8HQJrTOMd-h8DP37TUGG95allSov3wXT5A\"><br><em>Daniela Barbosa presents Community Recognition Awards to Accenute’s Peter Somogyvari and Splunk’s Antoine Toulme</em></p>\n\n\n\n<p>Throughout the event, we were also handing out small pieces of swag to thank the community members who were there. Taking the time to travel to the event and spend multiple days meeting and talking with others is an important contribution attendees were making to the health of the Hyperledger community. We wanted to recognize them for their time, effort and commitment.</p>\n\n\n\n<p>One of the items we were giving out were Hyperledger coins that said “Community Code Collaboration Contribution” on the back and had 2022 on the front. Since the event this year was being held in Dublin, we designed the coins to have the two color look of a <a href=\"https://en.wikipedia.org/wiki/2_euro_coin\">2 euro coin</a>.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/T4F_L06Zfh8ri9nffC-nfQA_95NfpD3i4KGXXRwoltYHjuRaDyzK26VEhRKw5yXiVUKBepNJ1tZzLyR1HlQn67PqincR8dIhcCpFHwDrLmPcNtg8572rb9Dtq376Y0A3OJC6kwq8l1pYGqyOcRspJne56MVX5rYCjXZmPrDQKssn6Y7bpqACuS1yYQ\" alt=\"\"/></figure>\n\n\n\n<p>We started making coins to thank community members – an idea long championed by our current TOC Chair, <a href=\"https://github.com/tkuhrt\">Tracy Kuhrt</a> &#8211; in 2021. People seemed to like them so we wanted to do it again this year. It also seems fun to have an ongoing series of coins that change each year that people can collect to show how long they’ve been active in the community. We don’t know what a 2023 coin would look like yet, so feel free to send us suggestions.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh5.googleusercontent.com/-V2NX8TowBQBlZ4YaIsxrAEM_AzuZza9C53Dhl5VVLLuiGtbgKEYQJzTrtHy8EWXFhJldbZsX6scYLVLHQPfd1DTYqIS9LK1Osbjl9oh0higFMdJCCxChV3MefQ-XcAOyQg0LzHxFggnBh6yzJvY1Vp5rfKZDBuSyZjvdhS1p-6XEbWfL8m1kuVO6g\" alt=\"\"/></figure>\n\n\n\n<p>For special occasions, we&#8217;ve also engraved the coins for some of the technical leaders in the community. Check out this video of a coin being engraved by a laser for <a href=\"https://youtu.be/aGe-ry7AbAw\">Danno Ferrin</a>, our TOC Vice Chair:</p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"@shemnon\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/aGe-ry7AbAw?feature=oembed&#038;enablejsapi=1&#038;origin=https://www.hyperledger.org\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>There are many other ways to recognize people for the contributions they make &#8211; one of <a href=\"https://github.com/ntp-project/ntp/blob/9c75327c3796ff59ac648478cd4da8b205bceb77/ntpd/ntp_control.c#L3807\">Ry’s personal favorites is a comment in the NTPd source code</a>. At the Hyperledger Foundation, we&#8217;ve also<a href=\"https://www.credly.com/badges/f0112709-7a9c-429e-83e4-b2322c5f1258/public_url\"> issued badges</a>, given<a href=\"https://raw.githubusercontent.com/ryjones/recognition/main/2020.jpg\"> poker</a><a href=\"https://raw.githubusercontent.com/ryjones/recognition/main/2019.jpg\"> chips</a> for events and<a href=\"https://raw.githubusercontent.com/ryjones/recognition/main/token-obverse.jpg\"> other</a><a href=\"https://raw.githubusercontent.com/ryjones/recognition/main/token-reverse.jpg\"> contributions</a>, published <a href=\"https://www.hyperledger.org/category/developer-showcase\">Developer Showcase blog posts</a> and have made stickers and shirts.</p>\n\n\n\n<p>Different ways to recognize people will be relevant for different people. Some people may want a coin or shirt and others may not. We’re interested to hear what sort of recognition is important to you so we can make sure what we do is meaningful. Please send us your thoughts (email <a href=\"mailto:community-architects@hyperledger.org\">community-architects@hyperledger.org</a>). And, if you’d like to earn a coin, a token, a badge or anything else, <a href=\"https://www.hyperledger.org/participate\">get involved in the community</a>, and we’ll be happy to thank you for your contributions.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/14/staff-corner-thanking-community-members-for-their-contributions\">Staff Corner: Thanking community members for their contributions</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"Our community is strong and growing thanks to hundreds of community leaders around the world. We recently got back from Hyperledger Global Forum 2022 in Dublin where the strength of our community was displayed in force. While we were there, we had the opportunity to recognize our community members in a number of fun (and hopefully meaningful) ways. \nThis year, on the main stage, we announced the winners of our annual Community Recognition Awards:\n\n\n\n\n\n\nThis year’s honorees were:\nDaniel Szegö, DLT Advisor, CBDC Think Tank Budapest – Recognised for hosting the most meetups of any organizer this year and doing events in three languages, In addition, he also actively brings community members together around Hyperledger Fabric and Kubernetes projects\nJosh Kneubuhl, IBM Research, IBM – Recognized for his cross project and lab collaboration with the Hyperledger Fabric community.\nArun S M, Staff Software Engineer, Walmart Global Tech India – Recognized for his active role in welcoming new community members on Discord and as one of the leaders of the Hyperledger India Chapter.\nChar Howland, Software Engineer, Indicio – Recognized for her active role in the Hyperledger Aries/Identity community, including running the identity implementers calls and welcoming new members to that growing community.\nNicko Guyer, Senior Full Stack Engineer, Kaleido – Recognized for being very active on Discord and Github and very good at onboarding new people into the Hyperledger FireFly community.\nAndrew Whitehead, Senior Software Architect, Portage CyberTech – Recognized for being an active Hyperledger Aries contributor who helps with onboarding new people and does a lot of work on security.\nAntoine Toulme, Senior Engineering Manager, Splunk – Recognized for being extremely responsive on the Hyperledger Besu channels as well as contributing workshops and more.\nMarcos Sarres, Director Executivo, GoLedger – Recognized as a co-lead our Hyperledger Brazil Chapter and organizer of many very well received meetups for the community this year.\nVipin Bharathan, Principal Consultant, dlt.nyc – Recognized for running the Identity WG, serving as the Chair of our Financial Services SIG and doing so much to welcome others into our community.\nPeter Somogyvari, Software Product Architecture Manager, Accenture – Recognized for always making the time to onboard and help new community members, taking on multiple mentees through our mentorship program and so much more.\n\n\n\n\n\nHyperledger Foundation Executive Governing Board Chair David Treat, Executive  Director Daniela Barbosa and Senior Director of Community Architects David Boswell join Community Recognition Awards recipients Marcos Sarres of GoLedger, Arun S M of Walmart Global Tech India, Vipin Bharathan of dlt.nyc, Nicko Guyer of Kaleido and Josh Kneubuhl of IBM  on stage at Hyperledger Global Forum 2022 in Dublin.\n\nDaniela Barbosa presents Community Recognition Awards to Accenute’s Peter Somogyvari and Splunk’s Antoine Toulme\nThroughout the event, we were also handing out small pieces of swag to thank the community members who were there. Taking the time to travel to the event and spend multiple days meeting and talking with others is an important contribution attendees were making to the health of the Hyperledger community. We wanted to recognize them for their time, effort and commitment.\nOne of the items we were giving out were Hyperledger coins that said “Community Code Collaboration Contribution” on the back and had 2022 on the front. Since the event this year was being held in Dublin, we designed the coins to have the two color look of a 2 euro coin.\n\n\n\n\nWe started making coins to thank community members – an idea long championed by our current TOC Chair, Tracy Kuhrt – in 2021. People seemed to like them so we wanted to do it again this year. It also seems fun to have an ongoing series of coins that change each year that people can collect to show how long they’ve been active in the community. We don’t know what a 2023 coin would look like yet, so feel free to send us suggestions.\n\n\n\n\nFor special occasions, we’ve also engraved the coins for some of the technical leaders in the community. Check out this video of a coin being engraved by a laser for Danno Ferrin, our TOC Vice Chair:\n\n\n\n\n\n\nThere are many other ways to recognize people for the contributions they make – one of Ry’s personal favorites is a comment in the NTPd source code. At the Hyperledger Foundation, we’ve also issued badges, given poker chips for events and other contributions, published Developer Showcase blog posts and have made stickers and shirts.\nDifferent ways to recognize people will be relevant for different people. Some people may want a coin or shirt and others may not. We’re interested to hear what sort of recognition is important to you so we can make sure what we do is meaningful. Please send us your thoughts (email community-architects@hyperledger.org). And, if you’d like to earn a coin, a token, a badge or anything else, get involved in the community, and we’ll be happy to thank you for your contributions.\nThe post Staff Corner: Thanking community members for their contributions appeared first on Hyperledger Foundation.","dc:creator":"Ry Jones and David Boswell, Community Architects","content":"<p>Our community is strong and growing thanks to hundreds of community leaders around the world. We recently got back from Hyperledger Global Forum 2022 in Dublin where the strength of...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/14/staff-corner-thanking-community-members-for-their-contributions\">Staff Corner: Thanking community members for their contributions</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"Our community is strong and growing thanks to hundreds of community leaders around the world. We recently got back from Hyperledger Global Forum 2022 in Dublin where the strength of...\nThe post Staff Corner: Thanking community members for their contributions appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=226291","categories":["Blog","Hyperledger Foundation Staff Corner","Hyperledger Global Forum","Community","contribution","Hyperledger community","open source","Swag"],"isoDate":"2022-10-14T16:00:00.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Hyperledger","title":"Hyperledger Foundation Charter Updates: Looking to 2023 and Beyond","link":"https://www.hyperledger.org/blog/2022/10/18/hyperledger-foundation-charter-updates-looking-to-2023-and-beyond","pubDate":"Tue, 18 Oct 2022 16:05:45 +0000","content:encoded":"\n<p>Looking ahead to 2023 and beyond, the Hyperledger Foundation Governing Board, working with our technical community and staff, recently updated the <a href=\"https://www.hyperledger.org/about/charter\">Hyperledger Foundation charter</a> to support our ever growing and evolving ecosystem. The charter spells out the governance for Hyperledger Foundation, which is now home to 15 projects, more than 50 labs, 13 working and special interest groups and seven regional chapters. These new updates were made as a follow-up to our change from a <a href=\"https://www.hyperledger.org/blog/2021/10/27/staff-corner-introducing-hyperledger-foundation\">project to a foundation with an umbrella of projects</a> to create the opportunity for more autonomy for technical projects and enable further growth for the community and the ecosystem.&nbsp;</p>\n\n\n\n<p>The key changes fall into two related categories:</p>\n\n\n\n<p><em>New Governance options for technical projects</em></p>\n\n\n\n<p>New and existing Hyperledger projects may now opt to have their own technical governance charter. The updated charter spells out that the scope of Hyperledger Foundation includes supporting various open technical projects including open source software, open standards / specifications, open data and other open projects. These projects can either be overseen by the Technical Oversight Committee of the Hyperledger Foundation (and be known as a “TOC Project”) or establish their own technical oversight pursuant to a technical charter specific to the project (and be known as a “Supported Project”).</p>\n\n\n\n<p><strong>_______________</strong><br><strong>Why is this an important feature to an umbrella project like the Hyperledger Foundation? </strong><br>Some projects want their own formal governance and, with the foundation’s umbrella format, it makes sense to create a path for projects to formalize how to govern themselves. This may be an  appealing path to both new code projects and open source projects that exist elsewhere but are interested in bringing their code and community to the world’s largest open global ecosystem for enterprise-grade blockchain technologies. <br><strong>_______________</strong></p>\n\n\n\n<p><em>Transition from a Technical Steering Committee (TSC) to a Technical Oversight Committee (TOC)</em></p>\n\n\n\n<p>Reflecting the shift to a full umbrella project, the revised charter not only renames the technical governance body but also clarifies its responsibilities. The structure and elections for the TOC are also updated. Going forward, the TOC will comprise  eleven individuals who are active within the scope of Hyperledger Foundation and have nominated themselves for the TOC.</p>\n\n\n\n<p>During the annual elections, <a href=\"https://wiki.hyperledger.org/display/TSC/TOC+Election+2022\">which kick off this week</a>, all maintainers (or similar technical role in a supported project) who have been active in the past year will elect six individuals from among the TOC Nominees to serve as TOC voting members.</p>\n\n\n\n<p>To ensure diversity and relevant expertise on the TOC, the Governing Board annually will appoint the remaining five voting members of the TOC from among the TOC Nominees. Once the TOC is selected, its members will elect a chair.</p>\n\n\n\n<p><strong>_______________</strong><br><strong>What’s the role of the TOC in a project’s life cycle?</strong><br>The TOC approves the creation of all technical projects, guides them through their life cycles, and makes sure they follow best open development and security practices. The day-to-day technical direction and roadmaps of each project are determined by its maintainers and the project’s own community.<br><strong>______________</strong></p>\n\n\n\n<p>As we enter our 7th year under the Linux Foundation project umbrella, these changes and enhancements to our governance model is a reflection of where Hyperledger technology and our community are today. We look forward to working with our active and growing community to meet the needs of the developers and the companies and governments that rely on Hyperledger projects.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/18/hyperledger-foundation-charter-updates-looking-to-2023-and-beyond\">Hyperledger Foundation Charter Updates: Looking to 2023 and Beyond</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"Looking ahead to 2023 and beyond, the Hyperledger Foundation Governing Board, working with our technical community and staff, recently updated the Hyperledger Foundation charter to support our ever growing and evolving ecosystem. The charter spells out the governance for Hyperledger Foundation, which is now home to 15 projects, more than 50 labs, 13 working and special interest groups and seven regional chapters. These new updates were made as a follow-up to our change from a project to a foundation with an umbrella of projects to create the opportunity for more autonomy for technical projects and enable further growth for the community and the ecosystem. \nThe key changes fall into two related categories:\nNew Governance options for technical projects\nNew and existing Hyperledger projects may now opt to have their own technical governance charter. The updated charter spells out that the scope of Hyperledger Foundation includes supporting various open technical projects including open source software, open standards / specifications, open data and other open projects. These projects can either be overseen by the Technical Oversight Committee of the Hyperledger Foundation (and be known as a “TOC Project”) or establish their own technical oversight pursuant to a technical charter specific to the project (and be known as a “Supported Project”).\n_______________\nWhy is this an important feature to an umbrella project like the Hyperledger Foundation? \nSome projects want their own formal governance and, with the foundation’s umbrella format, it makes sense to create a path for projects to formalize how to govern themselves. This may be an  appealing path to both new code projects and open source projects that exist elsewhere but are interested in bringing their code and community to the world’s largest open global ecosystem for enterprise-grade blockchain technologies. \n_______________\nTransition from a Technical Steering Committee (TSC) to a Technical Oversight Committee (TOC)\nReflecting the shift to a full umbrella project, the revised charter not only renames the technical governance body but also clarifies its responsibilities. The structure and elections for the TOC are also updated. Going forward, the TOC will comprise  eleven individuals who are active within the scope of Hyperledger Foundation and have nominated themselves for the TOC.\nDuring the annual elections, which kick off this week, all maintainers (or similar technical role in a supported project) who have been active in the past year will elect six individuals from among the TOC Nominees to serve as TOC voting members.\nTo ensure diversity and relevant expertise on the TOC, the Governing Board annually will appoint the remaining five voting members of the TOC from among the TOC Nominees. Once the TOC is selected, its members will elect a chair.\n_______________\nWhat’s the role of the TOC in a project’s life cycle?\nThe TOC approves the creation of all technical projects, guides them through their life cycles, and makes sure they follow best open development and security practices. The day-to-day technical direction and roadmaps of each project are determined by its maintainers and the project’s own community.\n______________\nAs we enter our 7th year under the Linux Foundation project umbrella, these changes and enhancements to our governance model is a reflection of where Hyperledger technology and our community are today. We look forward to working with our active and growing community to meet the needs of the developers and the companies and governments that rely on Hyperledger projects.\nThe post Hyperledger Foundation Charter Updates: Looking to 2023 and Beyond appeared first on Hyperledger Foundation.","dc:creator":"Hyperledger","content":"<p>Looking ahead to 2023 and beyond, the Hyperledger Foundation Governing Board, working with our technical community and staff, recently updated the Hyperledger Foundation charter to support our ever growing and...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/10/18/hyperledger-foundation-charter-updates-looking-to-2023-and-beyond\">Hyperledger Foundation Charter Updates: Looking to 2023 and Beyond</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"Looking ahead to 2023 and beyond, the Hyperledger Foundation Governing Board, working with our technical community and staff, recently updated the Hyperledger Foundation charter to support our ever growing and...\nThe post Hyperledger Foundation Charter Updates: Looking to 2023 and Beyond appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=234730","categories":["Blog","Governance","Charter","Technical oversight","TOC"],"isoDate":"2022-10-18T16:05:45.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Peter Somogyvari (Accenture), Jagpreet Singh Sasan (Accenture), Izuru Sato (Fujitsu), Takuma Takeuchi (Fujitsu), Venkatraman Ramakrishna (IBM), Sandeep Nishad (IBM), Krishnasuri Narayanam (IBM), Dhinakaran Vinayagamurthy (IBM)","title":"Introducing Hyperledger Cacti, a multi-faceted pluggable interoperability framework","link":"https://www.hyperledger.org/blog/2022/11/07/introducing-hyperledger-cacti-a-multi-faceted-pluggable-interoperability-framework","pubDate":"Mon, 07 Nov 2022 16:00:00 +0000","content:encoded":"\n<p>In a Hyperledger first, the community has merged two systems (architectures as well as code bases) to create a new project. <a href=\"https://www.hyperledger.org/use/cacti\">Hyperledger Cacti</a> is a multi-faceted interoperability platform that draws on the cutting-edge technical features of Hyperledger Cactus and Weaver, a Hyperledger Lab, and provides a clear path forward for users of both technologies.</p>\n\n\n\n<p>Hyperledger Cacti is a pluggable interoperability framework to link networks built on heterogeneous distributed ledger and blockchain technologies and to run transactions spanning multiple networks. Cacti was motivated by the observation that the blockchain/DLT ecosystem is fragmented into several independent networks built on a diverse set of DLTs, many of which are permissioned, but which cannot afford to remain isolated from each other, limiting the scale and utility of their business processes (smart contracts and “dapps”) and trapping their assets in silos.</p>\n\n\n\n<p>Consider a trade logistics network (like <a href=\"https://www.tradelens.com\">TradeLens</a>) that maintains bills of lading for shipments on its ledger. These bills are necessary to fulfill letters of credits’ payment obligations on a trade finance network (like <a href=\"https://marcopolonetwork.com\">Marco Polo</a>), but without an institutionalized mechanism to share a bill of lading with proof of authenticity between the two networks, the trade finance network will have to depend on untrustworthy shippers, who are incentivized to supply fake bills in order to get payment. In another scenario that is increasingly common and salient in the DeFi world, financial instruments and currency accounts (e.g., Central Bank DIgital Currency, or CBDC) are maintained on different ledgers. But this state-of-affairs will inhibit trading, and limit the utility of these networks as well as the DLTs they are built on, unless mechanisms to atomically exchange, say, a security on one network for digital currency tokens on another, are institutionalized.</p>\n\n\n\n<p>Extrapolating from these examples and others that are commonly encountered by enterprises and business consortia, we can identify the need for networks to interoperate for the purposes of sharing ledger state, moving assets across network boundaries, and exchanging assets atomically. But, because there are cogent privacy, autonomy, and performance reasons for a large number of such networks to co-exist, such interoperability must be enabled without forcing them all to coalesce into a single global chain or subscribe to a single global settlement chain.</p>\n\n\n\n<p>Hyperledger Cacti provides an interoperability solution that does not require the networks’ respective chains to coalesce into one “chain to rule them all.” It also does not require the creation of yet another settlement chain and consensus protocol to which existing networks must subscribe. Instead, Cacti allows networks to preserve autonomy of decision-making while conducting cross-network transactions on a need basis. In effect, Hyperledger Cacti scales decentralized trust above and beyond the confines of a single network without requiring networks to merge or integrate, in effect enabling a network-of-networks, as illustrated in the figure below using samples of DLT networks and cross-chain operations.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/cSZowCvlr3mIRAO5H6YkUhdQc5lRhGdhKdHD_SNbYXiTpYm4odB7PGzBg4zML85NHlaIWlyJx__tfUG2yEvTHqAYaBPAq9FlhNbtgLl8SdOSvfhm8NEJQ1e4G-HnVuPR2aackQsJ1wSML6zV5th2Fw6kDbRLJ3p2HkjMf9ROAUgXkja8T3Dmeu37O5P53w\" alt=\"\"/></figure>\n\n\n\n<p>A core design tenet of Hyperledger Cacti is that it does not require modification to any existing DLT stack, and operates purely at the contract- and-application layers (or Layer 2). This allows Cacti to be used not only for networks built on existing DLTs but potentially for DLTs that have yet to emerge. The initial release of Hyperledger Cacti will provide interoperability and connectivity features to varying extents for the following nine DLTs. (Interoperability support for other DLTs will be added to the future roadmap of the project.)</p>\n\n\n\n<ul><li>Hyperledger Besu</li><li>Hyperledger Fabric</li><li>Hyperledger Indy</li><li>Hyperledger Iroha</li><li>Hyperledger Sawtooth</li><li>R3 Corda</li><li>Go-Ethereum</li><li>Quorum</li><li>Xdai<br></li></ul>\n\n\n\n<p>The Cacti architecture builds on the pre-existing architecture of both Hyperledger Cactus and the Weaver Labs frameworks, merging components having similar or identical functionality and aggregating distinct components to offer several features that span a wide spectrum of trust and usability. The Cacti plugin architecture will enable the coexistence and maintenance of different feature/protocol implementations which can be selectively activated on demand with minimum configuration overhead. Users can customize the level of decentralization they require using a combination of the Node Server inherited from Cactus and a pluggable network-centric relay (or gateway) inherited from Weaver. The figure below illustrates how distributed applications running on distinct ledgers can trigger cross-network transactions either from a centralized Node Server or in a peer-to-peer manner using relays. The applications can be deployed in a standalone legacy manner or be “plugged into” the Node Server; developers and administrators may choose the option that fits their requirements better. All cross-relay communication protocols implemented in Cacti will be DLT-agnostic and comply with emerging standards.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh6.googleusercontent.com/nnn_KjGXEfHwNO5xBUlmzLgfaJzgR-_aWzZFMmonMw259BxPSkDTy5sP8J3Fj5i_8ylZOnWzLDjbx5Hg_Puqx-UAU5Wa7DILBHU66bFi3uiYDVOdZLMIQtW_gaIrCuBR-y-1Z670aRmc0ZqgRu7e_xrVbVScj3Mkzh52BgvjzzlMeLzYeThmqRmHBED9Ig\" alt=\"\"/></figure>\n\n\n\n<p>Core interoperability features of proof validation and lock management can be performed using either designated validator pools or with smart contracts and DApps installed in the core networks themselves; users may select these options depending on the level of trust they require and correspondingly, the level of administrative overhead they are willing to accept. Cacti will offer these features and the ability to select and activate them through a common (and comprehensive) client SDK and API. To provide a foundation for interoperability across heterogeneous DLTs, Cacti will maintain a pool of DLT- and version-specific connectors or drivers that will act as entry points for operations in a given ledger that must occur in the context of a multi-ledger transaction.</p>\n\n\n\n<p>To learn more, join us Monday, November 14, from 11am-2pm EST for the &#8220;Blockchain Interoperability with Hyperledger Cacti&#8221; hands-on workshop. To register, go <a href=\"https://zoom.us/meeting/register/tJ0vdOuoqT0qH9bRetrLUqbuHH_UykJs7DTf\">here</a>.&nbsp;</p>\n\n\n\n<p>To get involved in the Hyperledger Cacti community, connect with us on <a href=\"https://discord.com/channels/905194001349627914/908379366650703943\">Discord</a>. All are welcome!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/07/introducing-hyperledger-cacti-a-multi-faceted-pluggable-interoperability-framework\">Introducing Hyperledger Cacti, a multi-faceted pluggable interoperability framework</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"In a Hyperledger first, the community has merged two systems (architectures as well as code bases) to create a new project. Hyperledger Cacti is a multi-faceted interoperability platform that draws on the cutting-edge technical features of Hyperledger Cactus and Weaver, a Hyperledger Lab, and provides a clear path forward for users of both technologies.\nHyperledger Cacti is a pluggable interoperability framework to link networks built on heterogeneous distributed ledger and blockchain technologies and to run transactions spanning multiple networks. Cacti was motivated by the observation that the blockchain/DLT ecosystem is fragmented into several independent networks built on a diverse set of DLTs, many of which are permissioned, but which cannot afford to remain isolated from each other, limiting the scale and utility of their business processes (smart contracts and “dapps”) and trapping their assets in silos.\nConsider a trade logistics network (like TradeLens) that maintains bills of lading for shipments on its ledger. These bills are necessary to fulfill letters of credits’ payment obligations on a trade finance network (like Marco Polo), but without an institutionalized mechanism to share a bill of lading with proof of authenticity between the two networks, the trade finance network will have to depend on untrustworthy shippers, who are incentivized to supply fake bills in order to get payment. In another scenario that is increasingly common and salient in the DeFi world, financial instruments and currency accounts (e.g., Central Bank DIgital Currency, or CBDC) are maintained on different ledgers. But this state-of-affairs will inhibit trading, and limit the utility of these networks as well as the DLTs they are built on, unless mechanisms to atomically exchange, say, a security on one network for digital currency tokens on another, are institutionalized.\nExtrapolating from these examples and others that are commonly encountered by enterprises and business consortia, we can identify the need for networks to interoperate for the purposes of sharing ledger state, moving assets across network boundaries, and exchanging assets atomically. But, because there are cogent privacy, autonomy, and performance reasons for a large number of such networks to co-exist, such interoperability must be enabled without forcing them all to coalesce into a single global chain or subscribe to a single global settlement chain.\nHyperledger Cacti provides an interoperability solution that does not require the networks’ respective chains to coalesce into one “chain to rule them all.” It also does not require the creation of yet another settlement chain and consensus protocol to which existing networks must subscribe. Instead, Cacti allows networks to preserve autonomy of decision-making while conducting cross-network transactions on a need basis. In effect, Hyperledger Cacti scales decentralized trust above and beyond the confines of a single network without requiring networks to merge or integrate, in effect enabling a network-of-networks, as illustrated in the figure below using samples of DLT networks and cross-chain operations. \n\n\n\n\nA core design tenet of Hyperledger Cacti is that it does not require modification to any existing DLT stack, and operates purely at the contract- and-application layers (or Layer 2). This allows Cacti to be used not only for networks built on existing DLTs but potentially for DLTs that have yet to emerge. The initial release of Hyperledger Cacti will provide interoperability and connectivity features to varying extents for the following nine DLTs. (Interoperability support for other DLTs will be added to the future roadmap of the project.)\nHyperledger Besu\nHyperledger Fabric\nHyperledger Indy\nHyperledger Iroha\nHyperledger Sawtooth\nR3 Corda\nGo-Ethereum\nQuorum\nXdai\n\nThe Cacti architecture builds on the pre-existing architecture of both Hyperledger Cactus and the Weaver Labs frameworks, merging components having similar or identical functionality and aggregating distinct components to offer several features that span a wide spectrum of trust and usability. The Cacti plugin architecture will enable the coexistence and maintenance of different feature/protocol implementations which can be selectively activated on demand with minimum configuration overhead. Users can customize the level of decentralization they require using a combination of the Node Server inherited from Cactus and a pluggable network-centric relay (or gateway) inherited from Weaver. The figure below illustrates how distributed applications running on distinct ledgers can trigger cross-network transactions either from a centralized Node Server or in a peer-to-peer manner using relays. The applications can be deployed in a standalone legacy manner or be “plugged into” the Node Server; developers and administrators may choose the option that fits their requirements better. All cross-relay communication protocols implemented in Cacti will be DLT-agnostic and comply with emerging standards. \n\n\n\n\nCore interoperability features of proof validation and lock management can be performed using either designated validator pools or with smart contracts and DApps installed in the core networks themselves; users may select these options depending on the level of trust they require and correspondingly, the level of administrative overhead they are willing to accept. Cacti will offer these features and the ability to select and activate them through a common (and comprehensive) client SDK and API. To provide a foundation for interoperability across heterogeneous DLTs, Cacti will maintain a pool of DLT- and version-specific connectors or drivers that will act as entry points for operations in a given ledger that must occur in the context of a multi-ledger transaction.\nTo learn more, join us Monday, November 14, from 11am-2pm EST for the “Blockchain Interoperability with Hyperledger Cacti” hands-on workshop. To register, go here. \nTo get involved in the Hyperledger Cacti community, connect with us on Discord. All are welcome!\nThe post Introducing Hyperledger Cacti, a multi-faceted pluggable interoperability framework appeared first on Hyperledger Foundation.","dc:creator":"Peter Somogyvari (Accenture), Jagpreet Singh Sasan (Accenture), Izuru Sato (Fujitsu), Takuma Takeuchi (Fujitsu), Venkatraman Ramakrishna (IBM), Sandeep Nishad (IBM), Krishnasuri Narayanam (IBM), Dhinakaran Vinayagamurthy (IBM)","content":"<p>In a Hyperledger first, the community has merged two systems (architectures as well as code bases) to create a new project. Hyperledger Cacti is a multi-faceted interoperability platform that draws...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/07/introducing-hyperledger-cacti-a-multi-faceted-pluggable-interoperability-framework\">Introducing Hyperledger Cacti, a multi-faceted pluggable interoperability framework</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"In a Hyperledger first, the community has merged two systems (architectures as well as code bases) to create a new project. Hyperledger Cacti is a multi-faceted interoperability platform that draws...\nThe post Introducing Hyperledger Cacti, a multi-faceted pluggable interoperability framework appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=234910","categories":["Blog","Hyperledger Cacti","Interoperability","framework","Hyperledger Cactus","new project","Weaver"],"isoDate":"2022-11-07T16:00:00.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Gopikrishnan Konnanath, Senior Vice President, Global Head – Engineering Services and Blockchain, Infosys, and Srikanth Challa, Senior Director, Blockchain, Infosys","title":"Process Transformation for Public Services Driven by Blockchain","link":"https://www.hyperledger.org/blog/2022/11/10/process-transformation-for-public-services-driven-by-blockchain","pubDate":"Thu, 10 Nov 2022 16:00:00 +0000","content:encoded":"\n<p>Several government departments around the world are keen to offer their citizens seamless interactions and engaging experiences, akin to those in the private sector.&nbsp;</p>\n\n\n\n<p>The public sector is often riddled with manual processes, time-consuming verifications, legacy systems leading to low transparency and high costs. Over the years, digitalization has alleviated some of the challenges, but rising threats on privacy, data security coupled with the increasing legislations that enshrine the right-to-be-forgotten such as Europe’s GDPR or California’s CCPA pose new challenges for leaders serving in the public sector.</p>\n\n\n\n<p>In the future, we will witness a monumental shift in what citizens will come to expect from their governments &#8211; nothing short of how they experience retail or banking in their life. While this digital transformation has already begun in the public sector, technologies such as blockchain are essential foundations that will power the next generation of citizen experiences. Blockchain and, more broadly, distributed ledger technologies will create a core of trust, transparency, and immutability that&nbsp; breaks down information silos, reducing&nbsp; cost all while vastly enriching the citizen experiences.</p>\n\n\n\n<p>Infosys is proud to have been part of the transformation that is driving change in the public sector. We are happy to share a couple of examples where Infosys brought our strong capabilities in blockchain to help clients reimagine citizen experiences.</p>\n\n\n\n<ol>\n<li><strong>Blockchain helps reimagine public records validation for Riverside County California</strong></li>\n</ol>\n\n\n\n<p>Riverside County California relied heavily on security paper and wet signatures to establish ‘trust’ and authenticate records. Citizens often had to wait for the physical copies of verified documents to reach them by post, which led to delays. In addition, easy access to numerous online tools increased the incidence of fraud, making it challenging to verify proof-of-records and physical documents, which was done manually.&nbsp;</p>\n\n\n\n<p>Infosys Public Services helped create a blockchain-based digital records fulfillment solution for Riverside County’s Assessor-County Clerk-Recorder Office. Built on the Hyperledger Fabric blockchain framework, the new platform can seamlessly verify and authenticate several types of digital records (like land records, births, marriages, and deaths). The solution also bypasses physical paper records by issuing digital documents when a citizen or entity requests them, thereby providing an e-commerce-like experience. The blockchain solution will help Riverside County California achieve cost savings, faster turnaround time, and enhanced customer service.</p>\n\n\n\n<p><em>Read the full case study to see </em><a href=\"https://www.infosyspublicservices.com/insights/public-records-validation-process.html\"><em>how Riverside County authenticates and delivers digital records with 100% trust to citizens</em></a><em>.</em></p>\n\n\n\n<ol start=\"2\">\n<li><strong>Blockchain streamlines professional license issuance and verification for the State of Rhode Island</strong></li>\n</ol>\n\n\n\n<p>The Department of Business Regulation (DBR) in the State of Rhode Island chose to pilot a blockchain solution for identity validation, which is a pre-requisite for issuing licenses. The department used paper-based applications to issue nearly 200,000 licenses annually. This led to high operational inefficiencies, greater costs, and a poor citizen experience.&nbsp;</p>\n\n\n\n<p>DBR partnered with Infosys Public Services (Infosys) for its proven expertise in transforming government processes and implementing blockchain technology. Infosys implemented a blockchain-based identity and credential management solution using Hyperledger Indy and Hyperledger Aries that can quickly and securely validate an individual’s credentials. The solution is built on the Self-Sovereign Identity Model where citizens are the custodians of their data (i.e., personal data is stored on citizen mobile wallets, not on the blockchain). Instead, the blockchain stores the information needed to cryptographically validate the citizen’s credentials, which is shared with other parties. This solution can be easily adopted by other departments within the state paving the way for greater adoption across the entire state.</p>\n\n\n\n<p><em>Read the complete case study to see </em><a href=\"https://www.infosys.com/services/blockchain/analyst-reports/streamline-identity-validation.html\"><em>why blockchain was the right solution for the State of Rhode Island</em></a><em>.</em></p>\n\n\n\n<p>Beyond the buzz, blockchain is proving to be a beneficial technology in the real world across banking, insurance, retail and other industries. Governments around the world are not sitting on the sidelines but jumping mainstream into this disruptive technology to drive citizen-centered governance.</p>\n\n\n\n<p>To learn more about how Infosys leverages blockchain technologies to build reliable, trusted and sustainable ecosystems for governments and other organizations, go <a href=\"https://www.infosys.com/services/blockchain/\">here</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/10/process-transformation-for-public-services-driven-by-blockchain\">Process Transformation for Public Services Driven by Blockchain</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"Several government departments around the world are keen to offer their citizens seamless interactions and engaging experiences, akin to those in the private sector. \nThe public sector is often riddled with manual processes, time-consuming verifications, legacy systems leading to low transparency and high costs. Over the years, digitalization has alleviated some of the challenges, but rising threats on privacy, data security coupled with the increasing legislations that enshrine the right-to-be-forgotten such as Europe’s GDPR or California’s CCPA pose new challenges for leaders serving in the public sector.\nIn the future, we will witness a monumental shift in what citizens will come to expect from their governments – nothing short of how they experience retail or banking in their life. While this digital transformation has already begun in the public sector, technologies such as blockchain are essential foundations that will power the next generation of citizen experiences. Blockchain and, more broadly, distributed ledger technologies will create a core of trust, transparency, and immutability that  breaks down information silos, reducing  cost all while vastly enriching the citizen experiences.\nInfosys is proud to have been part of the transformation that is driving change in the public sector. We are happy to share a couple of examples where Infosys brought our strong capabilities in blockchain to help clients reimagine citizen experiences.\nBlockchain helps reimagine public records validation for Riverside County California\nRiverside County California relied heavily on security paper and wet signatures to establish ‘trust’ and authenticate records. Citizens often had to wait for the physical copies of verified documents to reach them by post, which led to delays. In addition, easy access to numerous online tools increased the incidence of fraud, making it challenging to verify proof-of-records and physical documents, which was done manually. \nInfosys Public Services helped create a blockchain-based digital records fulfillment solution for Riverside County’s Assessor-County Clerk-Recorder Office. Built on the Hyperledger Fabric blockchain framework, the new platform can seamlessly verify and authenticate several types of digital records (like land records, births, marriages, and deaths). The solution also bypasses physical paper records by issuing digital documents when a citizen or entity requests them, thereby providing an e-commerce-like experience. The blockchain solution will help Riverside County California achieve cost savings, faster turnaround time, and enhanced customer service.\nRead the full case study to see how Riverside County authenticates and delivers digital records with 100% trust to citizens.\nBlockchain streamlines professional license issuance and verification for the State of Rhode Island\nThe Department of Business Regulation (DBR) in the State of Rhode Island chose to pilot a blockchain solution for identity validation, which is a pre-requisite for issuing licenses. The department used paper-based applications to issue nearly 200,000 licenses annually. This led to high operational inefficiencies, greater costs, and a poor citizen experience. \nDBR partnered with Infosys Public Services (Infosys) for its proven expertise in transforming government processes and implementing blockchain technology. Infosys implemented a blockchain-based identity and credential management solution using Hyperledger Indy and Hyperledger Aries that can quickly and securely validate an individual’s credentials. The solution is built on the Self-Sovereign Identity Model where citizens are the custodians of their data (i.e., personal data is stored on citizen mobile wallets, not on the blockchain). Instead, the blockchain stores the information needed to cryptographically validate the citizen’s credentials, which is shared with other parties. This solution can be easily adopted by other departments within the state paving the way for greater adoption across the entire state.\nRead the complete case study to see why blockchain was the right solution for the State of Rhode Island.\nBeyond the buzz, blockchain is proving to be a beneficial technology in the real world across banking, insurance, retail and other industries. Governments around the world are not sitting on the sidelines but jumping mainstream into this disruptive technology to drive citizen-centered governance.\nTo learn more about how Infosys leverages blockchain technologies to build reliable, trusted and sustainable ecosystems for governments and other organizations, go here.\nThe post Process Transformation for Public Services Driven by Blockchain appeared first on Hyperledger Foundation.","dc:creator":"Gopikrishnan Konnanath, Senior Vice President, Global Head – Engineering Services and Blockchain, Infosys, and Srikanth Challa, Senior Director, Blockchain, Infosys","content":"<p>Several government departments around the world are keen to offer their citizens seamless interactions and engaging experiences, akin to those in the private sector.&#160; The public sector is often riddled...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/10/process-transformation-for-public-services-driven-by-blockchain\">Process Transformation for Public Services Driven by Blockchain</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"Several government departments around the world are keen to offer their citizens seamless interactions and engaging experiences, akin to those in the private sector.  The public sector is often riddled...\nThe post Process Transformation for Public Services Driven by Blockchain appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=235001","categories":["Blog","Hyperledger Aries","Hyperledger Fabric","Hyperledger Indy","InfoSys","Public sector","Riverside County California","State of Rhode Island"],"isoDate":"2022-11-10T16:00:00.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Stephen Curran, Maintainer, Hyperledger AnonCreds","title":"Announcing Hyperledger AnonCreds: Open Source, Open Specification Privacy Preserving Verifiable Credentials","link":"https://www.hyperledger.org/blog/2022/11/15/announcing-hyperledger-anoncreds-open-source-open-specification-privacy-preserving-verifiable-credentials","pubDate":"Tue, 15 Nov 2022 16:00:00 +0000","content:encoded":"\n<p>AnonCreds, the most commonly used Verifiable Credential (VC) format in the world*, is now a Hyperledger project. Ledger agnostic and with a formal open specification, AnonCreds continues to evolve as a mature verifiable credential format with unique privacy-protecting capabilities. As a Hyperledger project, AnonCreds will have support to grow its code base and community on a global level with technical governance that fosters best open development and security practices.</p>\n\n\n\n<p>As the Internet transitions to allowing people, organizations, and things to have greater control over the sharing of their credentials, protecting privacy is of paramount concern.</p>\n\n\n\n<p><a href=\"https://www.hyperledger.org/use/anoncreds\">Hyperledger AnonCreds</a>—short for “Anonymous Credentials”—is a type of VC that adds important privacy-protecting ZKP (zero-knowledge proof) capabilities to the core VC assurances. A core element of the Hyperledger Indy project for more than five years, AnonCreds is a mature, complete model and interactions set, with extensive support across Hyperledger Aries frameworks.</p>\n\n\n\n<p>The creation of this project signifies the continued healthy evolution of an open source software project that was once monolithic and is now a set of well-defined independent components.&nbsp;</p>\n\n\n\n<p>Hyperledger AnonCreds is ledger-agnostic and client-agnostic. It is not tied to Hyperledger Indy or Aries. This makes it usable with other verifiable data registries/ledgers and verifiable credential client stacks. As a result, important&nbsp; privacy-protecting capabilities become available to a much broader audience, and the underlying cryptography can evolve without affecting the features above it.</p>\n\n\n\n<p>Additional benefits of using Hyperledger AnonCreds include:</p>\n\n\n\n<ul>\n<li>Avoidance of identifiers: No correlatable identifiers are required in presenting data to a verifier. Correlatable identifiers may be applied in a use case specific manner.</li>\n\n\n\n<li>Verifier assurances: Credentials are bound to the holder, so verifiers know that credentials presented together were all issued to the holder providing the presentation.</li>\n\n\n\n<li>Minimal data sharing: Data to be shared by a holder to a verifier is minimized through the use of selective disclosure and ZKP predicates</li>\n</ul>\n\n\n\n<p>Flexible formatting: Credentials and presentations can be formatted in the W3C VC Data Model standard format.</p>\n\n\n\n<p>AnonCreds has joined the Hyperledger ecosystem with <a href=\"https://hyperledger.github.io/hyperledger-hip/HIPs/anoncreds.html\">over 25 sponsors</a>. The project consists of:</p>\n\n\n\n<ul>\n<li>The AnonCreds Specification, managed by the <a href=\"https://wiki.hyperledger.org/display/ANONCREDS/AnonCreds+Specification+Working+Group\">Hyperledger AnonCreds Specification Working Group</a> and with the potential of being submitted to an appropriate Standards organization</li>\n\n\n\n<li>Ledger/Verifiable Data Registry-agnostic, open source code implementations of the AnonCreds specification, suitable for use with Hyperledger Aries and non-Aries agents</li>\n\n\n\n<li>Guidance for creating ledger-specific <a href=\"https://hyperledger.github.io/anoncreds-methods-registry/\">AnonCreds Methods</a> to write and resolve AnonCreds objects for specific ledgers</li>\n\n\n\n<li>Documentation on AnonCreds suitable for all audiences, from business audiences to cryptographers</li>\n\n\n\n<li>A test suite to verify adherence to the AnonCreds specification and the interoperability of AnonCreds implementations.</li>\n</ul>\n\n\n\n<p>Next steps include evolving the existing <a href=\"https://github.com/hyperledger/anoncreds-rs\">AnonCreds Rust implementation</a> to be friendlier to VDRs/ledgers other than Indy, wrapping up the v1.0 specification, and gaining compliance with the W3C Verifiable Credentials Data Model Standard.</p>\n\n\n\n<p>If you’re interested in learning more about AnonCreds start with the <a href=\"https://hyperledger.org/use/anoncreds\">Hyperledger AnonCreds project page</a>. From there you can find how to join project discussions on Discord, add yourself to the project mailing list, find the AnonCreds repositories on GitHub, and join the AnonCreds Working Groups.</p>\n\n\n\n<p>We welcome interest from all groups and organizations, including enterprises and standards organizations. We look forward to hearing from you!</p>\n\n\n\n<p class=\"has-small-font-size\">*<em>Source: godiddy.com combined “sov” (Indy) network volume</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/15/announcing-hyperledger-anoncreds-open-source-open-specification-privacy-preserving-verifiable-credentials\">Announcing Hyperledger AnonCreds: Open Source, Open Specification Privacy Preserving Verifiable Credentials</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"AnonCreds, the most commonly used Verifiable Credential (VC) format in the world*, is now a Hyperledger project. Ledger agnostic and with a formal open specification, AnonCreds continues to evolve as a mature verifiable credential format with unique privacy-protecting capabilities. As a Hyperledger project, AnonCreds will have support to grow its code base and community on a global level with technical governance that fosters best open development and security practices.\nAs the Internet transitions to allowing people, organizations, and things to have greater control over the sharing of their credentials, protecting privacy is of paramount concern.\nHyperledger AnonCreds—short for “Anonymous Credentials”—is a type of VC that adds important privacy-protecting ZKP (zero-knowledge proof) capabilities to the core VC assurances. A core element of the Hyperledger Indy project for more than five years, AnonCreds is a mature, complete model and interactions set, with extensive support across Hyperledger Aries frameworks.\nThe creation of this project signifies the continued healthy evolution of an open source software project that was once monolithic and is now a set of well-defined independent components. \nHyperledger AnonCreds is ledger-agnostic and client-agnostic. It is not tied to Hyperledger Indy or Aries. This makes it usable with other verifiable data registries/ledgers and verifiable credential client stacks. As a result, important  privacy-protecting capabilities become available to a much broader audience, and the underlying cryptography can evolve without affecting the features above it.\nAdditional benefits of using Hyperledger AnonCreds include:\nAvoidance of identifiers: No correlatable identifiers are required in presenting data to a verifier. Correlatable identifiers may be applied in a use case specific manner.\nVerifier assurances: Credentials are bound to the holder, so verifiers know that credentials presented together were all issued to the holder providing the presentation.\nMinimal data sharing: Data to be shared by a holder to a verifier is minimized through the use of selective disclosure and ZKP predicates\nFlexible formatting: Credentials and presentations can be formatted in the W3C VC Data Model standard format.\nAnonCreds has joined the Hyperledger ecosystem with over 25 sponsors. The project consists of:\nThe AnonCreds Specification, managed by the Hyperledger AnonCreds Specification Working Group and with the potential of being submitted to an appropriate Standards organization\nLedger/Verifiable Data Registry-agnostic, open source code implementations of the AnonCreds specification, suitable for use with Hyperledger Aries and non-Aries agents\nGuidance for creating ledger-specific AnonCreds Methods to write and resolve AnonCreds objects for specific ledgers\nDocumentation on AnonCreds suitable for all audiences, from business audiences to cryptographers\nA test suite to verify adherence to the AnonCreds specification and the interoperability of AnonCreds implementations.\nNext steps include evolving the existing AnonCreds Rust implementation to be friendlier to VDRs/ledgers other than Indy, wrapping up the v1.0 specification, and gaining compliance with the W3C Verifiable Credentials Data Model Standard.\nIf you’re interested in learning more about AnonCreds start with the Hyperledger AnonCreds project page. From there you can find how to join project discussions on Discord, add yourself to the project mailing list, find the AnonCreds repositories on GitHub, and join the AnonCreds Working Groups.\nWe welcome interest from all groups and organizations, including enterprises and standards organizations. We look forward to hearing from you!\n*Source: godiddy.com combined “sov” (Indy) network volume\nThe post Announcing Hyperledger AnonCreds: Open Source, Open Specification Privacy Preserving Verifiable Credentials appeared first on Hyperledger Foundation.","dc:creator":"Stephen Curran, Maintainer, Hyperledger AnonCreds","content":"<p>AnonCreds, the most commonly used Verifiable Credential (VC) format in the world*, is now a Hyperledger project. Ledger agnostic and with a formal open specification, AnonCreds continues to evolve as...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/15/announcing-hyperledger-anoncreds-open-source-open-specification-privacy-preserving-verifiable-credentials\">Announcing Hyperledger AnonCreds: Open Source, Open Specification Privacy Preserving Verifiable Credentials</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"AnonCreds, the most commonly used Verifiable Credential (VC) format in the world*, is now a Hyperledger project. Ledger agnostic and with a formal open specification, AnonCreds continues to evolve as...\nThe post Announcing Hyperledger AnonCreds: Open Source, Open Specification Privacy Preserving Verifiable Credentials appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=235018","categories":["Blog","Hyperledger AnonCreds","Identity","new project","news","Open Source Development","Verifiable Credentials"],"isoDate":"2022-11-15T16:00:00.000Z","from":"https://www.hyperledger.org/feed"},{"creator":"Hyperledger","title":"GSBN Builds Global Trade Operating Platform with Hyperledger Fabric as the Foundation","link":"https://www.hyperledger.org/blog/2022/11/16/gsbn-builds-global-trade-operating-platform-with-hyperledger-fabric-as-the-foundation","pubDate":"Wed, 16 Nov 2022 19:07:54 +0000","content:encoded":"\n<p><strong>Read the full case study</strong><strong> </strong><a href=\"https://www.hyperledger.org/learn/publications/gsbn-case-study\"><strong>here</strong></a><strong>.</strong></p>\n\n\n\n<p>Global trade is systemically important to the world’s economy. In 2021, it represented $28.5 trillion. Yet, it hasn’t evolved along with the digital transformation of other industries.</p>\n\n\n\n<p>Perhaps that’s because evolution seems like an insurmountable task. Processes are complex. Documents and information flow continuously — but asynchronously — between parties across the globe. Many processes still rely on paper and legacy systems.&nbsp;</p>\n\n\n\n<p>This lack of digital, on-demand data makes it difficult for the shipping sector to respond to global events, like the COVID-19 pandemic in 2020 or the supply chain disruptions in 2021. In short, existing global trade processes aren’t efficient nor resilient enough.&nbsp;&nbsp;</p>\n\n\n\n<p>GSBN, a not-for-profit backed (and governed) by a <a href=\"https://www.gsbn.trade/our-ecosystem\">collection</a> of major shipping lines and global terminal operators, set out to create the trusted data sharing infrastructure needed for efficient, digital and resilient global trade. To do so, GSBN built a new global trade operating platform using Hyperledger Fabric as the foundation.&nbsp;</p>\n\n\n\n<p>The initial launch of GSBN centered around a Cargo Release offering aimed at improving shipping container turn-around time, reducing port congestion and pollution. Since its launch in March of 2021, more than 10,000 customers have used Cargo Release to get real-time updates on over 1 million shipments.</p>\n\n\n\n<p>In September 2021, GSBN formed the Trade Finance Advisory Group with Bank of China (Hong Kong) Limited (BOCHK), DBS Bank and The Hongkong and Shanghai Banking Corporation Limited (HSBC) to develop digital solutions to help improve the financing process for banks. To break barriers in data sharing that were hindering financing approvals for trade companies, especially SMEs, GSBN created an application for consent collection. It allows banks to source data directly from shipping lines so they can verify information based on a single source of truth.</p>\n\n\n\n<p>The third application for GSBN is electronic bills of lading (eBL). In June 2022, IQAX eBL application, built on top of GSBN, obtained approval by the International Group of P&amp;I Clubs. The eBL application provides a digital channel for all parties to access real-time data on the shipping process. It also guarantees the security, accuracy, and authenticity of data. And it ensures the data on the blockchain network is traceable to a single source. This application has already been adopted by three shipping lines and one bank.</p>\n\n\n\n<p>The Hyperledger Foundation team worked with GSBN on a case study that details the business and technical drivers and decisions that went into the creation of GSBN as well as key results to date. It also lays out how GSBN, as CTO Edmund To puts it, “will expand the global trade ecosystem by creating bridges to new market participants like banks, FinTech’s, and other consortia and launching new solutions.”</p>\n\n\n\n<p><strong>Read the full case study </strong><a href=\"https://www.hyperledger.org/learn/publications/gsbn-case-study\"><strong>here</strong></a><strong>.</strong></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/16/gsbn-builds-global-trade-operating-platform-with-hyperledger-fabric-as-the-foundation\">GSBN Builds Global Trade Operating Platform with Hyperledger Fabric as the Foundation</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","content:encodedSnippet":"Read the full case study here.\nGlobal trade is systemically important to the world’s economy. In 2021, it represented $28.5 trillion. Yet, it hasn’t evolved along with the digital transformation of other industries.\nPerhaps that’s because evolution seems like an insurmountable task. Processes are complex. Documents and information flow continuously — but asynchronously — between parties across the globe. Many processes still rely on paper and legacy systems. \nThis lack of digital, on-demand data makes it difficult for the shipping sector to respond to global events, like the COVID-19 pandemic in 2020 or the supply chain disruptions in 2021. In short, existing global trade processes aren’t efficient nor resilient enough.  \nGSBN, a not-for-profit backed (and governed) by a collection of major shipping lines and global terminal operators, set out to create the trusted data sharing infrastructure needed for efficient, digital and resilient global trade. To do so, GSBN built a new global trade operating platform using Hyperledger Fabric as the foundation. \nThe initial launch of GSBN centered around a Cargo Release offering aimed at improving shipping container turn-around time, reducing port congestion and pollution. Since its launch in March of 2021, more than 10,000 customers have used Cargo Release to get real-time updates on over 1 million shipments.\nIn September 2021, GSBN formed the Trade Finance Advisory Group with Bank of China (Hong Kong) Limited (BOCHK), DBS Bank and The Hongkong and Shanghai Banking Corporation Limited (HSBC) to develop digital solutions to help improve the financing process for banks. To break barriers in data sharing that were hindering financing approvals for trade companies, especially SMEs, GSBN created an application for consent collection. It allows banks to source data directly from shipping lines so they can verify information based on a single source of truth.\nThe third application for GSBN is electronic bills of lading (eBL). In June 2022, IQAX eBL application, built on top of GSBN, obtained approval by the International Group of P&I Clubs. The eBL application provides a digital channel for all parties to access real-time data on the shipping process. It also guarantees the security, accuracy, and authenticity of data. And it ensures the data on the blockchain network is traceable to a single source. This application has already been adopted by three shipping lines and one bank.\nThe Hyperledger Foundation team worked with GSBN on a case study that details the business and technical drivers and decisions that went into the creation of GSBN as well as key results to date. It also lays out how GSBN, as CTO Edmund To puts it, “will expand the global trade ecosystem by creating bridges to new market participants like banks, FinTech’s, and other consortia and launching new solutions.”\nRead the full case study here.\nThe post GSBN Builds Global Trade Operating Platform with Hyperledger Fabric as the Foundation appeared first on Hyperledger Foundation.","dc:creator":"Hyperledger","content":"<p>Read the full case study here. Global trade is systemically important to the world’s economy. In 2021, it represented $28.5 trillion. Yet, it hasn’t evolved along with the digital transformation...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.hyperledger.org/blog/2022/11/16/gsbn-builds-global-trade-operating-platform-with-hyperledger-fabric-as-the-foundation\">GSBN Builds Global Trade Operating Platform with Hyperledger Fabric as the Foundation</a> appeared first on <a rel=\"nofollow\" href=\"https://www.hyperledger.org\">Hyperledger Foundation</a>.</p>\n","contentSnippet":"Read the full case study here. Global trade is systemically important to the world’s economy. In 2021, it represented $28.5 trillion. Yet, it hasn’t evolved along with the digital transformation...\nThe post GSBN Builds Global Trade Operating Platform with Hyperledger Fabric as the Foundation appeared first on Hyperledger Foundation.","guid":"https://www.hyperledger.org/?p=235053","categories":["Blog","Hyperledger Fabric","Supply Chain","consortium","Global Trade","GSBN","Shipping"],"isoDate":"2022-11-16T19:07:54.000Z","from":"https://www.hyperledger.org/feed"},{"title":"Sam Bankman-Fried hopes to start new venture in effort to repay FTX investors - report","link":"https://seekingalpha.com/news/3916199-sam-bankman-fried-hopes-to-start-new-venture-in-effort-to-repay-ftx-investors-report?utm_source=feed_news_crypto&utm_medium=referral","pubDate":"Mon, 12 Dec 2022 12:00:25 -0500","guid":"https://seekingalpha.com/news/3916199-sam-bankman-fried-hopes-to-start-new-venture-in-effort-to-repay-ftx-investors-report?utm_source=feed_news_crypto&utm_medium=referral","categories":[{"_":"ftt-usd","$":{"domain":"https://seekingalpha.com/symbol/FTT-USD"}}],"isoDate":"2022-12-12T17:00:25.000Z","from":"https://seekingalpha.com/news/crypto/feed"},{"creator":"Andrew Throuvalas","title":"Coinbase Stock Hits New All-Time Low Amid Plummeting Yearly Revenues","link":"https://decrypt.co/116997/coinbase-stock-hits-new-all-time-low-plummeting-yearly-revenues","pubDate":"Mon, 12 Dec 2022 17:00:31 +0000","enclosure":{"url":"https://img.decrypt.co/insecure/rs:fill:1024:512:1:0/plain/https://cdn.decrypt.co/wp-content/uploads/2021/04/coinbase-app-skew-analytics-gID_4.jpeg@png","length":"1000000","type":"image/png"},"dc:creator":"Andrew Throuvalas","content":"Coinbase’s stock (COIN) continues to slide as the exchange braces for year-end figures that grossly underperform its 2021 numbers. ","contentSnippet":"Coinbase’s stock (COIN) continues to slide as the exchange braces for year-end figures that grossly underperform its 2021 numbers.","guid":"https://decrypt.co/?p=116997","categories":["Business"],"isoDate":"2022-12-12T17:00:31.000Z","from":"https://decryptmedia.com/feed/"},{"creator":"Nelson Wang","title":"Chinese Police Arrest 63 People Accused of Laundering $1.7B Using Cryptocurrency","link":"https://www.coindesk.com/policy/2022/12/12/chinese-police-arrest-63-people-accused-of-laundering-17b-using-cryptocurrency/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","pubDate":"Mon, 12 Dec 2022 16:54:27 +0000","dc:creator":"Nelson Wang","content":"The illicit funds were converted into tether and then laundered by people around the world, authorities said.","contentSnippet":"The illicit funds were converted into tether and then laundered by people around the world, authorities said.","guid":"FDPANEGRHRGA5BWIVZLXXOAEMU","categories":[{"_":"Policy","$":{"domain":"https://www.coindesk.com/policy/"}}],"isoDate":"2022-12-12T16:54:27.000Z","from":"http://feeds.feedburner.com/Coindesk"},{"creator":"Katarina Stefanovic","title":"ABCs of Web3 for Designers","link":"https://medium.com/reach-sh/abcs-of-web3-for-designers-5a71af20c973?source=rss----d99f38c59b5---4","pubDate":"Mon, 12 Dec 2022 17:09:56 GMT","content:encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*yStiFxVN_AV2XrCsyt3ldA.png\" /></figure><p>For Web3 to grow in popularity and expand beyond digital wallets and financial platforms,<strong> designers need to make Web3 apps more consistent and intuitive</strong>. They also have to provide more straightforward user education to help familiarize newcomers with novel features and interactions found on Web3 platforms.</p><p>Making DApps feel secure has to be a high priority too. It’s impossible to control the trustless, permissionless nature of Web3, but designers can predict what may go wrong and help prevent those occurrences. More transparent caveats about risks will go a long way to assuage people’s concerns and convince them to embrace Web3.</p><p>However, to start doing that — designers need to have a good grasp of terms used on a day-to-day basis in Web3.</p><p>Let’s go over the ABCs of Web3.</p><h3>A</h3><p><strong>Address </strong><em>(noun)</em><strong><br></strong>also referred to as wallet address or blockchain address — just like someone has a home and business address, a blockchain has an address to identify its location. A blockchain address is a long alphanumeric reference to access the precise location of the transaction’s home. It also can be where someone receives, sends, or holds their blockchain transactions. An example of a blockchain address is: <em>5TdA55HeLopzzwe3Lg7W335tGdCc623PoQ.</em></p><p><strong>Airdrop </strong><em>(noun, verb)<br></em>a specified amount of cryptocurrency, social tokens, or a new NFT dropped into a holder’s wallet for free or in exchange for minimal promotional work. It is a popular way for startups, NFT projects and social token creators to reward and engage their community.</p><p><strong>Altcoin </strong><em>(noun)</em><br>initially used to refer to any cryptocurrency that wasn’t Bitcoin, altcoin may now refer to any new cryptocurrency with a relatively small market cap.</p><p><strong>Alts </strong><em>(noun)</em><br>short for altcoins.</p><p><strong>ATH- All Time High </strong><em>(noun)</em><br>the highest price an asset has ever had.</p><p><strong>ATL- All Time Low </strong><em>(noun)</em><br>the lowest price an asset has ever had.</p><h3>B</h3><p><strong>Blockchain </strong><em>(noun)</em><strong><br></strong>a distributed database shared among the nodes of a computer network. As a database, a blockchain stores information electronically in digital format. It’s an immutable database, which means that information can’t be tampered with or altered once it’s been recorded. If there’s an error in an entry, then a new, revised entry must be made, and both entries will subsequently be visible on the ledger.</p><p><strong>Bridge in/bridge out </strong><em>(verb)</em><strong><br></strong>a blockchain bridge is a connection that allows the transfer of social tokens from one chain to another. Both chains can have distinct protocols, rules, and governance models, but the bridge provides a compatible way to conduct the transaction securely on both sides. For example, holders of Rally.io tokens can bridge out some (or all) of their holdings in the Rally sidechain to the Ethereum chain. From there, they can sell (or bridge) their Ethereum for currency.</p><p><strong>Burn </strong><em>(verb)</em><strong><br></strong>the process where tokens are removed from circulation. Coin burning is a market tool to increase the value of cryptocurrency.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*1-rumDpe_f_lfa2uS8k54Q.png\" /></figure><h3>C</h3><p><strong>Circulating supply </strong><em>(noun)</em><strong><br></strong>the number of cryptocurrency coins or tokens publicly available in the market.</p><p><strong>Composability </strong><em>(noun)</em><strong><br></strong> the ability of decentralized applications (dApps) and DAOs to effectively clone and integrate one another.</p><h3>D</h3><p><strong>DAO </strong><em>(noun)</em><strong><br></strong><em>Decentralized Autonomous Organization</em> — a community-led entity with no central authority. Ultimately, a DAO is run exclusively by its individual members, who jointly decide on important project issues including technical advancements and treasury allocations. Smart contracts set the ground rules, carry out the decisions reached by the community, and allow for public auditing at any time, making it completely autonomous and transparent.</p><p><strong>DApps </strong><em>(noun)</em><strong><br></strong>Decentralized Applications — digital applications that run on a blockchain network of computers instead of relying on a single computer. Since DApps are decentralized, they are free from the control and interference of a single authority. Benefits of dApps include the safeguarding of user privacy, the lack of censorship, and the flexibility of development.</p><p><strong>Decentralized exchange — DEX </strong><em>(noun)</em><strong><br></strong>DEX decentralized exchanges are smart contracts tailored for offering peer-to-peer transactions that ensure theoretically complete anonymity. This means the actual asset being exchanged never passes through the hands of an intermediary.</p><p><strong>Decentralized network </strong><em>(noun)</em><strong><br></strong>in computing terms, a decentralized network architecture distributes workloads among several machines instead of relying on a single central server. No one company or company’s servers control the network. Decentralized networks offer a wide range of benefits over centralized networks, including increased system reliability, scale, and privacy.</p><p><strong>Degen </strong><em>(noun)</em><strong><br></strong>now an affectionate and self-assigned term that members of the crypto world refer to themselves and others. Even though it stems from Degenerate or Degenerative Gambler, it is generally used as a badge of honour without negative ideals. Degens can often be found at 4am staring at multiple screens, looking for the next token or NFT drop.</p><h3>E</h3><p><strong>ETH </strong><em>(noun)</em><strong><br></strong>abbreviation for Ethereum cryptocurrency. Ethereum is a blockchain network with a decentralized public ledger for verifying and recording transactions. Its currency is Ether (ETH).</p><p><strong>Exchange </strong><em>(noun)</em><strong><br></strong>a platform on which to buy and sell cryptocurrency. Users can trade one crypto for another or buy crypto using traditional currency. Exchanges also can convert cryptocurrencies into US dollars or other government-backed currencies to be deposited into a traditional bank account.</p><h3>F</h3><p><strong>Fiat currency </strong><em>(noun)</em><strong><br></strong>the paper/coin currency of the government or region, typically declared as legal tender (eg. USD, EUR, CAD, GBP, etc).</p><p><strong>Floor</strong> <em>(noun)</em><br>the floor or floor price is the lowest price to buy an NFT on the secondary market.</p><p><strong>Fork </strong><em>(noun)</em><strong><br></strong>an update in the network protocol (the open-source software that runs blockchains)</p><h3>G</h3><p><strong>Gas and gas fees </strong><em>(noun)</em><strong><br></strong>transaction fees that users pay to miners on a blockchain protocol to have their transactions included in the block. The system works on a standard supply-and-demand mechanism. If there is a higher demand for transactions, miners may decide to include different levels of transactions, forcing users to pay more for more rapid and effective transaction processing.</p><p><strong>Gwei </strong><em>(noun)</em><strong><br></strong>a term for a very small amount of Ethereum cryptocurrency and commonly used when discussing and paying transactions fees on the Ethereum network. One Gwei is equal to 0.000000001 ETH.</p><h3>H</h3><p><strong>Hodl (or hodling) </strong><em>(verb)</em><strong><br></strong>a hold in the context of buying and holding Bitcoin and other cryptocurrencies. Hodl is derived from a misspelling of “hold” from a Bitcoin forum post from 2013.</p><h3>I</h3><p><strong>Impermanent loss </strong><em>(noun)<br></em>the loss that occurs when the tokens are in a liquidity pool compared to if they are just held in a crypto wallet is called impermanent loss. This type of loss is considered “impermanent” because it is only realized and becomes “permanent” when you withdraw the deposit. Interestingly enough, impermanent loss happens whichever way the price moves, no matter up or down. The bigger the change in price, the bigger the impermanent loss.</p><h3>K</h3><p><strong>KYC </strong><em>(noun)</em><strong><br>“</strong>know your customer “— the process of verifying a customer’s identity. Most commonly used by financial institutions and financial service businesses, including banks, stockbrokers, and cryptocurrency exchanges.</p><h3>L</h3><p><strong>Liquidity Pool </strong><em>(noun)</em><strong><br></strong>a platform where a pool of cryptocurrencies or tokens are crowdsourced and locked in a smart contract. And while being locked, they are being used as sources for loans for exchanges, and other applications.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*9518dzOt0dAKdxAEB5CG_w.png\" /></figure><h3>M</h3><p><strong>Mainnet </strong><em>(noun)</em><strong><br></strong>a blockchain that transfers a digital currency from a sender to a recipient. Mainnet is the main network; actual transactions take place on a distributed ledger.</p><p><strong>Metaverse </strong><em>(noun)</em><strong><br></strong>the metaverse is an expansive network of persistent, real-time rendered 3D worlds and simulations that support continuity of identity, objects, history, payments, and entitlements; can be experienced synchronously by an unlimited number of users, each with an individual sense of presence. More simply, a set of virtual spaces where people can create and explore with other people who aren’t in the same physical space. Decentraland and The Sandbox are two of the most popular metaverse platforms.</p><p><a href=\"https://www.techopedia.com/definition/32530/mining-blockchain\"><strong>Mining/miners</strong></a><strong> </strong><em>(verb)</em><strong><br></strong>the process of adding transactions to a large distributed public ledger of existing transactions known as a blockchain. Mining involves creating a hash of a block (a digital fingerprint) of transactions that cannot be easily forged, protecting the integrity of the entire blockchain without the need for a central system. The main incentive for mining is that individuals who choose to use a computer for mining are rewarded for doing so via cryptocurrency compensation. For example, bitcoin miners earn 25 bitcoin per hash.</p><p><strong>Minting </strong><em>(verb)</em><strong><br></strong>the process of turning a digital file into a crypto collectible or digital asset on a blockchain. The digital item or file is stored forever in this decentralized database or distributed ledger, and it is impossible to edit, modify, or delete. During the minting process, the creator of the NFT can schedule royalties from every subsequent sale.</p><h3>N</h3><p><strong>NFA </strong><em>(noun)</em><strong><br></strong>Not Financial Advice — a warning of the inherent risks to potential investors of cryptocurrency and NFT projects.</p><p><strong>NFT<br></strong>Non-Fungible Tokens — cryptographic assets on a blockchain with unique identification codes and metadata that distinguish them from each other. NFTs can also be used to represent real-world items like artwork and real estate.</p><p><strong>Node</strong> — a computer connected to a cryptocurrency network; can execute functions like creating, receiving, or sending information.</p><h3>P</h3><p><strong>P2P </strong><em>(noun)</em><strong><br></strong>peer-to-peer, a decentralized platform where two individuals interact without intermediation by a third party. The buyer and the seller transact directly with each other via the P2P service. The P2P platform may provide services such as search, screening, rating, payment processing, or escrow.</p><p><strong>PFP </strong><em>(noun)</em><strong><br></strong>profile picture — usually refers to a profile picture as an NFT.</p><p><strong>Play to earn </strong><em>(noun)</em><strong><br></strong>a business model for the video game industry that allows players to earn digital assets they can sell for money in a marketplace. Many of the assets are NFTs, such as a game skin, cool weapon, or an animal to breed.</p><p><strong>POAP </strong><em>(noun)</em><strong><br></strong>proof-of-attendance protocol — a system used to distribute crypto-badges to event attendees, course graduates, or something similar.</p><p><strong>Public/private key </strong><em>(noun)</em><strong><br></strong>allows users to send and receive cryptocurrency without requiring third-party verification. Together, the public and private keys form a key pair. Users keep their private keys a hidden but share their public keys in order to receive transactions. Any cryptocurrency linked to those private keys is accessible to anybody who has access to those keys. Private keys are not stored on the cryptocurrency blockchain network; instead, they are held in a digital wallet.</p><h3>S</h3><p><strong>Satoshi </strong><em>(noun)</em><strong><br></strong>the smallest fraction of coins in the Bitcoin cryptocurrency system. Named after Satoshi Nakamoto, the alias of the inventor of Bitcoin. One Satoshi is one-hundred-millionth (0.00000001) Bitcoin.</p><p><strong>Seed phrase </strong><em>(noun)</em><strong><br></strong>a series of words generated by the cryptocurrency wallet provider that gives the holder access to the crypto in their wallet. The list of 12 to 24 simple words is not a sentence (e.g., fiction, tree, cat, radio, stream, cloud, paper, cushion, abstract, bronze, pilot, orange).</p><p><strong>Sidechain </strong><em>(noun)</em><strong><br></strong>a separate blockchain that runs parallel to Layer 1 Blockchain and operates independently. It has its own consensus algorithm and is connected to Mainnet by a two-way bridge.</p><p><strong>Smart contracts </strong><em>(noun)</em><strong><br></strong>a tamper-proof program that runs on a blockchain network when certain predefined conditions are satisfied. Smart contracts enable multiple parties to reach a shared result in an accurate, timely, and tamper-proof manner by operating on a decentralized blockchain rather than a centralized server.</p><p><strong>Social token </strong><em>(noun)</em><strong><br></strong>community coins/token, creator coins — tokens issued by a community, creator, brand, or influencer; decentralized and secured by the blockchain.</p><p><strong>Staking </strong><em>(noun)</em><strong><br></strong>a way of earning rewards for holding certain cryptocurrencies. Cryptocurrencies allow staking using a “consensus mechanism” called proof of stake to ensure that all transactions are verified and secured without a bank or payment processor in the middle.</p><h3>T</h3><p><strong>Testnet </strong><em>(noun)<br></em>an alternative, value-less blockchain where developers can experiment with code and functions prior to application onto the network’s mainnet.</p><p><strong>Token </strong><em>(noun)</em><strong><br></strong>anything that has value or anything that can be exchanged for goods or services. Examples include fiat currency, cryptocurrency, NFTs, and gifts.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*DugXFbrSnpIjYL53Q00qUg.png\" /></figure><h3>W</h3><p><strong>Wallet </strong><em>(noun)</em><strong><br></strong>a digital wallet that facilitates transactions and holds cryptocurrency and NFTs. Wallets are necessary to purchase and trade NFTs and cryptocurrencies.</p><p><strong>Whale </strong><em>(noun)<br></em>an individual who holds a large amount of a particular cryptocurrency, social token, or NFT. A whale has enough coins or tokens to cause a significant impact on the market prices by selling or buying large amounts.</p><p>These were just some of the more common terms in Web3. However, the glossary keeps expanding so it’s helpful to stay updated with the industry lingo. There’s multiple websites that keep an updated Web3 Dictionary. Feel free to check two of my personal favorites — <a href=\"https://mhouse.club/dictionary/\">MHouse</a> &amp; <a href=\"https://web3.hashnode.com/glossary\">Hashnode</a>.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=5a71af20c973\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/reach-sh/abcs-of-web3-for-designers-5a71af20c973\">ABCs of Web3 for Designers</a> was originally published in <a href=\"https://medium.com/reach-sh\">Reach Platform</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>","content:encodedSnippet":"For Web3 to grow in popularity and expand beyond digital wallets and financial platforms, designers need to make Web3 apps more consistent and intuitive. They also have to provide more straightforward user education to help familiarize newcomers with novel features and interactions found on Web3 platforms.\nMaking DApps feel secure has to be a high priority too. It’s impossible to control the trustless, permissionless nature of Web3, but designers can predict what may go wrong and help prevent those occurrences. More transparent caveats about risks will go a long way to assuage people’s concerns and convince them to embrace Web3.\nHowever, to start doing that — designers need to have a good grasp of terms used on a day-to-day basis in Web3.\nLet’s go over the ABCs of Web3.\nA\nAddress (noun)\nalso referred to as wallet address or blockchain address — just like someone has a home and business address, a blockchain has an address to identify its location. A blockchain address is a long alphanumeric reference to access the precise location of the transaction’s home. It also can be where someone receives, sends, or holds their blockchain transactions. An example of a blockchain address is: 5TdA55HeLopzzwe3Lg7W335tGdCc623PoQ.\nAirdrop (noun, verb)\na specified amount of cryptocurrency, social tokens, or a new NFT dropped into a holder’s wallet for free or in exchange for minimal promotional work. It is a popular way for startups, NFT projects and social token creators to reward and engage their community.\nAltcoin (noun)\ninitially used to refer to any cryptocurrency that wasn’t Bitcoin, altcoin may now refer to any new cryptocurrency with a relatively small market cap.\nAlts (noun)\nshort for altcoins.\nATH- All Time High (noun)\nthe highest price an asset has ever had.\nATL- All Time Low (noun)\nthe lowest price an asset has ever had.\nB\nBlockchain (noun)\na distributed database shared among the nodes of a computer network. As a database, a blockchain stores information electronically in digital format. It’s an immutable database, which means that information can’t be tampered with or altered once it’s been recorded. If there’s an error in an entry, then a new, revised entry must be made, and both entries will subsequently be visible on the ledger.\nBridge in/bridge out (verb)\na blockchain bridge is a connection that allows the transfer of social tokens from one chain to another. Both chains can have distinct protocols, rules, and governance models, but the bridge provides a compatible way to conduct the transaction securely on both sides. For example, holders of Rally.io tokens can bridge out some (or all) of their holdings in the Rally sidechain to the Ethereum chain. From there, they can sell (or bridge) their Ethereum for currency.\nBurn (verb)\nthe process where tokens are removed from circulation. Coin burning is a market tool to increase the value of cryptocurrency.\n\nC\nCirculating supply (noun)\nthe number of cryptocurrency coins or tokens publicly available in the market.\nComposability (noun)\n the ability of decentralized applications (dApps) and DAOs to effectively clone and integrate one another.\nD\nDAO (noun)\nDecentralized Autonomous Organization — a community-led entity with no central authority. Ultimately, a DAO is run exclusively by its individual members, who jointly decide on important project issues including technical advancements and treasury allocations. Smart contracts set the ground rules, carry out the decisions reached by the community, and allow for public auditing at any time, making it completely autonomous and transparent.\nDApps (noun)\nDecentralized Applications — digital applications that run on a blockchain network of computers instead of relying on a single computer. Since DApps are decentralized, they are free from the control and interference of a single authority. Benefits of dApps include the safeguarding of user privacy, the lack of censorship, and the flexibility of development.\nDecentralized exchange — DEX (noun)\nDEX decentralized exchanges are smart contracts tailored for offering peer-to-peer transactions that ensure theoretically complete anonymity. This means the actual asset being exchanged never passes through the hands of an intermediary.\nDecentralized network (noun)\nin computing terms, a decentralized network architecture distributes workloads among several machines instead of relying on a single central server. No one company or company’s servers control the network. Decentralized networks offer a wide range of benefits over centralized networks, including increased system reliability, scale, and privacy.\nDegen (noun)\nnow an affectionate and self-assigned term that members of the crypto world refer to themselves and others. Even though it stems from Degenerate or Degenerative Gambler, it is generally used as a badge of honour without negative ideals. Degens can often be found at 4am staring at multiple screens, looking for the next token or NFT drop.\nE\nETH (noun)\nabbreviation for Ethereum cryptocurrency. Ethereum is a blockchain network with a decentralized public ledger for verifying and recording transactions. Its currency is Ether (ETH).\nExchange (noun)\na platform on which to buy and sell cryptocurrency. Users can trade one crypto for another or buy crypto using traditional currency. Exchanges also can convert cryptocurrencies into US dollars or other government-backed currencies to be deposited into a traditional bank account.\nF\nFiat currency (noun)\nthe paper/coin currency of the government or region, typically declared as legal tender (eg. USD, EUR, CAD, GBP, etc).\nFloor (noun)\nthe floor or floor price is the lowest price to buy an NFT on the secondary market.\nFork (noun)\nan update in the network protocol (the open-source software that runs blockchains)\nG\nGas and gas fees (noun)\ntransaction fees that users pay to miners on a blockchain protocol to have their transactions included in the block. The system works on a standard supply-and-demand mechanism. If there is a higher demand for transactions, miners may decide to include different levels of transactions, forcing users to pay more for more rapid and effective transaction processing.\nGwei (noun)\na term for a very small amount of Ethereum cryptocurrency and commonly used when discussing and paying transactions fees on the Ethereum network. One Gwei is equal to 0.000000001 ETH.\nH\nHodl (or hodling) (verb)\na hold in the context of buying and holding Bitcoin and other cryptocurrencies. Hodl is derived from a misspelling of “hold” from a Bitcoin forum post from 2013.\nI\nImpermanent loss (noun)\nthe loss that occurs when the tokens are in a liquidity pool compared to if they are just held in a crypto wallet is called impermanent loss. This type of loss is considered “impermanent” because it is only realized and becomes “permanent” when you withdraw the deposit. Interestingly enough, impermanent loss happens whichever way the price moves, no matter up or down. The bigger the change in price, the bigger the impermanent loss.\nK\nKYC (noun)\n“know your customer “— the process of verifying a customer’s identity. Most commonly used by financial institutions and financial service businesses, including banks, stockbrokers, and cryptocurrency exchanges.\nL\nLiquidity Pool (noun)\na platform where a pool of cryptocurrencies or tokens are crowdsourced and locked in a smart contract. And while being locked, they are being used as sources for loans for exchanges, and other applications.\n\nM\nMainnet (noun)\na blockchain that transfers a digital currency from a sender to a recipient. Mainnet is the main network; actual transactions take place on a distributed ledger.\nMetaverse (noun)\nthe metaverse is an expansive network of persistent, real-time rendered 3D worlds and simulations that support continuity of identity, objects, history, payments, and entitlements; can be experienced synchronously by an unlimited number of users, each with an individual sense of presence. More simply, a set of virtual spaces where people can create and explore with other people who aren’t in the same physical space. Decentraland and The Sandbox are two of the most popular metaverse platforms.\nMining/miners (verb)\nthe process of adding transactions to a large distributed public ledger of existing transactions known as a blockchain. Mining involves creating a hash of a block (a digital fingerprint) of transactions that cannot be easily forged, protecting the integrity of the entire blockchain without the need for a central system. The main incentive for mining is that individuals who choose to use a computer for mining are rewarded for doing so via cryptocurrency compensation. For example, bitcoin miners earn 25 bitcoin per hash.\nMinting (verb)\nthe process of turning a digital file into a crypto collectible or digital asset on a blockchain. The digital item or file is stored forever in this decentralized database or distributed ledger, and it is impossible to edit, modify, or delete. During the minting process, the creator of the NFT can schedule royalties from every subsequent sale.\nN\nNFA (noun)\nNot Financial Advice — a warning of the inherent risks to potential investors of cryptocurrency and NFT projects.\nNFT\nNon-Fungible Tokens — cryptographic assets on a blockchain with unique identification codes and metadata that distinguish them from each other. NFTs can also be used to represent real-world items like artwork and real estate.\nNode — a computer connected to a cryptocurrency network; can execute functions like creating, receiving, or sending information.\nP\nP2P (noun)\npeer-to-peer, a decentralized platform where two individuals interact without intermediation by a third party. The buyer and the seller transact directly with each other via the P2P service. The P2P platform may provide services such as search, screening, rating, payment processing, or escrow.\nPFP (noun)\nprofile picture — usually refers to a profile picture as an NFT.\nPlay to earn (noun)\na business model for the video game industry that allows players to earn digital assets they can sell for money in a marketplace. Many of the assets are NFTs, such as a game skin, cool weapon, or an animal to breed.\nPOAP (noun)\nproof-of-attendance protocol — a system used to distribute crypto-badges to event attendees, course graduates, or something similar.\nPublic/private key (noun)\nallows users to send and receive cryptocurrency without requiring third-party verification. Together, the public and private keys form a key pair. Users keep their private keys a hidden but share their public keys in order to receive transactions. Any cryptocurrency linked to those private keys is accessible to anybody who has access to those keys. Private keys are not stored on the cryptocurrency blockchain network; instead, they are held in a digital wallet.\nS\nSatoshi (noun)\nthe smallest fraction of coins in the Bitcoin cryptocurrency system. Named after Satoshi Nakamoto, the alias of the inventor of Bitcoin. One Satoshi is one-hundred-millionth (0.00000001) Bitcoin.\nSeed phrase (noun)\na series of words generated by the cryptocurrency wallet provider that gives the holder access to the crypto in their wallet. The list of 12 to 24 simple words is not a sentence (e.g., fiction, tree, cat, radio, stream, cloud, paper, cushion, abstract, bronze, pilot, orange).\nSidechain (noun)\na separate blockchain that runs parallel to Layer 1 Blockchain and operates independently. It has its own consensus algorithm and is connected to Mainnet by a two-way bridge.\nSmart contracts (noun)\na tamper-proof program that runs on a blockchain network when certain predefined conditions are satisfied. Smart contracts enable multiple parties to reach a shared result in an accurate, timely, and tamper-proof manner by operating on a decentralized blockchain rather than a centralized server.\nSocial token (noun)\ncommunity coins/token, creator coins — tokens issued by a community, creator, brand, or influencer; decentralized and secured by the blockchain.\nStaking (noun)\na way of earning rewards for holding certain cryptocurrencies. Cryptocurrencies allow staking using a “consensus mechanism” called proof of stake to ensure that all transactions are verified and secured without a bank or payment processor in the middle.\nT\nTestnet (noun)\nan alternative, value-less blockchain where developers can experiment with code and functions prior to application onto the network’s mainnet.\nToken (noun)\nanything that has value or anything that can be exchanged for goods or services. Examples include fiat currency, cryptocurrency, NFTs, and gifts.\n\nW\nWallet (noun)\na digital wallet that facilitates transactions and holds cryptocurrency and NFTs. Wallets are necessary to purchase and trade NFTs and cryptocurrencies.\nWhale (noun)\nan individual who holds a large amount of a particular cryptocurrency, social token, or NFT. A whale has enough coins or tokens to cause a significant impact on the market prices by selling or buying large amounts.\nThese were just some of the more common terms in Web3. However, the glossary keeps expanding so it’s helpful to stay updated with the industry lingo. There’s multiple websites that keep an updated Web3 Dictionary. Feel free to check two of my personal favorites — MHouse & Hashnode.\n\nABCs of Web3 for Designers was originally published in Reach Platform on Medium, where people are continuing the conversation by highlighting and responding to this story.","dc:creator":"Katarina Stefanovic","guid":"https://medium.com/p/5a71af20c973","categories":["crypto","product-design","glossary","blockhain","web3"],"isoDate":"2022-12-12T17:09:56.000Z","from":"https://medium.com/feed/reach-sh"},{"creator":"Aptos","title":"Securing Move","link":"https://aptoslabs.medium.com/securing-move-f81099f5e08c?source=rss-70211828fe2e------2","pubDate":"Mon, 12 Dec 2022 17:25:27 GMT","content:encoded":"<p><em>by Aptos Labs and OtterSec</em></p><p>The Aptos Network uses the Move smart contract language as the underlying programming model. While Move is designed for an ecosystem of secure smart contracts, a <em>faulty implementation of Move itself</em> can jeopardize those properties. At Aptos Labs, we are committed to making Move as secure as possible, together with the community. We are both investing in tools for writing correct smart contracts (e.g. the Move Prover, developed predominantly by Aptos), as well as the correctness of runtime core components like the Move Virtual Machine. In this article we describe how we, together with our partners, achieve the latter via auditing, bug bounties, fuzzing, and security hardening of the underlying implementation.</p><h3>What are we securing?</h3><p>Move’s security is based on a few basic properties. These properties are defined in terms of the <em>bytecode</em> that the Move execution engine consumes and are independent of the source language:</p><ul><li><strong>Type safety</strong>: Each value has a unique and unforgeable type. For example, it is not possible to take some value of type `address` and turn it into a security relevant token of type `signer`.</li><li><strong>Modular encapsulation</strong>: Resources in storage can only be manipulated from code within modules that are declaring those resources. Only functions with matching visibilities can be called cross-module.</li><li><strong>Ownership and lifetime</strong>: Move’s ability system enforces that a value is not copied, dropped, stored, or used as a key unless the corresponding ability is declared for the value type.</li><li><strong>Reference safety</strong>: References do not outlive the values that they are pointing to. A mutable reference is exclusively owned, such that aliasing is not possible.</li></ul><p>The traditional architecture of the Move virtual machine delegates validation of the above properties to the <em>(bytecode) verifier</em> as seen in the diagram below:</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/548/0*kNRSZ7ixRqD28pet\" /></figure><p>The following are the questions that we are interested in:</p><ol><li>Is the bytecode verifier <em>complete</em>, and does it guarantee that all of the properties above are satisfied for every program? This is important because violating any of the properties above can potentially result in the loss of assets.</li><li>Can a given Move bytecode program crash the execution engine? Because in a replicated state machine, all nodes execute the same programs, this can be used to halt the network.</li><li>Can a given program cause the execution engine to run out of resources (memory or time)? This can be exploited for DoS attacks slowing or suspending the network.</li></ol><h3>How are we doing it?</h3><p>At the core of developing bug-free code are disciplined software engineering practices paired with the right tools. At Aptos, we are following the rigorous process of mandatory code review and continuous testing and integration, combined with the best practices of the Rust ecosystem. In addition to these traditional aspects, we are also applying the following measurements to keep Move as safe as it is designed to be.</p><h3>Auditing and Consulting</h3><p>One of the most respected measurements in the industry to gain confidence in blockchain networks is auditing. At Aptos Labs, we contracted Certik (<a href=\"https://www.certik.com/projects/aptos\">report</a>) and Holburn for auditing the Move Virtual machine. Multiple critical issues were found, one of them in the category of type safety.</p><p>In addition to external auditing, Aptos Labs led and organized a community auditing effort, focused on the <em>bytecode</em> verifier. Engineers from Mysten Labs, Starcoin, and auditing companies like MoveBit and OtterSec teamed up with Aptos engineers for this effort, investing about 6 person weeks of auditing time. The results of this are captured<a href=\"https://docs.google.com/spreadsheets/d/1B0vRkM-UtZ2hICru6jwW08XmJUiP8-YuD1Z8HxVkfs4/edit?usp=sharing\"> in this spreadsheet</a>, referring to dozens of documents created during this audit. This auditing effort found and addressed multiple issues before Aptos hit mainnet.</p><p>Last, but not least, we have a close collaboration with <a href=\"https://osec.io/\">OtterSec</a>. The OtterSec team performed manual code reviews and developed fuzzing technology for various targets, identifying multiple critical issues in both the Move VM and Aptos framework code. They also led efforts to add redundant defense-in-depth logic to the Move VM (see below), influencing our ongoing design work to mitigate further loss of funds vulnerabilities.</p><h3>Bug Bounty</h3><p>Aptos Labs runs a <a href=\"https://github.com/aptos-labs/aptos-core/blob/main/SECURITY.md\">bug bounty program</a>. For critical bugs of the kind which can lead to loss of assets, bounties of up to $1,000,000 are offered. Similarly, crash bugs can be rewarded with up to $100,000.</p><p>With the bounty program, we have worked closely with a talented set of security researchers to find and fix bugs. A few of those bugs were in the critical category, while other bugs have been crashes found by using fuzzers.</p><p>Aptos Labs has stood to its commitments in bug bounties, and significant bounties were paid out. Moreover, Aptos Labs has continued to utilize the expertise of whitehats we met via the bounty program and intend on continuing to work together with this community.</p><h3>Fuzzing</h3><p>The bounty program motivated us to invest in fuzzing at Aptos Labs ourselves. The Move VM code has been modified to implement the `Arbitrary` Rust fuzzing trait at relevant points, thus enabling the use of ‘cargo fuzz’ to dynamically generate and validate bytecode modules.. We have a few continuous jobs running with those fuzzing targets.</p><h3>Redundancy</h3><p>One way to achieve extra assurance of security is via redundancy. We added a so-called <em>paranoid mode </em>to the Move VM, which enforces type safety and the other rules mentioned above at execution time. While the bytecode verifier already checks such properties when the code enters the system, the paranoid mode reverifies the same checks again during bytecode execution time. The paranoid mode was extensively discussed within the Move community, with Aptos engineers leading the design. For more information see <a href=\"https://github.com/move-language/move/pull/642\">this PR</a> (final version) and <a href=\"https://github.com/move-language/move/pull/598\">this PR</a> (intermediate version).</p><h3>What’s next?</h3><p>At Aptos Labs, we are committed to making Move as secure as possible, and invested heavily into this area. Here we described ongoing efforts around auditing, bug bounties, fuzzing, and hardening conducted by us and our partners. Moving forward, we plan to continue to invest in this space. We will continue to offer a bug bounty program, engage with reputable security auditors, and drive development of security hardening tools, e.g., fuzzing technology.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=f81099f5e08c\" width=\"1\" height=\"1\" alt=\"\">","content:encodedSnippet":"by Aptos Labs and OtterSec\nThe Aptos Network uses the Move smart contract language as the underlying programming model. While Move is designed for an ecosystem of secure smart contracts, a faulty implementation of Move itself can jeopardize those properties. At Aptos Labs, we are committed to making Move as secure as possible, together with the community. We are both investing in tools for writing correct smart contracts (e.g. the Move Prover, developed predominantly by Aptos), as well as the correctness of runtime core components like the Move Virtual Machine. In this article we describe how we, together with our partners, achieve the latter via auditing, bug bounties, fuzzing, and security hardening of the underlying implementation.\nWhat are we securing?\nMove’s security is based on a few basic properties. These properties are defined in terms of the bytecode that the Move execution engine consumes and are independent of the source language:\n\nType safety: Each value has a unique and unforgeable type. For example, it is not possible to take some value of type `address` and turn it into a security relevant token of type `signer`.\nModular encapsulation: Resources in storage can only be manipulated from code within modules that are declaring those resources. Only functions with matching visibilities can be called cross-module.\nOwnership and lifetime: Move’s ability system enforces that a value is not copied, dropped, stored, or used as a key unless the corresponding ability is declared for the value type.\nReference safety: References do not outlive the values that they are pointing to. A mutable reference is exclusively owned, such that aliasing is not possible.\n\nThe traditional architecture of the Move virtual machine delegates validation of the above properties to the (bytecode) verifier as seen in the diagram below:\n\nThe following are the questions that we are interested in:\n\nIs the bytecode verifier complete, and does it guarantee that all of the properties above are satisfied for every program? This is important because violating any of the properties above can potentially result in the loss of assets.\nCan a given Move bytecode program crash the execution engine? Because in a replicated state machine, all nodes execute the same programs, this can be used to halt the network.\nCan a given program cause the execution engine to run out of resources (memory or time)? This can be exploited for DoS attacks slowing or suspending the network.\n\nHow are we doing it?\nAt the core of developing bug-free code are disciplined software engineering practices paired with the right tools. At Aptos, we are following the rigorous process of mandatory code review and continuous testing and integration, combined with the best practices of the Rust ecosystem. In addition to these traditional aspects, we are also applying the following measurements to keep Move as safe as it is designed to be.\nAuditing and Consulting\nOne of the most respected measurements in the industry to gain confidence in blockchain networks is auditing. At Aptos Labs, we contracted Certik (report) and Holburn for auditing the Move Virtual machine. Multiple critical issues were found, one of them in the category of type safety.\nIn addition to external auditing, Aptos Labs led and organized a community auditing effort, focused on the bytecode verifier. Engineers from Mysten Labs, Starcoin, and auditing companies like MoveBit and OtterSec teamed up with Aptos engineers for this effort, investing about 6 person weeks of auditing time. The results of this are captured in this spreadsheet, referring to dozens of documents created during this audit. This auditing effort found and addressed multiple issues before Aptos hit mainnet.\nLast, but not least, we have a close collaboration with OtterSec. The OtterSec team performed manual code reviews and developed fuzzing technology for various targets, identifying multiple critical issues in both the Move VM and Aptos framework code. They also led efforts to add redundant defense-in-depth logic to the Move VM (see below), influencing our ongoing design work to mitigate further loss of funds vulnerabilities.\nBug Bounty\nAptos Labs runs a bug bounty program. For critical bugs of the kind which can lead to loss of assets, bounties of up to $1,000,000 are offered. Similarly, crash bugs can be rewarded with up to $100,000.\nWith the bounty program, we have worked closely with a talented set of security researchers to find and fix bugs. A few of those bugs were in the critical category, while other bugs have been crashes found by using fuzzers.\nAptos Labs has stood to its commitments in bug bounties, and significant bounties were paid out. Moreover, Aptos Labs has continued to utilize the expertise of whitehats we met via the bounty program and intend on continuing to work together with this community.\nFuzzing\nThe bounty program motivated us to invest in fuzzing at Aptos Labs ourselves. The Move VM code has been modified to implement the `Arbitrary` Rust fuzzing trait at relevant points, thus enabling the use of ‘cargo fuzz’ to dynamically generate and validate bytecode modules.. We have a few continuous jobs running with those fuzzing targets.\nRedundancy\nOne way to achieve extra assurance of security is via redundancy. We added a so-called paranoid mode to the Move VM, which enforces type safety and the other rules mentioned above at execution time. While the bytecode verifier already checks such properties when the code enters the system, the paranoid mode reverifies the same checks again during bytecode execution time. The paranoid mode was extensively discussed within the Move community, with Aptos engineers leading the design. For more information see this PR (final version) and this PR (intermediate version).\nWhat’s next?\nAt Aptos Labs, we are committed to making Move as secure as possible, and invested heavily into this area. Here we described ongoing efforts around auditing, bug bounties, fuzzing, and hardening conducted by us and our partners. Moving forward, we plan to continue to invest in this space. We will continue to offer a bug bounty program, engage with reputable security auditors, and drive development of security hardening tools, e.g., fuzzing technology.","dc:creator":"Aptos","guid":"https://medium.com/p/f81099f5e08c","categories":["technology","aptos","crypto","web3","blockchain"],"isoDate":"2022-12-12T17:25:27.000Z","from":"https://aptoslabs.medium.com/feed"},{"creator":"Cointelegraph By Turner Wright","title":"NYC Mayor stands by Bitcoin pledge amid bear market, FTX: Report","link":"https://cointelegraph.com/news/nyc-mayor-stands-by-bitcoin-pledge-amid-bear-market-ftx-report","pubDate":"Mon, 12 Dec 2022 17:30:00 +0000","enclosure":{"url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvMmUwYzJhZTEtOWYyYi00NGU4LWEwN2EtYTUwZmY0NDNlYzkyLmpwZw==.jpg","length":"840","type":"image/jpg"},"dc:creator":"Cointelegraph By Turner Wright","content":"\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvMmUwYzJhZTEtOWYyYi00NGU4LWEwN2EtYTUwZmY0NDNlYzkyLmpwZw==.jpg\"></p><p>During Eric Adams’ time in office, the NY state government passed a law which will implement a two-year moratorium on proof-of-work mining, and the crypto market turned bearish.</p>\n            ","contentSnippet":"During Eric Adams’ time in office, the NY state government passed a law which will implement a two-year moratorium on proof-of-work mining, and the crypto market turned bearish.","guid":"https://cointelegraph.com/news/nyc-mayor-stands-by-bitcoin-pledge-amid-bear-market-ftx-report","categories":["regulation","new york","eric adams","united states","bitcoin payments"],"isoDate":"2022-12-12T17:30:00.000Z","from":"https://cointelegraph.com/rss"},{"creator":"Jack Schickler","title":"Pro-Crypto EU Lawmaker Eva Kaili Set to Lose Vice-Presidency Amid Corruption Probe","link":"https://www.coindesk.com/policy/2022/12/12/pro-crypto-eu-lawmaker-eva-kaili-set-to-lose-vice-presidency-amid-corruption-probe/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","pubDate":"Mon, 12 Dec 2022 17:33:30 +0000","dc:creator":"Jack Schickler","content":"Kaili, actively involved in European Parliament discussions on cryptocurrency and NFTs, has already been suspended from her party following allegations of lobbying by Qatar","contentSnippet":"Kaili, actively involved in European Parliament discussions on cryptocurrency and NFTs, has already been suspended from her party following allegations of lobbying by Qatar","guid":"QI3Q55F75BBTHKQSQ34C5IB72U","categories":[{"_":"Policy","$":{"domain":"https://www.coindesk.com/policy/"}}],"isoDate":"2022-12-12T17:33:30.000Z","from":"http://feeds.feedburner.com/Coindesk"},{"creator":"Tom Carreras","title":"DOJ Mulls Bringing Criminal Charges Against Binance: Report","link":"https://cryptobriefing.com/doj-mulls-bringing-criminal-charges-against-binance-report/?utm_source=feed&utm_medium=rss","pubDate":"Mon, 12 Dec 2022 17:15:12 +0000","dc:creator":"Tom Carreras","content":"Binance and its executives could be facing charges including unlicensed money transmission, money laundering conspiracy, and criminal sanctions violationsif prosecutors can agree on filing them. Reuters vs. Binance The FTX...","contentSnippet":"Binance and its executives could be facing charges including unlicensed money transmission, money laundering conspiracy, and criminal sanctions violationsif prosecutors can agree on filing them. Reuters vs. Binance The FTX...","guid":"https://cryptobriefing.com/?p=123240","categories":["News","Binance","DOJ","Reuters"],"isoDate":"2022-12-12T17:15:12.000Z","from":"https://cryptobriefing.com/feed/"},{"title":"63 people arrested by Chinese police for laundering $1.7B through crypto","link":"https://seekingalpha.com/news/3916235-63-people-arrested-by-chinese-police-for-laundering-17b-through-crypto?utm_source=feed_news_crypto&utm_medium=referral","pubDate":"Mon, 12 Dec 2022 12:45:29 -0500","guid":"https://seekingalpha.com/news/3916235-63-people-arrested-by-chinese-police-for-laundering-17b-through-crypto?utm_source=feed_news_crypto&utm_medium=referral","categories":[{"_":"btc-usd","$":{"domain":"https://seekingalpha.com/symbol/BTC-USD"}}],"isoDate":"2022-12-12T17:45:29.000Z","from":"https://seekingalpha.com/news/crypto/feed"},{"creator":"Trustnodes","title":"Crypto is the Top Asset for Rich Millennials Says Survey","link":"https://www.trustnodes.com/2022/12/12/crypto-is-the-top-asset-for-rich-millennials-says-survey","pubDate":"Mon, 12 Dec 2022 17:52:48 +0000","dc:creator":"Trustnodes","comments":"https://www.trustnodes.com/2022/12/12/crypto-is-the-top-asset-for-rich-millennials-says-survey#respond","content":"<p><img width=\"860\" height=\"573\" src=\"https://www.trustnodes.com/wp-content/uploads/2022/12/boa.jpeg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://www.trustnodes.com/wp-content/uploads/2022/12/boa.jpeg 860w, https://www.trustnodes.com/wp-content/uploads/2022/12/boa-300x200.jpeg 300w, https://www.trustnodes.com/wp-content/uploads/2022/12/boa-768x512.jpeg 768w, https://www.trustnodes.com/wp-content/uploads/2022/12/boa-600x400.jpeg 600w, https://www.trustnodes.com/wp-content/uploads/2022/12/boa-750x500.jpeg 750w\" sizes=\"(max-width: 860px) 100vw, 860px\" data-full-width=\"860\" data-full-height=\"573\" /></p>Millennials choose crypto as their top assets, above stocks or private equity, according to a survey. ","contentSnippet":"Millennials choose crypto as their top assets, above stocks or private equity, according to a survey.","guid":"https://www.trustnodes.com/?p=50448","categories":["Crypto","Featured","News"],"isoDate":"2022-12-12T17:52:48.000Z","from":"https://www.trustnodes.com/feed"},{"creator":"Cointelegraph By Marco Castrovilli","title":"Bitcoin could reach $1M in 5 years due to fiat currencies’ collapse, says Samson Mow ","link":"https://cointelegraph.com/news/bitcoin-could-reach-1m-in-5-years-due-to-fiat-currencies-collapse-says-samson-mow","pubDate":"Mon, 12 Dec 2022 18:00:00 +0000","enclosure":{"url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvMzdhN2NkMGQtZDc2ZS00Mjc5LWJkMjktNWRiNTUwMTFkNGU2LmpwZw==.jpg","length":"840","type":"image/jpg"},"dc:creator":"Cointelegraph By Marco Castrovilli","content":"\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvMzdhN2NkMGQtZDc2ZS00Mjc5LWJkMjktNWRiNTUwMTFkNGU2LmpwZw==.jpg\"></p><p>The future collapse of fiat currencies could propel Bitcoin to $1 million in the next five to 10 years, according to Jan3 CEO and Bitcoin proponent Samson Mow.</p>\n            ","contentSnippet":"The future collapse of fiat currencies could propel Bitcoin to $1 million in the next five to 10 years, according to Jan3 CEO and Bitcoin proponent Samson Mow.","guid":"https://cointelegraph.com/news/bitcoin-could-reach-1m-in-5-years-due-to-fiat-currencies-collapse-says-samson-mow","categories":["El Salvador","Bitcoin Price","Bitcoin Payments","Bitcoin Industry","Bitcoin Lifestyle","Government","Fiat Money"],"isoDate":"2022-12-12T18:00:00.000Z","from":"https://cointelegraph.com/rss"},{"creator":"Mathew Di Salvo","title":"SBF Says He Isn't Attending DC Hearing in Person Due to 'Paparazzi Effect'","link":"https://decrypt.co/116994/sam-bankman-fried-dc-hearing-paparazzi-effect","pubDate":"Mon, 12 Dec 2022 18:01:40 +0000","enclosure":{"url":"https://img.decrypt.co/insecure/rs:fill:1024:512:1:0/plain/https://cdn.decrypt.co/wp-content/uploads/2022/07/sam-bankman-fried-ftx-ceo-congress-gID_4.jpg@png","length":"1000000","type":"image/png"},"dc:creator":"Mathew Di Salvo","content":"The disgraced ex-CEO of the collapsed FTX empire also said he expects his testimony to be “underwhelming.”","contentSnippet":"The disgraced ex-CEO of the collapsed FTX empire also said he expects his testimony to be “underwhelming.”","guid":"https://decrypt.co/?p=116994","categories":["ftx-token","Business"],"isoDate":"2022-12-12T18:01:40.000Z","from":"https://decryptmedia.com/feed/"},{"title":"Amber Group Claims ‘False Allegations’ Against Company, Provides No Details","link":"https://blockworks.co/news/amber-group-fraught-with-turmoil","pubDate":"Mon, 12 Dec 2022 18:18:58 GMT","content:encoded":"\n<p>Amber Group has yet to publicly address the latest reports around its financial health, outstanding liabilities, and its retail business, despite saying certain claims against the company have been inaccurate.</p>\n\n\n\n<p>Amber Group said in a Dec. 6 tweet that the company and <a href=\"https://blockworks.co/news/crypto-trading-platform-amber-group-eclipses-3b-valuation-with-latest-raise\" target=\"_blank\" rel=\"noreferrer noopener\">UK-based crypto subsidiary WhaleFin</a>, which operates a consumer-facing app, <a href=\"https://blockworks.co/news/amber-group-says-business-as-usual\" target=\"_blank\" rel=\"noreferrer noopener\">“are business as usual</a>.” But a source familiar with the matter told Blockworks that the company’s Whalefin business has essentially been “shut down.”&nbsp;</p>\n\n\n\n<p>The source, who spoke on the condition of anonymity, added that Amber Group has recently shifted focus to its institutional business.&nbsp;&nbsp;</p>\n\n\n\n<p>Last week The Block <a href=\"https://www.theblock.co/post/193616/amber-group-vauld-ceo-counterparty1-a-130-million\" target=\"_blank\" rel=\"noreferrer noopener\">reported</a> that Amber Group owes about $130 million to Darshan Bathija, the CEO of crypto lender Vauld, citing “a source with direct knowledge of the matter” and a legal document.</p>\n\n\n\n<p>The crypto platform appeared to deny the report.</p>\n\n\n\n<p>“Regarding certain false allegations against Amber today, our legal counsel will issue an official statement shortly and take potential legal actions,” the company <a href=\"https://twitter.com/ambergroup_io/status/1601214677610287105\" target=\"_blank\" rel=\"noreferrer noopener\">tweeted</a> on Friday.&nbsp;</p>\n\n\n\n<p>But the firm had not yet shared any follow-up to the claim, as of Monday mid-day.</p>\n\n\n\n<p>An Amber Group spokesperson declined to comment.&nbsp;</p>\n\n\n\n<p>Vauld <a href=\"https://blockworks.co/news/vauld-stops-withdrawals-eyes-restructure-after-users-pull-nearly-200m\" target=\"_blank\" rel=\"noreferrer noopener\">suspended</a> withdrawals, trading and deposits on its network in July, just weeks after it <a href=\"https://blockworks.co/coinbase-backed-vauld-cuts-workforce-by-30-seeks-to-halve-exec-pay/\" target=\"_blank\" rel=\"noreferrer noopener\">laid off 30%</a> of its staff.</p>\n\n\n\n<p>Bathija and the company did not immediately return requests for comment.</p>\n\n\n\n<h3>Cutting costs and raising funds&nbsp;&nbsp;</h3>\n\n\n\n<p>The Financial Times <a href=\"https://www.theblock.co/post/193530/amber-group-satellite-hubs-lose-key-executives\" target=\"_blank\" rel=\"noreferrer noopener\">reported</a> the day before that Singapore-based Amber Group had paused its expansion plans as it is in the process of raising the second half of a planned $100 million funding round.</p>\n\n\n\n<p><a href=\"https://www.linkedin.com/in/cactusraazi/\" target=\"_blank\" rel=\"noreferrer noopener\">Cactus Raazi</a>, who was hired as Amber Group’s US CEO in October 2021, is among leaders who have left the company in recent months, a source told Blockworks. <a href=\"https://www.linkedin.com/in/angiedicarlo/\" target=\"_blank\" rel=\"noreferrer noopener\">Angie Beehler</a>, formerly Amber Group’s global co-head of institutional sales and business development, and ex-Chief Strategy Officer <a href=\"https://www.linkedin.com/in/dimitrios-kavvathas-3bb3654/\" target=\"_blank\" rel=\"noreferrer noopener\">Dimitrios Kavvathas</a> left the company in September, according to their LinkedIn profiles.</p>\n\n\n\n<p>The company is reportedly getting ready to lay off several hundred people as well.</p>\n\n\n\n<p>Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2022-12-09/crypto-s-amber-to-end-chelsea-sponsorship-axe-over-40-of-jobs-in-ftx-fallout?leadSource=uverify%20wall\" target=\"_blank\" rel=\"noreferrer noopener\">reported</a> Friday that Amber Group is set to cut its workforce to less than 400 from roughly 700 and is also seeking to end its sponsorship deal with Chelsea Football Club.</p>\n\n\n\n<p>Several days prior to Bloomberg’s report about Amber Group layoffs, reporter Colin Wu <a href=\"https://twitter.com/WuBlockchain/status/1600018582212988929\" target=\"_blank\" rel=\"noreferrer noopener\">tweeted</a> that the firm began to lay off hundreds of people again this month, citing former employees.</p>\n\n\n\n<p>An Amber Group spokesperson declined to comment on the layoffs.</p>\n\n\n\n<p>“Weathering through market cycles, we have to constantly adjust and pivot our business strategies, product offerings, and, as a result, internal teams and functions,” the firm <a href=\"https://twitter.com/ambergroup_io/status/1600101239294787584\" target=\"_blank\" rel=\"noreferrer noopener\">said</a> on Dec. 6.</p>\n\n\n\n<p>Amber Group<a href=\"https://twitter.com/ambergroup_io/status/1590382100955697154\" target=\"_blank\" rel=\"noreferrer noopener\"> said last month</a> that it was an active trading participant on now-bankrupt crypto exchange FTX and had withdrawals yet to be processed — accounting for less than 10% of Amber Group’s total trading capital. Amber Group said at the time that the situation did not pose a threat to its business operations or liquidity.</p>\n\n\n\n<p>More recently, Amber Group co-founder Tiantian Kullander unexpectedly died in his sleep on Nov. 23, according to <a href=\"https://www.ambergroup.io/newsDetail?id=444&amp;source=In%20the%20News&amp;page=1\" target=\"_blank\" rel=\"noreferrer noopener\">a company post</a>. He was 30.</p>\n\n\n\n<p>A spokesperson declined to comment on the impact of Kullander’s death on the company.</p>\n\n\n\n<hr class=\"wp-block-separator\">\n<p><strong>Get the day’s top crypto news and insights delivered to your inbox every evening.&nbsp;<a href=\"https://cms.blockworks.co/newsletter/?source=end\" target=\"_blank\" rel=\"noreferrer noopener\">Subscribe to Blockworks’ free newsletter</a>&nbsp;now.</strong></p>\n<br>\n<p><strong>Can&#8217;t wait? Get our news the fastest way possible.&nbsp;<a href=\"https://t.me/blockworks_news\" target=\"_blank\" rel=\"noreferrer noopener\">Join us on Telegram</a>.</strong></p>\n<hr class=\"wp-block-separator\">\n","content:encodedSnippet":"Amber Group has yet to publicly address the latest reports around its financial health, outstanding liabilities, and its retail business, despite saying certain claims against the company have been inaccurate.\nAmber Group said in a Dec. 6 tweet that the company and UK-based crypto subsidiary WhaleFin, which operates a consumer-facing app, “are business as usual.” But a source familiar with the matter told Blockworks that the company’s Whalefin business has essentially been “shut down.” \nThe source, who spoke on the condition of anonymity, added that Amber Group has recently shifted focus to its institutional business.  \nLast week The Block reported that Amber Group owes about $130 million to Darshan Bathija, the CEO of crypto lender Vauld, citing “a source with direct knowledge of the matter” and a legal document.\nThe crypto platform appeared to deny the report.\n“Regarding certain false allegations against Amber today, our legal counsel will issue an official statement shortly and take potential legal actions,” the company tweeted on Friday. \nBut the firm had not yet shared any follow-up to the claim, as of Monday mid-day.\nAn Amber Group spokesperson declined to comment. \nVauld suspended withdrawals, trading and deposits on its network in July, just weeks after it laid off 30% of its staff.\nBathija and the company did not immediately return requests for comment.\nCutting costs and raising funds  \nThe Financial Times reported the day before that Singapore-based Amber Group had paused its expansion plans as it is in the process of raising the second half of a planned $100 million funding round.\nCactus Raazi, who was hired as Amber Group’s US CEO in October 2021, is among leaders who have left the company in recent months, a source told Blockworks. Angie Beehler, formerly Amber Group’s global co-head of institutional sales and business development, and ex-Chief Strategy Officer Dimitrios Kavvathas left the company in September, according to their LinkedIn profiles.\nThe company is reportedly getting ready to lay off several hundred people as well.\nBloomberg reported Friday that Amber Group is set to cut its workforce to less than 400 from roughly 700 and is also seeking to end its sponsorship deal with Chelsea Football Club.\nSeveral days prior to Bloomberg’s report about Amber Group layoffs, reporter Colin Wu tweeted that the firm began to lay off hundreds of people again this month, citing former employees.\nAn Amber Group spokesperson declined to comment on the layoffs.\n“Weathering through market cycles, we have to constantly adjust and pivot our business strategies, product offerings, and, as a result, internal teams and functions,” the firm said on Dec. 6.\nAmber Group said last month that it was an active trading participant on now-bankrupt crypto exchange FTX and had withdrawals yet to be processed — accounting for less than 10% of Amber Group’s total trading capital. Amber Group said at the time that the situation did not pose a threat to its business operations or liquidity.\nMore recently, Amber Group co-founder Tiantian Kullander unexpectedly died in his sleep on Nov. 23, according to a company post. He was 30.\nA spokesperson declined to comment on the impact of Kullander’s death on the company.\nGet the day’s top crypto news and insights delivered to your inbox every evening. Subscribe to Blockworks’ free newsletter now.\nCan’t wait? Get our news the fastest way possible. Join us on Telegram.","content":"Amber Group is moving away from its WhaleFin product, a source told Blockworks after media reports surfaced of Amber’s debt to crypto lender Vauld’s CEO","contentSnippet":"Amber Group is moving away from its WhaleFin product, a source told Blockworks after media reports surfaced of Amber’s debt to crypto lender Vauld’s CEO","guid":"https://blockworks.co/news/amber-group-fraught-with-turmoil","categories":["Markets","Amber Group","Debt","Vauld"],"isoDate":"2022-12-12T18:18:58.000Z","from":"https://blockworks.co/feed/"},{"creator":"Cointelegraph By Marcel Pechman","title":"Bitcoin traders cross fingers in hopes that a positive Fed meeting triggers a run to $18K ","link":"https://cointelegraph.com/news/bitcoin-traders-cross-fingers-in-hopes-that-a-positive-fed-meeting-triggers-a-run-to-18k","pubDate":"Mon, 12 Dec 2022 18:21:41 +0000","enclosure":{"url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvZWExZGYzMWYtNmM0ZC00NDYyLWFlN2UtMzg1NTYwODBkNmMxLmpwZw==.jpg","length":"840","type":"image/jpg"},"dc:creator":"Cointelegraph By Marcel Pechman","content":"\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvZWExZGYzMWYtNmM0ZC00NDYyLWFlN2UtMzg1NTYwODBkNmMxLmpwZw==.jpg\"></p><p>All eyes are on this week’s Federal Reserve meeting, and BTC traders hope that positive strides against inflation trigger a run to $18,000. </p>\n            ","contentSnippet":"All eyes are on this week’s Federal Reserve meeting, and BTC traders hope that positive strides against inflation trigger a run to $18,000.","guid":"https://cointelegraph.com/news/bitcoin-traders-cross-fingers-in-hopes-that-a-positive-fed-meeting-triggers-a-run-to-18k","categories":["markets","derivatives","asia","stablecoin","leverage","futures","Bybit"],"isoDate":"2022-12-12T18:21:41.000Z","from":"https://cointelegraph.com/rss"},{"creator":"Andrew Hayward","title":"Reddit Users Have Minted More Than 5 Million NFT Avatars on Polygon","link":"https://decrypt.co/117001/reddit-5-million-nft-avatars-polygon","pubDate":"Mon, 12 Dec 2022 18:36:30 +0000","enclosure":{"url":"https://img.decrypt.co/insecure/rs:fill:1024:512:1:0/plain/https://cdn.decrypt.co/wp-content/uploads/2022/08/reddit-polygon-nfts-gID_4.png@png","length":"1000000","type":"image/png"},"dc:creator":"Andrew Hayward","content":"Reddit’s NFT program is onboarding users into Web3, with more than 4.25 million unique wallets holding the Polygon assets.","contentSnippet":"Reddit’s NFT program is onboarding users into Web3, with more than 4.25 million unique wallets holding the Polygon assets.","guid":"https://decrypt.co/?p=117001","categories":["matic-network","NFTs"],"isoDate":"2022-12-12T18:36:30.000Z","from":"https://decryptmedia.com/feed/"},{"title":"Sam Bankman-Fried Still Thinks He’s a Good Businessman","link":"https://blockworks.co/news/sam-bankman-fried-still-thinks-hes-a-good-businessman","pubDate":"Mon, 12 Dec 2022 18:37:50 GMT","content:encoded":"\n<p>Sam Bankman-Fried still reckons he’s a good businessman despite his epic mismanagement triggering havoc across the entire crypto ecosystem.</p>\n\n\n\n<p>In an interview with BBC from a luxury apartment somewhere in the Bahamas, Bankman-Fried outlined what seems likely to be his primary legal defense: general denial.</p>\n\n\n\n<p>“I didn’t knowingly commit fraud, I don’t think I committed fraud. I didn’t want any of this to happen. I certainly wasn’t nearly as competent as I thought I was,” Bankman-Fried said.</p>\n\n\n\n<p>The disgraced former crypto billionaire noted he didn’t think he’ll be arrested for fraud but did worry about it. He conceded doing the wrong things while running FTX, albeit unintentionally.</p>\n\n\n\n<p>Bankman-Fried said: “It [FTX’s collapse] hurt a lot of people, and that’s on me one way or another. But I didn’t think it was going to happen. I never wanted anything like this to happen.”&nbsp;</p>\n\n\n\n<p>“I was surprised when it did. I’m not lying, and I think all that I have left now is to tell my truth and let the cards fall as they may.”</p>\n\n\n\n<p>FTX, alongside more than 100 affiliated entities, filed for bankruptcy last month after failing under the pressure of a $6 billion bank run. Customers rushed to withdraw funds after insolvency rumors swirled alongside revelations of funneling user funds to sister trading venture Alameda Research.</p>\n\n\n\n<p>Bankman-Fried <a href=\"https://www.bbc.com/news/technology-63911363\" target=\"_blank\" rel=\"noreferrer noopener\">told the BBC’s</a> Joe Tidy that he ran some aspects of FTX well — although he didn’t elaborate on which parts — “but some wasn’t enough.”</p>\n\n\n\n<p>When Tidy asked Bankman-Fried if he thought himself a good businessman, Bankman-Fried replied: “Yep,” but added that he grew careless over the past year. “Part of me was aware of that fact and didn’t know what to do about it.”</p>\n\n\n\n<h3>Sam Bankman-Fried doesn’t rule out potential crypto comeback</h3>\n\n\n\n<p>While the US Congress — alongside up to a million FTX users around the world — waits to hear potential testimony from Bankman-Fried on Tuesday, the FTX founder says his own financial outlook seems bleak.</p>\n\n\n\n<p>“The math isn’t looking great on a six-month long time scale. I don’t know, legal fees can get quite expensive,” Bankman-Fried said. He’d previously claimed access to just $100,000 and one functional credit card.</p>\n\n\n\n<p>&nbsp;“I’m not hiding any assets here, anything I’ve had, I’ve disclosed to and I don’t even have access to my own personal data, I’m trying to get a login for my own bank account.”</p>\n\n\n\n<p>As for whether Bankman-Fried plans to ever make a comeback in crypto, he said he wasn’t sure — but if he were to be involved in another company, he would want it to have a “really high standard of transparency.”</p>\n\n\n\n<p>How realistic a potential future Bankman-Fried venture would be, or what it would look like, wasn’t addressed. Bankman-Fried said he “would give anything to be able to [pay users back] and I’m gonna try if I can.”</p>\n\n\n\n<p>Indeed, the FTX saga looks set to stretch across multiple years, especially if previous crypto exchange insolvencies (such as Mt. Gox) are anything to go by.&nbsp;</p>\n\n\n\n<p>Still, Bankman-Fried shared the belief that he hadn’t single-handedly killed crypto: “I hope not. I don’t think so. I think it’s more resilient than that.”</p>\n\n\n\n<p>“And if I killed crypto, then crypto is not what we thought it was, because crypto is meant to be resilient.”</p>\n\n\n\n<hr class=\"wp-block-separator\">\n<p><strong>Get the day’s top crypto news and insights delivered to your inbox every evening.&nbsp;<a href=\"https://cms.blockworks.co/newsletter/?source=end\" target=\"_blank\" rel=\"noreferrer noopener\">Subscribe to Blockworks’ free newsletter</a>&nbsp;now.</strong></p>\n<br>\n<p><strong>Can&#8217;t wait? Get our news the fastest way possible.&nbsp;<a href=\"https://t.me/blockworks_news\" target=\"_blank\" rel=\"noreferrer noopener\">Join us on Telegram</a>.</strong></p>\n<hr class=\"wp-block-separator\">\n","content:encodedSnippet":"Sam Bankman-Fried still reckons he’s a good businessman despite his epic mismanagement triggering havoc across the entire crypto ecosystem.\nIn an interview with BBC from a luxury apartment somewhere in the Bahamas, Bankman-Fried outlined what seems likely to be his primary legal defense: general denial.\n“I didn’t knowingly commit fraud, I don’t think I committed fraud. I didn’t want any of this to happen. I certainly wasn’t nearly as competent as I thought I was,” Bankman-Fried said.\nThe disgraced former crypto billionaire noted he didn’t think he’ll be arrested for fraud but did worry about it. He conceded doing the wrong things while running FTX, albeit unintentionally.\nBankman-Fried said: “It [FTX’s collapse] hurt a lot of people, and that’s on me one way or another. But I didn’t think it was going to happen. I never wanted anything like this to happen.” \n“I was surprised when it did. I’m not lying, and I think all that I have left now is to tell my truth and let the cards fall as they may.”\nFTX, alongside more than 100 affiliated entities, filed for bankruptcy last month after failing under the pressure of a $6 billion bank run. Customers rushed to withdraw funds after insolvency rumors swirled alongside revelations of funneling user funds to sister trading venture Alameda Research.\nBankman-Fried told the BBC’s Joe Tidy that he ran some aspects of FTX well — although he didn’t elaborate on which parts — “but some wasn’t enough.”\nWhen Tidy asked Bankman-Fried if he thought himself a good businessman, Bankman-Fried replied: “Yep,” but added that he grew careless over the past year. “Part of me was aware of that fact and didn’t know what to do about it.”\nSam Bankman-Fried doesn’t rule out potential crypto comeback\nWhile the US Congress — alongside up to a million FTX users around the world — waits to hear potential testimony from Bankman-Fried on Tuesday, the FTX founder says his own financial outlook seems bleak.\n“The math isn’t looking great on a six-month long time scale. I don’t know, legal fees can get quite expensive,” Bankman-Fried said. He’d previously claimed access to just $100,000 and one functional credit card.\n “I’m not hiding any assets here, anything I’ve had, I’ve disclosed to and I don’t even have access to my own personal data, I’m trying to get a login for my own bank account.”\nAs for whether Bankman-Fried plans to ever make a comeback in crypto, he said he wasn’t sure — but if he were to be involved in another company, he would want it to have a “really high standard of transparency.”\nHow realistic a potential future Bankman-Fried venture would be, or what it would look like, wasn’t addressed. Bankman-Fried said he “would give anything to be able to [pay users back] and I’m gonna try if I can.”\nIndeed, the FTX saga looks set to stretch across multiple years, especially if previous crypto exchange insolvencies (such as Mt. Gox) are anything to go by. \nStill, Bankman-Fried shared the belief that he hadn’t single-handedly killed crypto: “I hope not. I don’t think so. I think it’s more resilient than that.”\n“And if I killed crypto, then crypto is not what we thought it was, because crypto is meant to be resilient.”\nGet the day’s top crypto news and insights delivered to your inbox every evening. Subscribe to Blockworks’ free newsletter now.\nCan’t wait? Get our news the fastest way possible. Join us on Telegram.","content":"Former FTX CEO Sam Bankman-Fried told the BBC he worries about getting arrested but tries to ignore things he can’t control","contentSnippet":"Former FTX CEO Sam Bankman-Fried told the BBC he worries about getting arrested but tries to ignore things he can’t control","guid":"https://blockworks.co/news/sam-bankman-fried-still-thinks-hes-a-good-businessman","categories":["Markets","bankruptcy","Sam Bankman-Fried"],"isoDate":"2022-12-12T18:37:50.000Z","from":"https://blockworks.co/feed/"},{"creator":"Douglas Axen","title":"How to Get the Token Balance of an Address","link":"https://moralis.io/how-to-get-the-token-balance-of-an-address/","pubDate":"Mon, 12 Dec 2022 18:40:50 +0000","dc:creator":"Douglas Axen","content":"<p>Join us in this tutorial as we show you the most accessible way to get the token balance of an address! In fact, with Moralis and the Token API, you can query an address’ ERC-20 token balance in three steps:&#160; If you follow the steps above, you should receive a response similar to the one</p>\n<p>The post <a rel=\"nofollow\" href=\"https://moralis.io/how-to-get-the-token-balance-of-an-address/\">How to Get the Token Balance of an Address</a> appeared first on <a rel=\"nofollow\" href=\"https://moralis.io\">Moralis Web3 | Enterprise-Grade Web3 APIs</a>.</p>\n","contentSnippet":"Join us in this tutorial as we show you the most accessible way to get the token balance of an address! In fact, with Moralis and the Token API, you can query an address’ ERC-20 token balance in three steps:  If you follow the steps above, you should receive a response similar to the one\nThe post How to Get the Token Balance of an Address appeared first on Moralis Web3 | Enterprise-Grade Web3 APIs.","guid":"https://moralis.io/?p=108411","categories":["Blog","Code Walkthrough","Programming","Token API","Get the Token Balance of an Address"],"isoDate":"2022-12-12T18:40:50.000Z","from":"https://moralis.io/blog/feed/"},{"creator":"Eliza Gkritsi, Nelson Wang","title":"Bitcoin Miner Argo Blockchain Says It's Close to Restructuring Without Having to Declare Bankruptcy","link":"https://www.coindesk.com/business/2022/12/12/bitcoin-miner-argo-blockchain-says-its-close-to-restructuring-without-having-to-declare-bankruptcy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","pubDate":"Mon, 12 Dec 2022 18:35:20 +0000","dc:creator":"Eliza Gkritsi, Nelson Wang","content":"The London-based company warned, however, that there's no reassurance it will be able to do so.","contentSnippet":"The London-based company warned, however, that there's no reassurance it will be able to do so.","guid":"GKUBROZYD5FVVIEIJ5J2SSE3HE","categories":[{"_":"Business","$":{"domain":"https://www.coindesk.com/business/"}}],"isoDate":"2022-12-12T18:35:20.000Z","from":"http://feeds.feedburner.com/Coindesk"},{"title":"Argo Blockchain provides update on liquidity, in advanced talks to sell certain assets","link":"https://seekingalpha.com/news/3916270-argo-blockchain-provides-update-on-liquidity-in-advanced-talks-to-sell-certain-assets?utm_source=feed_news_crypto&utm_medium=referral","pubDate":"Mon, 12 Dec 2022 14:08:13 -0500","guid":"https://seekingalpha.com/news/3916270-argo-blockchain-provides-update-on-liquidity-in-advanced-talks-to-sell-certain-assets?utm_source=feed_news_crypto&utm_medium=referral","categories":[{"_":"arbkf","$":{"domain":"https://seekingalpha.com/symbol/ARBKF"}},{"_":"arbk","$":{"domain":"https://seekingalpha.com/symbol/ARBK"}}],"isoDate":"2022-12-12T19:08:13.000Z","from":"https://seekingalpha.com/news/crypto/feed"},{"creator":"Cointelegraph By Rakesh Upadhyay","title":"Price analysis 12/12: SPX, DXY, BTC, ETH, BNB, XRP, DOGE, ADA, MATIC, DOT ","link":"https://cointelegraph.com/news/price-analysis-12-12-spx-dxy-btc-eth-bnb-xrp-doge-ada-matic-dot","pubDate":"Mon, 12 Dec 2022 19:30:00 +0000","enclosure":{"url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvN2ZhOTYwNzktNTRlZS00OWE1LWIxNWItYTg0YzYwZGNkNGQ2LmpwZw==.jpg","length":"840","type":"image/jpg"},"dc:creator":"Cointelegraph By Rakesh Upadhyay","content":"\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvN2ZhOTYwNzktNTRlZS00OWE1LWIxNWItYTg0YzYwZGNkNGQ2LmpwZw==.jpg\"></p><p>Cryptocurrency and stock markets could see a sharp spike in volatility due to this week’s CPI print, interest rate hike and a conference from Federal Reserve chair Jerome Powell.</p>\n            ","contentSnippet":"Cryptocurrency and stock markets could see a sharp spike in volatility due to this week’s CPI print, interest rate hike and a conference from Federal Reserve chair Jerome Powell.","guid":"https://cointelegraph.com/news/price-analysis-12-12-spx-dxy-btc-eth-bnb-xrp-doge-ada-matic-dot","categories":["Markets","S&P 500","US dollar","Bitcoin","Ethereum","Binance Coin","Ripple","Cardano","Dogecoin","Polygon","DOT","Price analysis"],"isoDate":"2022-12-12T19:30:00.000Z","from":"https://cointelegraph.com/rss"},{"creator":"Wasabi Wallet","title":"Wasabi Wallet Contribution Games","link":"https://blog.wasabiwallet.io/wasabi-wallet-contribution-games/","pubDate":"Mon, 12 Dec 2022 19:47:02 GMT","content:encoded":"<h3 id=\"stack-sats-for-doing-what-you-love\">Stack Sats for Doing What You Love</h3><img src=\"https://blog.wasabiwallet.io/content/images/2022/11/Contribution-Game.jpg\" alt=\"Wasabi Wallet Contribution Games\"><p>Contribution games have always been an integral part of Wasabi Wallet. Since its inception, individuals have been rewarded for facilitating the software&apos;s development via content creation, &#xA0;software testing or technical support.</p><p>We&apos;re always open to having new talent so we&apos;ve outlined multiple ways you can become a &#xA0;Wasabi Wallet contributor and ultimately stack sats on us.</p><h3 id=\"the-blog-writing-contribution-game\">The Blog Writing Contribution Game</h3><p>Contributors are encouraged<em> to submit</em> as many entries under the given prompt for the $100 bounty paid in Bitcoin. Once you have submitted your work, it will be reviewed. If it&apos;s something on par with the level of writing we&apos;d like to feature in our blog, then you will be rewarded!</p><p>Every winner can stack even more sats if they want to continue writing for us. After winning the bounty, you will be contacted to discuss the opportunity to consistently write content for us on a regular basis or as often as you&#x2019;d like.</p><p>The prompt is <strong>Bitcoin Privacy Best Practices.</strong> Please only submit work that has at least 500 words to <strong>contribution@zksnacks.com</strong> for consideration.</p><h3 id=\"political-cartoon-contribution-game\">Political Cartoon Contribution Game </h3><p>The Cartoonist contribution game invites all political cartoonists to create and submit bitcoin and privacy images for a $100 prize. Nothing is off limits but quality art and pertinent substance material are expected. </p><p>Like the blog contribution game, multiple submissions are welcomed. Send your submissions to &#xA0;<strong>contribution@zksnacks.com to be considered.</strong></p><h3 id=\"software-testing-contribution-game\">Software Testing Contribution Game</h3><p>There can never be enough people testing our software. Click <a href=\"https://wasabiwallet.io/contribution.html\">here</a> for more information on how you can contribute to Wasabi Wallet&#x2019;s software development.</p><h3 id=\"support-contribution-game\">Support Contribution Game </h3><p>People wanting to learn about Wasabi Wallet and offer technical support on various platforms can join Wasabi Wallet&#x2019;s support team. However, they must first go through an orientation process where they learn about the inner workings of Wasabi Wallet.<br><br>Candidates will then be left on their own to determine how well they can individually offer support to Wasabi users with the possibility of officially joining the Wasabi Wallet 2.0 Support Team.</p>","content:encodedSnippet":"Stack Sats for Doing What You Love\n\nContribution games have always been an integral part of Wasabi Wallet. Since its inception, individuals have been rewarded for facilitating the software's development via content creation,  software testing or technical support.\nWe're always open to having new talent so we've outlined multiple ways you can become a  Wasabi Wallet contributor and ultimately stack sats on us.\nThe Blog Writing Contribution Game\nContributors are encouraged to submit as many entries under the given prompt for the $100 bounty paid in Bitcoin. Once you have submitted your work, it will be reviewed. If it's something on par with the level of writing we'd like to feature in our blog, then you will be rewarded!\nEvery winner can stack even more sats if they want to continue writing for us. After winning the bounty, you will be contacted to discuss the opportunity to consistently write content for us on a regular basis or as often as you’d like.\nThe prompt is Bitcoin Privacy Best Practices. Please only submit work that has at least 500 words to contribution@zksnacks.com for consideration.\nPolitical Cartoon Contribution Game \nThe Cartoonist contribution game invites all political cartoonists to create and submit bitcoin and privacy images for a $100 prize. Nothing is off limits but quality art and pertinent substance material are expected. \nLike the blog contribution game, multiple submissions are welcomed. Send your submissions to  contribution@zksnacks.com to be considered.\nSoftware Testing Contribution Game\nThere can never be enough people testing our software. Click here for more information on how you can contribute to Wasabi Wallet’s software development.\nSupport Contribution Game \nPeople wanting to learn about Wasabi Wallet and offer technical support on various platforms can join Wasabi Wallet’s support team. However, they must first go through an orientation process where they learn about the inner workings of Wasabi Wallet.\nCandidates will then be left on their own to determine how well they can individually offer support to Wasabi users with the possibility of officially joining the Wasabi Wallet 2.0 Support Team.","dc:creator":"Wasabi Wallet","content":"We're always open to having new talent so we've outlined multiple ways you can become a  Wasabi Wallet contributor and ultimately stack sats on us.","contentSnippet":"We're always open to having new talent so we've outlined multiple ways you can become a  Wasabi Wallet contributor and ultimately stack sats on us.","guid":"63639e31cf2923003daebf30","categories":["Announcements","Company Culture"],"isoDate":"2022-12-12T19:47:02.000Z","from":"https://blog.wasabiwallet.io/rss/"},{"title":"New FTX CEO Says Exchange Commingled Assets in Congressional Testimony ","link":"https://blockworks.co/news/new-ftx-ceo-says-exchange-commingled-assets","pubDate":"Mon, 12 Dec 2022 19:49:50 GMT","content:encoded":"\n<p>FTX’s newly appointed CEO John Ray acknowledges the exchange commingled assets in Congressional testimony set to be delivered Tuesday.&nbsp;</p>\n\n\n\n<p>“Some of the unacceptable management practices at the FTX Group identified so far include…the commingling of assets,” Ray wrote in his prepared <a href=\"https://financialservices.house.gov/uploadedfiles/hhrg-117-ba00-wstate-rayj-20221213.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">testimony</a>, released Monday.&nbsp;</p>\n\n\n\n<p>FTX also inappropriately stored certain private keys “to access hundreds of millions of dollars in crypto assets without effective security controls or encryption,” Ray claimed in his statement. There was also no record of proper financial statements or transaction documentation, the insolvency professional added.&nbsp;</p>\n\n\n\n<p>Ray also clarified that FTX US, the exchange’s American subsidiary, was included in the Chapter 11 “because FTX US was not operated independently of FTX.com.” The filing helped to prevent a run on FTX US and protect current assets, Ray added.&nbsp;</p>\n\n\n\n<p>The House Financial Services Committee is slated to hear from Ray and former CEO Sam Bankman-Fried during its “<a href=\"https://financialservices.house.gov/events/eventsingle.aspx?EventID=410002\" target=\"_blank\" rel=\"noreferrer noopener\">Investigating FTX Hearing</a>” Tuesday morning.&nbsp;</p>\n\n\n\n<p>Bankman-Fried previously went <a href=\"https://blockworks.co/news/maxine-waters-subpoena-sam-bankman-fried\" target=\"_blank\" rel=\"noreferrer noopener\">back and forth with Rep. Maxine Waters</a>, the committee’s chair, over <a href=\"https://twitter.com/RepMaxineWaters/status/1599858166359068676?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1599858166359068676%7Ctwgr%5E164cbf465be428f4fb1beb1e1b5707bacd2cac06%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fblockworks.co%2Fnews%2Fmaxine-waters-subpoena-sam-bankman-fried\" target=\"_blank\" rel=\"noreferrer noopener\">Twitter</a> about whether or not he would appear. Waters said she would issue a subpoena if necessary.&nbsp;</p>\n\n\n\n<p>As of Friday, Dec. 9, Bankman-Fried is expected to attend the hearing, although he noted that he still does not have access to “much” of his data, but he “will try to be helpful during the hearing,” he <a href=\"https://twitter.com/SBF_FTX/status/1601186246990401537?s=20&amp;t=niz1AiRl9grGDy3rfQgZqg\" target=\"_blank\" rel=\"noreferrer noopener\">said</a>. It is expected that he will appear virtually, rather than in person.</p>\n\n\n\n<p>The hearing will be the disgraced founder’s <a href=\"https://blockworks.co/news/sbf-new-york-times\" target=\"_blank\" rel=\"noreferrer noopener\">latest</a> in a stint of public appearances following the exchange’s collapse.&nbsp;</p>\n\n\n\n<p>“I didn’t knowingly <a href=\"https://blockworks.co/news/bankman-fried-underestimated-collapse\" target=\"_blank\" rel=\"noreferrer noopener\">commingle funds</a>,” Bankman-Fried told the New York Times in November. “I wasn’t trying to commingle funds.”</p>\n\n\n\n<p>The restructuring team is currently focused on “implementing controls,” Ray said, including conducting audits and handling cash management. It also considers asset recovery and protection and maximizing value for stakeholders top priorities, according to the testimony.</p>\n\n\n\n<hr class=\"wp-block-separator\">\n<p><strong>Get the day’s top crypto news and insights delivered to your inbox every evening.&nbsp;<a href=\"https://cms.blockworks.co/newsletter/?source=end\" target=\"_blank\" rel=\"noreferrer noopener\">Subscribe to Blockworks’ free newsletter</a>&nbsp;now.</strong></p>\n<br>\n<p><strong>Can&#8217;t wait? Get our news the fastest way possible.&nbsp;<a href=\"https://t.me/blockworks_news\" target=\"_blank\" rel=\"noreferrer noopener\">Join us on Telegram</a>.</strong></p>\n<hr class=\"wp-block-separator\">\n","content:encodedSnippet":"FTX’s newly appointed CEO John Ray acknowledges the exchange commingled assets in Congressional testimony set to be delivered Tuesday. \n“Some of the unacceptable management practices at the FTX Group identified so far include…the commingling of assets,” Ray wrote in his prepared testimony, released Monday. \nFTX also inappropriately stored certain private keys “to access hundreds of millions of dollars in crypto assets without effective security controls or encryption,” Ray claimed in his statement. There was also no record of proper financial statements or transaction documentation, the insolvency professional added. \nRay also clarified that FTX US, the exchange’s American subsidiary, was included in the Chapter 11 “because FTX US was not operated independently of FTX.com.” The filing helped to prevent a run on FTX US and protect current assets, Ray added. \nThe House Financial Services Committee is slated to hear from Ray and former CEO Sam Bankman-Fried during its “Investigating FTX Hearing” Tuesday morning. \nBankman-Fried previously went back and forth with Rep. Maxine Waters, the committee’s chair, over Twitter about whether or not he would appear. Waters said she would issue a subpoena if necessary. \nAs of Friday, Dec. 9, Bankman-Fried is expected to attend the hearing, although he noted that he still does not have access to “much” of his data, but he “will try to be helpful during the hearing,” he said. It is expected that he will appear virtually, rather than in person.\nThe hearing will be the disgraced founder’s latest in a stint of public appearances following the exchange’s collapse. \n“I didn’t knowingly commingle funds,” Bankman-Fried told the New York Times in November. “I wasn’t trying to commingle funds.”\nThe restructuring team is currently focused on “implementing controls,” Ray said, including conducting audits and handling cash management. It also considers asset recovery and protection and maximizing value for stakeholders top priorities, according to the testimony.\nGet the day’s top crypto news and insights delivered to your inbox every evening. Subscribe to Blockworks’ free newsletter now.\nCan’t wait? Get our news the fastest way possible. Join us on Telegram.","content":"The House Financial Services Committee is slated to hear from Ray and former CEO Sam Bankman-Fried during its “Investigating FTX Hearing” Tuesday morning","contentSnippet":"The House Financial Services Committee is slated to hear from Ray and former CEO Sam Bankman-Fried during its “Investigating FTX Hearing” Tuesday morning","guid":"https://blockworks.co/news/new-ftx-ceo-says-exchange-commingled-assets","categories":["Markets","FTX","John Jay Ray III"],"isoDate":"2022-12-12T19:49:50.000Z","from":"https://blockworks.co/feed/"},{"creator":"jbkrakz","title":"Proof of Reserves or Proof of Nothing: There is no in between","link":"https://blog.kraken.com/post/16592/proof-of-reserves-or-proof-of-nothing-there-is-no-in-between/","pubDate":"Mon, 12 Dec 2022 19:50:34 +0000","dc:creator":"jbkrakz","content":"<p>As the crypto industry rallies around the transparency of Proof of Reserves (PoR) audits, Kraken is encouraged to see a greater focus be placed on proof, rather than promises. However, as others rush to catch up, we have observed attempts by other platforms and exchanges&#8230;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.kraken.com/post/16592/proof-of-reserves-or-proof-of-nothing-there-is-no-in-between/\">Proof of Reserves or Proof of Nothing: There is no in between</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.kraken.com\">Kraken Blog</a>.</p>\n","contentSnippet":"As the crypto industry rallies around the transparency of Proof of Reserves (PoR) audits, Kraken is encouraged to see a greater focus be placed on proof, rather than promises. However, as others rush to catch up, we have observed attempts by other platforms and exchanges…\nThe post Proof of Reserves or Proof of Nothing: There is no in between appeared first on Kraken Blog.","guid":"https://blog.kraken.com/?p=16592","categories":["Education","featured","proof of reserves"],"isoDate":"2022-12-12T19:50:34.000Z","from":"https://blog.kraken.com/feed/"},{"creator":"Cointelegraph By  David Attlee ","title":"SBF misses the Senate hearing but promises to testify to the House: Law Decoded","link":"https://cointelegraph.com/news/sbf-misses-the-senate-hearing-but-promises-to-testify-to-the-house-law-decoded","pubDate":"Mon, 12 Dec 2022 20:00:00 +0000","enclosure":{"url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvMjk3ZGU5YzItMTkzMi00NjQyLTk1YTUtYzJjZmJkNWI0NTYyLmpwZw==.jpg","length":"840","type":"image/jpg"},"dc:creator":"Cointelegraph By  David Attlee ","content":"\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvMjk3ZGU5YzItMTkzMi00NjQyLTk1YTUtYzJjZmJkNWI0NTYyLmpwZw==.jpg\"></p><p>Sam Bankman-Fried is willing to testify before the Financial Services Committee of the U.S. House of Representatives on Dec. 13.</p>\n            ","contentSnippet":"Sam Bankman-Fried is willing to testify before the Financial Services Committee of the U.S. House of Representatives on Dec. 13.","guid":"https://cointelegraph.com/news/sbf-misses-the-senate-hearing-but-promises-to-testify-to-the-house-law-decoded","categories":["Sam Bankman-Fried","FTX","Senate","Congress","Celsius","Ripple","SEC"],"isoDate":"2022-12-12T20:00:00.000Z","from":"https://cointelegraph.com/rss"},{"creator":"Simran Jagdev","title":"Cross-chain Interoperability Is the Future of DeFi","link":"https://consensys.net/blog/metamask/metamask-institutional/cross-chain-interoperability-is-the-future-of-defi/?utm_source=rss&utm_medium=rss&utm_campaign=cross-chain-interoperability-is-the-future-of-defi","pubDate":"Mon, 12 Dec 2022 19:36:48 +0000","dc:creator":"Simran Jagdev","comments":"https://consensys.net/blog/metamask/metamask-institutional/cross-chain-interoperability-is-the-future-of-defi/#respond","content":"<p>Cross-chain interoperability gives users the freedom to choose how they want to interact with DeFi, without being constrained by any one blockchain network.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://consensys.net/blog/metamask/metamask-institutional/cross-chain-interoperability-is-the-future-of-defi/\">Cross-chain Interoperability Is the Future of DeFi</a> appeared first on <a rel=\"nofollow\" href=\"https://consensys.net\">ConsenSys</a>.</p>\n","contentSnippet":"Cross-chain interoperability gives users the freedom to choose how they want to interact with DeFi, without being constrained by any one blockchain network.\nThe post Cross-chain Interoperability Is the Future of DeFi appeared first on ConsenSys.","guid":"https://consensys.net/?p=26981","categories":["MetaMask Institutional","DeFi","Metamask Institutional"],"isoDate":"2022-12-12T19:36:48.000Z","from":"https://feeds.feedburner.com/ConsenSys/posts"},{"creator":"Nelson Wang","title":"Coinbase Says Law Enforcement Requests Rose 66% From Year Ago","link":"https://www.coindesk.com/business/2022/12/12/coinbase-says-law-enforcement-requests-grew-by-66-from-year-ago/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","pubDate":"Mon, 12 Dec 2022 19:41:15 +0000","dc:creator":"Nelson Wang","content":"The number of requests from the U.S., which accounted for about 43% of the total, increased by 6%.","contentSnippet":"The number of requests from the U.S., which accounted for about 43% of the total, increased by 6%.","guid":"CKMDT4AFQNBDBFK7G5D5E3H3LQ","categories":[{"_":"Business","$":{"domain":"https://www.coindesk.com/business/"}}],"isoDate":"2022-12-12T19:41:15.000Z","from":"http://feeds.feedburner.com/Coindesk"},{"creator":"James Murphy","title":"10 Questions for FTX CEO John J. Ray III From a Securities Lawyer","link":"https://www.coindesk.com/consensus-magazine/2022/12/12/10-questions-for-ftx-ceo-john-j-ray-iii-from-a-securities-lawyer/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","pubDate":"Mon, 12 Dec 2022 19:43:27 +0000","dc:creator":"James Murphy","content":"In his recent media tour, disgraced founder Sam Bankman-Fried claims he did not commit fraud. Someone that still has access to FTX and Alameda Research’s accounts could prove otherwise.","contentSnippet":"In his recent media tour, disgraced founder Sam Bankman-Fried claims he did not commit fraud. Someone that still has access to FTX and Alameda Research’s accounts could prove otherwise.","guid":"2KGYH5YN7VGULN2QSNBAJEPSO4","categories":[{"_":"Consensus Magazine","$":{"domain":"https://www.coindesk.com/consensus-magazine/"}}],"isoDate":"2022-12-12T19:43:27.000Z","from":"http://feeds.feedburner.com/Coindesk"},{"creator":"Paul Veradittakit","title":"Adoption of DeFi, ZK Tech, NFTs and More Will Continue to Increase in 2023","link":"https://www.coindesk.com/consensus-magazine/2022/12/12/pantera-paul-veradittakit-crypto-2023-predictions/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","pubDate":"Mon, 12 Dec 2022 20:01:53 +0000","dc:creator":"Paul Veradittakit","content":"The crises of the past year obscured genuine growth in promising crypto industries, writes Pantera Capital General Partner Paul Veradittakit. Expanding on these themes will drive growth in the coming year.","contentSnippet":"The crises of the past year obscured genuine growth in promising crypto industries, writes Pantera Capital General Partner Paul Veradittakit. Expanding on these themes will drive growth in the coming year.","guid":"OTWR7ICGJ5E2JPVYU4UWWTZTQY","categories":[{"_":"Consensus Magazine","$":{"domain":"https://www.coindesk.com/consensus-magazine/"}}],"isoDate":"2022-12-12T20:01:53.000Z","from":"http://feeds.feedburner.com/Coindesk"},{"creator":"Jeff  Wilser","title":"The Birth of the (Network) Nations","link":"https://www.coindesk.com/consensus-magazine/crypto-2023/2022/12/12/web3-network-state-balaji-srinivasan/?utm_medium=referral&utm_source=rss&utm_campaign=headlines","pubDate":"Mon, 12 Dec 2022 20:03:56 +0000","dc:creator":"Jeff  Wilser","content":"Balaji Srinivasan says modern states are geographically concentrated but ideologically un-aligned. So what about states where online communities are in lockstep but geographically dispersed? That's the idea behind his new book, one of the big crypto-themed ideas of the last year.","contentSnippet":"Balaji Srinivasan says modern states are geographically concentrated but ideologically un-aligned. So what about states where online communities are in lockstep but geographically dispersed? That's the idea behind his new book, one of the big crypto-themed ideas of the last year.","guid":"M5SW3SWQFRHBFPHJ2WGX2GKMLU","categories":[{"_":"Crypto 2023","$":{"domain":"https://www.coindesk.com/consensus-magazine/crypto-2023/"}}],"isoDate":"2022-12-12T20:03:56.000Z","from":"http://feeds.feedburner.com/Coindesk"},{"creator":"Eric Newcomer","title":"Send in Your Burning Questions!","link":"https://www.newcomer.co/p/send-in-your-burning-questions","pubDate":"Mon, 12 Dec 2022 20:20:04 GMT","content:encoded":"<div class=\"captioned-image-container\"><figure><a class=\"image-link is-viewable-img image2\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F511544b9-4db3-40e3-86a1-bb9ec3c0e806_911x649.webp\"><div class=\"image2-inset\"><picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F511544b9-4db3-40e3-86a1-bb9ec3c0e806_911x649.webp 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F511544b9-4db3-40e3-86a1-bb9ec3c0e806_911x649.webp 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F511544b9-4db3-40e3-86a1-bb9ec3c0e806_911x649.webp 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F511544b9-4db3-40e3-86a1-bb9ec3c0e806_911x649.webp 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F511544b9-4db3-40e3-86a1-bb9ec3c0e806_911x649.webp\" width=\"911\" height=\"649\" data-attrs=\"{&quot;src&quot;:&quot;https://bucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com/public/images/511544b9-4db3-40e3-86a1-bb9ec3c0e806_911x649.webp&quot;,&quot;fullscreen&quot;:null,&quot;imageSize&quot;:null,&quot;height&quot;:649,&quot;width&quot;:911,&quot;resizeWidth&quot;:null,&quot;bytes&quot;:12622,&quot;alt&quot;:null,&quot;title&quot;:null,&quot;type&quot;:&quot;image/webp&quot;,&quot;href&quot;:null,&quot;belowTheFold&quot;:false,&quot;internalRedirect&quot;:null}\" class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F511544b9-4db3-40e3-86a1-bb9ec3c0e806_911x649.webp 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F511544b9-4db3-40e3-86a1-bb9ec3c0e806_911x649.webp 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F511544b9-4db3-40e3-86a1-bb9ec3c0e806_911x649.webp 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F511544b9-4db3-40e3-86a1-bb9ec3c0e806_911x649.webp 1456w\" sizes=\"100vw\"></picture><div class=\"image-link-expand\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"#FFFFFF\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" y1=\"3\" x2=\"14\" y2=\"10\"></line><line x1=\"3\" y1=\"21\" x2=\"10\" y2=\"14\"></line></svg></div></div></a></figure></div><p>Next week I&#8217;ll be answering reader questions for the second time. Ask me a question about tech, generative AI, what&#8217;s happening in venture, or whatever else is on your mind.</p><p>You can <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfYwEkowBNBFZmeAfGPms4gV2OwV-KVucVohn8DTNcAGofNkw/viewform?usp=sf_link\">submit questions anonymously</a> or put your name to them. You can pose an open-ended question or offer a <em>short</em> rebuttal to one of my recent pieces. You can ask me to chase down a fact or fish for my opinion on something.</p><h4><strong>To <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfYwEkowBNBFZmeAfGPms4gV2OwV-KVucVohn8DTNcAGofNkw/viewform?usp=sf_link\">submit a question</a>, you have several options:</strong></h4><ul><li><p><strong>leave a comment on this post</strong></p></li><li><p><strong>send me a tweet <a href=\"https://twitter.com/EricNewcomer\">@EricNewcomer</a></strong></p></li><li><p><strong>use <a href=\"https://forms.gle/K1pn7oZtT39oy8VU9\">this Google form</a> (especially if you want to submit an anonymous response)</strong></p></li><li><p><strong>respond by email &#8212; just reply to this post or email eric@newcomer.co. (I will honor requests for anonymity even if it&#8217;s obvious from your email who is writing in.)</strong></p></li></ul><p class=\"button-wrapper\" data-attrs=\"{&quot;url&quot;:&quot;https://forms.gle/mY1jd2dYNc3nK59z5&quot;,&quot;text&quot;:&quot;Submit a question&quot;,&quot;action&quot;:null,&quot;class&quot;:&quot;button-wrapper&quot;}\"><a class=\"button primary button-wrapper\" href=\"https://forms.gle/mY1jd2dYNc3nK59z5\"><span>Submit a question</span></a></p><p>I&#8217;ll be posting answers to the best questions next week. </p><h4>Make sure you&#8217;re signed up for <em>Newcomer</em> to see my responses &#8212;mailbag answers are a perk for paid subscribers!</h4><p class=\"button-wrapper\" data-attrs=\"{&quot;url&quot;:&quot;https://www.newcomer.co/subscribe?&quot;,&quot;text&quot;:&quot;Subscribe now&quot;,&quot;action&quot;:null,&quot;class&quot;:null}\"><a class=\"button primary\" href=\"https://www.newcomer.co/subscribe?\"><span>Subscribe now</span></a></p><p></p>","content:encodedSnippet":"Next week I’ll be answering reader questions for the second time. Ask me a question about tech, generative AI, what’s happening in venture, or whatever else is on your mind.\nYou can submit questions anonymously or put your name to them. You can pose an open-ended question or offer a short rebuttal to one of my recent pieces. You can ask me to chase down a fact or fish for my opinion on something.\nTo submit a question, you have several options:\n\nleave a comment on this post\n\nsend me a tweet @EricNewcomer\n\nuse this Google form (especially if you want to submit an anonymous response)\n\nrespond by email — just reply to this post or email eric@newcomer.co. (I will honor requests for anonymity even if it’s obvious from your email who is writing in.)\n\nSubmit a question\nI’ll be posting answers to the best questions next week. \nMake sure you’re signed up for Newcomer to see my responses —mailbag answers are a perk for paid subscribers!\nSubscribe now","enclosure":{"url":"https://substackcdn.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F511544b9-4db3-40e3-86a1-bb9ec3c0e806_911x649.webp","length":"0","type":"image/jpeg"},"dc:creator":"Eric Newcomer","content":"We're gearing up for an end-of-year reader mailbag","contentSnippet":"We're gearing up for an end-of-year reader mailbag","guid":"https://www.newcomer.co/p/send-in-your-burning-questions","isoDate":"2022-12-12T20:20:04.000Z","itunes":{},"from":"https://www.newcomer.co/feed"},{"creator":"Cumberland","title":"Vol Commentary: All Eyes On The CPI","link":"https://insights.deribit.com/industry/vol-commentary-all-eyes-on-the-cpi/","pubDate":"Mon, 12 Dec 2022 20:29:41 +0000","content:encoded":"<p><div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-1 fusion-flex-container nonhundred-percent-fullwidth non-hundred-percent-height-scrolling\" style=\"background-color: rgba(255,255,255,0);background-position: center center;background-repeat: no-repeat;border-width: 0px 0px 0px 0px;border-color:#e2e2e2;border-style:solid;\" ><div class=\"fusion-builder-row fusion-row fusion-flex-align-items-flex-start\" style=\"max-width:1144px;margin-left: calc(-4% / 2 );margin-right: calc(-4% / 2 );\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-0 fusion_builder_column_1_1 1_1 fusion-flex-column\"><div class=\"fusion-column-wrapper fusion-flex-justify-content-flex-start fusion-content-layout-column\" style=\"background-position:left top;background-repeat:no-repeat;-webkit-background-size:cover;-moz-background-size:cover;-o-background-size:cover;background-size:cover;padding: 0px 0px 0px 0px;\"><div style=\"text-align:center;\"><span class=\" fusion-imageframe imageframe-none imageframe-1 hover-type-none\" style=\"border-radius:5px;\"><img decoding=\"async\" width=\"1086\" height=\"462\" src=\"https://insights.deribit.com/wp-content/uploads/2022/12/vol-fea4-1.jpg\" alt class=\"img-responsive wp-image-20093\" srcset=\"https://insights.deribit.com/wp-content/uploads/2022/12/vol-fea4-1-200x85.jpg 200w, https://insights.deribit.com/wp-content/uploads/2022/12/vol-fea4-1-400x170.jpg 400w, https://insights.deribit.com/wp-content/uploads/2022/12/vol-fea4-1-600x255.jpg 600w, https://insights.deribit.com/wp-content/uploads/2022/12/vol-fea4-1-800x340.jpg 800w, https://insights.deribit.com/wp-content/uploads/2022/12/vol-fea4-1.jpg 1086w\" sizes=\"(max-width: 640px) 100vw, 1086px\" /></span></div></div><style type=\"text/css\">.fusion-body .fusion-builder-column-0{width:100% !important;margin-top : 0px;margin-bottom : 0px;}.fusion-builder-column-0 > .fusion-column-wrapper {padding-top : 0px !important;padding-right : 0px !important;margin-right : 1.92%;padding-bottom : 0px !important;padding-left : 0px !important;margin-left : 1.92%;}@media only screen and (max-width:1024px) {.fusion-body .fusion-builder-column-0{width:100% !important;}.fusion-builder-column-0 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}@media only screen and (max-width:640px) {.fusion-body .fusion-builder-column-0{width:100% !important;}.fusion-builder-column-0 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}</style></div></div><style type=\"text/css\">.fusion-body .fusion-flex-container.fusion-builder-row-1{ padding-top : 0px;margin-top : 0px;padding-right : 0px;padding-bottom : 0px;margin-bottom : 0px;padding-left : 0px;}</style></div><div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-2 fusion-flex-container has-pattern-background has-mask-background nonhundred-percent-fullwidth non-hundred-percent-height-scrolling\" style=\"background-color: rgba(255,255,255,0);background-position: center center;background-repeat: no-repeat;border-width: 0px 0px 0px 0px;border-color:#e2e2e2;border-style:solid;\" ><div class=\"fusion-builder-row fusion-row fusion-flex-align-items-flex-start\" style=\"max-width:1144px;margin-left: calc(-4% / 2 );margin-right: calc(-4% / 2 );\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-1 fusion_builder_column_1_1 1_1 fusion-flex-column\"><div class=\"fusion-column-wrapper fusion-flex-justify-content-flex-start fusion-content-layout-column\" style=\"background-position:left top;background-repeat:no-repeat;-webkit-background-size:cover;-moz-background-size:cover;-o-background-size:cover;background-size:cover;padding: 0px 0px 0px 0px;\"><div class=\"fusion-text fusion-text-1\"><p><strong>Cumberland is commenting on the recent volatility and potential opportunities to take advantage of it.</strong></p>\n<p>For further information about Cumberland, please visit Cumberland website <a href=\"https://cumberland.io/\">here</a>.</p>\n</div><div class=\"fusion-separator fusion-full-width-sep\" style=\"align-self: center;margin-left: auto;margin-right: auto;margin-top:15px;margin-bottom:26px;width:100%;\"><div class=\"fusion-separator-border sep-single\" style=\"border-color:#f0f0f0;border-top-width:1px;\"></div></div><div class=\"fusion-text fusion-text-2\"><h3>December 12</h3>\n<h2>What we are seeing in the markets</h2>\n<p>This week brings a round of data releases which have market moving potential. Whilst the main numbers to look for are US CPI and the FOMC rate decision, we also have EU and UK central bank meetings that add extra uncertainty.</p>\n<p><strong>1)</strong> Data from the beginning of November showed signs of inflation beginning to slow, with CPI and PPI both undershooting expectations and causing a risk on rally as the markets began to price in a FED pivot (from being solely focused on fighting inflation to taking some consideration for the lag effect of their restrictive policy and not wanting to unnecessarily hurt the economy).</p>\n<p><strong>2)</strong> More recently however, we have seen data that suggests the pivot idea might not be so clear cut. December numbers showed average hourly earnings strongly overshooting expectations. What is perhaps slightly less appreciated is that revisions of previous earnings data (see graph) provide even more evidence to suggest that the labor market is tighter than initially believed. Note PPI also overshot expectations last Friday (YOY at 7.4% vs an expected 7.2%).</p>\n<p><img decoding=\"async\" class=\"size-full wp-image-20080 alignnone\" src=\"https://insights.deribit.com/wp-content/uploads/2022/12/4w8ye9fshdwe.jpg\" alt=\"\" width=\"1654\" height=\"1158\" srcset=\"https://insights.deribit.com/wp-content/uploads/2022/12/4w8ye9fshdwe-200x140.jpg 200w, https://insights.deribit.com/wp-content/uploads/2022/12/4w8ye9fshdwe-300x210.jpg 300w, https://insights.deribit.com/wp-content/uploads/2022/12/4w8ye9fshdwe-400x280.jpg 400w, https://insights.deribit.com/wp-content/uploads/2022/12/4w8ye9fshdwe-600x420.jpg 600w, https://insights.deribit.com/wp-content/uploads/2022/12/4w8ye9fshdwe-768x538.jpg 768w, https://insights.deribit.com/wp-content/uploads/2022/12/4w8ye9fshdwe-800x560.jpg 800w, https://insights.deribit.com/wp-content/uploads/2022/12/4w8ye9fshdwe-1024x717.jpg 1024w, https://insights.deribit.com/wp-content/uploads/2022/12/4w8ye9fshdwe-1200x840.jpg 1200w, https://insights.deribit.com/wp-content/uploads/2022/12/4w8ye9fshdwe-1536x1075.jpg 1536w, https://insights.deribit.com/wp-content/uploads/2022/12/4w8ye9fshdwe.jpg 1654w\" sizes=\"(max-width: 1654px) 100vw, 1654px\" /></p>\n<p><strong>3)</strong> The most recent messaging by Powell has been that whilst a slowdown in large rate hikes is to be expected, inflation risks are nowhere near over. The FED may indeed raise the terminal rate to levels higher than initial projections/market pricing and keep them there for a longer period of time.</p>\n<p><strong>4)</strong> Despite all this, risk assets have showed little sign of reversing the recent rally. The S&amp;P 500 is 10% higher than its local lows in October, US 10Y yields have come down from highs of 4.2% to nearer 3.5%, and ETH is 16% higher than its post FTX implosion lows.</p>\n<p><strong>5)</strong> The FOMC meeting this week comes with an updated Summary of Economic Projections. This provides clarity on the FED&#8217;s current thinking, giving the market an opportunity to reprice its view, but then bringing a greater sense of medium term certainty in the outlook ahead.</p>\n<h2>Potential trades</h2>\n<p><strong>A)</strong> Sell BTC June Calls and hedge with December options.</p>\n<p>Based on (2), (3) and (4), there is reason to believe that a high CPI print on Tuesday could be a tipping point, giving risk assets a strong reason to move back towards the downside and thus generating delta P&amp;L through call selling. A low CPI should reassert the market&#8217;s confidence in inflation coming down, causing a rally in risk assets but bringing vols down again (generating vega P&amp;L through call selling) as this narrative is already somewhat priced in.</p>\n<p>From a volatility surface perspective, BTC June is 4 vols higher than BTC March. This makes it one of the most attractive points to sell, even when ignoring the macro factors in playBackend crypto vol levels have remained high recently, despite shorter dated vols dropping on low realized vol levels. We are entering the festive period with expectation of low realized as people take holidays, thus if spot continues to remain range bound, the backend of the term structure may finally give way. The medium term macro clarity provided by (5) adds even more weight to this argument, as well as the fact that vols typically come back down after CPI/FOMC events.</p>\n<p><img decoding=\"async\" class=\"size-full wp-image-20086 alignnone\" src=\"https://insights.deribit.com/wp-content/uploads/2022/12/29thc8ywefs.jpg\" alt=\"\" width=\"1396\" height=\"1108\" srcset=\"https://insights.deribit.com/wp-content/uploads/2022/12/29thc8ywefs-200x159.jpg 200w, https://insights.deribit.com/wp-content/uploads/2022/12/29thc8ywefs-300x238.jpg 300w, https://insights.deribit.com/wp-content/uploads/2022/12/29thc8ywefs-400x317.jpg 400w, https://insights.deribit.com/wp-content/uploads/2022/12/29thc8ywefs-600x476.jpg 600w, https://insights.deribit.com/wp-content/uploads/2022/12/29thc8ywefs-768x610.jpg 768w, https://insights.deribit.com/wp-content/uploads/2022/12/29thc8ywefs-800x635.jpg 800w, https://insights.deribit.com/wp-content/uploads/2022/12/29thc8ywefs-1024x813.jpg 1024w, https://insights.deribit.com/wp-content/uploads/2022/12/29thc8ywefs-1200x952.jpg 1200w, https://insights.deribit.com/wp-content/uploads/2022/12/29thc8ywefs.jpg 1396w\" sizes=\"(max-width: 1396px) 100vw, 1396px\" /></p>\n<p>One can hedge this trade by buying some gamma (short dated options expiring in December). The low levels of realized vol have made the weekly straddle prices reasonably cheap compared to historical levels during &#8216;data week&#8217;. This Friday&#8217;s BTC and ETH straddles are priced at 0.0453 and 0.0642 respectively, implying approximate moves of 4.5% and 6.4%.</p>\n</div><div class=\"fusion-separator fusion-full-width-sep\" style=\"align-self: center;margin-left: auto;margin-right: auto;margin-top:10px;margin-bottom:35px;width:100%;\"><div class=\"fusion-separator-border sep-single\" style=\"border-color:#f0f0f0;border-top-width:1px;\"></div></div><div class=\"fusion-text fusion-text-3\" style=\"font-size:13px;color:#666666;\"><p><strong>Disclaimer</strong></p>\n<p>The information (“Information”) provided by Cumberland DRW LLC and its affiliated or related companies (collectively, “Cumberland”), either in this document or otherwise, is for informational purposes only and is provided without charge. Cumberland is a principal trading firm; it is not and does not act as a fiduciary or adviser, or in any similar capacity, in providing the Information, and the Information may not be relied upon as investment, financial, legal, tax, regulatory, or any other type of advice. The Information has not been prepared or tailored to address, and may not be suitable or appropriate for the particular financial needs, circumstances, or requirements of any person, and it should not be the basis for making any investment or transaction decision. THE INFORMATION IS NOT A RECOMMENDATION TO ENGAGE IN ANY TRANSACTION.</p>\n<p>If any person elects to enter into transactions with Cumberland, whether as a result of the Information or otherwise, Cumberland will enter into such transactions as principal only and will act solely in its own best interests, which may be adverse to the interests of such person. Before entering into any such transaction, you should conduct your own research and obtain your own advice as to whether the transaction is appropriate for your specific circumstances. In addition, any person wishing to enter into transactions with Cumberland must satisfy Cumberland’s eligibility requirements.</p>\n<p>Cumberland may be subject to certain conflicts of interest in connection with the provision of the Information. For example, Cumberland may, but does not necessarily, hold or control positions in the cryptoasset(s) discussed in the Information, and transactions entered into by Cumberland could affect the relevant markets in ways that are adverse to a counterparty of Cumberland. Cumberland may engage in transactions in a manner inconsistent with the views expressed in the Information.</p>\n<p>Cumberland makes no representations or warranties (express or implied) regarding, nor shall it have any responsibility or liability for the accuracy, adequacy, timeliness, or completeness of, the Information, and no representation is made or is to be implied that the Information will remain unchanged. Cumberland undertakes no duty to amend, correct, update, or otherwise supplement the Information.</p>\n<p>The virtual currency industry is subject to a range of risks, including but not limited to: price volatility, limited liquidity, limited and incomplete information regarding certain instruments, products, or cryptoassets, and a still emerging and evolving regulatory environment. The past performance of any instruments, products, or cryptoassets addressed in the Information is not a guide to future performance, nor is it a reliable indicator of future results or performance. Investing in virtual currencies involves significant risks and is not appropriate for many investors, including those without significant investment experience and capacity to assume significant risks.</p>\n</div></div><style type=\"text/css\">.fusion-body .fusion-builder-column-1{width:100% !important;margin-top : 0px;margin-bottom : 0px;}.fusion-builder-column-1 > .fusion-column-wrapper {padding-top : 0px !important;padding-right : 0px !important;margin-right : 1.92%;padding-bottom : 0px !important;padding-left : 0px !important;margin-left : 1.92%;}@media only screen and (max-width:1024px) {.fusion-body .fusion-builder-column-1{width:100% !important;}.fusion-builder-column-1 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}@media only screen and (max-width:640px) {.fusion-body .fusion-builder-column-1{width:100% !important;}.fusion-builder-column-1 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}</style></div></div><style type=\"text/css\">.fusion-fullwidth.fusion-builder-row-2 a:not(.awb-custom-text-color):not(.fusion-button):not(.fusion-builder-module-control):not(.fusion-social-network-icon):not(.fb-icon-element):not(.fusion-countdown-link):not(.fusion-rollover-link):not(.fusion-rollover-gallery):not(.fusion-button-bar):not(.add_to_cart_button):not(.show_details_button):not(.product_type_external):not(.fusion-view-cart):not(.fusion-quick-view):not(.fusion-rollover-title-link):not(.fusion-breadcrumb-link) , .fusion-fullwidth.fusion-builder-row-2 a:not(.awb-custom-text-color):not(.fusion-button):not(.fusion-builder-module-control):not(.fusion-social-network-icon):not(.fb-icon-element):not(.fusion-countdown-link):not(.fusion-rollover-link):not(.fusion-rollover-gallery):not(.fusion-button-bar):not(.add_to_cart_button):not(.show_details_button):not(.product_type_external):not(.fusion-view-cart):not(.fusion-quick-view):not(.fusion-rollover-title-link):not(.fusion-breadcrumb-link):before, .fusion-fullwidth.fusion-builder-row-2 a:not(.awb-custom-text-color):not(.fusion-button):not(.fusion-builder-module-control):not(.fusion-social-network-icon):not(.fb-icon-element):not(.fusion-countdown-link):not(.fusion-rollover-link):not(.fusion-rollover-gallery):not(.fusion-button-bar):not(.add_to_cart_button):not(.show_details_button):not(.product_type_external):not(.fusion-view-cart):not(.fusion-quick-view):not(.fusion-rollover-title-link):not(.fusion-breadcrumb-link):after {color: #00cfbe;}.fusion-body .fusion-flex-container.fusion-builder-row-2{ padding-top : 0px;margin-top : 30px;padding-right : 0px;padding-bottom : 0px;margin-bottom : 0px;padding-left : 0px;}</style></div><div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-3 fusion-flex-container nonhundred-percent-fullwidth non-hundred-percent-height-scrolling\" style=\"background-color: rgba(255,255,255,0);background-position: center center;background-repeat: no-repeat;border-width: 0px 0px 0px 0px;border-color:#e2e2e2;border-style:solid;\" ><div class=\"fusion-builder-row fusion-row fusion-flex-align-items-flex-start\" style=\"max-width:1144px;margin-left: calc(-4% / 2 );margin-right: calc(-4% / 2 );\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-2 fusion_builder_column_1_1 1_1 fusion-flex-column\"><div class=\"fusion-column-wrapper fusion-flex-justify-content-flex-start fusion-content-layout-column\" style=\"background-position:left top;background-repeat:no-repeat;-webkit-background-size:cover;-moz-background-size:cover;-o-background-size:cover;background-size:cover;padding: 0px 0px 0px 0px;\"><div class=\"fusion-text fusion-text-4\" style=\"font-size:14px;\"><p><strong>AUTHOR(S)</strong></p>\n</div><div class=\"fusion-separator fusion-full-width-sep\" style=\"align-self: center;margin-left: auto;margin-right: auto;margin-bottom:30px;width:100%;\"><div class=\"fusion-separator-border sep-single\" style=\"border-color:#f0f0f0;border-top-width:1px;\"></div></div><div class=\"fusion-widget fusion-widget-element fusion-widget-area fusion-content-widget-area wpWidget-1\" style=\"border-width:0px;border-style:solid;\"><div class=\"widget widget_blog_widget\">    <div class=\"block-item-text\">\n  <input type=\"checkbox\" hidden class=\"read-more-state\" id=\"1\">\n  <div class=\"read-more-wrap\">\n    <p><img src=\"https://insights.deribit.com/wp-content/uploads/2022/10/KcCpRJ4a_400x400-66x66.jpg\" width=\"65\" height=\"65\" alt=\"Cumberland\" class=\"avatar avatar-65 wp-user-avatar wp-user-avatar-65 alignnone photo\" />    <a href=https://insights.deribit.com/author/cumberland/>Cumberland</a></p>\n    <p class=\"read-more-target\">\n    A global leader offering 24/7 access to deep crypto liquidity.    </p>\n  </div>\n  <label for=\"1\" class=\"read-more-trigger_closed\">\n    <strong>+ Show profile</strong>\n  </label>\n  <label for=\"1\" class=\"read-more-trigger_opened\">\n    <strong>- Hide profile</strong>\n  </label>\n</div>\n    </div></div></div><style type=\"text/css\">.fusion-body .fusion-builder-column-2{width:100% !important;margin-top : 0px;margin-bottom : 0px;}.fusion-builder-column-2 > .fusion-column-wrapper {padding-top : 0px !important;padding-right : 0px !important;margin-right : 1.92%;padding-bottom : 0px !important;padding-left : 0px !important;margin-left : 1.92%;}@media only screen and (max-width:1024px) {.fusion-body .fusion-builder-column-2{width:100% !important;}.fusion-builder-column-2 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}@media only screen and (max-width:640px) {.fusion-body .fusion-builder-column-2{width:100% !important;}.fusion-builder-column-2 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}</style></div></div><style type=\"text/css\">.fusion-body .fusion-flex-container.fusion-builder-row-3{ padding-top : 0px;margin-top : 30px;padding-right : 0px;padding-bottom : 0px;margin-bottom : 0px;padding-left : 0px;}</style></div><div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-4 fusion-flex-container nonhundred-percent-fullwidth non-hundred-percent-height-scrolling\" style=\"background-color: rgba(255,255,255,0);background-position: center center;background-repeat: no-repeat;border-width: 0px 0px 0px 0px;border-color:#e2e2e2;border-style:solid;\" ><div class=\"fusion-builder-row fusion-row fusion-flex-align-items-flex-start\" style=\"max-width:1144px;margin-left: calc(-4% / 2 );margin-right: calc(-4% / 2 );\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-3 fusion_builder_column_1_1 1_1 fusion-flex-column\"><div class=\"fusion-column-wrapper fusion-flex-justify-content-flex-start fusion-content-layout-column\" style=\"background-position:left top;background-repeat:no-repeat;-webkit-background-size:cover;-moz-background-size:cover;-o-background-size:cover;background-size:cover;padding: 0px 0px 0px 0px;\"><div class=\"fusion-text fusion-text-5\" style=\"font-size:14px;\"><p><strong>RECENT ARTICLES</strong></p>\n</div><div class=\"fusion-separator fusion-full-width-sep\" style=\"align-self: center;margin-left: auto;margin-right: auto;margin-bottom:20px;width:100%;\"><div class=\"fusion-separator-border sep-single\" style=\"border-color:#f0f0f0;border-top-width:1px;\"></div></div><div class=\"fusion-recent-posts fusion-recent-posts-1 avada-container layout-default layout-columns-1 rcp\"><section class=\"fusion-columns columns fusion-columns-1 columns-1\"><article class=\"post fusion-column column col col-lg-12 col-md-12 col-sm-12\"><div class=\"recent-posts-content\"><span class=\"vcard\" style=\"display: none;\"><span class=\"fn\"><a href=\"https://insights.deribit.com/author/cumberland/\" title=\"Posts by Cumberland\" class=\"author url fn\" rel=\"author\">Cumberland</a></span></span><span class=\"updated\" style=\"display:none;\">2022-12-12T20:29:41+00:00</span><h4 class=\"entry-title\"><a href=\"https://insights.deribit.com/industry/vol-commentary-all-eyes-on-the-cpi/\">Vol Commentary: All Eyes On The CPI</a></h4><p class=\"meta\"><span class=\"vcard\" style=\"display: none;\"><span class=\"fn\"><a href=\"https://insights.deribit.com/author/cumberland/\" title=\"Posts by Cumberland\" class=\"author url fn\" rel=\"author\">Cumberland</a></span></span><span class=\"updated\" style=\"display:none;\">2022-12-12T20:29:41+00:00</span><span>December 12, 2022</span><span class=\"fusion-inline-sep\">|</span><a href=\"https://insights.deribit.com/industry/\" rel=\"category tag\">Industry</a><span class=\"fusion-inline-sep\">|</span></p></div></article><article class=\"post fusion-column column col col-lg-12 col-md-12 col-sm-12\"><div class=\"recent-posts-content\"><span class=\"vcard\" style=\"display: none;\"><span class=\"fn\"><a href=\"https://insights.deribit.com/author/cumberland/\" title=\"Posts by Cumberland\" class=\"author url fn\" rel=\"author\">Cumberland</a></span></span><span class=\"updated\" style=\"display:none;\">2022-12-12T07:14:03+00:00</span><h4 class=\"entry-title\"><a href=\"https://insights.deribit.com/industry/vol-commentary-recovery-mode/\">Vol Commentary: Recovery Mode</a></h4><p class=\"meta\"><span class=\"vcard\" style=\"display: none;\"><span class=\"fn\"><a href=\"https://insights.deribit.com/author/cumberland/\" title=\"Posts by Cumberland\" class=\"author url fn\" rel=\"author\">Cumberland</a></span></span><span class=\"updated\" style=\"display:none;\">2022-12-12T07:14:03+00:00</span><span>December 12, 2022</span><span class=\"fusion-inline-sep\">|</span><a href=\"https://insights.deribit.com/industry/\" rel=\"category tag\">Industry</a><span class=\"fusion-inline-sep\">|</span></p></div></article><article class=\"post fusion-column column col col-lg-12 col-md-12 col-sm-12\"><div class=\"recent-posts-content\"><span class=\"vcard\" style=\"display: none;\"><span class=\"fn\"><a href=\"https://insights.deribit.com/author/genesis/\" title=\"Posts by Genesis\" class=\"author url fn\" rel=\"author\">Genesis</a></span></span><span class=\"updated\" style=\"display:none;\">2022-12-08T12:29:38+00:00</span><h4 class=\"entry-title\"><a href=\"https://insights.deribit.com/industry/desk-commentary-advent-calendars/\">Desk Commentary: Advent Calendars</a></h4><p class=\"meta\"><span class=\"vcard\" style=\"display: none;\"><span class=\"fn\"><a href=\"https://insights.deribit.com/author/genesis/\" title=\"Posts by Genesis\" class=\"author url fn\" rel=\"author\">Genesis</a></span></span><span class=\"updated\" style=\"display:none;\">2022-12-08T12:29:38+00:00</span><span>December 8, 2022</span><span class=\"fusion-inline-sep\">|</span><a href=\"https://insights.deribit.com/industry/\" rel=\"category tag\">Industry</a><span class=\"fusion-inline-sep\">|</span></p></div></article></section></div></div><style type=\"text/css\">.fusion-body .fusion-builder-column-3{width:100% !important;margin-top : 0px;margin-bottom : 0px;}.fusion-builder-column-3 > .fusion-column-wrapper {padding-top : 0px !important;padding-right : 0px !important;margin-right : 1.92%;padding-bottom : 0px !important;padding-left : 0px !important;margin-left : 1.92%;}@media only screen and (max-width:1024px) {.fusion-body .fusion-builder-column-3{width:100% !important;}.fusion-builder-column-3 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}@media only screen and (max-width:640px) {.fusion-body .fusion-builder-column-3{width:100% !important;}.fusion-builder-column-3 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}</style></div></div><style type=\"text/css\">.fusion-body .fusion-flex-container.fusion-builder-row-4{ padding-top : 0px;margin-top : 30px;padding-right : 0px;padding-bottom : 0px;margin-bottom : 30px;padding-left : 0px;}</style></div></p>\n<p>The post <a rel=\"nofollow\" href=\"https://insights.deribit.com/industry/vol-commentary-all-eyes-on-the-cpi/\">Vol Commentary: All Eyes On The CPI</a> appeared first on <a rel=\"nofollow\" href=\"https://insights.deribit.com\">Deribit Insights</a>.</p>\n","content:encodedSnippet":".fusion-body .fusion-builder-column-0{width:100% !important;margin-top : 0px;margin-bottom : 0px;}.fusion-builder-column-0 > .fusion-column-wrapper {padding-top : 0px !important;padding-right : 0px !important;margin-right : 1.92%;padding-bottom : 0px !important;padding-left : 0px !important;margin-left : 1.92%;}@media only screen and (max-width:1024px) {.fusion-body .fusion-builder-column-0{width:100% !important;}.fusion-builder-column-0 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}@media only screen and (max-width:640px) {.fusion-body .fusion-builder-column-0{width:100% !important;}.fusion-builder-column-0 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}\n.fusion-body .fusion-flex-container.fusion-builder-row-1{ padding-top : 0px;margin-top : 0px;padding-right : 0px;padding-bottom : 0px;margin-bottom : 0px;padding-left : 0px;}\n\n\n\nCumberland is commenting on the recent volatility and potential opportunities to take advantage of it.\nFor further information about Cumberland, please visit Cumberland website here.\n\n\n\nDecember 12\nWhat we are seeing in the markets\nThis week brings a round of data releases which have market moving potential. Whilst the main numbers to look for are US CPI and the FOMC rate decision, we also have EU and UK central bank meetings that add extra uncertainty.\n1) Data from the beginning of November showed signs of inflation beginning to slow, with CPI and PPI both undershooting expectations and causing a risk on rally as the markets began to price in a FED pivot (from being solely focused on fighting inflation to taking some consideration for the lag effect of their restrictive policy and not wanting to unnecessarily hurt the economy).\n2) More recently however, we have seen data that suggests the pivot idea might not be so clear cut. December numbers showed average hourly earnings strongly overshooting expectations. What is perhaps slightly less appreciated is that revisions of previous earnings data (see graph) provide even more evidence to suggest that the labor market is tighter than initially believed. Note PPI also overshot expectations last Friday (YOY at 7.4% vs an expected 7.2%).\n\n3) The most recent messaging by Powell has been that whilst a slowdown in large rate hikes is to be expected, inflation risks are nowhere near over. The FED may indeed raise the terminal rate to levels higher than initial projections/market pricing and keep them there for a longer period of time.\n4) Despite all this, risk assets have showed little sign of reversing the recent rally. The S&P 500 is 10% higher than its local lows in October, US 10Y yields have come down from highs of 4.2% to nearer 3.5%, and ETH is 16% higher than its post FTX implosion lows.\n5) The FOMC meeting this week comes with an updated Summary of Economic Projections. This provides clarity on the FED’s current thinking, giving the market an opportunity to reprice its view, but then bringing a greater sense of medium term certainty in the outlook ahead.\nPotential trades\nA) Sell BTC June Calls and hedge with December options.\nBased on (2), (3) and (4), there is reason to believe that a high CPI print on Tuesday could be a tipping point, giving risk assets a strong reason to move back towards the downside and thus generating delta P&L through call selling. A low CPI should reassert the market’s confidence in inflation coming down, causing a rally in risk assets but bringing vols down again (generating vega P&L through call selling) as this narrative is already somewhat priced in.\nFrom a volatility surface perspective, BTC June is 4 vols higher than BTC March. This makes it one of the most attractive points to sell, even when ignoring the macro factors in playBackend crypto vol levels have remained high recently, despite shorter dated vols dropping on low realized vol levels. We are entering the festive period with expectation of low realized as people take holidays, thus if spot continues to remain range bound, the backend of the term structure may finally give way. The medium term macro clarity provided by (5) adds even more weight to this argument, as well as the fact that vols typically come back down after CPI/FOMC events.\n\nOne can hedge this trade by buying some gamma (short dated options expiring in December). The low levels of realized vol have made the weekly straddle prices reasonably cheap compared to historical levels during ‘data week’. This Friday’s BTC and ETH straddles are priced at 0.0453 and 0.0642 respectively, implying approximate moves of 4.5% and 6.4%.\n\n\n\nDisclaimer\nThe information (“Information”) provided by Cumberland DRW LLC and its affiliated or related companies (collectively, “Cumberland”), either in this document or otherwise, is for informational purposes only and is provided without charge. Cumberland is a principal trading firm; it is not and does not act as a fiduciary or adviser, or in any similar capacity, in providing the Information, and the Information may not be relied upon as investment, financial, legal, tax, regulatory, or any other type of advice. The Information has not been prepared or tailored to address, and may not be suitable or appropriate for the particular financial needs, circumstances, or requirements of any person, and it should not be the basis for making any investment or transaction decision. THE INFORMATION IS NOT A RECOMMENDATION TO ENGAGE IN ANY TRANSACTION.\nIf any person elects to enter into transactions with Cumberland, whether as a result of the Information or otherwise, Cumberland will enter into such transactions as principal only and will act solely in its own best interests, which may be adverse to the interests of such person. Before entering into any such transaction, you should conduct your own research and obtain your own advice as to whether the transaction is appropriate for your specific circumstances. In addition, any person wishing to enter into transactions with Cumberland must satisfy Cumberland’s eligibility requirements.\nCumberland may be subject to certain conflicts of interest in connection with the provision of the Information. For example, Cumberland may, but does not necessarily, hold or control positions in the cryptoasset(s) discussed in the Information, and transactions entered into by Cumberland could affect the relevant markets in ways that are adverse to a counterparty of Cumberland. Cumberland may engage in transactions in a manner inconsistent with the views expressed in the Information.\nCumberland makes no representations or warranties (express or implied) regarding, nor shall it have any responsibility or liability for the accuracy, adequacy, timeliness, or completeness of, the Information, and no representation is made or is to be implied that the Information will remain unchanged. Cumberland undertakes no duty to amend, correct, update, or otherwise supplement the Information.\nThe virtual currency industry is subject to a range of risks, including but not limited to: price volatility, limited liquidity, limited and incomplete information regarding certain instruments, products, or cryptoassets, and a still emerging and evolving regulatory environment. The past performance of any instruments, products, or cryptoassets addressed in the Information is not a guide to future performance, nor is it a reliable indicator of future results or performance. Investing in virtual currencies involves significant risks and is not appropriate for many investors, including those without significant investment experience and capacity to assume significant risks.\n.fusion-body .fusion-builder-column-1{width:100% !important;margin-top : 0px;margin-bottom : 0px;}.fusion-builder-column-1 > .fusion-column-wrapper {padding-top : 0px !important;padding-right : 0px !important;margin-right : 1.92%;padding-bottom : 0px !important;padding-left : 0px !important;margin-left : 1.92%;}@media only screen and (max-width:1024px) {.fusion-body .fusion-builder-column-1{width:100% !important;}.fusion-builder-column-1 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}@media only screen and (max-width:640px) {.fusion-body .fusion-builder-column-1{width:100% !important;}.fusion-builder-column-1 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}\n.fusion-fullwidth.fusion-builder-row-2 a:not(.awb-custom-text-color):not(.fusion-button):not(.fusion-builder-module-control):not(.fusion-social-network-icon):not(.fb-icon-element):not(.fusion-countdown-link):not(.fusion-rollover-link):not(.fusion-rollover-gallery):not(.fusion-button-bar):not(.add_to_cart_button):not(.show_details_button):not(.product_type_external):not(.fusion-view-cart):not(.fusion-quick-view):not(.fusion-rollover-title-link):not(.fusion-breadcrumb-link) , .fusion-fullwidth.fusion-builder-row-2 a:not(.awb-custom-text-color):not(.fusion-button):not(.fusion-builder-module-control):not(.fusion-social-network-icon):not(.fb-icon-element):not(.fusion-countdown-link):not(.fusion-rollover-link):not(.fusion-rollover-gallery):not(.fusion-button-bar):not(.add_to_cart_button):not(.show_details_button):not(.product_type_external):not(.fusion-view-cart):not(.fusion-quick-view):not(.fusion-rollover-title-link):not(.fusion-breadcrumb-link):before, .fusion-fullwidth.fusion-builder-row-2 a:not(.awb-custom-text-color):not(.fusion-button):not(.fusion-builder-module-control):not(.fusion-social-network-icon):not(.fb-icon-element):not(.fusion-countdown-link):not(.fusion-rollover-link):not(.fusion-rollover-gallery):not(.fusion-button-bar):not(.add_to_cart_button):not(.show_details_button):not(.product_type_external):not(.fusion-view-cart):not(.fusion-quick-view):not(.fusion-rollover-title-link):not(.fusion-breadcrumb-link):after {color: #00cfbe;}.fusion-body .fusion-flex-container.fusion-builder-row-2{ padding-top : 0px;margin-top : 30px;padding-right : 0px;padding-bottom : 0px;margin-bottom : 0px;padding-left : 0px;}\n\n\n\nAUTHOR(S)\n\n\n\n    \n    Cumberland\n+ Show profile\n  \n  \n    - Hide profile\n  \n\n    \n\n.fusion-body .fusion-builder-column-2{width:100% !important;margin-top : 0px;margin-bottom : 0px;}.fusion-builder-column-2 > .fusion-column-wrapper {padding-top : 0px !important;padding-right : 0px !important;margin-right : 1.92%;padding-bottom : 0px !important;padding-left : 0px !important;margin-left : 1.92%;}@media only screen and (max-width:1024px) {.fusion-body .fusion-builder-column-2{width:100% !important;}.fusion-builder-column-2 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}@media only screen and (max-width:640px) {.fusion-body .fusion-builder-column-2{width:100% !important;}.fusion-builder-column-2 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}\n.fusion-body .fusion-flex-container.fusion-builder-row-3{ padding-top : 0px;margin-top : 30px;padding-right : 0px;padding-bottom : 0px;margin-bottom : 0px;padding-left : 0px;}\n\n\n\nRECENT ARTICLES\n\n\n\n\nCumberland2022-12-12T20:29:41+00:00\nVol Commentary: All Eyes On The CPI\nCumberland2022-12-12T20:29:41+00:00December 12, 2022|Industry|\n\nCumberland2022-12-12T07:14:03+00:00\nVol Commentary: Recovery Mode\nCumberland2022-12-12T07:14:03+00:00December 12, 2022|Industry|\n\nGenesis2022-12-08T12:29:38+00:00\nDesk Commentary: Advent Calendars\nGenesis2022-12-08T12:29:38+00:00December 8, 2022|Industry|\n\n\n.fusion-body .fusion-builder-column-3{width:100% !important;margin-top : 0px;margin-bottom : 0px;}.fusion-builder-column-3 > .fusion-column-wrapper {padding-top : 0px !important;padding-right : 0px !important;margin-right : 1.92%;padding-bottom : 0px !important;padding-left : 0px !important;margin-left : 1.92%;}@media only screen and (max-width:1024px) {.fusion-body .fusion-builder-column-3{width:100% !important;}.fusion-builder-column-3 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}@media only screen and (max-width:640px) {.fusion-body .fusion-builder-column-3{width:100% !important;}.fusion-builder-column-3 > .fusion-column-wrapper {margin-right : 1.92%;margin-left : 1.92%;}}\n.fusion-body .fusion-flex-container.fusion-builder-row-4{ padding-top : 0px;margin-top : 30px;padding-right : 0px;padding-bottom : 0px;margin-bottom : 30px;padding-left : 0px;}\n\nThe post Vol Commentary: All Eyes On The CPI appeared first on Deribit Insights.","dc:creator":"Cumberland","content":"<p>Cumberland is commenting on the recent volatility and potential opportunities to take advantage of it. For further information about Cumberland, please visit Cumberland website here.   December 12 What we are seeing in the markets This week brings a round of data releases which have market moving potential. Whilst the [...]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://insights.deribit.com/industry/vol-commentary-all-eyes-on-the-cpi/\">Vol Commentary: All Eyes On The CPI</a> appeared first on <a rel=\"nofollow\" href=\"https://insights.deribit.com\">Deribit Insights</a>.</p>\n","contentSnippet":"Cumberland is commenting on the recent volatility and potential opportunities to take advantage of it. For further information about Cumberland, please visit Cumberland website here.   December 12 What we are seeing in the markets This week brings a round of data releases which have market moving potential. Whilst the [...]\nThe post Vol Commentary: All Eyes On The CPI appeared first on Deribit Insights.","guid":"https://insights.deribit.com/?p=20078","categories":["Industry"],"isoDate":"2022-12-12T20:29:41.000Z","from":"https://blog.deribit.com/feed/"}]